{"data":{"mongodbDatabaseArticles":{"id":"5b9248b287be056953db7bda","content":"<div><p>Since I forgot to extend my booking in the hostel I was staying, I ended up moving to another hostel dorm somewhere around Singapore's central Bugis area. I was surprised how there wasn't any Westerners in this hostel though, but only South East Asian tourists, probably from Indonesia or Malaysia visiting Singapore.</p> <p>I entered the dorm where I was going to sleep tonight, which looked more like a homeless shelter than a hostel dorm. It was filled with 24 (!) bunk beds. I figured that's a lot of beds, but since Singapore's rents are so high, you have to have some return on investment. I had already paid for my booking, so I figured I'd just stay over anyway. When I walked around the dorm, I noticed everybody around me looked really tanned, more-so than I'm used to. In Asian cultures, that's usually a symbol of poverty.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/INSIDEOUT_02.jpg\"> <p>When everybody started waking up at 6AM and putting on yellow helmets, I finally connected the dots and figured out what was going on here. I was in the dorms of Singapore's illegal migrant workers. They mostly work in construction and I had only seen them before being driven around with 40 of them stacked together like human cattle in the back of a pick-up truck (a bit like illegal Mexican workers in the US). These workers are the ones making Singapore's current building boom of skyscrapers possible.</p> <p>In my quest for minimalism and living with less and less, I now ended up crossing paths with people living in Singapore's most dire of living conditions. It doesn't really get any more real than that. </p> <p>Life is fascinating, as it'll always lead you on these paths to force you to think about stuff. Just after I write about my admiration for <a href=\"http://levels.io/why-i-want-to-live-in-singapore/\">Singapore's clean and safe society</a> yesterday, I end up in the the dark side of its society that makes this Asian boom possible. You can't really get a more clear signal to go and put everything in perspective. Not in a cheesy, reddit-like <i>\"oh I'm such a fortunate privileged Westerner, bawwww\"-way</i>; I don't feel any guilt to be born as part of the wealthy West &#8212; even if its by sheer luck. I mean put into perspective that all this hypergrowth in these emerging markets is not all fun and games for everyone. Much of it goes over the backs of cheap migrant labor living in shitty conditions. Is that obvious and not really news? Sure, but seeing it for yourself makes it even more real. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/2865572926_eab8686876_o1.jpg\"> <p>Now should we do something about that? I'm not sure you can realistically do anything about it. The cheap labor of today is making possible what we all want, and they are working hard to give their kids a chance at a better life and those kids may be the consumer middle-class of tomorrow (as we saw in China). We should make sure they're not exploited though, like <a href=\"http://rt.com/op-edge/qatar-migrants-amnesty-international-893/\">what's happening in Dubai</a>.</p> <p>Anyway, perspective.</p> <p><a href=\"/hong-kong-new-york-of-the-east/\">After Singapore, I move on to Hong Kong where I'll taste a bit of the west...in the east &#187;</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I spent the night with Singapore’s migrant workers"}},"pageContext":{"id":"5b9248b287be056953db7bda"}}