{"data":{"mongodbDatabaseArticles":{"id":"5b95ea0487be05832748ff75","content":"<div><p> </p><p><img class=\"aligncenter\" src=\"https://media.nomadicmatt.com/bangkok4top.jpg\" alt=\"Beautiful temple in Bangkok\" width=\"825\" height=\"395\"><br> Updated: 07/25/2018 | July 25th, 2018</p><p>When people tell me they hate Bangkok, I understand. When I first went to <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\" target=\"_blank\" rel=\"noopener\">Bangkok</a> in 2006, I despised the city and couldn&#8217;t wait to get out.</p><p>It wasn&#8217;t until I lived in the city that <a href=\"https://nomadicmatt.com/travel-blogs/living-in-bangkok/\" target=\"_blank\" rel=\"noopener\">I really fell in love with it</a>.</p><p>Bangkok is not a city that opens itself up easily, and most people spend just a day or two here before leaving to go to <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/ko-phangan/\" target=\"_blank\" rel=\"noopener\">the islands</a> or <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\" target=\"_blank\" rel=\"noopener\">the jungle</a>. But while as a tourist you may not need tons of time to &#8220;see&#8221; the city, Bangkok is worth more than quick stay most travlers give it.</p><p>Bangkok may not have a lot of &#8220;tourist attractions&#8221; in the way that Paris, London, NYC, and Buenos Aires do but that&#8217;s OK. Bangkok is not that kind of city. Bangkok is a place to wander, eat, and imbibe. It doesn&#8217;t have to be a love-it-or-hate-it city but it is worth seeing. Check out my list of things to do in Bangkok</p><p>Here&#8217;s my suggested itinerary for what to see and do Bangkok that will have you ticking off the major sites as well some of the lesser places to go:</p><h3>What to do in Bangkok: Day One</h3><p><strong>The Grand Palace, Wat Pho, and Wat Arun</strong><br> <img src=\"https://media.nomadicmatt.com/4daysbk01.jpg\" alt=\"The Grand Palace in Bangkok, Thailand\" width=\"825\" height=\"395\"><br> The first place you should visit in Bangkok is&#160;the Grand Palace (Royal Palace) and neighboring Wat Pho, home to the famous reclining Buddha and massage school. The Royal family doesn&#8217;t live in the palace (it&#8217;s only used for official state functions) and you can&#8217;t go into any of the buildings, but wandering the grounds and open temples is worth the visit. It&#8217;s beautiful and the craftsmanship in the architecture is amazing. Go first thing in the morning to avoid the crowds.</p><p>Afterwards, wander down the street to Wat Pho and the famous reclining Buddha (as well as the famous Golden Buddha). The Wat Pho complex fills a city block so while seeing the statues doesn&#8217;t take long, you could spend a solid hour wandering the maze-like temple grounds.</p><p>Next, head across the river to Wat Arun (Temple of the Dawn) and get stellar views of the city from atop the temple. It&#8217;s my favorite temple in the city because of the view!</p><p>The Grand Palace is located on Na Phra Lan Road, +66 2 623 5500. Open daily from 8:30am-3:30pm. Admission is 500 THB. Wat Pho is located on 2 Sanamchai Road, Grand Palace Subdistrict, +66 2 662 3553, watpho.com. Opening daily from 8am&#8211;6:30pm. Admission is 100 THB. Wat Arun is across the river at 158 Wang Doem Road, +66 2 891 218. Open daily from 8am&#8211;5:30pm. Admission is 50 THB.</p><p><strong>Note:</strong> Be sure to wear clothes that cover your legs and shoulders; it&#8217;s considered disrespectful to wear revealing clothes. If you don&#8217;t, you can rent pants or shirts at the palace. At Wat Pho, they give them out for free.</p><p><strong>Cruise the river</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk02.jpg\" alt=\"Cruise on the river in Bangkok, Thailand\" width=\"825\" height=\"395\"><br> Take a tour of the Chao Phraya river, a relaxing and beautiful experience that shouldn&#8217;t be skipped. Don&#8217;t take an overpriced tour, though. You can ride the water taxi up and down the river for around 20 baht (less than $1 USD). Start at the central pier, go to the end, and come back. Presto! Instant tour! (The difference with the official tourist boat, which makes less stops, is that they have&#160;someone that gives brief descriptions about important sites as you go.)</p><p><strong>Tour the temples</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk03.jpg\" alt=\"Temple in Bangkok\" width=\"6825\" height=\"395\"><br> Bangkok has a lot of beautiful temples. Hire a tuk-tuk driver to take you around for the day to see the temples. Just make sure he doesn&#8217;t take you shopping along the way &#8212; drivers get kickbacks if they bring customers into certain shops. They can be annoying about this but stay firm! This is often the cheapest and most efficient way to see the temples throughout Bangkok. My favorite temples are:</p><ul><li><strong>Wat Saket</strong> &#8211; The Golden Mount has an enormous, 100m-high, 500m wide chedi (mound-like structure containing Buddhist relics). This is one of my favorite temples in city because of its beautiful golden temple and wonderful views of the city from its top. 344 Chakkraphat Diphong Road, +66 2 478 6010, bangkokforvisitors.com/golden-mount.Open daily from 9am-5pm. Admission is 10 THB.</li><li><strong>Wat Benchamabophit</strong> &#8211; This temple is pictured on the back of the 5-baht coin. The white marble used to contrast the building was imported directly from Italy, and there is a unique blend of both Thai and European architecture and design. In the courtyard, there are 53 Buddha images representing every mudra (gesture) and style from Thai history. This makes it a good place to visually see how Buddha has been represented in Thailand over time. 69 Nakornpathom Road, Dusit, +66 2 281 2501, templesinbangkok.com/watbenchamabophit. Admission is 20 THB.</li></ul><p><strong>Visit Khao San Road</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk05.jpg\" alt=\"The infamous Khao San Road in Bangkok\" width=\"825\" height=\"395\"><br> <a href=\"https://nomadicmatt.com/travel-blogs/bangkoks-khao-san-road-hd-video/\" target=\"_blank\" rel=\"noopener\">The backpacker capital of the world</a>, this road (along with Soi Rambuttri) in Bangkok is a must visit! You&#8217;ll find endless bars, shops, street food, international restaurants, vendors, locals, and activity all day and all night. It&#8217;s also a popular spot on the weekend for Thais. I personally like the quieter Soi Rambuttri, but Khao San is an awesome place to sit outside and meet other travelers. Be sure to visit Brick Bar, the hidden-away Thai ska bar where only locals go.</p><p><strong>NEED MORE TIPS? <a href=\"https://nomadicmatt.com/books/bangkok-guide/\" target=\"_blank\" rel=\"noopener\">Click here to get my detailed guidebook on Bangkok and get off the tourist path, save money, and see more!</a></strong></p><p><a href=\"https://www.nomadicmatt.com/books/thailand-bangkok-book-bundle/\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/2018/2fer-thai.jpg\"></a></p><h3>What to do in Bangkok: Day Two</h3><p><strong>Check out the floating market</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk06.jpg\" alt=\"Floating Market in Bangkok, Thailand\" width=\"825\" height=\"395\"><br> You can enjoy a half-day visit to the floating markets around the city (Khlong Lat Mayom and Thaling Chan are the two most popular). It makes for a filling morning adventure and if you get there early, you can avoid a lot of the crowds. Thaling Chan is the more touristy one so to avoid the hordes of tour groups, definitely get there early. Both markets can be visited by public transportation. I love the chaos, the smells, and the little ladies cooking and selling you various treats as they paddle by you. You never leave hungry!</p><p><strong>Explore Chinatown</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk07.jpg\" alt=\"Chinatown in Bangkok, Thailand\" width=\"825\" height=\"395\"><br> Chinatown in Bangkok is a culinary feast. You can go shopping here and buy lots of useless souvenirs, but what I love about this area is the food. On the chaotic vendor-lined streets, you&#8217;ll find a ton of vendors selling food you hardly see anywhere else in the city. This is a crowded and busy part of the city but one of my favorites. At night, the area is one of the best places in the city to get delicious seafood.</p><p>Near Sampeng Lane and Yaowarat Road. Shops will all have different hours, but it&#8217;s free to wander around. </p><p><strong>Visit the malls</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk04.jpg\" alt=\"Mall in Bangkok\" width=\"825\" height=\"395\"><br> Okay, hear me out on this: Malls in Bangkok are more than just malls &#8211;&#160;they are social hubs (thanks in part to the air-conditioning) where people eat (mall food courts in Bangkok are delicious), drink at bars, see movies, sit at coffee shops, and even go bowling! A lot of life in the city happens in the malls and each has its own character. Here&#8217;s a list of the best malls in the city:</p><ul><li><strong>Terminal 21</strong> &#8211; (88 Sukhumvit Road 19, +66 2 108 0888, terminal21.co.th) &#8212; This is my favorite mall in the city. It&#8217;s airport-themed, and every floor features a different region of the world. There&#8217;s free Wi-Fi, restaurants on every floor, a movie theater on the top floor, and one of the best mall food courts in the city. Definitely stop by here! Opening hours: Daily (10am&#8211;10pm).</li><li><strong>MBK Center</strong> &#8211; (444 Phayathai Road, +66 2 620 9000, mbk-center.co.th) &#8212; This is the best place for knockoff clothes, electronics, movies, and computer software. There are a number of tailors and restaurants, and a movie theater on the top floor. Opening hours: Daily (10am&#8211;10pm).</li><li><strong>Siam Paragon</strong> &#8211; (991/1 Rama I Road, +66 2 610 8000, siamparagon.co.th) &#8212; For designer clothes and upscale shopping, Siam Paragon has a wide range of stores, as well as restaurants and a luxurious movie theater (the best in the country, in my opinion). Siam Ocean World aquarium (the largest aquarium in Southeast Asia) is located on the bottom floor and is a good family activity if you&#8217;re traveling with kids. There is a large (but slightly overpriced) food court here too. Opening hours: Daily (10am&#8211;10pm).</li><li><strong>Emporium</strong> &#8211; (622 Sukhumvit Road, +66 2 269 1000, emporium.co.th) &#8212; This luxury shopping mall has a huge department store, a multiplex cinema, an English-language bookstore, fashion and trinket shops, a grocery store, a food court, and many upscale restaurants. Across the street, the owners opened the more upscale EmQuartier, with a gym, IMAX theater, even more high-end shops, incredible restaurants, and a beautiful roof garden and pond that overlooks the city. Visit just for that! Opening hours: Daily (10am&#8211;10pm).</li><li><strong>CentralWorld</strong> &#8211; (999/9 Rama I Road, +66 2 635 1111, centralworld.co.th) &#8212; CentralWorld is the sixth largest shopping complex in the world. The complex, which includes a hotel and office tower, burned down in 2010 as a result of the Bangkok riots but has since been rebuilt. It&#8217;s filled with mostly Western shops, but there are a lot of good restaurants in this mall and a bar on the roof. Opening hours: Daily (10am&#8211;10pm).</li><li><strong>Pantip Plaza</strong> &#8211; (604/3 Ratchathewi, +66 2 256 0355, bangkok.com/shopping-mall/pantipplaza) &#8212; This mall has all of your computer and electronic needs (it&#8217;s where I buy all of my electronics). There are both large brand-name stores and shops selling used merchandise. Opening hours: Daily (10am&#8211;9pm).</li></ul><p><strong>Watch a Muay Thai fight</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk09.jpg\" alt=\"Muay Thai Fighting\" width=\"825\" height=\"395\"><br> Muay Thai (a combat sport involving striking and clinching) is everywhere in Thailand and Thais take it very seriously. Fighters train for years. Don&#8217;t bother seeing the tourist Muay Thai fights on any of the islands. Instead, spend a night seeing an authentic match with world-class fighters in Bangkok at Rajadamnern Stadium.</p><p>1 Ratchadamnoen Nok Rd, +66 2 281 4205, rajadamnern-boxing-stadium.business.site. Main fights are on Mondays, Wednesdays, Thursdays, and Sundays. Tickets range from 1,000-2,000 THB.</p><p><strong>NEED MORE? <a href=\"https://nomadicmatt.com/books/bangkok-guide/\" target=\"_blank\" rel=\"noopener\">Click here to get my detailed guidebook on Bangkok and get off the tourist path, save money, and see more!</a></strong></p><h3>What to do in Bangkok: Day Three</h3><p><strong>Shop and eat at the Chatuchak Weekend Market</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk12.jpg\" alt=\"Chatuchak Weekend Market in Bangkok, Thailand\" width=\"825\" height=\"395\"><br> The weekend market is one of the best things in Bangkok. It&#8217;s the size of many football fields and quite crowded. You&#8217;ll find everything and anything from authentic designer clothes to their fake counterparts to phones to knockoff movies to pets to backpacks to kitchenware. There&#8217;s a big dining area with great, cheap food. Don&#8217;t miss coming here.</p><p>Kamphaeng Phet 2 Rd, +66 2 272 4813. chatuchakmarket.org. Open W-Th (7am-6pm), F (6pm-12am), Sa-Su (9am-6pm).</p><p><strong>Tour Jim Thompson&#8217;s House</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk13.jpg\" alt=\"Jim Thompson's House\" width=\"825\" height=\"395\"><br> Jim Thompson was an American spy and silk merchant in Thailand during the &#8217;50s and &#8217;60s who vanished mysteriously in 1967 while in Malaysia. He made his home in the traditional Thai style, decorating it with beautiful teak wood and a surrounding garden. The tours feature a lot of history about Jim, the silk industry, and how and why Thais design their homes the way they do. Admission fees go to underprivileged kids.</p><p>1 Khwaeng Wang Mai, +66 2 216 7368, jimthompsonhouse.com. Open daily from 9am-6pm. Admission is 200 THB for adults, with discounts available for students and kids.</p><p><strong>Visit Lumpini Park</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk14b.jpg\" alt=\"Visit Lumpini Park in Bangkok, Thailand\" width=\"825\" height=\"379\"><br> Lumpini Park is Bangkok&#8217;s Central Park. This sizable green space is well worth a visit if you&#8217;re a people watcher. At all hours of the day, you&#8217;ll find people playing sports, walking, biking, practicing tai chi, or just relaxing. In a city that lacks much green space, you&#8217;ll probably crave a little wildlife after navigating all the traffic and vendors in this concrete jungle.</p><p>192 Wireless Rd, +66 2 252 7006. Open daily from 4:30am-9pm.</p><p><strong>Hang with the Hipsters on Soi Nana</strong><br> There are two areas in Bangkok called Soi Nana (one is a sex tourism hub), but the Soi Nana I&#8217;m referring to is a hip new area for nightlife near the train station in Chinatown. This street is filled with tiny bars, cocktails lounges, and art exhibits in old-style Chinese homes left in their original style. Some of the best bars are Pijiu (Chinese beer bar), Teens of Thailand (first gin bar in Thailand), Ba Hao (four-floor Chinese-inspired bar), El Chiringuito (Spanish tapas), 23 Bar &amp; Gallery (bar in an art space). It&#8217;s incredibly popular with young Thais and one of the coolest new areas of Bangkok. Don&#8217;t miss it.</p><p><strong>NEED MORE? <a href=\"https://nomadicmatt.com/books/bangkok-guide/\" target=\"_blank\" rel=\"noopener\">Click here to get my detailed guidebook on Bangkok and get off the tourist path, save money, and see more!</a></strong></p><h3>Places To Visit in Bangkok: Day Four</h3><p><strong>Enjoy an event at the Bangkok Art and Culture Center</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk15.jpg\" alt=\"Bangkok Art and Culture Center\" width=\"825\" height=\"395\"><br> This contemporary arts center highlights and hosts art, music, theatre, film, design, and cultural events in its exhibition and performance spaces. In a city that lacks a real art scene, this is an enriching place to see some local art.</p><p>939 Rama I Road, +66 2 214 6630-8, bacc.or.th. Open Tu-Su (10am-9pm). Admission is 50 THB.</p><p><strong>Brave the Bangkok Corrections Museum</strong> <strong>CLOSED PERMANENTLY</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk16.jpg\" alt=\"Bangkok Corrections Museum\" width=\"825\" height=\"395\"><br> The Bangkok Corrections Museum is located on the site of a former maximum-security prison and has been a museum since 1939. You can learn about the cruel methods of punishment used in the past and see torture devices and wax figures depicting execution scenes.</p><p><strong>Visit the National Museum</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk17.jpg\" alt=\"Experience Thai Culture at the Bangkok National Museum\" width=\"825\" height=\"395\"><br> This museum focuses on Thai culture, with highlights that include a large collection of musical instruments, recorded music, ornate royal funeral chariots, and impressive wooden carvings. The museum isn&#8217;t very big and the signs aren&#8217;t very detailed, but the artifacts are interesting to look at. It&#8217;s best to go when they offer English tours on Wednesdays and Thursdays at 9:30am.</p><p>Na Phra That Alley, +66 2 224 1333,virtualmuseum.finearts.go.th/bangkoknationalmuseums. Open W-Su (9am-4pm). Admission is 200 THB. </p><p><strong>Take a food tour</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/4daysbk18.jpg\" alt=\"Delicious Thai food in Bangkok\" width=\"825\" height=\"395\"><br> Bangkok is all about food. You&#8217;ll never stop eating here, but the sheer variety can be overwhelming! To get a deeper appreciation of Thai food, take a food tour. The two best are <a href=\"http://bangkokfoodtours.com\" target=\"_blank\" rel=\"noopener\">Bangkok Food Tours</a>.</p><h3>More Places To Visit In Bangkok</h3><ul><li><strong>Museum of Siam</strong>&#160;&#8211; This museum uses a variety of media to explore the origins of the Thais and their culture. The galleries deal with the origins of the country and its people told through various multimedia. It&#8217;s a fun little interactive museum housed in an old 19th-century European style building. 4 Maha Rat Rd, +66 2 225 2777. Open everyday but Monday from 10am-6pm. Admission is 300 THB.</li><li><strong>Wakeboard at Lake Taco&#160;</strong>&#8211;<strong>&#160;</strong>If you want to get out of the city&#160;and have some adventure, head to the eastern outskirts of Bangkok&#160;for some wakeboarding (i.e. riding on a short board while being pulled by a motorboat). This is a popular thing to do with expats and though I never did it, my friends always said it was a fun time.</li><li><strong>Take a cooking class&#160;</strong>&#8211; Take an afternoon to learn about Thai cooking and try your hand at making some food. You&#8217;ll find cooking classes throughout the city but the vegetarian restaurant Mai Kaidee has a really good one!</li><li><strong>Calypso Ladyboy Show</strong> &#8211; This ladyboy show is actually a good cabaret show that attracts a variety of visitors. It&#8217;s Bangkok&#8217;s version of Moulin Rouge. There&#8217;s glitz, glamour, and spectacle&#8212;everything you&#8217;d expect from a cabaret show in Bangkok. They also have a traditional Thai buffet dinner. 2194 Charoenkrung 72-76 Road, Warehouse #3, +66 2 688 1415-7, calypsocabaret.com. Shows are daily at 8:15pm and 9:45pm. Tickets from 900 THB per person.</li></ul><h3>Where to Eat in Bangkok</h3><ul><li><strong>Indus</strong> &#8211; One of the more fancy Indian restaurants in Bangkok, this place has a beautiful design and outdoor eating area. It&#8217;s high end but the food is delicious. I especially like their Chicken Masala. 71 Sukhumvit Soi 26, +66 2 258 4900, indusbangkok.com. </li><li><strong>May Kaidee&#8217;s Vegetarian Restaurant</strong> &#8211; Located near Khao San Road, this restaurant is an institution in Bangkok and serves the best vegetarian Thai food in the area. Try the Massaman curry and spring rolls&#8212;they&#8217;re heavenly. They also offer cooking classes during the day. 33 Samsen Road, Soi 2, +66 2 281 7699, maykaidee.com/restaurants.</li><li><strong>Isao</strong> &#8211; This is one of my favorite sushi restaurants in the entire world. Everything here is delicious. There&#8217;s a robust menu and constantly changing specials. Make sure you try the Winter Roll as it will be the best thing you eat. 5 Sukhumvit 31, +66 2 258 0645-6, isaotaste.com.</li><li><strong>Bella Napoli</strong> &#8211; This is my favorite Italian place in Bangkok. You&#8217;ll get the best pizza in the city, along with other delicious Italian specialties, the staff is friendly, and the prices are affordable. Sukhimvit Soi 31, +66 2 259 0405, facebook.com/bellanapoli.bkk.</li><li><strong>Rawanstar Roasted Duck</strong> &#8211; Here you&#8217;ll find great roast duck at reasonable prices. 955/6 Thanon Nakhon Chai Soi, +66 2 241 2506. </li><li><strong>Sukhimvit Soi 33</strong> &#8211; Tucked down the side of the Family Mart is a series of street stalls that feature delicious food. Try the Pad Thai place. It&#8217;s one of the best in the city.</li><li><strong>Soi Rambuttri</strong> &#8211; At the far end of Soi Rambuttri near the roundabout is another series of street stalls that have grown more popular in the years. They have really, really good food. Be sure to try the soup place. It&#8217;s out of this world.</li></ul><p></p>***<br> There&#8217;s more to see and do in Bangkok than just temples, shopping, and traffic! It&#8217;s a city whose charm emerges slowly once you get off the beaten path. With four days, you can see the major and minor attractions and get a robust overview of one of favorite cities in the world.<p>There&#8217;s more to see and do in Bangkok than just temples, shopping, and traffic! It&#8217;s a city whose charm emerges slowly once you get off the beaten path. With four days, you can see the major and minor attractions and get a robust overview of one of favorite cities in the world.</p><p><a href=\"https://www.nomadicmatt.com/books/thailand-bangkok-book-bundle/\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/2018/2fer-thai.jpg\"></a></p><p><strong>NEXT STEP &#8212;- &gt;</strong> <a href=\"https://nomadicmatt.com/books/bangkok-guide/\" target=\"_blank\" rel=\"noopener\">Click here to get my detailed guidebook on Bangkok and get off the tourist path, save money, and see more!</a></p><p><img class=\"wp-image-141879\" src=\"https://www.nomadicmatt.com/wp-content/uploads/2018/07/visit-bangkok-itinerary.png\" alt=\"\" width=\"300\" height=\"704\"></p></div>","title":"What to Do and See in Bangkok: A 4 Day Itinerary"}},"pageContext":{"id":"5b95ea0487be05832748ff75"}}