{"data":{"mongodbDatabaseArticles":{"id":"5b95ea6d87be05832748ffa6","content":"<div><p> </p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/kophangan_saturday_city.jpg\" alt=\"beautiful Ko Phangan Island from afar\">Updated: 01/10/2018 | January 10th, 2018</p><p>Ok, so it is not a city, <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/ko-phangan/\" target=\"_blank\" rel=\"noopener\">it is an island</a> &#8211; and a big one at that. But we&#8217;re going to focus on one part of this island: Haat Rin Beach.</p><p>Haat Rin is the backpacker party mecca of <a href=\"https://nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\" target=\"_blank\" rel=\"noopener\">Southeast Asia</a>. All roads may lead to <a href=\"https://nomadicmatt.com/travel-blogs/bangkoks-khao-san-road-hd-video/\" target=\"_blank\" rel=\"noopener\">Khao San in Bangkok</a>, but, for those looking for parties and beaches, there is no better place to turn other than this island and, more specifically, this beach.&#160;Travelers come for one thing: <a href=\"https://nomadicmatt.com/travel-blogs/the-ultimate-guide-to-the-full-moon-party/\" target=\"_blank\" rel=\"noopener\">The Full Moon Party</a>, an event that turns out 10,000-40,000 people each month, depending on the time of year.</p><p>Ko Phangan is located in the Gulf of Thailand, north of Ko Samui and south of <a href=\"https://nomadicmatt.com/travel-blogs/the-complete-guide-to-diving-in-koh-tao/\" target=\"_blank\" rel=\"noopener\">Ko Tao</a>. The island began to draw tourists during the 1980s, when it was a sleepy little off-the-beaten-path part of the Southeast Asia tourist trail. Over the years, due to the party&#8217;s fame, more and more people came to the island looking for a good time and to rave at the Full Moon Party.</p><p><img src=\"https://media.nomadicmatt.com/ko_phangan_3.jpg\" alt=\"a beach on Ko Phangan\"></p><p>What started as a quiet beach party morphed into a beach rave and is now a giant beach drinking festival. Though there are dozens of beaches on Ko Phangan, the majority of tourists stick to Haat Rin, which is now filled with banana pancake shops, massage parlors, falafel stands (a lot of Israelis come here), bars, overpriced restaurants, travel agents, and crappy bungalows.</p><p>During the day, the beach is cleaned up from the night before while Westerners sun themselves, play beach games, and swim in the ocean. You get the best light here and, if you come out early enough, you still see people partying from the night before. At night, the beach is filled with bucket-drinking tourists watching fire dancers and dancing the night away. Around the beach, you can get yourself painted up with glow-in-the-dark paint.</p><p>The crowd peaks around the full moon, when the infamous party occurs. Legend has it that it started as a birthday party in the mid-80s and just grew from there. The travelers came back again and again, each time attracting more people. Old timers lament both the loss of the innocence and spirit of the old parties and the parties&#8217; subsequent morph into a drinking free-for-all.</p><p><img src=\"https://media.nomadicmatt.com/kophangan_island.jpg\" alt=\"a beach on Ko Phangan; Photo by J&#248;rn Eriksson (flickr: @jorneriksson)\"></p><p>During the <a href=\"https://nomadicmatt.com/travel-blogs/the-ultimate-guide-to-the-full-moon-party/\" target=\"_blank\" rel=\"noopener\">Full Moon Party</a>, accommodation on the beach is fully booked, the beach is packed, the music is loud, the buckets flow freely, and everyone is painted up. The party peaks during the Christmas season when the December Full Moon and the New Year&#8217;s Full Moon parties see anywhere between 25,000 and 40,000 people. (During New Year&#8217;s, people from neighboring islands and beaches trek to Haat Rin.)</p><p>For those who are not interested in such debauchery, the island has many other things to offer, too. For starters, there is a yoga and health center on the east side of the island that&#8217;s one of the most famous in <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener\">Thailand</a>. The beaches to the north, such as Bottle Beach, see fewer tourists, are quieter, cheaper, and cleaner. Here are some things to see and do on Ko Phangan:</p><p><strong>Go snorkeling</strong><br> Snorkel trips usually run from 11 am-5 pm and include transportation by boat, snorkeling, swimming, and lunch for about 475-675 THB. You meet tons of people on them as well. There is also a tour called the Munchies Tour and another called the Reggae Tour and both include, as you might guess, marijuana.</p><p><strong>Tour the temples</strong><br> Thailand is covered with temples of varying religious denominations, and Ko Pha Ngan is no exception. If you haven&#8217;t gotten your fill of culture yet, visit some of them. They are beautiful windows into Thai religion and make for great photo opportunities.</p><p><strong>Take a boat trip</strong><br> Boat trips can be arranged through a variety of resorts and companies around the island. Some of the best itineraries include visits to the Than Sadet Waterfall, Thong Nai Pan, and Bottle Beach (Haad Khuat). Usually, you&#8217;ll have lunch included on these excursions.</p><p><strong>Go kayaking</strong><br> <img src=\"https://media.nomadicmatt.com/phangan_kayaking.jpg\" alt=\"kayakers on Ko Phangan\"><br> Just on many of the other islands, it&#8217;s possible to rent a sea kayak and head out on the water. Head out for an hour of paddling, or be more ambitious and do an organized day tour. You can find kayaks on nearly every beach, with most starting at around 100-150 THB per hour. The West coast, from Wok Tum to Koh Ma offers some of the best kayaking waters to beach hop.</p><p><strong>Visit the botanical gardens</strong><br> The Pha Ngan Heritage Garden has over 2,000 species of Thai vegetation, with over 200 different types of water lilies alone! The ponds boast giant carp, and there is what claims to be (and I believe it!) the only Siamese Fighting Fish and Guppy Fish Museum in the South of Thailand. There is a 50 THB donation required to enter the gardens.</p><p><strong>Relax in the sun</strong><br> <img src=\"https://media.nomadicmatt.com/phangan_beach.jpg\" alt=\"a beach in Ko Phangan; Photo by Plus Good (flickr: @bjvs)\"><br> Haat Rin is the most developed beach on the island but, with over 30 beaches to choose from, you can have anything from touristy and developed, to deserted and secluded beaches all to yourself. Thong Nai Pan is one of my favorites, with white sand and calmer waters.</p><p>But the truth is that the allure of Ko Phangan rests mostly with Haat Rin. Even those who do not stay on the beach go there at night. While the inner island has some great hiking and waterfalls, <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/ko-phangan/\" target=\"_blank\" rel=\"noopener\">Ko Phangan</a> is synonymous with parties. Travelers will ironically lament that this is not the &#8220;real&#8221; Thailand while drinking a bucket on the beach. But you don&#8217;t come here to see the real Thailand. You come here to meet other travelers and have a good time. I recently spent my New Year&#8217;s on the island where I met amazing people, had a great time, and saw dawn too often. It was not local Thailand. Not even close.</p><p>But, accept the island for what it is &#8211; a tourist party island &#8211; and you will open yourself up to just enjoying yourself, free of expectations about authentic travel.</p><p>So if you find yourself on the <a href=\"https://nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\" target=\"_blank\" rel=\"noopener\">Southeast Asian backpacking trail</a> and are looking to have a great, wild time, there is no better place to do that than Haat Rin Beach on Ko Phangan.</p><p><strong>How to get there</strong><br> There&#8217;s no airport on the island, so everyone comes by ferry. From Surat Thani, round-trip boat tickets cost 600 baht. From there, it&#8217;s a 100-baht taxi ride to Haad Rin. From Koh Samui, boat tickets cost 200 baht and leave from Big Buddha Pier or Maenam Beach. The Samui ferry will drop you off at the main dock of Thong Sala or Haad Rin, depending on time of day and ferry company. During the Full Moon Party, boats go from Koh Samui to Haad Rin every hour.</p><h3>Get the In-Depth Budget Guide to Thailand!</h3><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Thailand_Flat.jpg\" alt=\"Nomadic Matt Thailand guide\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p><h4>Book Your Trip to Ko Phangan: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Ko Phangan by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Acommodation</strong><br> You can book your hostel in Ko Phangan with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Ko Phangan?</strong><br> Be sure to visit our robust <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/ko-phangan/\" target=\"_blank\" rel=\"noopener\">destination guide on Ko Phangan</a> for even more planning tips!</p><p>Photo Credit: <a href=\"https://flic.kr/p/cD4NSY\" target=\"_blank\" rel=\"noopener\">3</a>, <a href=\"https://flic.kr/p/7LwpNM\" target=\"_blank\" rel=\"noopener\">6</a></p></div>","title":"Ko Phangan: An Insider's Guide to This Crazy Paradise"}},"pageContext":{"id":"5b95ea6d87be05832748ffa6"}}