{"data":{"mongodbDatabaseArticles":{"id":"5b95efd687be058327490121","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Why I Don&#8217;t Drive a Motorbike in Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/why-i-dont-drive-motorbike-thailand\"><img class=\"aligncenter size-full wp-image-15003\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Dont-Ride-Motorbike-Thailand-Header.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Why I don't drive a motorbike in Thailand\" width=\"1000\" height=\"550\"></a></p>\n<p>A recent evening out with new friends prompted a conversation about riding motorbikes in Thailand. Chris and I share a bike but he&#8217;s the driver and I always ride pillion. Always. I don&#8217;t drive a motorbike in Thailand and probably never will, but I have my reasons why.</p>\n<p>Anyone who knows me knows that I&#8217;m not a risk taker. I&#8217;d also go so far to say I&#8217;m a safety nut.&#160;I&#8217;m that woman who won&#8217;t go skydiving and I can&#8217;t be bothered to&#160;gamble.&#160;That&#8217;s because I won&#8217;t do something if I know the chances of me getting hurt, losing money, or experiencing negative consequences are high.</p>\n<p>So boring, I know.</p>\n<p>With that said, <strong>I made the conscious decision not to drive a motorbike after&#160;Chris and I moved to Thailand.</strong> That was nearly three years ago and I still don&#8217;t know how to drive one. Sure, I miss my independence that I used to have when I drove a car. I&#8217;m also regularly inconvenienced by the time I waste walking or trying to hail a songthaew, but I have my reasons. Like I like living.</p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"aligncenter size-full wp-image-15006\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Dont-Ride-Motorbike-Thailand-Pinterest.jpg?resize=500%2C750&amp;ssl=1\" alt=\"Hopping on a motorbike to explore Thailand is not as easy as it sounds...and can be dangerous, too. | Tieland to Thailand\" width=\"500\" height=\"750\"></p>\n<h2><p id=\"I_have_a_not-so-great_track_record\"><p>I have a not-so-great track record</p></p></h2>\n<p>Let&#8217;s just say I&#8217;ve gotten in a few accidents in my good ol&#8217; driving days back in the USA. I was very lucky that in most of the accidents the damage was done solely to my vehicle. None of my accidents injured anyone, myself included.</p>\n<p>Silly things, like the one time the&#160;light turned green and I started to go (because that&#8217;s what you&#8217;re supposed to do) but the car in front of me didn&#8217;t.</p>\n<p>Or that other time I was actively avoiding a collision with&#160;someone else and ended up causing another accident in the process.</p>\n<p>I admit that I can get distracted easily. Since<strong> riding a motorbike requires a superhuman level of concentration</strong> to avoid and prevent accidents, I&#8217;d be a big, fat FAILURE.</p>\n<h2><p id=\"I8217m_not_confident_in_my_motorcycle_driving_ability\"><p>I&#8217;m not confident in my motorcycle driving ability</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-15002\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Dont-Ride-Motorbike-Thailand-3.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Why I don't drive a motorbike in Thailand\" width=\"1000\" height=\"550\"></p>\n<p>I learned how to ride a horse by getting on its back and holding on. But that is not how I want to learn how to ride a motorbike.</p>\n<p>I guess any beginner lacks confidence. Arguably confidence grows with practice. I&#8217;ve tried riding a motorbike twice and as soon as I hopped on the seat I was&#160;ready to get off. The motorbike was heavy and wobbly. When I reflexively put my foot down to stable myself while practicing turns and making u-turns, my leg got yanked back. Ouch! The alternative was to not put my foot down and therefore topple over sideways and scrape up the rental and one side of my body. It was pretty much a lose-lose situation and not fun at all.</p>\n<p>Plus unlike a bicycle, if I was riding a motorbike and it fell over (god forbid ON me), would I be strong enough to pick it up? If can&#8217;t physically manhandle the motorbike then I have no business riding it.</p>\n<p>I think my biggest heartache is the throttle. <strong>Why on earth would someone design the throttle to fail-safe in the accelerating position!</strong>? Having to pull the throttle back&#160;to go is the reason countless &#8220;superman&#8221; accidents happen. SMH.</p>\n<p>Why&#160;doesn&#8217;t the throttle require a forward push to accelerate? Or a sensitive throttle thumb control? I&#8217;d be so much more confident knowing that I wouldn&#8217;t accidentally rev the engine as I straddled the bike and take off flying. Because that&#8217;s exactly what I want to do in life: have the bike yank me around and cause me to tear a ligament in my knee or something. We know someone who that happened to!</p>\n<p><strong>I&#160;get one chance to counter steer properly, prevent myself from stalling, or successfully dodge potholes &#160;&#8211; one chance &#8211; or else I&#160;crash.</strong> If you ask me, those are some pretty lousy statistics.</p>\n<h2><p id=\"I8217m_not_ready_to_accept_the_consequences_of_an_accident\"><p>I&#8217;m not ready to accept the consequences of an accident</p></p></h2>\n<p>I live close to a major clinic in Chiang Mai&#8217;s Old City. I&#8217;ve seen my fair share of tourists (although a few Thai people, too) painfully limping around with bright white bandages on their ankles, knees, and elbows.</p>\n<p>As a beginner driver, I am not ready to accept the consequences of my sub-par driving skills. &#160;<strong>Displaying purple, disfiguring road rash for several years is not on my bucket list.</strong> Or, say, having a limp or an ache that never ever goes away. Nope, no thank you.&#160;I&#8217;m thirty years old, have never broken a bone, and wish to keep it that way.</p>\n<p>That&#8217;s not to say Chris&#8217;s driving skills will keep us completely out of harm&#8217;s way because there are still <a href=\"https://www.tielandtothailand.com/minivan-accident-in-chiang-mai-thailand/\">crazy drivers</a> out there. But he&#8217;s definitely a much safer, more experienced driver than I am. That would lessen the chance of us getting into an accident.&#160;At least when I&#8217;m a passenger, I trust Chris to handle situations far&#160;better than I can. He&#8217;s&#160;taken a week-long motorcycle safety course. Plus, he&#8217;s had several years of experience driving motorcycles in the USA before coming to Thailand.</p>\n<p>As a motorbike driver, I&#8217;d hold the heavy weight of&#160;responsibility in my&#160;hands, too. Beginners are&#160;high-risk drivers. If I were to hurt someone,&#160;<strong>I wouldn&#8217;t be ready for the consequences of dealing with a legal battle if it came to that. Especially in a foreign country!</strong></p>\n<h2><p id=\"It_will_always_be_my_fault\"><p>It will always be my fault</p></p></h2>\n<img class=\"wp-image-15001 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Dont-Ride-Motorbike-Thailand-2.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Why I don't ride a motorbike in Thailand\" width=\"1000\" height=\"550\"><p>At least in the USA, if you get in an accident the person at fault is usually correctly blamed. But in Thailand, all I&#8217;ve ever read on forums and heard from other people sharing their experiences is that <strong>the foreigner is always to blame for causing the accident.</strong> Some hodgepodge about &#8220;if the foreigner wasn&#8217;t in Thailand, the accident would have never happened.&#8221;</p>\n<p>Sure, if I cause an accident I have enough integrity to accept the blame. However, <strong>if I didn&#8217;t cause an accident and got slapped with the blame and bill, I would see red.</strong></p>\n<p>I am a&#160;person who accepts responsibility and consequences of my own actions. Therefore, I expect the same if someone else were to hit me. Unfortunately, as the foreigner, I am slapped with the label that I have more money. Often in Thai society, that&#8217;s the person who automatically is responsible for paying for an accident, regardless of who&#8217;s at fault.</p>\n<p><strong>I can&#8217;t wrap my head around it and&#160;I refuse to play that game.</strong></p>\n<h2><p id=\"Hit_and_runs_scare_me\"><p>Hit and runs scare me</p></p></h2>\n<p>If I were to get into an accident, <strong>I wouldn&#8217;t trust whatever Thai person or random tourist that hit me to call for help</strong> if no one else was around! That&#8217;s because it&#8217;s not common to be penalized for leaving the scene of an accident.</p>\n<p></p>Hit and run accidents&#160;happen a lot here. Although compulsory&#160;insurance&#160;is mandatory in Thailand, A) does the driver actually have it and B) will it be enough?\n<p>Hit and run accidents happen a lot here. Although compulsory insurance is mandatory in Thailand, A) does the driver actually have it and B) will it be enough?</p><p>The thought of paying a huge medical bill or replacing a motorbike out-of-pocket can easily convince someone to flee the scene of an accident. And how many tourists do you think have a cell phone with a functioning Thai SIM card before they go zipping around on Thailand&#8217;s roads? I know I didn&#8217;t invest in a SIM card when I was on vacation in Thailand in 2012.</p>\n<p><strong>I don&#8217;t want to be riding around by myself and something happens where I&#8217;m left alone</strong>, bleeding and broken on the side of the road. At least if I&#8217;m riding with Chris, he&#8217;s there with me. There&#8217;s the chance that one of us isn&#8217;t knocked out and physically capable of calling the police or functional enough to help the other person.</p>\n<h2><p id=\"I_don8217t_drive_a_motorbike_in_Thailand_and_may_never_do_it\"><p>I don&#8217;t drive a motorbike in Thailand and may never do it.</p></p></h2>\n<p>Maybe I&#8217;m being too cautious and should really give driving a motorbike another try. But at the end of the day, I know my limitations. It&#8217;s more important for me to be a functional human being than some vegetable hooked up in a hospital somewhere.</p>\n<p>There may come a time that I work up my courage to drive a motorbike in Thailand. For now, I&#8217;m content with sitting behind Chris on a bike. At least he&#8217;s an awesome driver!</p>\n<p><strong>Would you drive a motorbike in Thailand without prior experience?</strong></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Why I Don’t Drive a Motorbike in Thailand"}},"pageContext":{"id":"5b95efd687be058327490121"}}