{"data":{"mongodbDatabaseArticles":{"id":"5b96297c87be058327491192","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What I was up to other than here:</h2><ul><li><a href=\"http://www.scribblesnaptravel.com/the-ultimate-travel-tips-from-some-of-the-worlds-top-travel-bloggers/\" target=\"_blank\"><p>The Ultimate Travel Tips from some of the World&#8217;s Top Travel Bloggers</p></a> on Scribble, Snap, Travel</li></ul><h1>Now your story,</h1><p>One time leaving Bombay to NY, the American flight attendants on United Airlines almost had a meltdown over trying to get the Indian passengers to put their luggage in the overhead bins.</p><p>I kid you not, one got on the intercom and frantically said,&#160;&#8220;If you do not all sit down and let us put your luggage up, this plane WILL NOT TAKE OFF! YOU CAN STAY RIGHT HERE IN INDIA! SIT DOWN!&#8221;&#160;They must draw straws to see who has to do this 16 hour flight because they were all miserable to be working it.</p><p>What was the issue with the passengers? Well it&#8217;s hard to name just one (I mean the seat-switch requests alone were out of control, and there were multiple men demanding the flight attendants put their iPhones on charge), but I think the main issue was everyone wanted to put their luggage in the overhead bins <strong>near the front of the plane</strong>&#8230; <strong>even if their seat was in the back.</strong></p><h3>Why? I would guess so they don&#8217;t have to carry down the isle or so they can run to the front when the plane lands and get off first. The flight attendants were losing their minds over it!</h3><p>If you&#8217;ve ever been on a plane or train in India you know exactly what I&#8217;m talking about. Everyone wants off first! It&#8217;s a fight to baggage claim&#160;where they will then fight to stand closest to where the luggage comes out on the belt.</p><p>If you haven&#8217;t, it&#8217;s really hard to explain without sounding mean&#8230; but it&#8217;s not a lie: people here get pushy. Really pushy. For some reason standing in line isn&#8217;t a &#8220;thing&#8221; in India as you saw in my last <a title=\"This is India! (six)\" href=\"https://hippie-inheels.com/this-is-india-six-indian-customs/\" target=\"_blank\">This is India story</a>, and even though you&#8217;d think aboard an aircraft with lots of Indian business men this would be different, I can assure you after about 100 flights here, it is not! Some Indian stereotypes are certainly true, just like stereotypes anywhere else.</p><p>When the plane lands, typically people exit their seats from front to back, but on Indian flights there is no order to it- the people in the isle seats get up and off first then the rest of the people fight to exit.</p><p>So the flight attendants&#160;yelled, I laughed, it was the start of a terrible 16 hour flight. The little four year old next to me would tap my arm every two seconds, &#8220;auntie, can you change this show &#8230; auntie, can I have some of your chocolate&#8230; auntie, are you 40?&#8230; auntie your glasses are too big, you look funny&#8221;.&#160;&#160;We only took off 30 minutes late and we landed on time. The little Indian girl slept on me almost the whole trip but she was too adorable to care, and her pregnant mama was too tired to notice.</p><h1>This is India!</h1><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on <a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>, <a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>, <a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a> &amp; <a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! (seven)"}},"pageContext":{"id":"5b96297c87be058327491192"}}