{"data":{"mongodbDatabaseArticles":{"id":"5b96248787be058327490e9c","content":"<div><p><img title=\"numbers\" src=\"https://foxnomad.com/wp-content/uploads/2008/12/numbers-300x2011.jpg\" alt=\"numbers\" width=\"300\" height=\"201\">The other day I heard the morbid logic from a (non) frequent flier that he takes separate flights with one child and his wife with their other two. They do this so that in case of a plane crash, their family and one of the children will survive. This is not the first time I&#8217;ve heard people bring this up &#8211; some parents take separate flights when they leave the kids behind with relatives for this very reason.</p>\n<p>As odd as it sounds, the idea intrigues me, does flying separately really reduce the chances of losing your entire family in a plane crash?</p>\n<p><strong>The Numbers</strong></p>\n<p>According to <a href=\"http://www.foxnomad.com/2007/03/23/feed-you-obsession-for-plane-crashes-planecrashinfocom/\">Plane Crash Info</a>, the odds of you dying in a commuter plane crash are 1 per every 140,000 flight hours. Americans are at slightly higher risk, they have about a <a href=\"http://www.livescience.com/environment/050106_odds_of_dying.html\">1 in 20,000 chance</a> of dying in a plane accident and frequent flier are more likely to die in a crash.</p>\n<p><strong>Two Flights, Better Odds?</strong></p>\n<p>Taking two flights (since plane crashes are random events) doesn&#8217;t reduce your chances of dying to 1 in 40,000. It just gives <strong>each passenger</strong> (if you&#8217;re family is taking two planes) a 1 in 20,000 chance of dying in a crash. So, even if the plane goes down you may still survive depending on <a href=\"http://www.foxnomad.com/2007/08/08/plane-crash-survival-slightly-higher-if-you-sit-in-the-back/\">where you sit</a> and the type of crash.</p>\n<p></p>\n<p><strong>In The End</strong></p>\n<p>If your family takes an of 10 flights per year, you&#8217;d have to fly an average of 2,000 years before your first plane crash. Yes, even still, if the flight your family is on does happen to crash you may all perish. But it hasn&#8217;t happened on a commercial airline&#8230;ever. With the <a href=\"http://www.foxnomad.com/2008/10/07/has-the-global-economic-crisis-affected-your-travel-plans-poll/\">global economic crisis</a> you&#8217;re better off saving the money on that extra flight and <a href=\"http://www.foxnomad.com/2008/08/07/does-traveling-age-you/\">drinking wine</a> to keep reduce your risk of developing blood clots in your legs &#8211; on 4 hour flights you&#8217;re 3 times as likely &#8211; and have a 1 in 5 chance of dropping dead from a heart attack.</p>\n<p>Have you ever considered taking separate flights and would you do it if money weren&#8217;t an issue?</p>\n<p>[photo by: <a href=\"https://www.flickr.com/photos/koenvereeken/\">Koen Vereeken</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Will Flying Separately Save Your Family In A Plane Crash?"}},"pageContext":{"id":"5b96248787be058327490e9c"}}