{"data":{"mongodbDatabaseArticles":{"id":"5b937b0e87be056953db7d11","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"1550\" id=\"1550\" class=\"graf graf--h3 graf--leading graf--title\">In no particular order: Some things I have learned so far in my 9ish months as a&#160;nomad</h1></p><p name=\"f0a7\" id=\"f0a7\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">It&#8217;s okay to say this sucks sometimes. </strong>&#8220;wow living the dream megs!&#8221;&#8202;&#8212;&#8202;the reaction I get every time I mention that I&#8217;m a nomad (I usually say homeless, but I&#8217;m told I&#8217;m not supposed to say that any more), and admittedly, it&#8217;s a badge I don&#8217;t mind showing off&#8202;&#8212;&#8202;&#8220;yeah, I guess I am&#8221; I always say. This is the dream, isn&#8217;t it? It feels ungrateful to be on my way to Edinburgh&#8202;&#8212;&#8202;trying to use a sundress as a blanket on a cement floor at 4am, because I tried to save a buck, but didn&#8217;t realize that the layover would be in an outdoor station and nothing would be open&#8202;&#8212;&#8202;thinking &#8220;this fucking sucks&#8221;.</p><p name=\"44e3\" id=\"44e3\" class=\"graf graf--p graf-after--p\">On any given night, my activity of choice is to put on all my softest clothes, wrap myself in all my softest blankets curl up with bad tv drama on top of every pillow I own. I&#8217;m not even sure that I like traveling alone. Actually, I&#8217;m pretty sure I don&#8217;t. Everything is hard. Like, everything. I miss my friends and family. I miss knowing my way around. I miss my closet. But as much as I dislike traveling alone, I dislike wasting time even more. Every time I enjoyed the comforts of home, it came with a little piece of regret for not doing more with my time. And when the joys of being comfortable fade, a pile of those little pieces is all that&#8217;s left.</p><p name=\"6c97\" id=\"6c97\" class=\"graf graf--p graf-after--p\">Don&#8217;t get me wrong, it&#8217;s really fun most of the time. It&#8217;s what I want to be doing. On any single night I&#8217;ll choose the blankets, but on any given set of days, I&#8217;ll choose the new experiences. But if I&#8217;m not having fun I let myself acknowledge it instead of swatting it away &#8220;you&#8217;re living the dream you&#8217;re living the dream you&#8217;re living the dream.&#8221; I knew the trade that I made: not so comfortable in exchange for no regrets and no wasted time. Being uncomfortable sucks sometimes, and that&#8217;s okay.</p><p name=\"0c83\" id=\"0c83\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I will never understand tapas. Isn&#8217;t it just tiny everythings?</strong> Oh cool your favourite food is tapas? Yeah I actually like all the foods too. Weird.</p><p name=\"48ca\" id=\"48ca\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Always check in at airports.</strong> It&#8217;s crazy how often someone I know is sitting in the same airport. And sometimes they even have lounge passes.</p><p name=\"ca20\" id=\"ca20\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I need an every-day-talk-about-nothing person. </strong>Traveling alone is lonely. The longer you&#8217;re gone, the more your friendships feel faded&#8202;&#8212;&#8202;sure they&#8217;re the special kind that you can pick up right where you left off like no time has passed, but right now, they&#8217;re faded. To really feel connected to people, you need to talk to someone on a daily basis. Or, at least, I do. I need someone who I can message with the latest addition to my list of my favourite dutch words (eg. rhinoceros translates to nose-horn, turtle to shield-toad, shield-toad!) or give the full transcripts of my awkward attempts at greeting Europeans (Are you hugging? leaning in? some sort of hybrid half hug? actual kiss or just sound? how do you decide one cheek or both??). When I have someone to share my daily trifles with, I&#8217;m not lonely. I have that feeling that someone is in my corner, and suddenly the world doesn&#8217;t seem that big (plus I need someone to notice if a crazy foreign serial murder finds me).</p><p name=\"6233\" id=\"6233\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I will always have a break down when something that should be easy is really hard when I first get to a new city. </strong>Like buying a subway ticket, or finding a bank machine that will accept my card, or trying to buy a yogurt that isn&#8217;t 10000% fat when I can&#8217;t read the label. Inevitably, something will put me over the edge and bring on the waterworks. Then the real anxieties join in. &#8220;You can&#8217;t do this&#8221; is the ringleader, sometimes followed by &#8220;What are you trying to prove?&#8221; and &#8220;You are an idiot&#8221;. Five or six cities later, I&#8217;m dealing with this the way I deal with every break up: it&#8217;s not me, it&#8217;s you. Of course you&#8217;re going to have a melt down! This city is weird and new and I&#8217;m pretty sure they put mayonnaise on their french fries. Being alone in a new city is scary and stressful, but I am expecting magic as soon as I step off the plane. Let the breakdown happen, and call the anxieties what they are&#8202;&#8212;&#8202;fears, without any truth to them.</p><p name=\"b148\" id=\"b148\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">There&#8217;s nothing like a long walk on a sunny day with a good audiobook and nowhere to be to learn a city. </strong>My favourite way to check out a city when I first arrive is to stick my headphones in on a nice day and just get lost while listening to the latest David Sedaris audiobook and snapping a few pictures. Likewise, going for a run with the intention of getting lost is a close second in my favourite ways to explore a city.</p><p name=\"2694\" id=\"2694\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Avoid the Currywurst.</strong></p><p name=\"bacd\" id=\"bacd\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Buy a pre-paid sim card.</strong></p><p name=\"e174\" id=\"e174\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I get so much more done when I work on the opposite time zone.</strong> I wake up and answer every single email, never feeling rushed, as I know that everyone will get them at the same time: when they wake up. I choose what I&#8217;m going to work on today, and.. just.. work on it, uninterrupted. No inbox filling up with replies from the emails I just sent, cluttering my brain as I constantly assign and reassign order of importance. I set my meetings for the evenings (the only time that works for CET &amp; PDT) which means that they never interrupt my best working hours (mornings) and instead save them for when I&#8217;m starting to get tired and work on things in smaller time slots. Then when I start work the next morning: hey I have last nights meeting fresh in my brain and nothing to interrupt me. The work is better and faster.</p><p name=\"e710\" id=\"e710\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I will wear the same thing every single day if given the opportunity.</strong></p><p name=\"347b\" id=\"347b\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">1&#8211;2 months is the right amount of time (for me) to visit a city. </strong>I can only start my emails with &#8220;sorry for the delay, I was traveling&#8221; every so often. To be good at my job I need to settle in somewhere, so I can dedicate big swaths of time and focus on a project. Extending each of the stops makes it a lot easier to work at the same time, but even if I wasn&#8217;t working I&#8217;d still prefer the longer stay.</p><p name=\"ab7a\" id=\"ab7a\" class=\"graf graf--p graf-after--p\">Showing up, checking off all 20 things on tripadvisors &#8220;top ten things to do&#8221; list, and leaving a week or so later is the fast food of travel: you&#8217;re full, but weirdly exhausted, and everything kind of looks the same. To get a feel for a city, I need to make a routine for myself. Sometimes it takes a while to figure out if. Like, does this whole country just have bad produce or am I really bad at choosing grocery stores? And how many bad cups of coffee can one person endure before they find a good one? And for gods sake who has good internet just tell me up front. But eventually the coffee guy starts to know your order, and you know exactly where to run out to for some cheap lunch, and the bartender downstairs thinks you&#8217;re charming for all your terrible attempts at ordering in a language you will clearly never speak. That&#8217;s when I fall in love with a city. I still like to check off all the things you&#8217;re supposed to see, but I don&#8217;t sweat it if I miss a few. I&#8217;m way more concerned with who makes the best croissant.</p><p name=\"91c4\" id=\"91c4\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Banana bread is a constant, and can fix anything.</strong></p><p name=\"900c\" id=\"900c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">It&#8217;s basically a cleanse with intermittent accidental binge drinking. </strong>Man, am I good at taking care of myself with no friends around. I run every day (okay, not every day, but, like, enough)(okay not enough, but, like, sometimes). I remember to eat all three meals, all of which contain a vegetable. I remember to take my contacts out. I actually finish all the things I was supposed to do, so I just.. go to bed when I&#8217;m tired. If I don&#8217;t have any other reasons to do this, I can always just call it a health kick.</p><p name=\"4003\" id=\"4003\" class=\"graf graf--p graf-after--p\">Eventually, the cabin fever starts to set in. You should get out on the town! Enjoy the nightlife! You&#8217;re here to have fun, not just work! Of course this just means going to sit at a bar by myself in hopes of striking up a conversation. Unfortunately, there is a strict regulation in my social anxieties contract that requires a minimum of two drinks before striking up any conversation with a stranger&#8202;&#8212;&#8202;recommended three. Okay, cool, I made some friends, they seem nice. They talk amongst themselves in other languages a lot, but I&#8217;ll just take a drink while they&#8217;re talking so it&#8217;s not weird. Oh, that was a lot of take-a-drinks, I guess I usually spend that time talking. I guess I usually talk <strong class=\"markup--strong markup--p-strong\">a lot</strong>. Oh, did I mention I&#8217;m on a health kick lately, so my tolerance is like zero?</p><p name=\"76be\" id=\"76be\" class=\"graf graf--p graf-after--p\">Anyway, pack some advil.</p><h4 name=\"3ba1\" id=\"3ba1\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Some things I am really glad I&#160;have</strong></h4><p name=\"5155\" id=\"5155\" class=\"graf graf--p graf-after--h4\">&#8212; <strong class=\"markup--strong markup--p-strong\">Sleeping pills</strong> for airplanes</p><p name=\"f086\" id=\"f086\" class=\"graf graf--p graf-after--p\">&#8212; <strong class=\"markup--strong markup--p-strong\">A weekender bag</strong> so every now and then I can skip lugging my big suitcase around for a week</p><p name=\"76bf\" id=\"76bf\" class=\"graf graf--p graf-after--p\">&#8212; <strong class=\"markup--strong markup--p-strong\">Audible &amp; podcasts</strong> I spend a lot of time doing things solo, listening to a book or podcast makes doing things solo one of my favourite activities</p><p name=\"823e\" id=\"823e\" class=\"graf graf--p graf-after--p\">&#8212; <strong class=\"markup--strong markup--p-strong\">Enough underwear to last a year</strong> I don&#8217;t really care if anything else is that clean</p><p name=\"0b4f\" id=\"0b4f\" class=\"graf graf--p graf-after--p\">&#8212; <strong class=\"markup--strong markup--p-strong\">Neocitron</strong> I get a nasty cold every time I step on an airplane</p><p name=\"99c7\" id=\"99c7\" class=\"graf graf--p graf-after--p\">&#8212; <strong class=\"markup--strong markup--p-strong\">Blanket scarf </strong>sometimes a scarf, sometimes a blanket, always cozy and warm</p><p name=\"809e\" id=\"809e\" class=\"graf graf--p graf-after--p\">&#8212; <strong class=\"markup--strong markup--p-strong\">Stove top espresso pot </strong>Some people just want to watch the world burn, and those people are airbnb hosts who do not leave a coffee machine. A french press or areopress would also do.</p><p name=\"050e\" id=\"050e\" class=\"graf graf--p graf-after--p graf--trailing\">&#8212; <strong class=\"markup--strong markup--p-strong\">All my favourite creams and goos and face junk </strong>This isn&#8217;t a dirt bag backpackers trip, this, like, my whole (indefinite) plan. It&#8217;s worth the extra weight/space/snarky-remarks to be able to come home and wash off a bad day with all my favourite things.</p></div>","title":"In no particular order: Some things I have learned so far in my 9ish months as a nomad"}},"pageContext":{"id":"5b937b0e87be056953db7d11"}}