{"data":{"mongodbDatabaseArticles":{"id":"5b962a1d87be0583274911cf","content":"<div><p>As you know, I <a href=\"https://hippie-inheels.com/leaving-india/\">left India for the last time as an expat </a>last week and from here on out will be going back to India as a tourist. Ben and I took our pets and preparing to leave India with pets (think quarantine, paperwork, and government export offices) is about as stressful as you can imagine. Here&#8217;s an <a href=\"https://hippie-inheels.com/how-to-take-pets-out-of-india/\">article on how to take pets out of India</a>. If there is ANY time to upgrade a flight from economy to business class, traveling with pets is the time, ha! Plus the route we took included a 15-hour flight from <strong>Mumbai directly to Toronto</strong>, another great reason to upgrade.</p><p>In a future post, I&#8217;ll be sharing about how to take pets out of India, but now I want to tell you about the plane journey.&#160;<strong>This route from Air Canada is new.</strong> It&#8217;s only been around for about 8 months and does not fly every day; just three times a week. You will want to book well ahead. I will always choose a long direct flight like this out of India rather than stopping in Europe because for me, it&#8217;s the layovers that stress me out and make my trip seem so much longer. The majority of flights from the USA and Canada involve stopovers in Europe, so this new flight is golden. We looked up multiple options and it was cheaper than all the competing airlines. Ben and I booked this about 1 month before our trip. I was upgraded complimentary by the airline at the gate! I am a member of the Aeroplan (miles program) and suggest you sign up as well. I&#8217;m only just now starting to get into points.</p><p>This is not the first time I&#8217;ve chosen to go through Canada to go to India. Last year, I flew from Ohio to Toronto on a separate ticket just to go to India from Toronto. In the USA, the only direct flight available is usually United, who I actually try to avoid on long-haul flights due to some serious flight mishaps with them in the past. If you are coming from the USA to India, it&#8217;s well worth flying a code-share airline to Toronto and catching their direct flights either to Mumbai like my journey or Delhi which is also direct.</p><h2>The B787 Dreamliner &amp; Business Class Heaven</h2><p><img class=\"alignnone size-full wp-image-27626\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Air-Canada-Mumbai-Toronto-1.jpg?resize=1024%2C734&amp;ssl=1\" alt=\"Air Canada Business Class Review: Mumbai to Toronto\" width=\"1024\" height=\"734\"></p><p>That moment when the airline flight attendant crosses out your seat and writes in &#8220;1A&#8221;&#8230; bliss. If you&#8217;ve ever boarded a plane in India then you know that lines are a mess &#8211; and Indians push in line to board as if we aren&#8217;t all going to be able to get on the plane. I&#8217;ve written about this dilemma before in my &#8220;This is India&#8221; series. Getting priority boarding for business class is enough of a perk to booking it, haha! You also get more luggage allowance.</p><p>I had just dropped Shanti, my dog, off with the staff and was feeling quite emotional (not just for the dog but leaving India after 5 years here). I immediately made my seat into a bed with the mattress cover, pillow, and duvet, and got settled in. I don&#8217;t waste any time getting comfortable!</p><p>The seats are a 1-2-1 configuration. I had a window seat, so didn&#8217;t have anyone sitting next to me. One thing I loved right away is that there was a little cubby you could put all your belongings in during take-off and landing.</p><p>When you get on board, they will come and offer you drinks, magazines, and newspapers. They also were kind to tell me that the pilot was a dog-lover and knew my dog was on board the plane. Below, you can see the amenities that are given to the business class passengers. The headphones were noise-canceling which was fantastic. They gave slippers, socks, earplugs, an eye mask, face and hand cream, and a toothbrush and toothpaste. It is a pretty standard kit compared to other business class airlines although I think the creams were a bit nicer than I have been given before.</p><p><img class=\"alignnone size-full wp-image-27628\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Air-Canada-Mumbai-Toronto-3.jpg?resize=1024%2C769&amp;ssl=1\" alt=\"Air Canada Business Class Review: Mumbai to Toronto\" width=\"1024\" height=\"769\"></p><p>The seats do fully recline back into a bed and the pillows and duvet are totally comfortable and full-size. They gave me an extra pillow when I asked. Business class was not full and it was very quiet up there but I still wore my earplugs when I slept.</p><p>Right after take-off, which was around 11 pm, dinner was served. I usually eat before a flight because I don&#8217;t like plane food but because I was traveling with Shanti I had not eaten. That ended up being okay because look at the dinner they served!</p><p><img class=\"alignnone size-full wp-image-27630\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Air-Canada-Mumbai-Toronto-5.jpg?resize=1024%2C769&amp;ssl=1\" alt=\"Air Canada Business Class Review: Mumbai to Toronto\" width=\"1024\" height=\"769\"></p><p>I ate dinner while watching First Wives Club. They had all the new releases, in fact, I was really impressed with how new of movies they had as options but I had seen them all. Luckily, they had a ton of older classics. The spinach and cheese-filled chicken breast, roll, cheese plate, and salad were all tasty. They also offer&#160;cheesecake or ice cream for dessert. You get Baskin Robbins in India but it&#8217;s usually a little melty and re-frozen making it not very tasty&#8230; unfortunately, this ice cream was like that and I didn&#8217;t enjoy it much. They have other snacks throughout the flight you can get as you like, so I also had a bag of Vicky&#8217;s chips and a Lindt dark chocolate bar.</p><p>While dinner was really tasty, for breakfast I chose the french toast and didn&#8217;t love it. The omelette looked a lot better so I recommend going for that instead. They give you some pastries anyway on the side, so you&#8217;ll get some good bread with the omelette meal.</p><p>This was an overnight flight so for the most part, it was quite dark and &#8220;bed time&#8221;. I woke up about an hour outside Toronto and read peacefully until we landed, feeling totally refreshed.</p><h2>Maple Leaf Lounge Access</h2><p>With a business class ticket, you get access to the Maple Leaf Lounge. When you de-plane, and are going from one international flight to another (just passing through Canada) you go to the &#8220;international to international&#8221; security line which is right there near the gate. There was no one in line and I scammed my USA passport to go onward to security. The lounge is right there on the other side of security.</p><p>If you are not from the USA, you might need to do an ETA, which is a quick form you fill out online and they will email you a confirmation. You will need to this to board the plane. Ben is from the UK and forgot to do this so did it at checkin and go the confirmation within 5 minutes. This isn&#8217;t recommended though as sometimes they want additional paperwork and the airline cannot let you board without the right immigration papers (no airline will).</p><p>I used the lounge to freshen up then hit up the breakfast bar. Thank you Canada for sausages and bacon! During a long trip, the below is basically heaven.</p><p><img class=\"alignnone size-full wp-image-27637\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Air-Canada-Mumbai-Toronto-16.jpg?resize=1024%2C768&amp;ssl=1\" alt=\"Air Canada Business Class Review: Mumbai to Toronto\" width=\"1024\" height=\"768\"></p><p>The lounge is just upstairs from all the onward international flights with Air Canada so you can stay there right up to the minute of boarding. There is not a lot of space for seating down at the gate, so I recommend staying in the lounge as long as you can. It has tons of seating, was not very full at all, had great food, booze if you want it, good WiFI, and loads of magazines and newspapers to read.</p><h2>My Onward Flight: Toronto to Cancun</h2><p>I was also bumped up for my ongoing flight to Cancun and the breakfast on that flight was SMASHING. I have never had red pepper relish before, but now I want it on everything I eat for the rest of my life, lol. The fruit was so fresh and it was just a really tasty meal. They gave out headphones and iPads with the same movies and TV shows as the long-haul flight from Mumbai. I watched Black Panther and Tribes of Palos Verdes. The flight was on-time and a breeze.</p><p>When I got to Cancun, all my luggage was there having been checked all the way through from India. Actually, you used to have to pick luggage up and re-check it in Toronto and you do have to in the USA with most airlines so it&#8217;s a huge benefit that they now to the international to international line, letting your luggage go all the way through.</p><p>Overall, I highly recommend this flight and if you have the budget to upgrade it&#8217;s well worth it. The older I get, the more I put into the quality of things rather than just booking the cheapest ticket I see. These are long flights to India and being in economy showing up jetlagged will start your trip off a bit tired &#8211; so especially if you are visiting India for just a couple of weeks, look into the business class prices, compare dates to see which dates have the lowest price and make your trip a breeze by going business class!</p><p>Even if you are not going to fly business class, consider flying out of Toronto with Air Canada to India direct rather than the US airlines that stop in Europe. Doing one flight without a layover makes things so much less stressful and it&#8217;s usually much cheaper than the other options out of the US.</p><p>Disclaimer: I paid for my Air Canada flight, my excess baggage, and my pet&#8217;s ticket. In exchange for a complimentary upgrade (if there were open seats), I offered to write this honest review.&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Air Canada Business Class Review: Mumbai to Toronto"}},"pageContext":{"id":"5b962a1d87be0583274911cf"}}