{"data":{"mongodbDatabaseArticles":{"id":"5b95eb1d87be05832748fffb","content":"<div><p>Made with love by travelers for travelers! The purpose of my guides is to let you live large on a budget. I focus on activities that give you insight into the land, people, and culture.</p><strong>Updated:</strong> July 2018<br><strong>Return policy:</strong> No risk, 30 Day, 100% Money Back Guarantee<br><strong>Details:</strong> 110 pages of expert budget travel advice with maps<p>July 2018No risk, 30 Day, 100% Money Back Guarantee110 pages of expert budget travel advice with maps</p><p>Wondering how you&#8217;re going to get around Bangkok or make the most of your visit? Are you worried about getting stuck in tourist areas? Getting scammed? Or eating at the wrong street stall and getting sick?</p><p>Crowded and chaotic, Bangkok is often mischaracterized as a place with only temples, massage parlors, barely any tourist attractions, chaos, traffic, pollution, and parties. Most visitors never get past that image because they get caught up in the tourist / backpacker trail, and, in doing so, mostly use Thailand&#8217;s bustling capital as a hub for travel around Southeast Asia.</p><p>But, when you do this, you miss out on all Bangkok has to offer.</p><p>You miss out on the best &#8212; and cheapest parts &#8212; of Bangkok.</p><p>There&#8217;s a reason why people who stay longer love it so much. In Bangkok, giant shopping malls and modern high-rises share streets with 200-year-old village houses, vendors, and food stalls. The place is like an onion: you have to peel back layers to really get to know and understand it. Bangkok is a city that opens itself up when you ditch the typical tourist path.</p><h3 class=\"clear\"></h3><p><img class=\"alignright\" src=\"//www.nomadicmatt.com/wp-content/themes/nomadicmatt/images/matt_@2x.png\" alt=\"\" width=\"189\" height=\"189\">I used to hate Bangkok until, on my third visit, wanting to learn Thai, I decided to stay for a month. I didn&#8217;t leave until nine months later. The following year I moved back again, and there hasn&#8217;t been a year since I haven&#8217;t visited this city.</p><p>It has become one of my favorite places in the world.</p><p>I have watched Bangkok change, grow, and expand. I know it like the back of my hand and used my personal experience to write this direct and straightforward guide so you can visit this exotic city like a local, avoid tourist traps, and save money.</p><p>This guide is meant for travelers looking to see the most of Bangkok. I share all my best tips, tricks, and secret spots so you don&#8217;t have to make rookie mistakes like falling for the tuk-tuk temple scam or being overcharged for a riverboat cruise. You&#8217;ll see the local side of the city as I take you off the tourist trail and show you Bangkok&#8217;s inner world.</p></div>","title":"Bangkok Travel Guide: Expert Travel Advice from Nomadic Matt"}},"pageContext":{"id":"5b95eb1d87be05832748fffb"}}