{"data":{"mongodbDatabaseArticles":{"id":"5b9382ce87be056953db7df7","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*ZDEeUY4OwYDbUSLxWA8aQQ.jpeg\">Design Sprinting @ Google&#160;HQ<p name=\"7483\" id=\"7483\" class=\"graf graf--p graf-after--figure\">Even though the team was spread across 3 cities, we were still in the same time zone and were able to have plenty of face-to-face time, both digitally &amp; physically. These are some common and healthy rhythms I fell into that enabled me to efficiently collaborate as a remote designer, while also being able to pitch designs, make the hard decisions with leadership, and also have quality heads-down time to focus and design with out interruption.</p><h3 name=\"5376\" id=\"5376\" class=\"graf graf--h3 graf-after--p\">Regular collaboration is not only critical, its&#160;human</h3><p name=\"79ba\" id=\"79ba\" class=\"graf graf--p graf-after--h3\">Living minutes from John Wayne Airport (SNA) and affordable 70min Southwest flights made these 1 day on-site trips fairly easy. These trips normally started on a Tuesday around 6:00am with me returning around 8:00pm. I would take the first flight out of SNA, land in SJC, take a 20min Uber into Mt View, and be in the office by 9:00am. The joke in the office was that I could get to Google Headquarters faster then driving to Los Angles or faster then my co-workers shuttling down from Oakland.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*M2Z0p6LQHD2V7hHUjwAVqw.jpeg\"><p name=\"fccc\" id=\"fccc\" class=\"graf graf--p graf-after--figure\">The main goal of these shotgun trips was to get face-to-face time with with the full Android Auto UX team. My manager and I would schedule these days around the most essential collaborative meetings &amp; jam sessions that week. There is something special and innately human about collaborating around a white board. These times in the office with my peers really helped when I felt isolated and creatively &#8220;alone&#8221;. The weekly travel and 12 hr days were by far worth it for the amount of focused meetings and collaboration I got out of one day.</p><h3 name=\"54d2\" id=\"54d2\" class=\"graf graf--h3 graf-after--p\">Be efficient, available, &amp; over communicate</h3><p name=\"218f\" id=\"218f\" class=\"graf graf--p graf-after--h3\">Having one day committed to travel, team collaboration, and in-person meetings allowed me to have efficient and (mostly) uninterrupted time designing in the Google Irvine Office. I still had the normal morning stand-ups and prioritization Hangout calls, but all of the other hallway distractions and taps-on-the-shoulders were nowhere to be seen. A specific point I want to make is that even though I was being distracted less, doesn&#8217;t mean that I wasn&#8217;t available. There are a couple notable attributes that allowed to be remote, available, and accessible.</p></div>","title":"How Working Remote Worked for Me – AIGA Orange County – Medium"}},"pageContext":{"id":"5b9382ce87be056953db7df7"}}