{"data":{"mongodbDatabaseArticles":{"id":"5b92489087be056953db7bb8","content":"<div><p>I've been hearing about float tanks, sensory deprivation tanks or isolation tanks for years. They're like enclosed bath tubs, square or round, filled with salt water (or <a href=\"//en.wikipedia.org/wiki/Magnesium_sulfate\">magnesium sulphate</a> to be exact) that is warmed to your body temperature that you lie in. But it's like the Dead Sea, there's so much salt (I think 500 kg or 1000 lbs of salt per tank) that you float. And once you close the tank and switch off the light, it's pitch black. And it's supposedly very introspective for your mind. I wanted to try it.</p> <p>The point is that since you float, you don't feel anything you lie on (except for the water if it moves). Since it's pitch-black, you don't get any visual inputs. And since it's sound-proofed, you don't hear anything either. For most of us, that means it's the first time in our lives we have zero sensory inputs (except sleep, I guess). And that supposedly gives you nothing else than your consciousness to deal with. Intense...</p> <p>With my friend <a href=\"http://twitter.com/flowen_nl\">Lowen</a>, we randomly passed by the a float center in the Netherlands. The day after we decided to try it.</p> <p>I was actually pretty nervous to try it, since I heard it can be very intense: </p> <p></p> <p>I heard Joe Rogan talk about how his float tank is the strongest psychedelic drug he's ever experienced. Okay...</p> <h2>Walking in</h2> <p>It was funny walking in, as this whole float center had more of a meditation, massage, zen-vibe than \"this is going to be more intense than psychedelic drugs, bro\". Maybe it has to do with your own projection and expectation of what the tank will give you.</p> <img src=\"/wp-content/uploads/2016/02/photo54.jpg\" alt=\"photo54\" width=\"810\" height=\"543\" class=\"alignnone size-full wp-image-5606 responsively-lazy\"> <p>We were welcomed by a really nice lady who ran the place. She showed us around. There's lots of different rooms, and you book one of them.</p> <img src=\"/wp-content/uploads/2016/02/photo55.jpg\" alt=\"photo55\" width=\"810\" height=\"543\" class=\"alignnone size-full wp-image-5609 responsively-lazy\"> <p>The rooms contain a shower and a gated hole in the wall:</p> <img src=\"/wp-content/uploads/2016/02/photo47.jpg\" alt=\"photo47\" width=\"810\" height=\"543\" class=\"alignnone size-full wp-image-5607 responsively-lazy\"> <p>When you open it, you see, that's the float tank.</p> <h2>Let's start</h2> <p>I showered, and then stepped in to the tank fully naked. The first thing you feel is the salt burning on your skin. Especially parts where you have some small wounds or scratches. Somehow in my sleep sometimes I scratch my back really hard and I felt the salt burning there. Slowly that feeling subsides.</p> <p>When you first step in, there's a light on and this is what you see:</p> <img src=\"/wp-content/uploads/2016/02/photo48.jpg\" alt=\"photo48\" width=\"810\" height=\"543\" class=\"alignnone size-full wp-image-5608 responsively-lazy\"> <p>There's two buttons, one red one for emergencies, and next to it the light button. I thought they were placed pretty stupidly as you could easily hit the wrong button trying to turn the light back on when it's pitch black.</p> <p>In the beginning there's typical meditation yoga-ey zen music playing. When the music fades out it means the session starts for an hour, and it becomes silent. I lied down and kept the light on for a while. </p> <img src=\"/wp-content/uploads/2016/02/3mg-bg-6-d1-705x490.jpg\" alt=\"3mg-bg-6-d1-705x490\" width=\"705\" height=\"490\" class=\"alignnone size-full wp-image-5622 responsively-lazy\"> <h2>Scary</h2> <p>Looking at the ceiling was a bit scary, as it had the very familiar profile just like a funeral casket had. So suddenly, I felt like I was in a casket, haha. Was I dead? Was this all an illusion and I had already died? Who knows. Okay, try to relax...This doesn't help!</p> <img src=\"/wp-content/uploads/2016/02/7e034847ea455f248d1c0dfc564b5e14.jpg\" alt=\"7e034847ea455f248d1c0dfc564b5e14\" width=\"564\" height=\"374\" class=\"alignnone size-full wp-image-5613 responsively-lazy\"> <p>I wanted to try it first with the lights on, to not get too claustrophobic and scared.</p> <p>To be honest, the whole thing was intimidating. A claustrophobic dark box with water you lie in? You're scared to drown but you won't because you float. But still. And then you think \"what if the door doesn't open anymore\". I really had to let go of that thought to even be okay with this situation.</p> <h2>Lying down</h2> <p>I lied down and floated. My ears went under the water making me hear almost nothing except for the soft music playing in the background. My arms floated with my palms down on the water surface. It's kind of a weird unnatural position the first time you do it. You need to force your head down lower than you think it can go because otherwise you're actually still using your neck muscles to keep your head afloat. You need to let the water hold your head instead.</p> <img src=\"/wp-content/uploads/2016/02/Why-You-Need-To-Try-An-Isolation-Tank-Today-By-GreenBlender.jpg\" alt=\"Why-You-Need-To-Try-An-Isolation-Tank-Today-By-GreenBlender\" width=\"985\" height=\"739\" class=\"alignnone size-full wp-image-5633 responsively-lazy\"> <p>The feeling of the salt water on your skin is also really interesting. It feels like a very thick gooey layer on your skin.</p> <p>I closed my eyes and tried to relax. After a few minutes, I felt good enough to switch off the light inside the tank. So I did. Now I was floating and it was pitch black. </p> <img src=\"/wp-content/uploads/2016/02/2photo47-copy.jpg\" alt=\"2photo47 copy\" width=\"810\" height=\"543\" class=\"alignnone size-full wp-image-5666 responsively-lazy\"> <p>Except for a line of light around the door/gate of the float tank from the shower room. I kinda liked that as it kept me from getting too disoriented and scared in the pitch black tank. (Yes I drew that myself)</p> <h2>Salt can hurt</h2> <p>Then my eye itched, so I scratched it. But my hand had been in the salt water obviously. That was a bad idea. My eye and face started burning like crazy and I had to get the towel from outside the tank to dry it. You don't want this stuff on your face.</p> <p>After a few more minutes, I became brave enough to get out of the tank to the shower room to switch off the light there too. I went back in and now it was pitch black.</p> <img src=\"/wp-content/uploads/2016/02/Flag_of_Afghanistan_1880%E2%80%931901.svg_.png\" alt=\"Flag_of_Afghanistan_(1880&#8211;1901).svg\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-5625 responsively-lazy\"> <h2>Only now, it really started</h2> <p>Complete sensory deprivation, as in SHUT ALL THE LIGHTS, was definitely necessary. Because now stuff started to happen.</p> <p>I floated. And floated more. And I kept feeling I was drifting to the left. I was sure I had rotated 90 degrees to the left and my feet were now at the door. But I knew the tank was actually not that wide to fit. When I felt what was on my right, there was still the door as before. So it was just my body having no idea where it moved. That's the sensory deprivation.</p> <img src=\"/wp-content/uploads/2016/02/Flag_of_Afghanistan_1880%E2%80%931901.svg_.png\" alt=\"Flag_of_Afghanistan_(1880&#8211;1901).svg\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-5625 responsively-lazy\"> <p>I even felt like I rotated vertically like I was falling into the water. I obviously did not, but it felt crazy.</p> <h2>HAVE TO RELAX -&gt; CANNOT RELAX -&gt; PANIC</h2> <p>The challenge I kept having was that I felt I was supposed to relax. That's what the tank was for. But focusing on relaxing actually did the opposite, it made me a bit stressed. I did deep meditation-style breathing but that didn't work either.</p> <h2>I'm tense af</h2> <p>I became aware that my body was extremely tense. I think most people over the age of 25 that graduated probably have that. Real life makes you tense as fuck. I mean, you want to succeed in your job, or your own business, and maybe you don't like your job or business, or maybe it doesn't pay well, and maybe you have bills to pay, and a boyfriend/girlfriend that dumped you, and you stress about settling down, getting children even, but you're not sure you want that. Etcetera. The real life issues make you tense as fuck. You're not alone, we all have them.</p> <p>I literally felt where my body was tense. It was mostly my neck, shoulder, arms, upper chest area.</p> <img src=\"/wp-content/uploads/2016/02/Flag_of_Afghanistan_1880%E2%80%931901.svg_.png\" alt=\"Flag_of_Afghanistan_(1880&#8211;1901).svg\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-5625 responsively-lazy\"> <p>(Yes, I know, every picture now is black. That's not a bug, that's the point, haha. That's how it looked. BLACK.)</p> <h2>When was the last time I was really relaxed?</h2> <p>I thought about what was the last time I felt like not tense. A few years ago, I'd be nervous about my YouTube business shutting down and not making any money anymore, having to get a job. Before that, I'd feel nervous about going to high school. But before that, I couldn't remember nerves. So I think I was relaxed in elementary school for the last time. Wow. I never thought about that before.</p> <p>I kinda concluded how fucked it is to always be so tense. Like I really need to solve that somehow. Only when I'm doing shit, like making stuff, I don't feel tense. But that can't be healthy man.</p> <p>So now, I had to REALLY just let go to be able to relax. And that took more time.</p> <img src=\"/wp-content/uploads/2016/02/Flag_of_Afghanistan_1880%E2%80%931901.svg_.png\" alt=\"Flag_of_Afghanistan_(1880&#8211;1901).svg\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-5625 responsively-lazy\"> <h2>The thoughts</h2> <p>I constantly had thoughts racing. It's like being in bed before sleeping, there's a lot of worrying etc. And you have your repeating thoughts and issues you go over. The thing is, in bed that's annoying because you want to sleep. In the float tank, it felt more manageable. I was able to go over my current \"life issues\" and repeating obsessive thoughts (that we all have) and somehow deal with them. I can't say I came up with new solutions for my issues, but I felt it became a bit clearer, kinda like going to the gym. Nothing changed, but your perception of your issues has changed (due to dopamine).</p> <h2>My body became an obstruction</h2> <p>I then felt my mind separating from my body. I became very aware of my body, this physical enclosure that wrapped around my consciousness. Even without feeling, hearing or seeing anything, I felt my consciousness very clearly placed in the center of my head. It wasn't very spiritual, it was more of just \"okay I'm not feeling my body anymore and I'm still here\". It's a very cool and strange feeling. In a way my body felt like an obstruction. A cage or prison for my mind. I didn't need it anymore in this moment.</p> <img src=\"/wp-content/uploads/2016/02/Flag_of_Afghanistan_1880%E2%80%931901.svg_.png\" alt=\"Flag_of_Afghanistan_(1880&#8211;1901).svg\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-5625 responsively-lazy\"> <p>I guess experiencing this, made me relax because I wasn't going over my thoughts anymore. Suddenly I was hit with intense relaxation. It went like CLICK. And BAM I let out a relaxing sound of WAAAAaaaaAaaaaaaaohaooohhhhh...o.o...h. I cracked my toes and fingers (like they do in a massage) just by moving them.</p> <p>For a few minutes I felt intense relaxation. The thoughts stopped for awhile. And it just felt really fuzzy and cosy around me.</p> <p>The weird thing is that my body wasn't able to keep my eyes closed because it didn't see the difference between having my eyes closed or open. So it kinda kept switching or stayed half open. I sometimes was scared to maybe see hallucinations, so I'd close them. But there wasn't a real difference. I did see a face. But that was probably my mind trying to see faces in the random noise of my eyes.</p> <p>I also did fun exercises like imagining I was floating in outer space. Which felt really fun.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2016/02/space-2.jpg\"> <h2>Processing my thoughts</h2> <p>Then I went back to my thoughts to try and process them again. I was able to think very clearly. Very rational. Not emotional. I thought about my relationships, breakups, how I felt lost when traveling so much and how that feeling got better now that I'm back in my own city again. I thought about my existential crisis that happened now that I have a business that makes enough money for me and just that success gives me a void of not knowing what to do with my life next. I processed everything. Like a list.</p> <img src=\"/wp-content/uploads/2016/02/Flag_of_Afghanistan_1880%E2%80%931901.svg_.png\" alt=\"Flag_of_Afghanistan_(1880&#8211;1901).svg\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-5625 responsively-lazy\"> <p>Processing this didn't make me very relaxed. But I did think this was one of the cool things to do in a tank.</p> <h2>This was taking too long</h2> <p>Then I had a weird moment. I was lying there. And I was kinda of out of the zone suddenly. And I felt \"what the hell, this is taking so long, I don't have time for this\". It was so weird. Like, I was kinda done. I wanted to get out and do something. I probably had only been in there for half an hour and now I was done. </p> <img src=\"/wp-content/uploads/2016/02/to-do-list.jpg\" alt=\"to-do-list\" width=\"950\" height=\"534\" class=\"alignnone size-full wp-image-5630 responsively-lazy\"> <p>I think this came from my general impatience. And my \"YOU NEED TO DO SHIT\"-brain took over and felt it was idiotic that I was in a float tank. But that was definitely my problem, not the tank, haha.</p> <p>It took awhile for me to get back into it.</p> <h2>SEX</h2> <p>Then for some reason I was aroused. I have no idea why but <a href=\"http://twitter.com/flowen_nl\">Lowen</a> later told me had the same thing. I guess because sexual arousal and relaxation might be combined. It just happened.</p> <p>Then I think I blanked out for awhile. And then I got scared and shocked when suddenly the music faded back in. And the light went on:</p> <img src=\"/wp-content/uploads/2016/02/photo48.jpg\" alt=\"photo48\" width=\"810\" height=\"543\" class=\"alignnone size-full wp-image-5608 responsively-lazy\"> <h2>The end</h2> <p>I got out, showered and put my clothes back on. Then we went outside and walked around Amsterdam at night.</p> <img src=\"/wp-content/uploads/2016/02/Amsterdam-1024x623.jpg\" alt=\"Amsterdam\" width=\"640\" height=\"389\" class=\"alignnone size-large wp-image-5672 responsively-lazy\"> <p>The cool thing was that when we went outside, and the few hours after that, you could really feel the effects of the tank. They were somehow more powerful OUTSIDE the tank than inside. You become more aware of your senses. And you actually feel more relaxed after than during the session.</p> <p>I'm going again in 2 weeks, and I'm really interested how the second time will be. I think a large part of the first session was simply getting used to how weird is it to be in a pitch-blank bath tub full of salt. I also wonder if this thing can help me to get rid of my worries, and tense body more.</p> <h2>Conclusion</h2> <p>I'd definitely recommend it just to try. It's a pretty weird and interesting experience. And I think the real benefits will come after a few sessions. It's very similar to what I feel during a massage, you relax and you also process your thoughts. This has the potential to be stronger though as it really isolates you from the world.</p> <p>If you wanna try it, <a href=\"http://floatationlocations.com/\">this site</a> has a list of float centers around the world.</p> <p><strong><a href=\"/float-tank-2/\">I floated for a second time</a> some weeks after</strong></p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"My first time floating in a sensory deprivation tank ☺️"}},"pageContext":{"id":"5b92489087be056953db7bb8"}}