{"data":{"mongodbDatabaseArticles":{"id":"5b92488887be056953db7bb0","content":"<div><p>In February of this year, I arrived in Seoul to live there for two months. We could house-sit my girlfriend's friend's house in Hongdae, think of it like Shoreditch or Williamsburg of Seoul. It's hip and has a big art university in the middle.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/811711065_7262629845893333377-copy.jpg\"> <p>This is Hongdae. Yes, looks like Japan, don't say that to a Korean, they will kill you.</p> <img src=\"/wp-content/uploads/2015/05/Hongdae-1.jpg\" alt=\"Hongdae-1\" width=\"640\" height=\"371\" class=\"alignnone size-full wp-image-4689 responsively-lazy\"> <p>But let's get down to the brass tacks here, John Hancock, the clock is ticking, Charlie.</p> <h2>Getting a 4G SIM</h2> <p>As any traveler, I arrived in the airport and tried to find a SIM card. Korea is very modern in many ways, but it's also very traditional and weird in others. It's a high tech country, but you can't buy a SIM card as a foreigner, you have to rent it and then when you leave give it back. So I did. I went to the Olleh KT desk at the airport:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"IMG_3570\"><img src=\"/wp-content/uploads/2015/05/IMG_3570.jpg\" alt=\"IMG_3570\"> <p>I told the KT Staff that I needed <strong>unlimited data</strong>. I know what unlimited means in most countries, it's 1 or 2 GB and then they slow you down. So I asked \"is it really unlimited?\" and she nodded. Cool. Let's try. It was ~$40 per month. They made a copy of my credit card, which gave me some anxiety but there was no other way. She said.</p> <h2>WiFi okay, 4G awesome</h2> <p>We moved in to the house, it was this cute old Korean house:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"811704666_557970949285663794 copy\"><img src=\"/wp-content/uploads/2015/05/811704666_557970949285663794-copy.jpg\" alt=\"811704666_557970949285663794 copy\"> <p>And I tried the WiFi. For Korean standards it was relatively slow. I think 20 mbps down and 5 mbps up. Then I speedtested my 4G on my phone. It was 100 mbps down and 50 mbps up. It ranged upwards to 70mbps up. What the fuck 1.0.</p> <p>50 mbps up is insane. Divide that number by 8 (mbps is bit, mb is byte) It means you can transfer 5 megabytes per second. That's 300 mb per minute, or half a CD. That's 432 GIGABYTE PER DAY! That's a normal person's hard drive, IN A DAY! WHAT THE FUCK 2.0.</p> <h2>Cue my backup situation</h2> <p>I have about 3 TB of backups:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/small_sg3tb2.jpg\"> <p>And I have like 6 copies of this 3TB drive spread around the world.</p> <p>My backup drive's data goes back to my first computer from 1994. I never lost anything. I almost lost a .BMP image (I drew a tribal scene with a totem pole and a snake) in 1994 when I was 8, because my brother overwritten it on THIS diskette. Yes 18 years ago.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/photo-1.jpg\"> <p>And then I was able to recover it in 2012 (or 16 years later):</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/indiaanbmp.jpg\"> <p>Don't say it's sexist, it was 1994 and I was 8.</p> <p>So yes. I never lost any data. I know you can criticize me now if you're a buddhist. \"Everything shall pass\" etc. But I don't care. I like to be 82 years old and then I'm going to watch MY ENTIRE LIFE and everything I made. Whatever you say. Then my kids will save my backups and in 500 years we will all enjoy Pieter's pictures. Okay they won't But they might. ANYWAY.</p> <p>So I said, I have about 3 TB of backups and a 1TB internal SSD.</p> <p>So since I'm always traveling I have to keep these around, and they're heavy, bulky and they will crash at some point. I wanted to put them in the cloud. And if anything, with this speed, now was the time.</p> <h2>Cue AWS</h2> <p>CrashPlan SUCKS because it caps the upload speed at 2mbps. And its servers suck, they are mostly in the US it seems. The whole service is a joke. So instead I went more raw, I set up an AWS Glacier instance (that means you go to <a href=\"http://aws.amazon.com/\">Amazon AWS</a> and ask them to set up a cloud drive for you, it's not hard, it sounds hard, it's not hard).</p> <p>P.S. This is NOT Amazon Cloud Drive (!), this is AWS Glacier. Very different. Although they use the same backend.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/2513d50e8521e119296160bb8342a989.png\"> <p>The nearest AWS region was Tokyo, so I set it up there. You can always cheaply transfer your whole backup to another region like US or Europe. Or even just have multiple copies for when the asteroids hit the Earth on one side, YOUR DATA WILL PERSEVERE!</p> <p>I then installed <a href=\"//www.arqbackup.com/\">Arq Backup</a> for OSX:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/choose_storage_class_70.png\"> <p>I can't give enough praise to Arq. And the internet is already <a href=\"//news.ycombinator.com/item?id=7336215\">full of praise for Arq</a>. It pretty much takes all the hard work out of uploading and downloading your backups to Amazon AWS. Oh and it encrypts your data on YOUR side, before sending it to the server.</p> <p>I then connected my HHDs, yes that's a rice cooker on the right. Yes I worked in a kitchen for 2 months. Yes that's fairly optimal:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/x811024545_8597238918417719441-copy-copy.jpg\"> <h2>Here we go</h2> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\">Backing up 3TB into Amazon AWS S3/Glacier at 4 megaBYTE per second via 4G LTE, oh &#127472;&#127479; Korea mobile internet I love you <a href=\"http://t.co/juoG6zKAKK\">pic.twitter.com/juoG6zKAKK</a></p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/563678153105629184\">February 6, 2015</a></p></blockquote> <p></p> <p>So then I tried it. I used my old iPhone as a tethered 4G modem for my MacBook and started transferring. I was expecting this was going to work for the first 2GB and then slow down. But it didn't.</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\">Okay, so far in 24h I've uploaded 100 GB to AWS over 4G LTE SK Telecom ,~1900 GB to go or about 3 weeks at this pace <a href=\"http://t.co/Zekuy99Bir\">pic.twitter.com/Zekuy99Bir</a></p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/564323894710919168\">February 8, 2015</a></p></blockquote> <p></p> <p>Then it was 100 GB, and it didn't slow down. Then the first 1TB transferred. It kept going.</p> <h2>So what now</h2> <p>So what do you do when you know this is going to take a month. And you're in Korea. Well of course, you go for Korean BBQ A LOT:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"811710445_9426532409253838405 copy\"><img src=\"/wp-content/uploads/2015/05/811710445_9426532409253838405-copy.jpg\" alt=\"811710445_9426532409253838405 copy\"> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"811717681_4518911319160444250 copy\"><img src=\"/wp-content/uploads/2015/05/811717681_4518911319160444250-copy.jpg\" alt=\"811717681_4518911319160444250 copy\"> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"811711601_6829933223452307962 copy\"><img src=\"/wp-content/uploads/2015/05/811711601_6829933223452307962-copy.jpg\" alt=\"811711601_6829933223452307962 copy\"> <p>It still took me about 20 days to upload the 4TB. But that was because I suck and I sometimes forgot to connect it and was a way for days too. That's still an average of 200 GB per day.</p> <p>So now my backup problem is solved. It's all in the cloud. If my HDD drives are destroyed, it doesn't matter. Hopefully. It's in the cloud. From AWS I can transfer it to other regions, like I said. But also to other providers, fairly easily.</p> <h2>Returning my SIM</h2> <p>When I left Korea, I had to return the SIM. The staff lady from KT looked at me stringently and said \"you have an overcharge\". Fuck I knew it. How was I going to explain I uploaded 4,000 GB on my phone. She said, \"please pay now\". And gave me the bill. Normally it's like $10 per GB. So I was going to have to pay $40,000. Oh my god:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/811706348_11940113344041057145-copy-copy.jpg\"> <p>That wasn't 40,000. That was 52,700. Wait. My face:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"811714186_18161774273219536922 copy copy\"><img src=\"/wp-content/uploads/2015/05/811714186_18161774273219536922-copy-copy.jpg\" alt=\"811714186_18161774273219536922 copy copy\"> <p>But we were in Korea, that wasn't USD, that wasn't EUR, that was KRW. That means, that was $48. And the overcharge was $8 because I made some voice calls. Not data.</p> <p>Wow.</p> <p>2 months, 4 TB for $48 per month. Thank you Korea, godspeed to you.</p> <h2>Conclusion</h2> <p>Wireless is the future, no it's the NOW, and Korea shows it. Europe is trying to put expensive fiber into the ground which is already overflowing with broken copper wiring that they're pushing slow ADSL over. And US is similar to that. What about just going wireless guys/girls? It's silly we're still trying to push so much traffic over old wires.</p> <p>I have no idea how the Koreans do it, but they do it.</p> <p>So if you have my backup problem. And you want to finally put it in the cloud, and you're in Asia, and you want to eat BBQ while at it. Just fly to Korea, go housesitting, get a SIM and transfer your HDD to Amazon AWS.</p> <p>This fun new reality where people fly places for fast internet...<a href=\"//nomadlist.com/\">that reminds me of something</a>.</p> <p><strong>Everything. Went. Better. Than. Expected.</strong></p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"I uploaded 4 terabyte over Korea’s 4G, and paid $48"}},"pageContext":{"id":"5b92488887be056953db7bb0"}}