{"data":{"mongodbDatabaseArticles":{"id":"5b92396b87be0583cfde67fd","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">Back to the Gold Standard: Will there be a Gold Backed Currency?</h1>\n \n</p><img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/gold-backed-currency-yuan.jpg\" alt=\"New Gold Backed Currency in Chinese Yuan\" width=\"700\" height=\"467\" class=\"size-full wp-image-26360\"><p>Dateline: Dubai, United Arab Emirates</p>\n<p>Several years ago, nearby Abu Dhabi installed one of the world&#8217;s first <a href=\"https://www.telegraph.co.uk/news/worldnews/middleeast/unitedarabemirates/7720491/The-ATM-that-dispenses-gold-bars.html\" rel=\"noopener\" target=\"_blank\">gold ATMs</a>, allowing customers to withdraw fiat currency in term of everything from one-gram gold nuggets to larger gold bars.</p>\n<p>The media has often been aflutter about the opulence of being able to buy gold with a debit card, presenting it as the domain of wealthy sheiks with nothing better to do than purchase a few gold bars on a Tuesday afternoon. What often goes without mention is that, for 99% of human history, money has been backed by gold.</p>\n<p>Now, I&#8217;m not the world&#8217;s biggest gold bug by any means, but it goes without saying that so-called &#8220;fiat currency&#8221; &#8211; money that has value purely because we think it does &#8211; is problematic.</p>\n<p>Today, while the gold ATM concept has achieved some level of success in the UAE, one fact remains: the <a href=\"https://en.wikipedia.org/wiki/United_Arab_Emirates_dirham\" rel=\"noopener\" target=\"_blank\">Emirati dirham</a> &#8211; the fiat currency of the country &#8211; is not backed by any gold itself.</p>\n<p>In fact, no currency in the world today is on the &#8220;gold standard&#8221;. Switzerland abandoned the practice just two decades ago.</p>\n<h2>What is The Gold Standard?</h2>\n<p>The gold standard is a monetary policy in which a currency is based on a quantity of gold. Basically, money is backed by the hard asset that is gold in order to preserve its value. The government issuing the currency ties its value to the amount of gold it possesses, hence the desire for gold reserves.</p>\n<p>Under a gold standard, anyone holding paper money can turn it in for a fixed amount of gold from the country&#8217;s gold reserve. That means those paper banknotes can be exchanged at will for actual metal; you could bring paper money to a bank and get actual gold in return. </p>\n<p>This concept started thousands of years ago in Asia Minor when various precious metals including gold and silver were accepted as a method of payment. Farmers exchanged weirdly-shaped fragments of gold and other metals as a primitive method of payment; if you&#8217;ve ever visited a museum, you&#8217;ve probably seen these examples of these early means of exchange.</p>\n<p>Later on, actual metal coins were issued and governments started using them in trade. Since gold was the most durable of all metals, it has had the most staying power. Lydia in modern-day Turkey is noted as being one of the first cultures <a href=\"https://www.thebalance.com/what-is-the-history-of-the-gold-standard-3306136\" rel=\"noopener\" target=\"_blank\">to document</a> their use of gold as currency.</p>\n<p>While various countries have adapted their currency&#8217;s backings over the centuries, the British Gold Standard was one of the most notable examples of backing currency with hard assets. Gold has spurred exploration in the 16th century, and helped standardize world trade when it boomed in the 19th century.</p>\n<p>Along the way, governments introduced paper money to make life more convenient. Carrying about metal became frustrating, and the easy solution was to issue little slips of paper. In practice, paper itself is worth nothing; a $1 coupon for McDonald&#8217;s is only worth $1 if McDonald&#8217;s is willing to honor it. And for that reason governments backed their paper money with gold, merely allowing the paper for convenience but with the full backing of a hard asset.</p>\n<p>Sadly, things change. In 1971, the United States closed the &#8220;Gold Redemption Window&#8221; and ended the practice of issuing sound money, instead deciding to join the ranks of most other nations that shifted to purely &#8220;fiat currency&#8221; with no value other than what is implied.</p>\n<p>If you&#8217;re reading this, you no doubt have a sneaking suspicion that keeping your money as a ledger line on internet banking, or even as cold hard cash in your home safe, isn&#8217;t the best thing for your money. Ever since going off the Gold Standard, the US dollar has declined in value each year. In fact, the dollar has lost about 90% of its value since going off the Gold Standard.</p>\n<h2>How is Money Valued Today?</h2>\n<p>Is currency backed by gold? The simple answer is &#8220;no&#8221;.</p>\n<p>Today, money is worth whatever people think it&#8217;s worth. And that can be dangerous. One of my friends from Venezuela recently told me that she could buy food for months with a single one-ounce silver coin.</p>\n<p>Of course, Venezuela&#8217;s devastating food shortages mean that she may not get the chance, but her story proves the potentially destructive power of fiat currency.</p>\n<p>Essentially, today&#8217;s non-gold standard is a monetary version of the Greater Fool Theory; will someone buy your dollars or euros or pounds for what you think they&#8217;re worth?</p>\n<p>While some foreign currencies &#8211; including the dirham &#8211; are pegged or essentially pegged to the US dollar, the US dollar is not pegged to anything. Countries around the world have tied the fate of their currency, and their population&#8217;s welfare, to a currency they don&#8217;t control merely on the basis that the United States will never fail.</p>\n<p>I&#8217;m not one of those guys telling you that the US dollar is tomorrow&#8217;s toilet paper, but on a long-term trend the idea of simply blindly following a central bank and its destructive policies seems dangerous. After all, people have historically flocked to gold when they don&#8217;t trust the local bank to keep their money safe.</p>\n<p>Recent examples in Cyprus and Argentina have demonstrated that not only are the actual currencies at risk for loss, but the banks themselves can be, too.</p>\n<p>When your money is in the financial system, it&#8217;s subject to the whims of central banks and politicians. President Roosevelt&#8217;s famous gold confiscation forced all banks to hand over their gold to the government&#8217;s Fort Knox, and the forced private citizens to hand over their metals at a steep discount in exchange for dollars.</p>\n<p>Basically, the government devalued the wealth of its own citizens by nearly half overnight. Not only was wealth devalued, but private ownership of most forms of gold was banned unless you held a license. The government had confiscated wealth and prohibited an exit for its citizens.</p>\n<p>For some reason, a total of zero central bankers think this is a bad thing. Bankers and politicians prefer to be able to manipulate the value of their fiat currencies at whim in order to achieve their political objectives. The idea is that a hard asset with intrinsic, long-held value can&#8217;t be manipulated the same way paper money can to achieve the whims of the moment.</p>\n<p>Some people are apparently trying to change that&#8230;</p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/gold-backed-currency-dollar.jpg\" alt=\"US Dollar Gold-Back Currency\" width=\"700\" height=\"467\" class=\"size-full wp-image-26361\"><h2>The Gold Backed Currency Announcement</h2>\n<p>For years, various world powers have discussed replacements to the US dollar as the world reserve currency. The BRICS nations have discussed their own currency <a href=\"https://www.epw.in/journal/2017/11/commentary/brics-and-new-financial-architecture.html\" rel=\"noopener\" target=\"_blank\">to compete with the US dollar</a>, while others have devised an end to the US-based SWIFT system of bank transfers.</p>\n<p>Last year, Russia and China took steps toward so-called &#8220;de-dollarization&#8221; with the opening of a renmibi clearing bank in Russia. Russia&#8217;s central bank also opened its first ever foreign branch in China in an effort to strengthen financial ties between the two superpowers.</p>\n<p>The underreported headline in all of this is that Russia and China were creating a framework to eventually clear transactions in gold, bypassing the dollar entirely. The countries aim to make more of their transactions in gold. That&#8217;s notable because both Russia and China have been accumulating gold reserves at a rapid pace compared to other countries, and the BRICS nations are <a href=\"https://russia-insider.com/en/who-needs-dollars-russia-and-china-are-now-dominating-global-gold-production/ri19083\" rel=\"noopener\" target=\"_blank\">gold producers</a>.</p>\n<p>Trading in Chinese renmibi is the first step for these superpowers to eventually trade in gold. Elsewhere, countries are <a href=\"https://www.silverdoctors.com/gold/gold-news/china-gold-standard-jim-willie/\" rel=\"noopener\" target=\"_blank\">challenging the petrodollar</a> and seeking to trade oil in hard assets.</p>\n<h3>Gold-Backed Cryptocurrency</h3>\n<p>My friends <a href=\"https://dailyreckoning.com/the-world-is-ganging-up-against-the-dollar/\" rel=\"noopener\" target=\"_blank\">Jim Rickards</a> has also suggested that with the invention of the blockchain and high-level encryption, a gold-backed cryptocurrency could eventually become a reality. Jim is not a fan of Bitcoin per se, but does believe in the Blockchain, saying he has been working with it long before cryptocurrencies entered their manic boom.</p>\n<p>Jim Rickards claims that since China and Russia are making geopolitical and financially savvy moves to bypass the US dollar, their new gold-based trading systems would be only a &#8220;small step&#8221; away from a decentralized ledger system for a gold-based currency.</p>\n<p>Under this system, Jim claims that the dollar &#8211; and Bitcoin &#8211; would be the big losers, saying gold is relevant as ever when you consider that many of the world&#8217;s developing countries are actually stockpiling gold.</p>\n<h2>How to Benefit from a New Gold Standard</h2>\n<p>While there is no gold standard for you to participate in anywhere in the world, you can diversify your wealth into new asset classes and internationally to achieve some of the benefits of an <a href=\"https://www.investopedia.com/ask/answers/09/gold-standard.asp\" rel=\"noopener\" target=\"_blank\">actual gold standard</a>. Here are a few ideas:</p>\n<h3>Own Physical Gold</h3>\n<p>I&#8217;m not talking about an exchange-traded fund; I&#8217;m talking about physical gold. I don&#8217;t trust the US markets much these days, and as a hedge I prefer to own actual bullion and coins.</p>\n<p>Personally, I&#8217;d recommend you own some coins to keep at home, and some bullion to keep stored away. Larger bullion, such as a gold kilobar, comes with a lower spread and can easily be stored and sold at whim. Meanwhile, coins give you immediate access to your money. Either way, you can trade into and out of dollars, euros, or almost any other currency at whim, and if you <a href=\"http://nomadcapitalist.com/2013/12/23/how-to-buy-gold-avoid-us-gold-coins/\">buy gold correctly</a>, you can enjoy rather tight spreads. I recommend <a href=\"http://nomadcapitalist.com/2013/12/08/top-5-best-gold-bullion-coins-internationalization/\">well-known bullion pieces</a> that are easy to sell.</p>\n<p>As to storage, I recommend offshore vaults. There have been a number of vaults popping up everywhere from <a href=\"http://nomadcapitalist.com/2015/05/29/how-to-store-gold-offshore-cayman-islands/\">the Cayman Islands</a> to Argentina, but I prefer Singapore and Austria as main storage destinations. Austria offers more privacy at a higher cost with less convenience, while Singapore is the world&#8217;s new wealth hub.</p>\n<p>It&#8217;s even possible to <a href=\"http://nomadcapitalist.com/2015/12/09/how-to-get-a-gold-bank-loan/\">borrow money</a> against your gold at low interest rates, freeing up liquidity and essentially giving you an option against the dollar.</p>\n<p>If you&#8217;re interested in offshore gold storage as a way to keep your assets safe from prying hands, check out these articles:</p>\n \n \n \n<h3>Open an Offshore Bank Account</h3>\n<p>If you&#8217;re going to keep your money in the bank, at least keep it in a bank returning some interest. I recently wrote about countries with <a href=\"http://nomadcapitalist.com/2018/08/12/highest-interest-rates-banks/\">ultra-high interest rates</a> on savings in their local currency. It&#8217;s possible to earn 9%, 10%, or even 16% on foreign currency deposits in sound banks; some of these banks are actually better than your local bank in the US, Canada, or Australia.</p>\n<p>While a 9.5% term deposit in, say, Georgian lari may not sound attractive, consider that not only does Georgia&#8217;s economy have more room to grow, but that the lari has maintained relatively low volatility against the dollar in recent years. In the mid-term, you can earn a high interest rate for several years and convert back to your base currency when exchange rates are most favorable.</p>\n<p>Neither currency is backed by gold, but you can at least grow your money. You&#8217;ll also enjoy freedom from capital controls that prevent movement of money or lock you into a specific currency. If your money is in an <a href=\"http://www.nomadcapitalist.com/offshore-banking/\">offshore bank</a>, you&#8217;ll have the ability to convert your laris &#8211; or whatever else you&#8217;re holding &#8211; back to any currency of your choice, rather than being forced to hold a currency that could decline at the hands of the government.</p>\n<p>If you don&#8217;t think it&#8217;s possible, just ask my friends in Russia, Serbia, Montenegro, or Venezuela.</p>\n<h3>Buy &#8220;Paper Gold&#8221;</h3>\n<p>Again, I&#8217;m not talking about an ETF, but rather a new concept of so-called paper money that has gold in it. A new &#8220;currency&#8221; <a href=\"https://www.peakprosperity.com/podcast/91771/new-way-hold-gold-2015-update\" rel=\"noopener\" target=\"_blank\">called the aurum</a> has been touted as a way to hold gold-backed money in your wallet alongside your paper US dollars or euros.</p>\n<p>Now, I&#8217;m not entirely convinced this is the way to go. Governments have come down on a ton of bricks like this stuff before, but it&#8217;s worth understanding how this &#8220;new way to hold gold&#8221; works. Generally, I stay away from anything that proposes any actual new currency outside of the sovereign system. If you want to buy gold, then buy gold.</p>\n<p>Which leads me to my last idea&#8230;</p>\n<h3>Diversify Yourself</h3>\n<p>The country you are a citizen of has no doubt debased your savings and eaten away at your nest egg with their destructive policies. Whether you were part of an actual gold confiscation or not, the government&#8217;s policies have made you poorer.</p>\n<p>To that, my question is: &#8220;Why remain their subject?&#8221;</p>\n<p><a href=\"http://www.nomadcapitalist.com/second-passport/\">Having a second passport</a> is an excellent way to personally diversify yourself so that no government has total power over you. While I&#8217;m not a &#8220;gloom and doom&#8221; guy I do realize that the world&#8217;s superpowers, particularly the United States, can do anything they want at anytime. The fact that you&#8217;ll be hurt by it is irrelevant.</p>\n<p>In an era where the western middle class is evaporating, savers and the wealthy will have a target on their back for anything from wealth taxes to <a href=\"http://nomadcapitalist.com/2018/05/17/how-to-avoid-estate-taxes/\">higher estate taxes</a> to actual asset confiscation. It&#8217;s already started happening in direct and indirect ways in countries like Ireland and even the United States through the tax code.</p>\n<p>Being a dual citizen or even holding multiple passports give you the freedom to travel to and live in another country whenever you wish. It makes opening bank and brokerage accounts in another country easier, while making it harder for &#8220;de-risking&#8221; foreign banks to close your account and send your money home. And it gives you a legal escape hatch to <a href=\"http://nomadcapitalist.com/2018/01/17/renounce-us-citizenship-ultimate-guide/\">renounce your citizenship</a> if things get bad enough that you need to pull the plug entirely.</p>\n<p class=\"et_social_bottom_trigger\"></p> </div>","title":"Back to the Gold Standard: Will there be a Gold Backed Currency?"}},"pageContext":{"id":"5b92396b87be0583cfde67fd"}}