{"data":{"mongodbDatabaseArticles":{"id":"5b95eaed87be05832748ffe3","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/swedenmove.jpg\" alt=\"A statue of a proud man in Stockholm, Sweden\">Posted: 02/21/2012 | February 21st, 2012</p><p>I poke. I push. I prod. I try to get people out of their cubicles and <a href=\"https://www.nomadicmatt.com/travel-blogs/there-is-no-tomorrow-in-travel/\">traveling the world</a>. That&#8217;s what I do. That&#8217;s my thing. I show others that traveling doesn&#8217;t have to be expensive, that anyone can do it, and that <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-overcome-your-fears/\">your fears are unfounded</a>. I try to be a living example of that. Judging by the emails I get from people, I think I&#8217;m successful at getting people onto airplanes and into the world.</p><p>But last month, <a href=\"https://www.nomadicmatt.com/travel-blogs/feeling-lost-my-fork-in-the-road/\">I faced a fork in the road</a> about what to do when my trip ends: do I move to New York City right away or do I move to Sweden for six months? Once you go down a path, there&#8217;s no turning back, and I was very torn on what to choose.</p><p>But I decided to choose <a href=\"https://www.nomadicmatt.com/travel-guides/sweden-travel-tips/\">Sweden</a>.</p><p>The guiding principle in my life is no regrets. I don&#8217;t want to be on my deathbed saying, &#8220;I wish I did&#8230;&#8221; and I think that if I didn&#8217;t move to Sweden, I&#8217;d always regret it. I&#8217;d always wonder what might have been. What would life have been like if just for a moment I finally got to live in Europe? What possibilities and opportunities did I pass up?</p><p>So in July, I&#8217;ll be getting on a plane to Stockholm, where I&#8217;ll stay until January &gt;when my book is released. I&#8217;d leave sooner, but I have some conferences and plans in the United States that I need to attend in the meantime.</p><p>As I lay awake one night, I realized that if I didn&#8217;t move to Sweden, not only would I regret it, but I&#8217;d also be a hypocrite. After all, instead of facing my fears and reservations, I&#8217;d be taking the easy road. New York is easy. I know it, I&#8217;ve lived there, I have friends there. I don&#8217;t need to worry about visas, languages, or anything else. New York would be the easy, comfortable choice.</p><p>Instead of <a href=\"https://www.nomadicmatt.com/travel-blogs/breaking-out-of-your-comfort-zone/\">breaking out of my comfort zone</a>, I&#8217;d be staying firmly in it. And if I did that, how could I ever again tell people to break out of their own comfort zones?</p><p><img title=\"Swedish flags and bonfire on Valborg Day, Stockholm\" src=\"https://media.nomadicmatt.com/movingtostockholm2.jpg\" alt=\"swedish flags on valborg day\"></p><p>All you have to judge me by are the blogs I write and the information I share. Based on what I present, you decide if I&#8217;m trustworthy enough to listen to. I trust <a href=\"http://www.stuckincustoms.com/\">Trey Radcliff</a> when it comes to photography because of his amazing photos, the fact that he only promotes the products he would actually use, and the people and news sources that vouch for him. I trust he knows what he is talking about.</p><p>And trust is the currency of the Internet.</p><p>I can&#8217;t tell people to conquer their fears, live their dreams, and travel the world if I won&#8217;t even do that for myself. With so many sketchy websites these days, trust is in short supply. All you have online is your credibility.</p><p>So late at night, I thought about all the emails I get from the people who have told me I&#8217;ve inspired them to take a trip. I thought about all the messages from the people whose fears I&#8217;ve helped vanquish. I thought of all the people who told me a blog post was exactly what they needed.</p><p><img src=\"https://media.nomadicmatt.com/movingtostockholm3.jpg\" alt=\"Beautiful buildings on the water in Stockholm, Sweden\"></p><p>And then I thought about how deep down I knew I wanted to move to Sweden. There was nothing I wanted more. I want to learn the language, eat the food, meet the people, and explore the countryside. New York can wait six months. I&#8217;ll miss it, but it will always be there. Yet if there was no doubt in my mind, how come there was doubt in my mind?</p><p>Because I was too scared to make the leap and commit. It was easier to stay in my comfort zone. It always is. But I realized that I&#8217;ve helped so many people take a deep breath, close their eyes, and just go for it that not doing it when it came for my own turn would make me a hypocrite.</p><p>And that realization removed my doubt and made me commit.</p><p>And so in July, I&#8217;ll move to Sweden. It may be great. It may be awful. I may come home early or I may stay forever. But at the very least I&#8217;ll have practiced what I preached. I can wake up every day knowing that I did what I tell others to do:&#160;I seized the day, conquered my fears, and leaped into the unknown.</p><p>Because if I didn&#8217;t do that, I&#8217;d be a hypocrite.</p><p>And I&#8217;d never be able to look at myself the same way again.</p></div>","title":"Why I'm Moving to Sweden, Trust, and Practicing What I Preach"}},"pageContext":{"id":"5b95eaed87be05832748ffe3"}}