{"data":{"mongodbDatabaseArticles":{"id":"5b9624ca87be058327490f0a","content":"<div><p><em><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/imagine-vagabond-story1.jpg\" alt=\"imagine vagabond story\" width=\"235\" height=\"375\">Traveler and author Grant Lingel was kind enough to send me a copy of his new book <a href=\"http://www.vagabondstory.com/\">Imagine: A Vagabond Story</a>. You can read more <a href=\"http://www.vagabondstory.com/about/\">about Grant Lingel</a> and <a href=\"http://www.vagabondstory.com/book-preview/\">preview the book</a> on his website. Be the first person to comment on this post and I&#8217;ll send you a copy to read as well.</em></p>\n<p>Grant Lingel was 7 credits shy of graduating college he decided to see what else was out in the world as many backpackers do. The book is an honest chronicle of New Yorker Lingel&#8217;s first trip as a vagabond down to Mexico and beyond. With little money to his name he just goes &#8211; setting the tone for the entire story. <a href=\"https://www.amazon.com/gp/product/193493853X?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=193493853X\">Imagine: A Vagabond Story</a> is a slice of time in Lingel&#8217;s life and a familiar story for many perpetual travelers.</p>\n<p>Initially it&#8217;s the drugs and sex that draw you into the story, but despite the occasional jolts along the way, the book falls into a flow and takes you along for the ride. Characters drift in and out of the picture. Corrupt Mexican police, a Texan with a taste for joints, and a beach full of Norwegian women. Events change without reason and plans are made on a whim. There isn&#8217;t a point or final destination, it simply is.</p>\n<p><a href=\"https://www.amazon.com/gp/product/193493853X?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=193493853X\">Imagine: A Vagabond Story</a> is honest, without being presumptuous or pompous. Lingel is new to this type of travel and his naivety is refreshing and you&#8217;ll feel like you&#8217;re constantly putting yourself in his shoes. It&#8217;s a vivid scene brought to life through the intricate descriptions and details of each hostel, trip, and person Lingel encounters. As the story progresses however it makes you want to step out and get a grasp on Lingel in the &#8216;outside&#8217; world. What his conversations with his parents were like the days after almost getting arrested or what his college friends back home are up to come to mind.</p>\n<p>Lingel provides an excellent insight into a wild world that isn&#8217;t so mystical. Imagine: A Vagabond Story is Lingel&#8217;s backpacking adventure, without a set plan or permanent characters, save two. Partying, sex, and drugs are all part of Lingel&#8217;s backpacking trip as are some odd jobs along the way and one person whose prescience is felt throughout. <a href=\"https://www.amazon.com/gp/product/193493853X?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=193493853X\">Imagine: A Vagabond Story</a> is a fun story with familiar elements for most travelers and some new adventures for others.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Adventures On The Road, Imagine: A Vagabond Story"}},"pageContext":{"id":"5b9624ca87be058327490f0a"}}