{"data":{"mongodbDatabaseArticles":{"id":"5b96246287be058327490e51","content":"<div><p><img src=\"https://foxnomad.com/wp-content/uploads/2008/10/aboutme_big.jpg\" alt=\"about me\" width=\"169\" height=\"125\">Founder and editor of Travel Blissful, Erica Johansson was kind enough to write a review of foXnoMad yesterday. I&#8217;d like to welcome all of you Travel Blissful readers who may be new to this site.</p>\n<p><strong>So, let me introduce myself.</strong></p>\n<p>My name is Anil Polat, a traveler and travel enthusiast. I&#8217;ve spent my entire life traveling, studying cultures, and picking up tricks along the way. I created foXnoMad to connect with other travelers, discover their world, and share what I&#8217;ve learned about mine. It didn&#8217;t always start out like that, if you&#8217;re interested you can read <a href=\"../2008/06/25/the-history-of-foxnomad/\">the history of foXnoMad</a>.</p>\n<p><strong>About foXnoMad the Blog</strong></p>\n<p>The aim of foXnoMad is to help you travel smarter. I try to write about the travel topics that people who are passionate about travel want to read about. I draw on my own personal experiences form the <a href=\"http://www.foxnomad.com/locations\">places I&#8217;ve been</a>, my background in anthropology, and most importantly other travelers &#8211; like yourself.</p>\n<p>Here are some of my best posts from a few popular categories.</p>\n \n<p><strong>Subscribe to foXnoMad For Free</strong></p>\n<p>If you&#8217;re interested in reading foXnoMad and getting in touch with me I&#8217;d like to invite you to subscribe to <a href=\"https://feeds.feedburner.com/Foxnomad\">my RSS feed</a> (<a href=\"http://www.foxnomad.com/2008/09/22/different-ways-to-read-foxnomad/\">what&#8217;s RSS?</a>), meet <a href=\"http://apps.new.facebook.com/blognetworks/blogpage.php?blogid=42111\">me on Facebook</a>, or sign up for email updates below.</p>\n<p>\n</p>Receive email updates:\n<p>     </p>\n<p>&#8211;<br>\n</p>\n<p>I&#8217;d like to thank Erica, who writes one of <a href=\"http://www.foxnomad.com/2008/08/13/the-travel-blogs-i-read-regularly/\">my favorite travel blogs</a>, <a href=\"http://www.travelblissful.com\">Travel Blissful</a>, for reviewing foXnoMad. I plan on working on some of her suggestions by the end of the month.</p>\n<ol>\n<li><strong>A Better Header Image </strong>&#8211; As I&#8217;m working on a custom header design, I&#8217;ll enhance the quality of the current header image for a more appealing look.</li>\n<li><strong>Categories </strong>&#8211; I&#8217;ve got too many categories, I&#8217;ll cut them back and post them on the sidebar so it&#8217;s easier for you to navigate between posts of similar topics such as <a href=\"http://www.foxnomad.com/category/travel/air/\">air travel</a> and <a href=\"http://www.foxnomad.com/category/travel/advice/\">basic travel advice</a>.</li>\n<li><strong>Translation </strong>&#8211; I&#8217;m going to tweak the translation engine for all of the languages, hopefully those of you who speak the ones I don&#8217;t can give me feedback.</li>\n</ol>\n<p>Welcome again to foXnoMad. One of the primary reasons I created this blog is to connect with other travelers and discover your world, so please feel free to leave a comment introducing yourself or <a href=\"http://www.foxnomad.com/contact\">drop me an email</a> to say hi. It&#8217;s always appreciated and I&#8217;ll reply to every single one.</p>\n<p>Happy travels, -Anil Polat</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"foXnoMad Reviewed By Travel Blissful Editor Erica Johansson"}},"pageContext":{"id":"5b96246287be058327490e51"}}