{"data":{"mongodbDatabaseArticles":{"id":"5b937aed87be056953db7cf1","content":"<div><p name=\"aab8\" id=\"aab8\" class=\"graf graf--p graf--leading\">I always get asked if <strong class=\"markup--strong markup--p-strong\">my digital nomad lifestyle is gonna last forever</strong>. If I am gonna keep travelling, where I'm going next, if this choice to live without a home, a while in each city of the world, is a long term decision. Or if I have a plan to come back to Brazil in the future just like nothing has changed and catch up with my old life.</p><p name=\"ec98\" id=\"ec98\" class=\"graf graf--p graf-after--p\">Sometimes me and my boyfriend also question how long this way of life is gonna satisfy us. There are a million things that are amazing when you can work online and have the opportunity to live anywhere in the world. And we love every minute of it. But we also miss our family, we think about our careers, our friends, problems, diseases, money and other things that are a part of the nomad life (and the life of everyone else too). Maybe, someday, this life won&#8217;t make us happy anymore.</p><blockquote name=\"4223\" id=\"4223\" class=\"graf graf--pullquote graf-after--p\">But there&#8217;s nothing in life that lasts forever.<br>About our future, then, who&#160;knows?</blockquote><p name=\"3e22\" id=\"3e22\" class=\"graf graf--p graf-after--pullquote\">Everytime I think about it, I end up with the same result: <strong class=\"markup--strong markup--p-strong\">life will tell</strong>. Today, I&#8217;m really happy with my digital nomad life. But I have no idea about tomorrow. I change my mind a lot, I have the possibility to transform myself everyday and I&#8217;m not tied with anything that keeps me from moving. From changing. To become someone else. And you also don&#8217;t.</p><p name=\"ca60\" id=\"ca60\" class=\"graf graf--p graf-after--p\">And there&#8217;s the question that can make everyone uncomfortable: <strong class=\"markup--strong markup--p-strong\">where&#8217;s the stability of a nomad?</strong> The answer is, as far as I know, where we least expect: on the change itself.</p><p name=\"4658\" id=\"4658\" class=\"graf graf--p graf-after--p\">The road we are travelling on today has not been paved with years of habits and behaviors. We left that pattern when we decided that our future should be open and that any stability in a company, career or life path based on work-house-kids is not going to define our future. Basically, because we don&#8217;t want it to. We wanna think and choose the next steps, not only follow the worn road of anyone else&#8217;s life.</p><p name=\"3b10\" id=\"3b10\" class=\"graf graf--p graf-after--p\">And the fact that we don't have a guideline saying how we need to behave, where we need to live, have kids, study, when we need to get married or buy a car, makes us free. <strong class=\"markup--strong markup--p-strong\">Makes our future to be open.</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*yHx141UwVcE1xskGxx-DLw.jpeg\"><p name=\"8dcc\" id=\"8dcc\" class=\"graf graf--p graf-after--figure\">Because my path has never been made before, following exactly the same circumstances that we live right now, <strong class=\"markup--strong markup--p-strong\">we live by hypothesis</strong>. Experimenting if they&#8217;re gonna work out or not. If they do and that makes us happy, perfect. We go to the next one. If it doesn&#8217;t work, we need to face the consequences and bring new hypothesis to the game.</p><p name=\"c5e6\" id=\"c5e6\" class=\"graf graf--p graf-after--p\">Living by hypothesis is not that easy. You need to keep planning your life and literally every next move you&#8217;re gonna make, not just follow the road with everyone else. You need to think about it the moment you wake up to the second you go to sleep.</p><p name=\"5a44\" id=\"5a44\" class=\"graf graf--p graf-after--p\">Just like everybody else, I don&#8217;t know what is going to make me happy in one, five or ten years.<strong class=\"markup--strong markup--p-strong\"> The only thing I know for sure is that living a while in each part of the world made me learn that I&#8217;m not set.</strong> I know that even if I decide to go back to Brazil and to my old life (if that was possible), I will not be tied there forever. Just like I never was. Not me and not you either. We just end up with that idea in mind because society makes us think this is the only option.</p><p name=\"97a9\" id=\"97a9\" class=\"graf graf--p graf-after--p\">If you can be a digital nomad forever? Of course.<br>But, over time, your life changes. Even if you are working 9 to 5 or on the move for years. Some lives changes faster than others. Some small periods of time can change everything.<br>And of course you can be a nomad as long as it pleases you. <strong class=\"markup--strong markup--p-strong\">You can be anything for the rest of your life if it still makes you happy</strong>.</p><p name=\"bfe1\" id=\"bfe1\" class=\"graf graf--p graf-after--p\">Being a nomad until now taught me <strong class=\"markup--strong markup--p-strong\">that choosing something doesn&#8217;t have to be definitive</strong>. One day I can wake up and say &#8220;Let&#8217;s stay here forever&#8221; and just stay. Because I know that is never too late, too much work or impossible to change. I know that the day that I&#8217;m not satisfied with any aspect of my life, I can simply change it. The questions, the fear, the insecurity and the planning needs to exist, but everything is part of the change process. We do not need to live in a situation, city or environment that do not make us happy.</p><h3 name=\"5eaf\" id=\"5eaf\" class=\"graf graf--h3 graf-after--p\">We can simply&#160;change.</h3><p name=\"2267\" id=\"2267\" class=\"graf graf--p graf-after--h3\">You don't have to follow the road that everyone follows.<br>Your life is movable. Your decisions don't need to be others tested hypothesis.<br>Create your own, try it, approve it, make it wrong and change it.</p><blockquote name=\"270d\" id=\"270d\" class=\"graf graf--pullquote graf-after--p graf--trailing\">We don't need to ride on the same road our whole life.<br><strong class=\"markup--strong markup--pullquote-strong\">If your idea of being happy changes over time, change with&#160;it.</strong></blockquote></div>","title":"Is it possible to be a nomad forever? – This Publication is Moved – Medium"}},"pageContext":{"id":"5b937aed87be056953db7cf1"}}