{"data":{"mongodbDatabaseArticles":{"id":"5b95ea0087be05832748ff74","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/nicaraguastonecarver.jpg\" alt=\"esteli, nicaragua's Stone Carving Hermit Alberto Guti&#233;rrez\"><br> Updated: 07/01/2018 | July 1st, 2018</p><p>Nicaragua is a place that attracts visitors with its surf, beaches, hiking, volcanoes, and delicious food. <a href=\"https://nomadicmatt.com/travel-blogs/activities-to-do-nicaragua/\" target=\"_blank\" rel=\"noopener\">You&#8217;ll never be short of something to do</a>. But if you&#8217;re looking for something different and personable, travel north to Esteli and search out Alberto Guti&#233;rrez, the town&#8217;s stone-carving hermit.</p><p>He&#8217;s not easy to get to but he&#8217;s worth the trek.</p><p>I got lucky. A friend of mine connected me with a local named Rodney McDonald, who runs a great program <a href=\"http://ersla.org/\" target=\"_blank\" rel=\"noopener\">teaching communities about fire safety and EMS</a>. (Tragically, it&#8217;s not very common in Central America.) Rodney would show me around the area, including taking me to see Alberto.</p><p>&#8220;Not many people get out to see him. Most don&#8217;t even know about him. If you want to break up your hiking, typical sightseeing, and drinking, we&#8217;ll go in the morning.&#8221; Rodney said to me.</p><p>I was intrigued.</p><p>How could I say no to that?</p><p>Alberto is something of a local character and has been carving figures and images into the rocks around his house for nearly 30&#160;years. While he&#8217;s no hidden secret (I wish I could say I was the first to visit with this amazing man), since he is hard to get to, not many people actually endeavor to visit him. (Do a quick Google search and you&#8217;ll find very little information on Alberto.)</p><p>And so, the following morning, Rodney, one of his employees (you can hear her translating in the video), and I climbed into his pickup tuck and headed out of town. We drove to its edge, into rural Nicaragua, where houses became trees and small street stalls. &#8220;This is definitely out of the way,&#8221; I thought to myself.</p><p>We suddenly turned onto a dirt road. There was nothing around but rolling green hills and farms. No signs pointing our way. The road seemed as random as the adventure. We passed horses and a few houses up this bumpy, windy dirt road until eventually, we stopped. On our left was a footpath through a stranger&#8217;s farm.</p><p>&#8220;We&#8217;ll head down there to Alberto&#8217;s house,&#8221; Rodney said to me.</p><p>We trekked down the hill, taking time to marvel at the beautiful scenery, before continuing down a small cow path through the woods, eventually coming upon what seemed to be the only house for miles.</p><p>A woman came out, greeted us, and led us behind the house, where a sun-kissed, scruffy man with an ear-to-ear smile came out to greet us. It was Alberto &#8212;&#160;and immediately he began to tell us stories of the local woods, plant life, and his carvings, all of which are summed up in this week&#8217;s video:</p><p></p><p>The day we spent visiting Alberto, hearing his story, seeing his carvings, and wandering around this remote&#160;area in Nicaragua was one of the most unexpected and enjoyable days I had during my visit. If you find yourself in Nicaragua and want to see the most jovial and interesting man in the country, head up to Esteli and visit Alberto.</p><p>Tell him I say hello.</p><p><strong>Directions:</strong> Getting there is a bit complicated. To visit Alberto Guti&#233;rrez, take a bus or taxi to the Tisey Estanzuela Natural Reserve. Ask to be dropped off at the entrance to El Calejate or Eco Posada. If you are dropped off at Eco Posada (where you can get lunch,&#160;buy drinks, etc.), keep walking up the road and eventually you&#8217;ll come to a big clearing on your left with a well-worn road going slightly down the hill. There will be a sign that says &#8220;El Calejate.&#8221; Go down this path, admire the stunning view, and then veer left down the footpath down the hill. Keep walking and you will see a sign that says &#8220;Bienvenidos a Galeria Esculturas en Piedras.&#8221; Cross the wooden gate and start calling out. Alberto will come out to greet you. Roam Nicaragua also has a tour for $30 USD if you don&#8217;t want to try to find Alberto by yourself! They also visit a market and go hiking.</p><p></p><p id=\"om-wgnksxyooxacue2jbray-holder\"></p><h4>Book Your Trip to Nicaragua: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Nicaragua by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Nicaragua with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Nicaragua?</strong><br> Be sure to visit our robust <a href=\"https://nomadicmatt.com/travel-guides/nicaragua-travel-tips/\" target=\"_blank\" rel=\"noopener\">destination guide on Nicaragua</a>&#160;for even more planning tips!</p></div>","title":"How to Visit Alberto Gutiérrez, the Stone Carving Hermit of Nicaragua"}},"pageContext":{"id":"5b95ea0087be05832748ff74"}}