{"data":{"mongodbDatabaseArticles":{"id":"5b9248df87be056953db7c07","content":"<div><p>I have been obsessed by <a href=\"http://rinse.fm/\">Rinse FM</a> for the last six months. With the current state of electronic music, where every producer is using the same sample packs and the the sound has become completely commodified, Rinse FM is like a fountain of fresh water in the middle of the desert. It's the only thing I can listen to these days.</p> <p>They've positioned themselves on the cutting edge of electronic music and they keep reinventing themselves. They're now pushing acid house, to garage-y techno and disco, but they might switch it over to completely new sounds as they do every month. It's just really really fresh stuff.</p> <p>My favorite shows are Hessle's amazing acid house show, <a href=\"http://www.youtube.com/watch?v=p_00Bq-1pcA\">Alex Jones's hilarious Hypercolour</a> dark techno show, Mark Radford's house show and Zinc's urban garage show. There's a consistent element to all Rinse's shows though, they all represent UK's underground scenes.</p> <h2>Podcast</h2> <p>Since Rinse FM actually doesn't have podcast and I was getting tired downloading the latest episodes from their website and putting them on my iPhone every other day, I built a robot that listens to Rinse FM all day and pushes the latest episodes to a podcast feed.</p> <h2>So give me the podcast link!</h2> <p>You can subscribe to the Rinse FM podcast through your podcast app (I recommend <a href=\"http://www.downcastapp.com/\">Downcast</a>) on the URL <a href=\"http://etc.levels.io/rinse-fm/podcast/\">http://etc.levels.io/rinse-fm/podcast/</a>.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/photo-2.png\"> <h2>Subscribe to specific shows</h2> <p>You can also subscribe to specific shows. An index of all Rinse FM shows is available at <a href=\"http://etc.levels.io/rinse-fm/podcast/shows\">http://etc.levels.io/rinse-fm/podcast/shows</a>. You can simply add the name of the show at the end of the url and you have the podcast link: e.g. for Hessle's show, subscribe to: <a href=\"http://etc.levels.io/rinse-fm/podcast/hessle/\">http://etc.levels.io/rinse-fm/podcast/hessle/</a>.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/photo.png\"> <p>I hope this helps more people discover <a href=\"http://rinse.fm/\">Rinse FM</a>, which in my opinion is now the most forward thinking radio station in the world (can't really hide my obsession with it very well, now can I?).</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Rinse FM, here’s your podcast feed we’ve always wanted"}},"pageContext":{"id":"5b9248df87be056953db7c07"}}