{"data":{"mongodbDatabaseArticles":{"id":"5b9248e587be056953db7c0b","content":"<div><p>This just happened:</p>   <p></p> <p>29 days ago, Ben Rubin launches Meerkat, a live-streaming app that becomes a viral hit. On Product Hunt, @httpete (Pete) writes how he was making the same app but Meerkat beat him to the punch</p> <a href=\"http://www.producthunt.com/posts/meerkat\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screenshot 2015-03-28 17.09.56\"><img src=\"/wp-content/uploads/2015/03/Screenshot-2015-03-28-17.09.56-1024x651.png\" alt=\"Screenshot 2015-03-28 17.09.56\"></a> <p>A week later, Twitter acquires Periscope, another video-streaming app. it takes them 2 weeks to develop it into a clone of Meerkat, but better. It launches two days ago, and blows Meerkat out of the water:</p> <a href=\"//www.producthunt.com/posts/periscope-4\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screenshot 2015-03-28 19.01.25\"><img src=\"/wp-content/uploads/2015/03/Screenshot-2015-03-28-19.01.25-1024x736.png\" alt=\"Screenshot 2015-03-28 19.01.25\"></a> <h2>Why is this relevant?</h2> <p>The pace of apps replacing each other seems like something we've hardly seen before. It's possible because:</p> <ul> <li>Amazing dev tools now means app development time is short</li> <li>The trend for apps is now minimalism, which often means shorter development times.</li> <li>Tech has created winner-take-all markets for apps</li> </ul> <h2>What does this tell us?</h2> <p>Tech has made makers of software simply an extension of the market. Something like <a href=\"http://en.wikipedia.org/wiki/Invisible_hand\">Adam Smith's invisible hand</a>:</p> <blockquote><p>The idea of trade and market exchange automatically channeling self-interest toward socially desirable ends is a central justification for the laissez-faire economic philosophy, which lies behind neoclassical economics.</p></blockquote> <p><strong>The market doesn't care anymore about the personal traits of makers, it doesn't care who they are, where they're from, how great their team is, what tech stack they use, or their company culture.</strong></p> <p>This is equalizing, as anyone can now launch an app and possibly succeed, whoever, wherever. Competition is fierce and makers know that if they win, they can capture the majority of their market. With fierce competition, users now get the best product. Yet, with the high pace of competition, it also means products can now be replaced in a matter of weeks and lose their market.</p> <p>How attractive is a market like that really for makers? Economics tells us perfect competition pushes profits towards zero. Is this what we're seeing here?</p> <p>If it is, it fits into the overall narrative of tech now. <a href=\"/a-future-of-two-extremes\">Tech + capitalism heavily rewards efficiency.</a></p> <p>It feels almost as if makers are merely the \"executing team\" of the bigger force that is tech. It doesn't care about us individually, it cares about technological progress.</p> <p>Tech rewards only the few who win, until the winners are ruthlessly replaced by the next &#8212; sometimes in the span of 14 days.</p> <p>This (sarcastic) tweet probably sums it up best:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/uvarovdd\">@uvarovdd</a> <a href=\"//twitter.com/levelsio\">@levelsio</a> <a href=\"//twitter.com/erictwillis\">@erictwillis</a> that's the beauty of capitalism, a billion ppl are depressed while 1 person is momentarily ecstatic.</p> <p>&#8212; ellis (@EllisAgainst) <a href=\"//twitter.com/EllisAgainst/status/581962454122528769\">March 28, 2015</a></p></blockquote> <p></p> <p>I'm curious what you think, <a href=\"http://twitter.com/levelsio\">tweet me your feedback</a>.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Makers have become the invisible hand"}},"pageContext":{"id":"5b9248e587be056953db7c0b"}}