{"data":{"mongodbDatabaseArticles":{"id":"5b95ef7a87be058327490115","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">For Those Who Prefer Cold Showers&#8230;</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>Thailand is HOT. Now that we have rolled into April, we barely get a break from the heat, and that&#8217;s even at night. When we first arrived in March, at least we looked forward to opening the windows to let in the cool, 60s-ish evening air.</p>\n<p>But that is no longer the case, and even in the mornings we wake up and it&#8217;s hot. And after going about our daily business we are hot. And after we get home from riding around outside we are hot. Can you see a trend here?</p>\n<p><strong></strong></p>\n<h1><p>That is where a nice, cool shower comes in.</p></h1>\n<p>Never did I think that I would regularly use the traditional Thai cool-water shower, but I do. The Thai showers are not a miserable, get-in-get-out-as-quick-as-you-can cold as I thought, but rather a refreshingly cool temperature, like nice pool water. It&#8217;s a welcomed cool-down after waking up hot or running afternoon errands.</p>\n<p>It&#8217;s funny that we had asked our landlord to install hot water shower heaters before moving in because we wanted warm showers, like back in the States. Little did we know how wonderful cool showers are&#8230;</p>\n<p>Hot showers are a bit different here than back home. Hot water comes from individual heater units installed in the showers themselves rather than hot water supplied to the entire house from one big tank. The water heated as it is being used, and a dial on the unit regulates the temperate rather that a hot/cold gauge directly on the faucet.</p>\n<p><a href=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/04/20130407-130112.jpg?ssl=1\"><img class=\"alignnone size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/04/20130407-130112.jpg?w=1080&amp;ssl=1\" alt=\"20130407-130112.jpg\"></a></p>\n<p>And for those of your who are wondering what else may be different in our bathrooms here&#8230; the answer is no, we do not have squat toilets, but we do have bum guns!</p>\n<p><a href=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/04/20130407-130945.jpg?ssl=1\"><img class=\"alignnone size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/04/20130407-130945.jpg?w=1080&amp;ssl=1\" alt=\"20130407-130945.jpg\"></a></p>\n<p></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"For Those Who Prefer Cold Showers…"}},"pageContext":{"id":"5b95ef7a87be058327490115"}}