{"data":{"mongodbDatabaseArticles":{"id":"5b95ee6787be0583274900d9","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Chiang Mai Barber Review: The Cutler</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/cutler-chiang-mai-barber-shop/\"><img class=\"aligncenter size-full wp-image-10376\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/08/CM-Cutler-Headers2.png?resize=555%2C416&amp;ssl=1\" alt=\"Chiang Mai Barber Review: The CUTLER\" width=\"555\" height=\"416\"></a></p>\n<p>Gentlemen, if you want an amazing haircut in Chiang Mai, look no further. After stumbling upon a place via Facebook and browsing through the before-and-after photos, we couldn&#8217;t see a more fitting place for a men&#8217;s haircut than at the modern-classic Chiang Mai barber called The Cutler.</p>\n<p>A man&#8217;s first haircut in Thailand is usually cautiously received. Understandably. Images of rusty scissors, dim lighting, and a patchwork job inevitably may turn you off to the idea. Many people&#160;search for the least intimidating-looking place in town before taking a seat. Of course, nervousness and a perceived language barrier prompts you to mime the style you want, complete with elbows flailing and holding up select fingers to indicate the electric razor number. Miming? Please, stop.</p>\n<p>Situated a bit south of Wat Phra Singh is a fantastic Chiang Mai barber called The Cutler: Barber and Tattoo. A large awning protects the small glass-enclosed shop from the sun. There is no red, white, and blue candy cane indicating a barber shop but rather a black and white sign written in calligraphy. This is the place you need to go to.</p>\n<p><img class=\"aligncenter size-full wp-image-10371\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/08/Outside-Cutler.jpg?resize=563%2C422&amp;ssl=1\" alt=\"The Cutler Sign\" width=\"563\" height=\"422\"><br>\nInside sports simple rustic decor. The eggshell white walls are sketched with barber-themed artwork, caged light fixtures hang from the ceiling, and rough concrete is underfoot. Shallow wooden display shelves are home to tin tubs of pomade and hair gel. The walls sport pictures of 1920s-era men with various degrees of facial plumage.</p>\n<p>The scent of the room is incredible.&#160;Clean and menthol-like, with a faint talc-powder and woodsy scent. Manly. Just like a barber shop should be, right? Jazz music plays in the background. There&#8217;s beer and water for thirsty patrons. Can this get any better?</p>\n<p><img class=\"aligncenter size-full wp-image-10374\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/08/Cutler-Collage2.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Vintage Style at The Cutler\" width=\"563\" height=\"422\"></p>\n<p>Amazingly, the 12&#215;12 ft single room is home to three old-time metal barber chairs, with flaking cream-colored paint and refurbished brown leather seats. Two barbers are on the floor, Si and X, sporting waxed mustaches and fedoras. They speak good English and are happy to show you some styles from a photo collection in a narrow binder.</p>\n<p><img class=\"aligncenter wp-image-10325 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/07/CutlerCollage.jpg?resize=563%2C300&amp;ssl=1\" alt=\"A sample of The Cutler's styles\" width=\"563\" height=\"300\"></p>\n<p>Images straight from The Cutler&#8217;s binder of styles. Thanks, <a href=\"https://www.google.co.th/search?q=1920s+mens+haircut&amp;safe=off&amp;client=firefox-a&amp;hs=zgi&amp;rls=org.mozilla:en-US:official&amp;channel=sb&amp;tbm=isch&amp;tbo=u&amp;source=univ&amp;sa=X&amp;ei=6bXZU7HfG4qTuASMs4HwDw&amp;ved=0CBoQsAQ&amp;biw=1366&amp;bih=565#channel=sb&amp;q=1920s+mens+haircut&amp;rls=org.mozilla:en-US:official&amp;safe=off&amp;tbm=isch&amp;imgdii=_\">Google</a>.</p>\n<h2><p>The Cut</p></h2>\n<p>You might be accepted as a walk-in client, but chances are, you&#8217;ll need an appointment. Why? Because haircuts at The Cutler take an hour. Yes, an hour that combines electric shaving, hand-cut trimming, and even precise sculpting with a straight razor. For viewing pleasure, two mirrors are strategically positioned so that patrons can watch their haircut unfold from both the front and the back.</p>\n<p>Heck, you&#8217;ll even get a cool towel on your face and lean back in the chair as they groom your manly beard.</p>\n<p>After having your hair cut and then properly pomaded into place, you&#8217;ll look like a million bucks. And the cost for an hour&#8217;s work by a skilled artist? A mere 200 baht. <strong>That&#8217;s less than 7 USD.</strong></p>\n<p><strong>MAY 2017 UPDATE:</strong> Haircuts are 300 baht. A cut and shave is 500 baht. But they are as fine as ever!</p>\n<p>In addition to their serviced haircuts, The Cutler sells hair care products including Layrite, JS Sloane, and REUZEL. At this point, you&#8217;ll do anything to capture this fresh style they&#8217;ve created, and you will want, no need, their pomades and gels.</p>\n<p>So is there any question to where your next hair cut will be? Clean, professional, and amazing. So be a gentleman and treat yourself to The Cutler.</p>\n<h2><p>Location and Contact Information for The Cutler</p></h2>\n<p><strong>Address:</strong> 75 Samlan Road, Phra Singh, Chiang Mai, Thailand 50100<br>\n<strong>Hours:</strong> 1:00 pm to 9:00 pm<br>\n<strong>Phone:</strong> (091) 123-7966 or (093) 858-6012<br>\n<strong>Website:</strong> <a href=\"https://www.facebook.com/THECUTLERBARBER\">https://www.facebook.com/THECUTLERBARBER</a></p>\n<p></p>\n<h2><p>Additional Chiang Mai Barbers</p></h2>\n<p>In addition to being a (very satisfied) customer of The Cutler, there are other Chiang Mai barbers we are familiar with. One that is also on part with The Culter is Skill, which has two locations.</p>\n<p>Although some barbers are cheaper than the already affordable 200 baht 300 baht charged by The Cutler, there are always patrons looking for the best deal.</p>\n<p>A place that Chris has frequented most often is Cut and Beauty, just south of Thapae Gate on the east side of the Old City. A haircut costs 120 baht (4 USD) but a head scrub and rinse bumps it to 150 baht (5 USD). Not inexpensive, but they probably charge a bit more because of their prime place on the moat.</p>\n<p><img class=\"aligncenter size-full wp-image-10380\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/08/ThaiBarber.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Chiang Mai Barber - Local Thai\" width=\"563\" height=\"422\"></p>\n<p>One-man shops are scattered around the entire city, particularly on smaller sois&#160;and streets just outside the moat. They have the only-in-the-movies look of a Thai barber. Open aired, single chair, fluorescent lighting with washed out pictures from decades ago on the wall. The barber wears a white apron and cuts his patron&#8217;s hair while he leans back in the chair. The going price? Around 60 baht (2 USD).</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Chiang Mai Barber Review: The Cutler"}},"pageContext":{"id":"5b95ee6787be0583274900d9"}}