{"data":{"mongodbDatabaseArticles":{"id":"5b962b6287be0583274911dc","content":"<div><p><strong>-This post is brought to you and written by India Someday-</strong></p><p>India Someday is a travel service that offers just the right amount of assistance to independent travelers looking at planning a trip to India.</p><p>Our Audience is Just about anyone, We&#8217;ve helped people across all age groups (19 year to 83 year olds) from back packers, mid budget, comfort and luxury travelers. Our personalized service is based on what the client prefers rather than pushing our ideas through. Depending on how much assistance you are looking at we will help you fill in the gaps of your India travel.</p><p><strong>Our Service in a nutshell</strong></p><p>Say you are planning a trip to India and have limited time in the country and are overwhelmed with which places, regions to include or omit.</p><p>Or say you have a good idea of which places you&#8217;d like to visit, but are confused with which route to follow? Or you have your route in mind, but are unable to book train tickets!</p><p>Perhaps your a solo female traveler and want a little help/assurance while travelling.&#160; Know you&#8217;re staying at safe places and that your using safe means to travel and have someone in India to call should you need any help once in India.</p><p>India someday is a travel service that fills in that gap. Depending on what you need we help you plan your route, help you book right places to stay and book your trains/buses/cars and flights.</p><p><strong>Our Pricing &#8211; We charge a reasonable flat planning and booking fee</strong></p><p>We charge a fixed travel planning and booking fee to help you plan a highly personalized holiday and manage all your trip related bookings. You are in complete control of how much you wish to spend. We give you a break-up of every component of your trip.</p><p><strong>More about us!</strong></p><p>Our website should give you a better understand on what we do &#8211; <a href=\"http://www.indiasomeday.com\" rel=\"nofollow\">www.indiasomeday.com</a>. Hippie on Heels has not had a chance to experience our services yet but do take a look at the<a href=\"http://www.tripadvisor.in/ShowTopic-g293860-i511-k6980251-India_Someday_the_best_travel_agency-India.html\" rel=\"nofollow\"> reviews</a> by people who&#8217;ve used our service on how they benefited travelling with India someday assistance.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"India Someday – India travel with a little assistance"}},"pageContext":{"id":"5b962b6287be0583274911dc"}}