{"data":{"mongodbDatabaseArticles":{"id":"5b92396787be0583cfde67f9","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">5 tax strategies for digital nomads and location independent entrepreneurs</h1>\n \n</p><img class=\"size-full wp-image-10940\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/04/digital-nomad-tax-strategies-2.jpg\" alt=\"Tax strategies for digital nomads\" width=\"700\" height=\"467\"><p>Last updated January 7, 2017</p>\n<p>Dateline: Brasov, Romania</p>\n<p>In British electronica trio <a href=\"http://yearsandyearsofficial.com\" target=\"_blank\" rel=\"noopener\">Years and Years</a>&#8216; newest single, King, vocalist Olly Alexander sings about the shackles of a bad relationship and how he wants out.</p>\n<p>I&#8217;m certainly not a music scholar, but it seems the title &#8220;King&#8221; is a nod to the feeling of freedom he feels in said relationship. However, in reality, he knows he is anything but free and is asking to be let go from the sense of false freedom.</p>\n<p>Sounds a lot like expats doing taxes.</p>\n<blockquote><p>I caught you watching me under the light<br>\n&#8230;<br>\nAnd oh, oh, oh<br>\nI was a king under your control<br>\nI wanna feel like you&#8217;ve let me go<br>\nSo let me go</p></blockquote>\n<p>The phenomenon of digital nomads spawned by books like <a href=\"https://amzn.to/1d68Mav\">The Four Hour Workweek</a> is huge. Thousands of people have quit their jobs in the United States, Canada, Australia, and Europe to <a title=\"The 5 most livable cities in Southeast Asia\" href=\"http://nomadcapitalist.com/2013/10/20/top-5-livable-cities-southeast-asia/\">live overseas in Southeast Asia</a> and other emerging countries. No doubt, many feel like kings.</p>\n<p><strong>Here&#8217;s the dirty little secret: many digital nomads and location independent entrepreneurs are not in tax compliance back home.</strong> I call this &#8220;The Nomad Trap&#8221;; the idea that simply leaving your country as a tourist is enough to keep you from paying tax. If you&#8217;re in this boat, the fines and penalties could be huge. Even I have trouble keeping up with the endless tax laws these governments put out.</p>\n<p></p>\n<p>On top of that, most digital nomads I&#8217;ve met in my travels haven&#8217;t properly structured their affairs to legally reduce or eliminate taxes. While some people unnecessarily <a href=\"http://www.nomadcapitalist.com/offshore-company\">set up offshore companies</a>, others who need them totally ignore that.</p>\n<p>Hopefully you know by now that simply leaving your home country for greener pastures doesn&#8217;t mean an end to your tax obligations&#8230; <a title=\"FBAR form and other offshore filing requirements\" href=\"http://nomadcapitalist.com/2013/09/25/fbar-and-other-offshore-bank-account-reporting-requirements/\">especially</a> if you&#8217;re a US person.</p>\n<p>Just as in the song, you may feel like a &#8220;king&#8221; or queen with the freedom that being a digital nomad provides. However, maintaining your home country&#8217;s passport means you are still a king under the control of that government.</p>\n<p>If and until you give up your citizenship, you have to play by their rules or risk the penalties of non-compliance. As always, ignorance of the law is no defense to tax authorities. And as of 2017, countries like <a href=\"http://nomadcapitalist.com/2016/10/26/end-tax-nonresident-status/\">Australia</a> have been issuing more and more strict tax rulings to non-residents.</p>\n<p>If you want to truly be free and not under the thumb of your local tax authority, here are some important steps. It doesn&#8217;t cost a lot to get started, but doing this stuff right from the beginning can save you countless hours of time and great expense.</p>\n<p>As they say, an ounce of prevention is worth a pound of cure. Which is why we&#8217;ve taken the time to tell you about these five important tax strategies for digital nomads.</p>\n<h2>1. Become tax non-resident in your home country</h2>\n<p>This was one of the big discussion points at my private club meeting in Monaco earlier this month. More countries are raising the stakes for their citizens to escape taxation at home, even when your primary home is overseas.</p>\n<p>For digital nomads, this can be especially challenging. Countries like the UK, Australia, and others limit the amount of time you can spend there once you&#8217;ve ticked the box to have your tax domicile located elsewhere.</p>\n<p>That&#8217;s why obtaining <a href=\"http://nomadcapitalist.com/2015/09/07/tax-free-countries-second-residency/\">a second residency</a> can be an important step for digital nomads. Historically, many people obtained permanent residence in countries like Panama, but in my opinion Latin America can be needlessly bureaucratic and surprisingly expensive. Options in eastern Europe and Asia are often more attractive, although the choice is yours.</p>\n<p>Putting down roots in your country of residency can help your case even more. This includes renting an apartment, getting a drivers&#8217; license, joining a country club, or docking your <a href=\"http://nomadcapitalist.com/2017/07/17/ultimate-guide-yacht-registration/\">yacht </a>at the local marina. Every little step helps.</p>\n<p>For US citizens, being tax non-resident can be as simple as spending 330 days in foreign countries in any 365 calendar day period. However, you still have to structure your company properly to avoid paying a minimum 15.3% tax for Social Security and Medicare.</p>\n<h2>2. Earn your money in an offshore company</h2>\n<p>All too often, I see entrepreneurs, and especially consultants, living overseas earning money in their personal name or even using a corporation in their home country.</p>\n<p>There&#8217;s a reason you left California, and you ought to ditch your California LLC, too. Around our office, we refer to California as a sort of plague. There are some circumstances where using a corporate entity in your country of citizenship can be useful; in some cases, you can even structure it to be tax-free. It&#8217;s better to <a href=\"http://www.nomadcapitalist.com/offshore-company/\">have an offshore company</a>, though.</p>\n<p>However, doing business in your own name may qualify you for tax exemptions like <a title=\"Do you qualify for the Foreign Earned Income Exclusion?\" href=\"http://nomadcapitalist.com/2014/01/15/qualify-foreign-earned-income-exclusion/\">the Foreign Earned Income Exclusion</a> in the United States, but it may leave you open to other taxes as mentioned above. If you&#8217;re not a US citizen, you could still be on the hook for income tax on your entire business profits if you mess up on step #1, or if you spend too much time somewhere else.</p>\n<h2>3. Be careful where you live</h2>\n<p>Being a digital nomad or perpetual traveler is all about being able to call anywhere &#8220;home&#8221;. Just make sure your definition lines up with that of the tax authorities where you lay your head.</p>\n<p>Here in Europe, most countries practice what is called &#8220;residential taxation&#8221;. Live there long enough &#8212; often 183 days or more per year &#8212; and you&#8217;ll be taxed on your worldwide income. Some countries aren&#8217;t as aggressive as the United States at taxing your foreign investment income, but you can&#8217;t be too careful.</p>\n<p>Fortunately, many of the countries sought out by nomads practice &#8220;<a title=\"Tax freedom starts with a territorial tax system\" href=\"http://nomadcapitalist.com/2013/05/10/tax-freedom-starts-with-a-territorial-tax-system/\">territorial taxation</a>&#8220;, which means that only income you earn in that country is taxed. Malaysia, Singapore, and Panama are a few examples of this. In simple terms, that means that earning money in an offshore company and not remitting it to where you&#8217;re living can keep you tax-free.</p>\n<p>Of course, the United States is the most aggressive of all with what is called &#8220;citizenship-based taxation&#8221;. If you follow these steps, though, you stand a good chance to eliminate most forms of tax&#8230; unless perhaps you&#8217;re the sole employee of a business doing $20 million in profit.</p>\n<p>If you travel from place to place <a title=\"The easiest countries for perpetual travelers to visit visa-free\" href=\"http://nomadcapitalist.com/2015/03/23/easiest-countries-for-perpetual-travelers/\">as a tourist</a>, you&#8217;ll enjoy the best of both worlds. Just be careful; the US can tax you if you overstay your welcome as a tourist. I think it&#8217;s written on the Statue of Liberty under &#8220;your huddled masses yearning to breathe free&#8221;.</p>\n<h2>4. Bank overseas in a foreign currency</h2>\n<p>Your newly internationalized business should use foreign currencies as a diversification tool. If you&#8217;re from the United States, holding US dollars in your personal and business account can be a ticking time bomb.</p>\n<p>It&#8217;s easy to hold foreign currencies in offshore banks, and currency exchange rates in some of the large wealth havens in Asia are often excellent.</p>\n<p><a href=\"http://www.nomadcapitalist.com/offshore-banking/\">Banking offshore</a> helps bolster your case that you&#8217;re truly a global citizen, not just someone on vacation. Again, every step in that direction helps.</p>\n<h2>5. Have an accountant that specializes in expat tax law</h2>\n<p>When I operated and invested in businesses in the United States, I retained the top tax firm in town. My annual tax return looked like a small town phonebook. Paying that firm thousands of dollars a year was well worth it, despite some of my employee friends who thought paying more than $399 at <a href=\"http://www.hrblock.com\" target=\"_blank\" rel=\"noopener\">H&amp;R Block</a> was insane.</p>\n<p>That said, the minute I saw the light and started applying offshore strategies, I found tax counsel that understood what it&#8217;s like to be an expat. For as expensive as my US-based firm was, they didn&#8217;t understand stuff like the FEIE or what an FBAR was. It rarely came up among their clients. Hiring an expat-focused tax preparer doesn&#8217;t have to be expensive. In fact, my expat tax attorney costs about the same as my high-powered domestic firm when I lived in the United States.</p>\n<p><strong>If you need help applying these tax strategies, <a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\">apply here</a> to see if you qualify to work with me 1-on-1 and avoid the tax pitfalls location independent workers face.</strong></p>\n<p class=\"et_social_bottom_trigger\"></p> </div>","title":"5 tax strategies for digital nomads and location independent entrepreneurs"}},"pageContext":{"id":"5b92396787be0583cfde67f9"}}