{"data":{"mongodbDatabaseArticles":{"id":"5b95ead687be05832748ffd8","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/Hostelsex4.jpg\" alt=\"backpacking couple kissing near architecture in Europe on vacation\"><br> There you are. Sitting across from some foreign hottie in your hostel. You&#8217;re staring deeply into each other&#8217;s eyes when you realize you are both conveying the same thought: &#8220;Let&#8217;s have sex.&#8221;</p><p>No one wants to spend a year traveling around the world and not come back with&#160;<a href=\"https://www.nomadicmatt.com/travel-blogs/love-and-romance-on-the-road/\">at least one story of overseas romance</a>. Magical nights spent in exotic cities,&#160;two souls exploring the world together. Or at least one drunken night in that&#160;<a href=\"https://www.nomadicmatt.com/travel-blogs/my-favorite-hostels-in-europe/\">hostel in Europe</a>.</p><p>Kindred spirits abound on the travel trail, and people are constantly starting and ending relationships &#8211; sometimes in the same day. So there you are, in that hostel with your new romance &#8211;&#160;what do you do? Where will you go? Well, here are some do&#8217;s and don&#8217;ts for having sex in a hostel:</p><p><strong>DO head to the bathroom</strong><strong>.</strong> This is a perfect place to do the nasty. You can lock the door, and the shower makes for easy cleanup. It&#8217;s also less likely someone will come in and bother you here than in a dorm room.</p><p><strong>DON&#8217;T have sex in the common room</strong><strong>.</strong> After a long day of&#160;sightseeing, you don&#8217;t want to come back, sit down on the couch, and think, &#8220;Ewww&#8230;why is this couch sticky?&#8221; Do us all a favor and head somewhere you won&#8217;t leave a mark&#8230;at least not one people will sit in. Try the closet where the hostel keeps cleaning supplies. No one will bother you there. I&#8217;ve walked in on people in the common room and just think, &#8220;Gross.&#8221; Plus, people hang out, eat, and drink in the common room all day. It&#8217;s probably not that clean to begin with.</p><p><img src=\"https://media.nomadicmatt.com/Hostelsex2.jpg\" alt=\"girl in the middle of two backpacking sexy couples in love at a hostel\"></p><p><strong>DO head to the roof</strong><strong>.</strong> Tons of hostels have rooftop terraces, and many are kept unlocked. No one is going to bother you (unless they get the same idea &#8211;&#160;maybe &#8220;the more the merrier&#8221; is a philosophy you take with you all the time?). Bump uglies under the stars all night long. It will be the most romantic time you&#160;have in a hostel.</p><p><strong>DON&#8217;T have sex on the top bunk</strong><strong>.</strong> You&#8217;ll shake the bed. It will creak. You&#8217;ll wake everyone up, especially your bunkmate. It&#8217;s just&#160;rude &#8211;&#160;there are other places to go. Don&#8217;t be that guy or girl!</p><p><strong>DO drape sheets over your bed.</strong>&#160;I can&#8217;t count the number of times I&#8217;ve seen sheets hanging over the bottom bunk in a dorm room. Couples think they are being coy, but we all know what is going on behind the sheets. However, your dormmates will appreciate when you hang a sheet around the bed because no one wants to see your butt bouncing up and down like a teenager thinking his parents aren&#8217;t home.</p><p><strong>DON&#8217;T have sex in the kitchen.</strong>&#160;Seriously. I mean it. People eat there. The only white sauce I want on my pasta is made out of cheese. Hostel kitchens are dirty enough; there&#8217;s no need to make them dirtier. Additionally, there are&#160;people in a kitchen 24 hours a day so there&#8217;s little chance you&#8217;ll have privacy. Don&#8217;t have sex in the kitchen. Think of it as the hostel&#8217;s champagne room. There is no sex in the <a href=\"http://en.wikipedia.org/wiki/No_Sex_%28In_the_Champagne_Room%29\">champagne room</a>.</p><p><strong>DO wait until people go to bed.</strong>&#160;If you wait until late at night, there&#8217;s less of a chance that people will hear you have sex in your dorm. Okay, someone will probably hear you. They might even watch; you never know. But if you wait until your dormmates put in earplugs and fall into a comfy drunk sleep, the chances of you waking someone are pretty low. Unless, of course,&#160;you&#8217;re a screamer. Then there&#8217;s no hope.</p><p><img src=\"https://media.nomadicmatt.com/Hostelsex5.jpg\" alt=\"loving black and white photo of backpackers kissing at the transportation hub while traveling\"></p><p><strong>DON&#8217;T do it in the evening.&#160;</strong>This is the&#160;WORST&#160;time to have sex. People are coming in from a day of sightseeing. They&#8217;re eating dinner. Getting ready to go out. Posting pictures on Instagram. The hostel is bursting with life in the early evening. Bottom line: Unless you want to show people your bottom and&#160;possibly get kicked out&#160;in the process, wait a few hours until everyone goes out for the night (see tip below).</p><p><strong>DO wait until people go out for the evening</strong><strong>.</strong> When nighttime rolls around and everyone goes out to socialize, there&#8217;s no one around to bother you and your special someone while you play a quiet game of hide the sausage.</p><p><strong>DON&#8217;T have sex in the morning.</strong>&#160;Everyone is getting up or sleeping off their hangovers. The last thing they want to hear is &#8220;Ohhh I&#8217;m almost there&#8221; or, more likely, &#8220;I usually last a little longer.&#8221; Waking people up by getting jiggy with it is a sure-fire way to leave a hostel with no friends. Except for that creepy guy who wouldn&#8217;t stop staring.</p><p><strong>DO get it on in the laundry room</strong><strong>.</strong> It will be empty,&#160;especially at night, so you&#8217;ll have your own private space. Put a few coins in the machine for some extra fun.</p><p><strong>DON&#8217;T do it in a small room.</strong>&#160;If you are in a 24-person dorm, it will be easy to get away with doing it. Most people aren&#8217;t going to realize who is doing what if you&#8217;re in a huge dorm, but in a small room, it&#8217;s easy to annoy your roommates. People will figure it out, you&#8217;ll keep them up, and you&#8217;ll make enemies. I&#8217;ve stayed in 40-bed dorms where it&#8217;s hard to hear anything over the 10 people snoring like freight trains, but in that 6-bed dorm? You know who is doing what!</p><p><strong>DO get your own room!</strong>&#160;I know you are on a budget and a private room is expensive, but when two of you split the cost of a room, it&#8217;s not so bad. For a few extra dollars a night, you and your lover can have complete privacy. You can do it until you are blue in the face without having to worry about getting caught.</p><p><strong>DON&#8217;T forget to wear a condom.</strong>&#160;Because photos and memories are the only thing you want to bring home from your holiday.</p><p>So remember, if you are going to have sex in a hostel, make sure you have sex the right way &#8211; without&#160;<a href=\"https://www.nomadicmatt.com/travel-blogs/hostel-etiquette/\">bothering the rest of the hostel</a>. No one wants to see your ass. It&#8217;s not pretty. In fact, when was the last time you got a tan? It&#8217;s looking a little white.&#160;<a href=\"https://www.nomadicmatt.com/travel-blogs/this-one-time-while-in-a-hostel/\">I&#8217;ve seen some crazy stuff in hostels</a>,&#160;but seeing you having sex is something no one wants to see! Be courteous hostel guests!</p></div>","title":"How to Have (Or Not Have) Sex in Hostels"}},"pageContext":{"id":"5b95ead687be05832748ffd8"}}