{"data":{"mongodbDatabaseArticles":{"id":"5b9382de87be056953db7e00","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Nyd6_w4LOmPyqkYj2LQ0mA.png\"><h1 name=\"title\" id=\"title\" class=\"graf graf--h2 graf-after--figure graf--title\">How a remote control with just one button could make your TV great&#160;again</h1><h2 name=\"subtitle\" id=\"subtitle\" class=\"graf graf--h4 graf-after--h2 graf--subtitle\">Yes, just one, big, nice button. The manual would say one thing: &#8220;Press the button&#8221;. Here&#8217;s how it could&#160;work.</h2><p name=\"ce64\" id=\"ce64\" class=\"graf graf--p graf-after--h4\">Last night I fell asleep watching TMZ, a gossip show. It was on. My TV was on. I had hired the TV to do one job: Take my mind off work. So I watched. At the same time, Fallon, Ferguson, Charlie Rose, Democracy Now and The Office were on. I would probably have watched those instead, had I known. They weren&#8217;t on the channel my TV was left on when it was last turned off, so I didn&#8217;t.</p><p name=\"24ad\" id=\"24ad\" class=\"graf graf--p graf-after--p\">So why didn&#8217;t I switch the channel? Open the cable guide? Why didn&#8217;t I just fire up Hulu, Netflix, Tivo, Amazon and pick exactly what I wanted? That&#8217;s not what I hired the TV for. I hired it to take my mind off work&#8202;&#8212;&#8202;not to be a bad content whack-a-mole. Not to be a set of seemingly unlimited choices. Not to spend my time carefully traversing menus and weighing this episode of The Office against that Charlie Rose interview. Admittedly, it would take my mind off work, but it would still feel like work.</p><p name=\"019f\" id=\"019f\" class=\"graf graf--p graf-after--p\">As a European transplant, it boggled my mind to learn that I can&#8217;t just put HBO on channel 1 and Discovery on channel 2. They&#8217;re fixed. From channel 1 to 10 I have Mexican and Chinese channels, and one dedicated to selling jewelry. They probably paid their way in there so I could fall asleep to it. There must be a way to hide those channels, right? The good news is that there is. The bad is that you have to be an engineer.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*ZvqudVJKm-XmhgF2.png\">My cable box allows me to hide channels. It took me 30 minutes to find out how. And an hour to do&#160;it.<p name=\"e65a\" id=\"e65a\" class=\"graf graf--p graf-after--figure\">Again, too much work for someone trying to take their mind off work.</p><p name=\"d70a\" id=\"d70a\" class=\"graf graf--p graf-after--p\">Here&#8217;s what I need: One button. It doesn&#8217;t need a label, but if someone insisted, I would go with it and make the label say &#8220;take my mind off work&#8221;, or &#8220;entertain me for a while&#8221;, or &#8220;show me something cool&#8221;. Or just &#8220;watch&#8221;.</p><h4 name=\"537a\" id=\"537a\" class=\"graf graf--h4 graf-after--p\">So how would it&#160;work?</h4><p name=\"81ff\" id=\"81ff\" class=\"graf graf--p graf-after--h4\">It&#8217;s simpler than a Raspberry Pi, which is 35 dollars, so I would take it this would cost less. You tell it which TV, streaming boxes, and cable provider you have. Maybe list a few of your favorite shows and movies to get you started. Then press the button. The only button.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*5IrRrblYA1Yc_RWfJS6xcQ.gif\"><p name=\"429e\" id=\"429e\" class=\"graf graf--p graf-after--figure\">It&#8217;s a lot like the universal remotes in Best Buy. The difference is that it&#8217;s online, and knows what you like to see. So &#8220;next channel&#8221; doesn&#8217;t mean &#8220;from 5 to 6&#8221;, but &#8220;show me the next show that&#8217;s relevant for me&#8221;.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*VpgUsr5c33PjhdpQ.png\">The channel mix, made for me. The wifi remote changes the order of your channels to match what you like to&#160;watch<h4 name=\"d831\" id=\"d831\" class=\"graf graf--h4 graf-after--figure\">How about streaming?</h4><p name=\"2c8d\" id=\"2c8d\" class=\"graf graf--p graf-after--h4\">Say you&#8217;re a fan of House of Cards on Netflix. During the setup you told the remote that you have a Roku box on HDMI 1. When there&#8217;s a new episode, erh, season of House of Cards available, the one-button remote will now switch to HDMI 1 and use the Roku API to find and play the latest episode. It could even work on an Apple TV, which doesn&#8217;t have an API, just by transmitting a series of commands, emulating a real user.</p><p name=\"66ce\" id=\"66ce\" class=\"graf graf--p graf-after--p\">Of course, this would be invisible to you. It would do all this behind the scenes, before it switches the image itself. Your job is to watch TV, not to switch channels, let alone watch it switching channels.</p><p name=\"4348\" id=\"4348\" class=\"graf graf--p graf-after--p\">So. We&#8217;ve mixed in on-demand streaming. Now my mix could look something like this:</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*C0zTwK0aX8WUfsoZ.png\">Seamlessly mixing streaming shows and live&#160;tv<h4 name=\"5043\" id=\"5043\" class=\"graf graf--h4 graf-after--figure\">It&#8217;s not an&#160;app</h4><p name=\"2ffc\" id=\"2ffc\" class=\"graf graf--p graf-after--h4\">If it&#8217;s just one button, why isn&#8217;t it just an app? Your phone can&#8217;t send remote control signals. But even if it could, it wouldn&#8217;t be the best device. You still have to unlock your phone, find the app and open it, just to be able to press a button. It kind of defeats the purpose.</p><p name=\"7b5e\" id=\"7b5e\" class=\"graf graf--p graf-after--p\">In rare cases, you would open a companion app on your phone. You know, for those situations where you actually want to watch TMZ. Or you want to search for an actor or a specific movie. But then again, TMZ will be in the mix, just not at the very beginning. So you may have to push the button a few more times. In any case, you&#8217;ll most likely end up with fewer button presses than if you had to traverse menus, TV guides and search fields with your current remote.</p><p name=\"b025\" id=\"b025\" class=\"graf graf--p graf-after--p graf--trailing\">So with a one-button remote, maybe you&#8217;ll fall asleep to something you actually like, and maybe even something that could make you smarter. And if you&#8217;re really serious about celebrity gossip, it will make sure you fall asleep to TMZ.</p></div>","title":"How a remote control with just one button could make your TV great again"}},"pageContext":{"id":"5b9382de87be056953db7e00"}}