{"data":{"mongodbDatabaseArticles":{"id":"5b937b1e87be056953db7d20","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*LITnpMPS4HehMk6cqbLX2w.jpeg\"><h1 name=\"f6ba\" id=\"f6ba\" class=\"graf graf--h3 graf-after--figure graf--title\">Traveling Around The Globe With a Budget of $1000/Month</h1><p class=\"aspectRatioPlaceholder-fill\"></p><a href=\"http://bit.ly/2wJfG1Q\" class=\"graf-imageAnchor\" rel=\"nofollow\"><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Rg7sQSD8kiOXzqAGek_ZJg@2x.jpeg\"></a><p name=\"5480\" id=\"5480\" class=\"graf graf--p graf-after--figure\">Lithuania, Hungary, Ukraine, Romania, Bulgaria, UAE, Malaysia, Singapore, Indonesia, Philippines, Thailand, Vietnam, USA, UK, Lithuania</p><p name=\"aff2\" id=\"aff2\" class=\"graf graf--p graf-after--p\">What happened when I packed my life into a backpack and left home with a one-way ticket?</p><p name=\"f8a0\" id=\"f8a0\" class=\"graf graf--p graf-after--p\">Since then, I&#8217;ve lived in 3 continents, been to 14 countries, flew all around the globe, met hundreds of fascinating and inspiring people, burned thousands of calories lifting weights in gyms, ate amazing foods on the streets, cafes, restaurants and hotels, I&#8217;ve snorkelled, rode a boat, drove hundreds of kilometres on a scooter, chilled out on a paradise island, been in a relationship, seen dozens of temples, slept in a bungalow in a jungle, done numerous of interviews, grew my business but most important, I started to love the world and life more than ever before.</p><blockquote name=\"c526\" id=\"c526\" class=\"graf graf--pullquote graf--startsWithDoubleQuote graf-after--p\">&#8220;Either write something worth reading or do something worth writing.&#8221;&#8202;&#8212;&#8202;Benjamin&#160;Franklin</blockquote><p name=\"1d6d\" id=\"1d6d\" class=\"graf graf--p graf-after--pullquote\">Simply put, I&#8217;ve experienced and learned more than I ever could have if I have stayed at home. Today I&#8217;d like to share some lessons I&#8217;ve learned traveling and exploring the world with an average budget of $1000/month.</p><h3 name=\"a046\" id=\"a046\" class=\"graf graf--h3 graf-after--p\">Never say&#160;never</h3><p name=\"9300\" id=\"9300\" class=\"graf graf--p graf-after--h3\">I never thought I&#8217;d be homeless by choice, I never thought I would exchange financial security for freedom, I never thought I would become a writer, teacher, speaker, entrepreneur, I never thought of myself as a nomad, I never thought I would travel around the world while doing what I like but all these things happened in a year.</p><p name=\"2ccc\" id=\"2ccc\" class=\"graf graf--p graf-after--p\">I&#8217;ve had many misleading perceptions and beliefs that changed entirely while traveling and opened my eyes and changed my way of thinking.</p><p class=\"aspectRatioPlaceholder-fill\"></p><p class=\"iframeContainer\"></p><h3 name=\"3019\" id=\"3019\" class=\"graf graf--h3 graf-after--figure\">Living with less is more enjoyable</h3><p name=\"508a\" id=\"508a\" class=\"graf graf--p graf-after--h3\">Simplifying my life and spreading the minimalist lifestyle has become my daily activity. Experiencing and collecting moments not things has made me happier than ever before, not having any physical possessions cause very little to no problems and leave my head fresh and empty. While I still do have some stuff which is a quality laptop for work, and phone for communication and camera, I don&#8217;t really try to get any fancy clothes or other things that would weigh me down and allow me to brag about these temporary belongings.</p><h3 name=\"37ad\" id=\"37ad\" class=\"graf graf--h3 graf-after--p\">What about&#160;money?</h3><p name=\"1975\" id=\"1975\" class=\"graf graf--p graf-after--h3\">Money-wise I am still in a transition from a freelancer to an entrepreneur, meaning that I still do work that exchanges my hours into dollars to sustain my lifestyle and fund my ventures such as <a href=\"http://despreneur.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Despreneur</strong></a>, <a href=\"http://mobiledesignbook.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Mobile Design Book</strong></a> and my upcoming book on habits. Staying at a startup or a design agency in London, Amsterdam or New York I&#8217;d be making way more money but would not have the freedom to do things that really excite and inspire me.</p><p name=\"046c\" id=\"046c\" class=\"graf graf--p graf-after--p\">I&#8217;ve learned to stop collecting things or saving money for things I don&#8217;t really need, chasing expensive toys is not for me anymore, I wish you could let go of that idea of collecting things that simply tie you to one place and make your life more messy and complex.</p><p name=\"2efc\" id=\"2efc\" class=\"graf graf--p graf-after--p\">All of my belongings fit into a simple backpack, I&#8217;ve never had less stuff in my life, but never felt richer in my life at the same time.</p><h3 name=\"d311\" id=\"d311\" class=\"graf graf--h3 graf-after--p\">There is no right or&#160;wrong</h3><p name=\"26fd\" id=\"26fd\" class=\"graf graf--p graf-after--h3\">Nothing is completely good or completely bad. I&#8217;ve learned to give up my ego and really stop, observe and think before judging something. There is no right or wrong, traveling to many places and meeting people have taught me that what is right in Europe might be completely wrong in Asia such as putting whitening cream on your skin in Asia and putting tanning cream in Europe. Driving 7 people on a scooter and a dog and numerous of shopping bags are completely OK in Southeast Asia while here in Europe driving alone in a car is acceptable.</p><p name=\"0a49\" id=\"0a49\" class=\"graf graf--p graf-after--p\">I came to a conclusion that being right is no longer my goal, because there is simply no such thing, better focus on understanding people and empathising to connect with them on a deeper level, just because you have certain beliefs or habits or traditions it doesn&#8217;t make you right.</p><p name=\"2b36\" id=\"2b36\" class=\"graf graf--p graf-after--p\">When I stopped fighting for being right all the time I became happier, <strong class=\"markup--strong markup--p-strong\">things are the way they are and the only thing I can change about that is my attitude</strong>. Accepting things helped me to resonate with people, their values, stories and discover myself in a different perspective.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*3sV-mb35Bbszn_hpZFQq8g.jpeg\">A mandatory selfie with an ocean in the background for my freezing friends in&#160;Europe.<h3 name=\"2083\" id=\"2083\" class=\"graf graf--h3 graf-after--figure\">How it all&#160;started?</h3><p name=\"cebe\" id=\"cebe\" class=\"graf graf--p graf-after--h3\">Jon Yongfook published a great article on his experience living and <a href=\"http://yongfook.com/1-year-as-a-digital-nomad-how-to-build-a-business-by-the-beach.html\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">building a startup as a digital nomad for over a year</a>. His target budget a month was $2000. But, Jon has worked in Singapore for a long time, has a lot of experience and connections so for a young Northern European boy like me it may look like a very unreachable goal at the beginning.</p><p name=\"d295\" id=\"d295\" class=\"graf graf--p graf-after--p\">I&#8217;ve been working in London for over a year making much more than that but it depends a lot on the context, as many other things in life, so it&#8217;s hard to expect that traveling around the world you will easily make the same money as working on site in a studio located in London.</p><p name=\"0d66\" id=\"0d66\" class=\"graf graf--p graf-after--p\">If you are like me when I&#8217;ve started my journey&#8202;&#8212;&#8202;little to no experience, little to no connections, enormous passion for traveling, thirst of adventures and courage of losing or winning it all, then read on.</p><h3 name=\"c826\" id=\"c826\" class=\"graf graf--h3 graf-after--p\">Planning</h3><p name=\"119e\" id=\"119e\" class=\"graf graf--p graf-after--h3\">If you think there is a secret to cheap traveling and seeing the world on a tight budget, it must be a never-ending-planning. You can get amazing deals for flights, buses and trains as well as an accommodation if you book in advance.</p><p name=\"f5e2\" id=\"f5e2\" class=\"graf graf--p graf-after--p\">Browse <a href=\"http://www.airbnb.com/c/tlaurinavicius?s=8\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Airbnb</a> and book in advance to get the best deals. <a href=\"http://www.airbnb.com/c/tlaurinavicius?s=8\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Get $25 credit</strong></a> for your first trip on Airbnb; if you are leaving, you can also rent out your own place and make money while traveling, I know a guy who lived in China entirely from renting out his flat in Vilnius, Lithuania.</p><h4 name=\"18b7\" id=\"18b7\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Airline hacks</strong></h4><p name=\"5724\" id=\"5724\" class=\"graf graf--p graf-after--h4\">Below are flight search engines I&#8217;ve used to book cheap tickets to Dubai, Kuala Lumpur, Singapore, Bali, Ho Chi Minh, Los Angeles, New York, London and many other destinations.</p><p name=\"6eaa\" id=\"6eaa\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Pro tip:</strong> use incognito mode to avoid tracking cookies by airline companies and get cheaper flights.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*q6wI9cSlljAWOsWP3yRKpg.png\">Google Flights is a handy tool for getting the &#8220;big picture&#8221; of the available flights.<p name=\"54e1\" id=\"54e1\" class=\"graf graf--p graf-after--figure\"><a href=\"https://www.google.com/flights/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Google Flights</a>&#8202;&#8212;&#8202;great tool for getting the &#8220;big picture&#8221; of the available flights.</p><p name=\"b6f8\" id=\"b6f8\" class=\"graf graf--p graf-after--p\"><a href=\"http://www.momondo.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Momondo</a>&#8202;&#8212;&#8202;another useful tool that scans various booking websites and looks for the best offers.</p><p name=\"7ce9\" id=\"7ce9\" class=\"graf graf--p graf-after--p\"><a href=\"http://www.jetradar.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">JetRadar</a>&#8202;&#8212;&#8202;this tool, very similar to Momondo scans numerous of airline websites to find the best deal for you.</p><h3 name=\"9474\" id=\"9474\" class=\"graf graf--h3 graf-after--p\">Actual Costs</h3><p name=\"359d\" id=\"359d\" class=\"graf graf--p graf-after--h3\">Actual ticket cost: $222 for a direct flight from Stockholm (ARN) to Bangkok (BKK).</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*8KMaij5VIgubj6ttxNkOTg.jpeg\">$222 for a flight to Bangkok from Stockholm with Norwegian.<p name=\"0855\" id=\"0855\" class=\"graf graf--p graf-after--figure\">Try to get to one of these international/regional hubs like in Europe we have London that can fly you anywhere; New York or Los Angeles in the USA, in Southeast Asia it can be Kuala Lumpur, Singapore or Bangkok with cheap airlines like <a href=\"http://www.tigerair.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Tigerair</a>, <a href=\"http://www.airasia.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">AirAsia</a>, <a href=\"http://www.jetstar.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Jetstar</a> you can fly pretty much anywhere for under $100, if you have flexible dates you&#8217;ll even fit under the $50/flight group.</p><p name=\"05c9\" id=\"05c9\" class=\"graf graf--p graf-after--p\">The most expensive flights are from one continent to another. I&#8217;ve paid $598 for a one-way ticket from Ho Chi Minh City (Vietnam)&#8202;&#8212;&#8202;Tokyo (Japan)&#8202;&#8212;&#8202;Los Angeles (USA).</p><p name=\"5835\" id=\"5835\" class=\"graf graf--p graf-after--p\">Domestic flights are pretty cheap, I&#8217;ve paid $61 for a roundtrip from Bangkok (DMK)&#8202;&#8212;&#8202;Chiang Mai (CMX)&#8202;&#8212;&#8202;Bangkok (DMK) with AirAsia.</p><h4 name=\"e6bd\" id=\"e6bd\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">How to&#160;save?</strong></h4><p name=\"a0b4\" id=\"a0b4\" class=\"graf graf--p graf-after--h4\">When booking a room or a flight, make sure to uncheck everything airlines and hotels try to offer you by default (e.g. hotel, airport pick-up, car, insurance, priority boarding, meals, reserved seat, SMS confirmation, etc.).</p><h3 name=\"3724\" id=\"3724\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Packing</strong></h3><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*VcfPIQqVc32o-oRHiiAfPw.jpeg\">Everything I am packing for my next 9-month&#160;trip.<p name=\"e062\" id=\"e062\" class=\"graf graf--p graf-after--figure\">I&#8217;m a light traveler. I prefer to pack little and have a luxury of mobility and flexibility. It&#8217;s better to have a budget to buy something in case you need rather than carrying a huge luggage with you.</p><p name=\"9792\" id=\"9792\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Note</strong>: when flying or taking a long haul bus or train trip, have a sarong or wear long-sleeved top and pants as you can get cold quickly.</p><p name=\"ca0f\" id=\"ca0f\" class=\"graf graf--p graf-after--p\">Always pack the most necessary things for you travels, earlier I&#8217;ve written a <a href=\"https://medium.com/to-inspire/travel-packing-list-for-digital-nomads-503bab1560b9\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">packing list for digital nomads</a>, which has changed significantly as I have got rid of many things.</p><h3 name=\"f7ff\" id=\"f7ff\" class=\"graf graf--h3 graf-after--p\">Fees</h3><p name=\"0aaf\" id=\"0aaf\" class=\"graf graf--p graf-after--h3\">I&#8217;ve already spent hundreds of dollars in fees for my bank providers in Lithuania and the United Kingdom. Lloyds bank seems to be the worst choice ever when traveling, charging me for every single transaction.</p><p name=\"61ad\" id=\"61ad\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Bank fees.</strong> You will not avoid these, especially if you are going to travel and work at the same time, meaning that you will be getting money and cashing it out in different places and ATMs. Be prepared for these and calculate how much cash you need, take the most available at a time.</p><p name=\"da92\" id=\"da92\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Departure fees.</strong> When traveling in Asia make sure to research your destinations so you can find out how much visa costs, are there any other fees like departure fee. Leaving any airport in Indonesia you have to pay a certain fee. Even though fees are not super high they don&#8217;t accept credit cards which means if you have spent all of your cash you will have to go to the airport&#8217;s ATM and take the cash out and pay the fees again.</p><p name=\"162e\" id=\"162e\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Government taxes.</strong> In some countries in Southeast Asia, cafes and restaurants usually do not include service tax or government tax, so be prepared to add 10&#8211;25% to your final bill.</p><p name=\"87fa\" id=\"87fa\" class=\"graf graf--p graf-after--p\">In some countries like Indonesia, foreigners pay a higher price for services like gym membership just because they are foreigners. Might look quite racist at the first glance but makes sense once you find out how low local income is, so everyone can afford it, fair enough.</p><p name=\"4680\" id=\"4680\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Hidden VAT.</strong> In the USA many places show price without the VAT tax, so if you go to a supermarket and see a nice T-shirt for $15 it will be around $18 at the end with the VAT, depending on the state you&#8217;re in.</p><p name=\"f751\" id=\"f751\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Seat reservations.</strong> In Europe many trains require a seat reservation, meaning that buying the ticket from A to B doesn&#8217;t guarantee that you are going there, you need to reserve a seat for an additional fee. Very annoying but avoidable if you jump on the train last minute and pretend not to speak English when the conductor comes.</p><h3 name=\"fed8\" id=\"fed8\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Visas</strong></h3><p name=\"1e52\" id=\"1e52\" class=\"graf graf--p graf-after--h3\">In the summer of 2013 I&#8217;ve traveled around the Europe with my best friend <a href=\"https://twitter.com/JustasMarkus\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Justas Markus</a>. We had an idea of where to go and what to see but mostly our route was developing on the way. What we have experienced was the ease of entering a new country, the European Union has made moving from country to country so easy that visiting 13 countries we have never had to show our documents when crossing the border unless it was a flight.</p><p name=\"dbbf\" id=\"dbbf\" class=\"graf graf--p graf-after--p\">In the USA, the Middle East, and Southeast Asia the story is totally different. Unless you are from one of the Asian countries like Singapore, Japan, South Korea, you will have a lot of hassle getting visas and paying for them. Most countries like Indonesia, Thailand, Philippines, Singapore issue visa on arrival for free or a fixed fee, depending where you come from, but some countries require an invitation letter from the country like Vietnam, other countries take couple of weeks to process the visa (India).</p><h4 name=\"3f16\" id=\"3f16\" class=\"graf graf--h4 graf-after--p\">Visa costs for Lithuanians</h4><p name=\"8e45\" id=\"8e45\" class=\"graf graf--p graf-after--h4\">Visa on arrival in Indonesia for 30 days costs $35, you can do one more month extension for the same fee by going to the immigration bureau.</p><p name=\"4cce\" id=\"4cce\" class=\"graf graf--p graf-after--p\">Visa on arrival in Thailand for 15 days costs 1000 baht (~$30), 60-day tourist visa costs the same and can be issued at your own country&#8217;s Thai embassy.</p><p name=\"c3e7\" id=\"c3e7\" class=\"graf graf--p graf-after--p\">Visa on arrival is free in Singapore, Philippines, Malaysia and allows you to stay from 30 to 90 days depending on the country.</p><p name=\"7059\" id=\"7059\" class=\"graf graf--p graf-after--p\">For more accurate information about visas check the table showing how many countries you can visit with your country passport.</p><p name=\"d223\" id=\"d223\" class=\"graf graf--p graf-after--p\"><a href=\"https://en.wikipedia.org/wiki/Visa_requirements_for_Lithuanian_citizens\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Visa requirements for Lithuanian citizens</a></p><p name=\"fbf2\" id=\"fbf2\" class=\"graf graf--p graf-after--p\"><a href=\"https://en.wikipedia.org/wiki/Visa_requirements_for_United_States_citizens\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Visa requirements for United States citizens</a></p><p name=\"6575\" id=\"6575\" class=\"graf graf--p graf-after--p\"><a href=\"https://en.wikipedia.org/wiki/Visa_requirements_for_British_citizens\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Visa requirements for British citizens</a></p><h3 name=\"8111\" id=\"8111\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Accommodation</strong></h3><p name=\"c7fa\" id=\"c7fa\" class=\"graf graf--p graf-after--h3\">People are scared of going to new places because they don&#8217;t have home there. Finding accommodation on a budget might be really challenging in particular places, especially the ones loved by the tourists. To avoid high costs, choose places that are not in the area of touristic attractions and consider going in the low season. Below are some of the services I&#8217;ve used for finding an accommodation in different places in the world.</p><h4 name=\"bca8\" id=\"bca8\" class=\"graf graf--h4 graf-after--p\"><a href=\"http://www.agoda.com/\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Agoda</a></h4><p name=\"cfe9\" id=\"cfe9\" class=\"graf graf--p graf-after--h4\">Agoda lets you search hotels and hostels and offers very nice discounts, especially in Southeast Asia region.</p><h4 name=\"2346\" id=\"2346\" class=\"graf graf--h4 graf-after--p\"><a href=\"http://booking.com/\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Booking.com</a></h4><p name=\"7b58\" id=\"7b58\" class=\"graf graf--p graf-after--h4\">I loved using it in Bali, Kuala Lumpur and many places in Thailand as it shows prices with all the fees and service charges included as well as they don&#8217;t charge anything from your card, you just pay once you get there. Cancelation policy is super strict but if you certainly know you will stay there, it&#8217;s fine. However, check reviews and general ratings before making a final decision.</p><p name=\"30a7\" id=\"30a7\" class=\"graf graf--p graf-after--p\">During the low season in Bali, Malaysia and Thailand Booking.com had some pretty cool deals for 30&#8211;60% off, including this 3-star resort with a breathtaking ocean view.</p><h4 name=\"ec00\" id=\"ec00\" class=\"graf graf--h4 graf-after--p\"><a href=\"https://www.couchsurfing.com/\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Couchsurfing</a></h4><p name=\"ccea\" id=\"ccea\" class=\"graf graf--p graf-after--h4\">I&#8217;ve never used it in the USA or Asia to find an accommodation, but it worked for me and Justas couple of times in Europe and the Middle East (Dubai, UAE). It&#8217;s a great tool to meet up with locals, though. I&#8217;ve met so many cool people and travelers at the <a href=\"http://couchsurfing.meetup.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Couchsurfing meetup</a> in Budapest, Hungary.</p><h4 name=\"2daa\" id=\"2daa\" class=\"graf graf--h4 graf-after--p\">Airbnb</h4><p name=\"8eeb\" id=\"8eeb\" class=\"graf graf--p graf-after--h4\">It&#8217;s a cool service that connects locals renting their place with short or long-term travelers. Airbnb gets pretty expensive on high seasons and especially if you stay a night or two in one place and then book another one as fees add up quickly.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*BvbF6sZo3_ATmsMQ1tEh_w.jpeg\">Typical Balinese breakfast, Nasi Goreng with Sate&#160;Ayam.<p name=\"7430\" id=\"7430\" class=\"graf graf--p graf-after--figure\">What I do is simply set the rent duration to a month and get a special monthly price which has a better value and can get you places with swimming pool, breakfast included, free coffee/tea and room service every single day for $405/month.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/800/1*C6nC0AgteIvp9ccqgtGkvA.png\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/800/1*KQ2WKLBrG3SY-iXDawSqkg.png\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/800/1*QtryQ7_AA6J7pz13zf_ZJQ.png\">Gunung Merta Bungalows in Ubud, Bali, Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*sTjQb5gUOyye_mxEZvARmg.jpeg\">Chilling by the pool in Ubud, Bali, Indonesia.<p name=\"0356\" id=\"0356\" class=\"graf graf--p graf-after--figure\">If you have never used Airbnb, I highly recommend you to try it, use <a href=\"http://www.airbnb.co.uk/c/tlaurinavicius?s=8\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">this link to get $25 for your first stay</a>.</p><p name=\"ae67\" id=\"ae67\" class=\"graf graf--p graf-after--p\">Taxi costs around $0.17/km what makes it very affordable to go even longer distances.</p><h3 name=\"2a98\" id=\"2a98\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Food</strong></h3><p name=\"5177\" id=\"5177\" class=\"graf graf--p graf-after--h3\">One of the best thing about traveling is food unless you don&#8217;t like to eat. Trying out new food in different countries is extremely exciting, however not always end up very well, too sweet, too sour, too spicy, too stinky. Anyway, food in Thailand, Bali, Singapore is incredible. I just love everything I get there. And it&#8217;s also very cheap, eating out is cheaper than cooking by yourself and it saves you time buying groceries, storing food, preparing it and cleaning up afterward.</p><p name=\"3bc8\" id=\"3bc8\" class=\"graf graf--p graf-after--p\">A simple meal in Bali, Thailand, Vietnam can cost you from $1 to $3 depending on the place.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*VPEkQ5v-VNgrLcnt-Si3Kw.jpeg\">Sate Ayam, chicken satay with rice in Ubud, Bali, Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*QidGF6WRszyA5n-vsuby4g.jpeg\">Sea food feast in Krabi, Thailand.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*lD3kA4LqHeMs67A2-4aNFA.jpeg\">Delicious vegan food in Chiang Mai, Thailand.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*-ldcFXwxb8mOmdgTSvVH2A.jpeg\">Pad Thai in Koh Lanta, Thailand.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*pOcp9RnV0TAMb-rgUjsUnA.jpeg\">Light breakfast in Penang, Malaysia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*dBRhB5VhOgONDswWtmzqRw.jpeg\">Kopi Luwak is a part-digested coffee cherries eaten and defecated by the Asian palm civet. It&#8217;s the most expensive coffee in the world. My cup of coffee in Bali, Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*wtN8u6pQlotYdbi9Ao0CMw.jpeg\">Street food in Bangkok, Thailand.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*QqkJ8GBEFC4gptFRsUhBjw.jpeg\">Killer burger on my cheat day in Budapest, Hungary.<p name=\"4d38\" id=\"4d38\" class=\"graf graf--p graf-after--figure\">When traveling to cheaper countries in Eastern Europe, Southeast Asia, take advantage of eating out as it will conserve a lot of willpower that needs to be spent on cooking.</p><p name=\"d741\" id=\"d741\" class=\"graf graf--p graf-after--p\">In more expensive countries like most of the Europe, the United States or more developed countries in Asia like Singapore, Malaysia, Japan can be very expensive to eat out. If you have a tight budget, get some groceries at a local store and cook at home, if you want to try local food, make new friends and exchange dinners. On weekends or special occasions treat yourself with a dinner or lunch at a restaurant trying out local meals.</p><h3 name=\"abf2\" id=\"abf2\" class=\"graf graf--h3 graf-after--p\">Exercise</h3><p name=\"35b8\" id=\"35b8\" class=\"graf graf--p graf-after--h3\">Exercising for me personally is the best way to maintain a healthy happiness level and have a feeling of achievement at the end of the day. It improves the sleep quality, allows quick adjustment to the environment and clears my head. I&#8217;ve been regularly exercising for around 14 years now and hitting the gym or going for a run has been one of the daily activities while traveling around the world.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/800/1*A35xGTNLzDFt0L23CMc_xw.jpeg\">Playing basketball at the Green School in Bali, Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/800/1*qoZwzvrIPOXC0edWQVCNdA.jpeg\">Regular session at the gym in Singapore.<p name=\"1fcc\" id=\"1fcc\" class=\"graf graf--p graf-after--figure\">You should exercise no matter what kind of lifestyle you have or where you live, it has enormous benefits for your body as well as mentioned psychological benefits. Simply find something you really enjoy, whether it&#8217;s running, swimming, yoga, martial arts, body weight exercises, anything works as long as you break a sweat.</p><p name=\"5e0f\" id=\"5e0f\" class=\"graf graf--p graf-after--p\">Your mind is the limit, what your mind believes your body can achieve, if you are totally exhausted and you command yourself to do 10 pushups it will be definitely hard but if you truly believe it, picture yourself doing it, eventually you&#8217;ll find the energy and willpower to do it.</p><p name=\"f32d\" id=\"f32d\" class=\"graf graf--p graf-after--p\">Finding a gym is quite hard and can get pretty expensive if you&#8217;re staying short-term. For that reason use <a href=\"https://foursquare.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Foursquare</a> to find local gyms near you, even if it&#8217;s 2&#8211;3 km away from you, you have a chance to do a light warm-up and run to the place.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*zOu0EZ16w5OTcB3wtcrZTQ.jpeg\">Christmas day workout in Ho Chi Minh City,&#160;Vietnam.<p name=\"7f3b\" id=\"7f3b\" class=\"graf graf--p graf-after--figure\">To get better deals at local gyms, always negotiate, no matter where you go, always ask for a discount or a special offer. If that doesn&#8217;t work, google coupons for gyms in that area, or use deal websites like <a href=\"https://www.groupon.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Groupon</a> (I&#8217;ve got a 1-month membership at Gold&#8217;s Gym in Downtown Los Angeles for $19.99/month).</p><h3 name=\"5fd4\" id=\"5fd4\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Entertainment</strong></h3><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*ZI3A86_niW_Mz68Po3FP7w.jpeg\">The iconic Santa Monica beach in Los Angeles, California, USA.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*KbDBq9KdBXhqlDfIxrh8JQ.jpeg\">Partying at the Khaosan Road in Bangkok, Thailand.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*13IuF8VrALnTeHa6BeWy1A.jpeg\">Dubai from the observation deck of the tallest building in the world, Burj Khalifa in Dubai,&#160;UAE.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*aTG8ngze00CQ6-prx9trXQ.jpeg\">Batu Caves in Kuala Lumpur, Malaysia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*K6q4eqSmi2w9E9pZLKV3OQ.jpeg\">Lincoln Memorial in Washington DC,&#160;USA.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*c1i6d3AuE4qMjwHaw6qAmw.jpeg\">The Hollywood Hills in Los Angeles, California, USA.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*sVrjCU15Noj7Ad1CC-vslg.jpeg\">Tegalalang rice terrace near Ubud, Bali, Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*lLMIcm9ip0qXdRlnSpcRTA.jpeg\">Chilling on the Gili Air island in Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/800/1*AOU_7ZH7da9-n3O_dKfKdw.jpeg\">Eating a huge spider at Khaosan Road in Bangkok, Thailand.<p name=\"1dd6\" id=\"1dd6\" class=\"graf graf--p graf-after--figure\">Traveling is generally entertaining experience but you can make it even better by visiting local clubs, pubs, bars, concerts, exhibitions, sport games, cinemas, hiking spots, city tours, and other touristic stuff. Once again, do a quick research and find what people are talking about in a certain area. Personally, I prefer to immerse myself in fewer activities and get a deeper understanding of culture and people, rather than seeing everything on a surface level. I recommend checking guides on <a href=\"https://nomadlist.com/guides\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Nomad List</a>, checking traveling communities like <a href=\"http://www.tripadvisor.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">TripAdvisor</a>, <a href=\"http://www.lonelyplanet.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Lonely Planet</a>, and <a href=\"http://www.travelfish.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Travelfish</a>.</p><h3 name=\"f1c9\" id=\"f1c9\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Meeting up with&#160;people</strong></h3><p name=\"e610\" id=\"e610\" class=\"graf graf--p graf-after--h3\">Traveling and just seeing places gets pretty boring after some time (I&#8217;ve been there, done that). Missing out on meeting new people and making friends is a complete failure of traveling in general. At the very beginning it is very scary because you are in a new place, you don&#8217;t know the language, history, traditions, but you will be surprised if you start a conversation with a stranger. I&#8217;ve made hundreds of friends throughout my travels and now coming back to one or another country I have someone I know to ask out for a coffee.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*pgMqRCIHOCuvlWD5EA3i0Q.jpeg\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*B3I3M3pBHNwkiarJ8mHKGg.jpeg\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*M_qJW6PiDAiyH4QIRa8PrA.jpeg\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*n9CzluNHUKOeWB7x3Ws4yw.jpeg\">Meeting people all around the world, Ubud, New York, Ho Chi Minh City,&#160;Sanur.<p name=\"7d64\" id=\"7d64\" class=\"graf graf--p graf-after--figure\">If you are more introverted you will find it very difficult and alienating to make new connections. However, nowadays our technology is bridging the gap between you and incredible people you want to meet. I&#8217;ve been meeting people in the bars, cafes, co-working spaces, conferences, tech events and meetups. Some of the platforms I&#8217;ve been using lately: <a href=\"http://www.startuptravels.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Startuptravels</a>, <a href=\"http://www.meetup.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Meetup</a>, <a href=\"https://www.couchsurfing.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Couchsurfing</a>, <a href=\"http://startupweekend.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Startup Weekend</a>, <a href=\"https://twitter.com/tomaslau\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Twitter</a>, <a href=\"https://www.facebook.com/groups/FREE.NOMADS/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Facebook groups</a>.</p><h3 name=\"6474\" id=\"6474\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Travel inspiration</strong></h3><p name=\"15a2\" id=\"15a2\" class=\"graf graf--p graf-after--h3\">When I heard the term &#8220;digital nomad&#8221; I didn&#8217;t really understand what it meant. However, following people like <a href=\"https://levels.io/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Pieter Levels</a>, <a href=\"http://yongfook.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Jon Yongfook</a>, <a href=\"http://www.noeltock.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Noel Tock</a> and <a href=\"http://www.jacoblaukaitis.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Jacob Laukaitis</a>, I&#8217;ve started to develop a taste of how cool and challenging this lifestyle can be. If you truly want to change your lifestyle and find ways to redesign your life, make sure to find these indirect mentors that share everything and inspire you to move forward.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*BPR4hGEPZTdfn47RSIbqVA.jpeg\">Digital nomad lifestyle brings you anywhere, &#8220;Too fast to sleep&#8221;, 24/7/365 open library and a coffee shop for&#160;example.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*-Zrv4eM2BDxpll_NU1NDzA.jpeg\">Once you become a digital nomad, you can work from anywhere, including this resort in Alcoy, the Philippines.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*revnyIZKkH56B4nFIjGXBQ.jpeg\">Working from a restaurant in Ubud, Bali, Indonesia.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*X0ZC9pM1J5qehmF3OqmVzg.jpeg\">The SEA co-working space in Phuket, Thailand.<p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*vxvDpY_a7MjnZUBxhfnSwg.jpeg\">Usual nomad&#8217;s workspace, a caf&#233; in Chiang Mai, Thailand.<p name=\"d8de\" id=\"d8de\" class=\"graf graf--p graf-after--figure\">You can easily find a convenient place to get the job done by simply googling or using before mentioned <a href=\"https://foursquare.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Foursquare</a>. Some other handy websites are <a href=\"http://workfrom.co/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Workfrom</a>, <a href=\"https://nomadlist.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Nomad List</a> for finding a coworking space. Check <a href=\"http://despreneur.com/10-hottest-hubs-co-working-spaces-in-south-east-asia/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">10 hottest hubs and co-working spaces</a> in Southeast Asia.</p><h3 name=\"f33b\" id=\"f33b\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Conclusion</strong></h3><p name=\"5a96\" id=\"5a96\" class=\"graf graf--p graf-after--h3\">You will find yourself. You will discover what is your life purpose is. You will see the good and the bad, and the main difference between these two. You will enjoy every single day. You will live in the moment. You will appreciate real people. You will experience love, for yourself, for the world, family, friends, a stranger next to you, love for being alive. You will learn about the world, about many things that scared you. You will become stronger, more confident, more alive, energised to become the greatest, you will want to create more, you will be more mindful, you will be more aware of the world around you, you will start making solutions to problems, you will realise that it&#8217;s not about you, you will give more than you take, you will be happy with what you have, you will expect nothing and appreciate everything.</p><blockquote name=\"9268\" id=\"9268\" class=\"graf graf--pullquote graf-after--p\">Subscribe to <a href=\"http://tomaslau.us4.list-manage.com/subscribe?u=248e16af753b2d09ada0d5d45&amp;id=f5b19cfcef\" class=\"markup--anchor markup--pullquote-anchor\" rel=\"noopener nofollow\" target=\"_blank\"><strong class=\"markup--strong markup--pullquote-strong\">my email list</strong></a> for more inspiring stories.</blockquote><p name=\"6df2\" id=\"6df2\" class=\"graf graf--p graf-after--pullquote\">I hope you&#8217;ve enjoyed my story. Please share it with your friends and let me know if you have any questions about becoming independent and designing your own lifestyle.</p><p class=\"aspectRatioPlaceholder-fill\"></p><a href=\"http://bit.ly/2wJfG1Q\" class=\"graf-imageAnchor\" rel=\"nofollow\"><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*0DRkqQ6A7AbqyX8fDc1MtQ@2x.jpeg\"></a></div>","title":"Traveling Around The Globe With a Budget of $1000/Month"}},"pageContext":{"id":"5b937b1e87be056953db7d20"}}