{"data":{"mongodbDatabaseArticles":{"id":"5b95ea9c87be05832748ffbc","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/staciinterview04.jpg\" alt=\"Schwarz family in from of the Amber Palace in Jaipur\"><br> Yesterday in Buenos Aires, I had lunch with a family of digital nomads. They&#8217;ve been on the road since 2008 working on software and app development all over the world (their son was born in Mexico). The wife, Kelli, asked if I met a lot of families traveling on the road. &#8220;Of course! These days, there are a lot,&#8221; I said. </p><p>When I started traveling the world, taking your kids out of school for a year away was weird and social suicide. Now, I think there is a big support community online and hundreds of blogs to provide encouragement and help families make the leap.</p><p>It was funny she asked that because today we are doing a family profile on the blog. I want to share the story of Staci, Mason, and their kids. They&#8217;re a middle-class family from Iowa that set out on a round-the-world trip. Today, they tell us how they did it and share their advice for other families out there!</p><p><strong>Nomadic Matt: Tell everyone about yourself.</strong><br> <strong>Staci:</strong> We are the Schwarz family. My name is Staci, my husband is Mason, and our kids are Ian (19) and Lily (16). We live in Des Moines, Iowa, and are traveling the world together for about 4&#189; months. (It&#8217;s the first time out of the country for my husband and kids!) In our previous lives, I was a pricing analyst and Mason was a printing press operator.</p><p><strong>Why did you and your family decide to do this trip?</strong><br> Four years ago, I read the book <a href=\"http://www.amazon.com/gp/product/0684836017/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0684836017&amp;linkCode=as2&amp;tag=nommatstrasit-20&amp;linkId=EBO57C37TI2F6MQD\" rel=\"nofollow\">One Year Off</a> by David Cohen about how he and his wife sold their home and took their three children on a one-year trip around the world, and I could not get over it. I told my husband I wanted to do something similar, and with NO hesitation, he said yes. His mom died unexpectedly [when she was] not much older than we are now, and that really affects the decisions we make to <a href=\"https://www.nomadicmatt.com/travel-blogs/there-is-no-tomorrow-in-travel/\">not put things off</a>, assuming we have plenty of time to get around to doing them.</p><p><strong>How are you funding this trip?</strong><br> We saved for almost four years <a href=\"https://www.nomadicmatt.com/travel-blogs/cut-your-expenses/\">by doing basic things like cutting back on entertainment and eating out</a>. We went through our house and garage and sold a ridiculous amount of stuff that we didn&#8217;t need or use &#8212; we had a book sale where we sold 700 books. 700! We also used some of our retirement savings. We have found that this seriously freaks people out, but we look at it this way: we are young and have a lot of time to work. We firmly believe that investing our money in a life-changing experience is a far better use of it.</p><p><img src=\"https://media.nomadicmatt.com/staciinterview06.jpg\" alt=\"Schwarz family on Mediterranean gulet cruise\"></p><p><strong>What did your friends and family think?</strong><br> There were some mixed responses. Because we talked about it for so long, I think there was a sense of doubt about whether we would really follow through, but once <a href=\"https://www.nomadicmatt.com/travel-blogs/the-day-i-quit/\">we quit our jobs</a> and <a href=\"https://www.nomadicmatt.com/travel-blogs/booking-a-cheap-airfare-online/\">booked tickets</a>, all of our friends were incredibly excited and supportive. We couldn&#8217;t have asked for a better support system. Our parents were concerned about some of the places on our itinerary (namely Turkey), and we do have a couple of family members <a href=\"https://www.nomadicmatt.com/travel-blogs/unsupportive-friends-and-family/\">who think that it was downright stupid and irresponsible for us to quit our jobs to travel</a>. And that&#8217;s OK. Not everyone is going to understand or support every life decision we make.</p><p><strong>Did you change anyone&#8217;s mind now that they see you&#8217;re traveling and just fine?</strong><br> Well, the couple of people who thought we were stupid when we left still think we are stupid. I think my mom has had the biggest change of heart. She was really worried about the places we were going and just fretted about our safety, but as we&#8217;ve been traveling and posting pictures and blogs about our experiences, she has gotten really excited about traveling the world and has started a list of places she wants to see. She was so inspired by our day at the <a href=\"https://www.nomadicmatt.com/travel-blogs/thailand-elephant-conservation/\">Elephant Nature Park in Chiang Mai</a> that she wants to go volunteer there for a week. My parents have never left the US, and I love seeing her so <a href=\"https://www.nomadicmatt.com/get-inspired-travel/\">inspired and excited about traveling</a>.</p><p><strong>What did you do about school? Are you doing classes remotely?</strong><br> Ian was able to take a training program at a technical school in welding and finished his certificate a few weeks before we left, but Lily&#8217;s school offered to let her take her junior year online. We were really relieved about this, since we were all a little concerned about homeschooling on the road. This was a big concern for Lily &#8212; probably the one thing that initially kept her from getting really excited about the trip &#8212; so once that fell into place, she was able to stop worrying and get excited about the travel. She has been able to work at her own pace through the coursework, which has been great, because we don&#8217;t always have good, reliable Internet connection everywhere we have been.</p><p><img src=\"https://media.nomadicmatt.com/staciinterview01.jpg\" alt=\"travelers at a cooking class in Chiang Mai Thailand\"></p><p><strong>What&#8217;s been the hardest part so far?</strong><br> There have been a few hard parts. Our first few days were really difficult. Just simple things like finding food or figuring out how to get around was a challenge. Lily and I did not adjust well at all, and we both cried a lot. We look back now and it&#8217;s amazing how comfortable we have become with moving to new places. I&#8217;ve seen so much growth in my kids in their confidence and ability to figure out new environments and situations. It&#8217;s really cool to see.</p><p>Also India. India was HARD &#8212; so many people, so much pollution, so much poverty. Garbage everywhere, people up in your space all the time. We were ill prepared. A friend told me &#8220;India isn&#8217;t for everyone, but give it a little time.&#8221; It was good advice. I&#8217;m still not sure India was for us, but we&#8217;re glad we went. It was definitely unlike anything we have ever experienced. We were completely overwhelmed the entire time we were there.</p><p><strong>What advice do you have for other families doing this?</strong><br> If you want to do it, you absolutely can make it happen. <a href=\"https://www.nomadicmatt.com/travel-blogs/myths-family-travel/\">People make all sorts of excuses about why they can&#8217;t travel</a>, but if we could make it happen, then really anyone can. It&#8217;s just a matter of deciding how badly you want it and then making it a priority. The time we have spent together on this trip has brought us so close as a family, and watching my kids discover the beauty and magic of travel has deepened my own experience and made it so much richer.</p><p>People will say to us, &#8220;You are so lucky to be able to take this trip.&#8221; I don&#8217;t believe this is true. We worked really hard toward this goal. We made it happen. And if we can do it then, seriously, anyone can. That&#8217;s not to say it was easy &#8212; we aren&#8217;t the most disciplined people in the world. It just means if you want it bad enough, you&#8217;ll do what it takes to make it happen.</p><p><img src=\"https://media.nomadicmatt.com/staciinterview02.jpg\" alt=\"female traveler bathing a Thai elephant\"></p><p><strong>What&#8217;s been your favorite moment so far?</strong><br> This will vary depending on who you ask in our family. Lily says that she really loved the cooking class we took in Chiang Mai. In Varanasi, Mason sat down and talked with a group of kids playing cricket and had a really cool moment just connecting with them. For me, I would say the <a href=\"https://www.nomadicmatt.com/travel-guides/cambodia-travel-tips/angkor-wat/\">temples at Angkor</a> have been the most moving, but if I am being honest &#8212; and slightly cheesy &#8212; my favorite moments are when we are all sitting around talking about what we did that day or where we are going the next day and we are completely undistracted by the overstuffed schedules and obligations we have back home. This time together is precious to me.</p><p><strong>Why do you think fewer families do this? Were there any big obstacles that got in your way in the beginning?</strong><br> I think a lot of families are concerned about the cost and the amount of time spent together. <a href=\"https://www.nomadicmatt.com/save-for-trip-advice/\">Cost was always an obstacle for us</a>, and we ended up postponing the trip for a year so we could save more and have a better budget to fund our travel. The kids got a lot of astonishment from their friends along the lines of &#8220;how will you spend that much time with your family without killing each other?&#8221; We haven&#8217;t found this to be an issue. Other than some moments where we are a little grouchy with one another &#8212; which happens at home too &#8212; we have gotten along great.</p><p>That being said, if you don&#8217;t enjoy each other&#8217;s company at home, long-term travel might be difficult. But we&#8217;ve had to learn to work together as a team to handle things like travel days. And once we got stuck on a mountain for 12 hours, so we had to take care of one another, and those things have brought us closer as a family. Although admittedly, we were a pretty tight family to begin with.</p><p><img src=\"https://media.nomadicmatt.com/staciinterview08.jpg\" alt=\"Lily at the Blue Mosque in Istanbul\"></p><p><strong>What do your kids think about this experience?</strong><br> Well, I asked them right now and this was their reply:</p><p>&#8220;It&#8217;s been eye opening. It&#8217;s hard to take it all in while you are doing it, and it just seems like &#8216;this is my life today.&#8217; We think people expect us to say it is life changing, but we don&#8217;t feel that yet. It&#8217;s too hard to explain to people at home what it feels like to sit on a temple and listen to Buddhist prayers for an hour and explain that experience in a way that people will understand.&#8221;</p><p><strong>When you were planning this big trip, what were some of the fears you had?</strong><br> I am a big fat worrywart. I fret about EVERYTHING, so I would lie in bed at night and think of all of the possible things that could go wrong to the point where I was making myself crazy. <a href=\"https://www.nomadicmatt.com/travel-blogs/14-ways-to-be-prepared-for-anything-while-traveling/\">Safety was my biggest fear</a>. If you believe the news, the world is a horrible, awful place where everyone is trying to kill you and nowhere is safe. We have found the truth to be so fundamentally different. People are full of kindness and hospitality, and we have been well taken care of in our travels by perfect strangers.</p><p><img src=\"https://media.nomadicmatt.com/staciinterview05.jpg\" alt=\"Schwarz family at Red Fort in Dehli, India\"><br> <strong>What are two things about travel you&#8217;ve learned that have made you go, &#8220;Wow, it&#8217;s that simple, huh?!&#8221;?</strong></p><ol><li>The vast discrepancy between what we are told on the news and what is actually happening on the ground. Everyone was terrified of us being in Turkey, but Turkey was where we had the most positive experiences with people. People went far out of their way to make us feel welcome, safe, and cared for. They definitely have impacted our hearts and our trip in the most positive way, and we look back on our time there and are so moved by the people we met.</li></ol><ol start=\"2\"><li>How many people speak English and how well. We thought communication would be a huge obstacle for us, but it has literally been a nonissue. Everywhere we have gone, people have spoken great English, and we have never had an issue arise due to miscommunication.</li></ol><p></p>****When I speak at consumer shows and at conferences, the feasibility of a family traveling the world always comes up. Is it safe? Is it affordable? How do you educate your kids? I hope stories like this show that family travel is a feasible and inspire you to<a></a><p>When I speak at consumer shows and at conferences, the feasibility of a family traveling the world always comes up. Is it safe? Is it affordable? How do you educate your kids? I hope stories like this show that family travel is a feasible and inspire you to <a href=\"https://www.nomadicmatt.com/travel-blogs/category/family-travel-2/\"> start planning your own trip</a> </p></div>","title":"Why this Family Took Their Teens on an Epic RTW Adventure"}},"pageContext":{"id":"5b95ea9c87be05832748ffbc"}}