{"data":{"mongodbDatabaseArticles":{"id":"5b93834087be056953db7e42","content":"<div><h1 name=\"e115\" id=\"e115\" class=\"graf graf--h3 graf-after--figure graf--title\">I found my ideal lifestyle by working&#160;remotely</h1><p name=\"2253\" id=\"2253\" class=\"graf graf--p graf-after--h3\">At the start of 2014, I decided I need to make some changes in my life. I was working in an office in one of the coolest startups in Cape Town. I have worked in an office pretty much all of my career. I was also commuting to work and back, taking about an hour and a half of my day. Commuting has always been part of work for me too.</p><p name=\"a712\" id=\"a712\" class=\"graf graf--p graf-after--p\">I have a beautiful family; my wife who works from home and away on weekends shooting as a wedding photographer, my four year old son and my my baby daughter, who had just been born.</p><p name=\"5ec5\" id=\"5ec5\" class=\"graf graf--p graf-after--p\">I live in a far flung suburb of Cape Town, Muizenberg which is a famous and well known surf spot. My house is right next to the ocean, and ever since living here, surfing had become my favourite past time. I love being out in the ocean, close to nature. I love the physical and meditative aspects of surfing. After a great surfing session my body is tired but content, my mind is at ease.</p><p name=\"b34a\" id=\"b34a\" class=\"graf graf--p graf-after--p\">I loved my job, but after three years at the company, I felt a need to explore something new. I also felt that I haven&#8217;t been living the life that I wanted. I was working too hard and not spending enough time with my family. Not spending enough time surfing. I loved my work, always have, but I could never get used to the sharp divide between work and the &#8216;rest&#8217; of your life.</p><h3 name=\"9e25\" id=\"9e25\" class=\"graf graf--h3 graf-after--p\">The daily&#160;grind</h3><p name=\"8f76\" id=\"8f76\" class=\"graf graf--p graf-after--h3\">I would leave the house early in the morning to rush to work. I would return at night, hoping the perhaps catch my children before they went to bed. Often, I would miss them, missing out on what happened throughout their day. Being unable to help out my wife, she often had to take care of them by herself all day.</p><p name=\"f7d3\" id=\"f7d3\" class=\"graf graf--p graf-after--p\">There were lots of days where I would leave for work in the morning, driving past the ocean, spotting amazing waves that I wished I could surf, but knowing I can&#8217;t.</p><p name=\"7ff0\" id=\"7ff0\" class=\"graf graf--p graf-after--p\">There would always be a few souls out there though. I always wondered about those people. Did they not work? Most of them where probably young, had no responsibilities. They could choose to surf, not have to worry about supporting their dependents, enjoy the moment. I was doomed to a different fate. Or was I?</p><h3 name=\"f679\" id=\"f679\" class=\"graf graf--h3 graf-after--p\">Work vs&#160;Life</h3><p name=\"47b4\" id=\"47b4\" class=\"graf graf--p graf-after--h3\">This might sound familiar to a lot of people. We just accept this as a fact of life. Your work eats into the rest of your life, you have to structure everything else around it. Everything else goes into the &#8216;gaps&#8217;; weekends or what you have left of your evening during the week.</p><p name=\"9407\" id=\"9407\" class=\"graf graf--p graf-after--p\">But sometimes work even eats into that. The odd Saturday spent at work to meet a deadline never gets balanced out by taking it easy on a Monday morning, except if you resort to dubious behaviour like calling in &#8216;sick&#8217;.</p><h3 name=\"c4ba\" id=\"c4ba\" class=\"graf graf--h3 graf-after--p\">An Escape?</h3><p name=\"e79d\" id=\"e79d\" class=\"graf graf--p graf-after--h3\">But it doesn&#8217;t need to be this way. I love my work, and my life outside of work, but why should the one detract from the other? Why can&#8217;t I have the best of both? I want to love my work without feeling guilty about not being with my family and unhappy because I don&#8217;t have time for doing other things I love.</p><p name=\"bc08\" id=\"bc08\" class=\"graf graf--p graf-after--p\">Why make this distinction between what you call work and what you call life. Can&#8217;t it all just be living?</p><p name=\"9515\" id=\"9515\" class=\"graf graf--p graf-after--p\">Remote working felt like the answer. I knew that I would love to work remotely, but for the right kind of company. Remote working had gotten somewhat of a bad rap in some places, but I have always thought that fault lay not with the idea of having a distributed team, but the culture of the company surrounding it.</p><p name=\"71a8\" id=\"71a8\" class=\"graf graf--p graf-after--p\">To expand my outlook, I read two amazing books: <a href=\"http://www.amazon.com/gp/product/0804137501/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0804137501&amp;linkCode=as2&amp;tag=httpwwwnavelg-20&amp;linkId=ND44WJ5HTGD3CA33\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Remote</a> by 37signals and <a href=\"http://www.amazon.com/gp/product/1118660633/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1118660633&amp;linkCode=as2&amp;tag=httpwwwnavelg-20&amp;linkId=MRSMH7BGLFY35QAR\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">The Year Without Pants</a>, by Scott Berkun. From these books I learned that for a fully remote company to succeed, remote working has to be baked in the fabric of the organisation.</p><h3 name=\"a34c\" id=\"a34c\" class=\"graf graf--h3 graf-after--p\">The principles of remote&#160;working</h3><p name=\"dd6c\" id=\"dd6c\" class=\"graf graf--p graf-after--h3\">There are certain thing that might be lacking in traditional office environments, and not make a big difference or even be noticed at all, but will be end up being deadly to distributed teams. Communication is super, super important. So is a culture of mutual trust and respect. Being transparent in how you run your business makes sure that everyone can be on the same page at the same time.</p><p name=\"e729\" id=\"e729\" class=\"graf graf--p graf-after--p\">So when I decided take the leap, to free myself from the shackles of an office and commuting and to give remote working the chance it fully deserves, I knew that it had to be with just the right company.</p><h3 name=\"997a\" id=\"997a\" class=\"graf graf--h3 graf-after--p\">Buffer</h3><p name=\"48c5\" id=\"48c5\" class=\"graf graf--p graf-after--h3\">I was already a big fan of Buffer at the time. I loved the product and used it often. I was also intrigued by the company. I remember being impressed by the way they handled a pretty bad hacking <a href=\"http://open.bufferapp.com/buffer-has-been-hacked-here-is-whats-going-on/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">incident</a>. Most companies in these situations tend to clam up, leaving users in the dark. Buffer was open about the whole situation, kept everyone in the loop and managed to turn a bad situation on it&#8217;s head, by providing <a href=\"https://open.bufferapp.com/buffer-has-been-hacked-here-is-whats-going-on/#comment-1098600630\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">amazing customer service</a>. I was hooked.</p><p name=\"1852\" id=\"1852\" class=\"graf graf--p graf-after--p\">And so I was delighted learn that they were a fully distributed team, with team members scattered across time zones, all over the world. I learned about their values and how they <a href=\"http://joel.is/the-joys-and-benefits-of-working-as-a-distributed-team/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">embraced being a distributed team</a>. I knew then I didn&#8217;t just want to work remotely, I wanted to work at Buffer.</p><h3 name=\"4253\" id=\"4253\" class=\"graf graf--h3 graf-after--p\">Getting the&#160;job</h3><p name=\"04be\" id=\"04be\" class=\"graf graf--p graf-after--h3\">I spent about a week writing an intro email to apply for the backend hacker position that was open. I remember agonising about every sentence, really trying to get it right. Reading it again now made me smile, it was probably too long, but there was so much I wanted to say. I really wanted to convey that I was up to it, and how much I wanted to work for Buffer.</p><p name=\"2e82\" id=\"2e82\" class=\"graf graf--p graf-after--p\">I remember being really happy when Sunil responded to my mail and we set up our first interview. Even though I was a bit nervous, I saw this as an opportunity to find out if Buffer lived up to my expectations as well. And I wasn&#8217;t disappointed. Through the interview process I became more and more convinced that this is where I belong. I remembered being blown away by how smart, open and honest everyone was.</p><p name=\"f21a\" id=\"f21a\" class=\"graf graf--p graf-after--p\">So I met with Sunil, Joel and Leo. I still think that Leo was the nicest person I&#8217;ve encountered in an interview, I didn&#8217;t even feel like an interview but a light and fun conversation. And then I got the good news: I was invited to join Buffer in my 45 day Bootcamp! That was a good day &#9786;</p><h3 name=\"c0c8\" id=\"c0c8\" class=\"graf graf--h3 graf-after--p\">Adjusting</h3><p name=\"2dd8\" id=\"2dd8\" class=\"graf graf--p graf-after--h3\">Going from working in an office to working remotely full time is not easy. Self discipline becomes super important. You have learn a whole new set of skills that &#8216;normal&#8217; office workers don&#8217;t always need to have. You have more responsibility, it feels much more like running your own little company.</p><p name=\"df90\" id=\"df90\" class=\"graf graf--p graf-after--p\">But being in a great distributed team with a bunch of sensitive and understanding people helps a lot. One of Buffer&#8217;s core values is to focus on self improvement. For someone who&#8217;s never worked remotely, no-one expects you to be perfect at it right away. Struggling is OK, as long as you keep trying to find ways of improving. And improvement is much easier and natural in a relaxed and welcoming environment.</p><p name=\"7662\" id=\"7662\" class=\"graf graf--p graf-after--p\">What did I struggle with most? Structuring my time and communication.</p><p name=\"06f8\" id=\"06f8\" class=\"graf graf--p graf-after--p\">I thought that it might be hard to stay productive at home. That happens sometimes, but for me the problem was often that I could be productive enough, but not working on the right things.</p><p name=\"0f03\" id=\"0f03\" class=\"graf graf--p graf-after--p\">This leads back to communication. When you&#8217;re working in an office and everyone goes to work at the same time, communication is really easy, almost to the point where people take it for granted. When you&#8217;re working with a distributed team of people in timezones across the world, communication becomes the most important thing.</p><h3 name=\"24b2\" id=\"24b2\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Designing your&#160;life</strong></h3><p name=\"6adf\" id=\"6adf\" class=\"graf graf--p graf-after--h3\">One of the greatest and most fascinating aspect of working remotely in a company where you get to manage your time is the freedom an power to design the structure of your days and weeks. This is also one of the most challenging things!</p><p name=\"5292\" id=\"5292\" class=\"graf graf--p graf-after--p\">Unlike a conventional work life, you are in charge. You set your own hours and make decisions on when to work and how to structure your day yourself. But you also have to be mindful of this. It&#8217;s really easy to develop bad habits when you don&#8217;t have a &#8216;boss&#8217; checking up on you. I have found that sticking to a routine helps, but it&#8217;s also great that the routine can be flexible.</p><p name=\"7ece\" id=\"7ece\" class=\"graf graf--p graf-after--p\">The trick is finding that balance, sticking to a stable routine each day, with added flexibility to deal with unexpected curve balls that life throws at you.</p><p name=\"9060\" id=\"9060\" class=\"graf graf--p graf-after--p\">My word day themes</p><p name=\"cc58\" id=\"cc58\" class=\"graf graf--p graf-after--p\">I like to think of it as if my days and weeks have a &#8216;theme&#8217;. This has started out more or less based on a 8&#8211;5 conventional work day when I started, but over time I&#8217;ve been able to tweak it to fit my life naturally.</p><p name=\"1e6f\" id=\"1e6f\" class=\"graf graf--p graf-after--p\">Here is what a typical theme for a work day looks like:</p><p name=\"74cc\" id=\"74cc\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Monday to Friday</strong>: Get up early, around 6:25 am. If the waves are looking good, I usually ask my wife to take the kids to school, so I help them get dressed, fed and ready for school. When she leaves to take them, I go surfing.</p><p name=\"f665\" id=\"f665\" class=\"graf graf--p graf-after--p\">If the waves aren&#8217;t good, I take the kids. I get back and can generally get to work just after 9am. If during the day the waves improve, I can get out in the water during the day for an hour or so, sometimes longer.</p><p name=\"712d\" id=\"712d\" class=\"graf graf--p graf-after--p\">Now I&#8217;ll usually work until lunch, then prepare a home cooked meal or perhaps go for a walk for a bit coffee. Some days, to get out of the house I might spend a few hours in a coffee shop.</p><p name=\"d36e\" id=\"d36e\" class=\"graf graf--p graf-after--p\">If I went surfing in the morning, I&#8217;ll go fetch the kids from school in the afternoon.</p><p name=\"4157\" id=\"4157\" class=\"graf graf--p graf-after--p\">I generally stop working around 5:30 for dinner with the family and bath/play and bed time for the kids. This is the craziest part of the day, but I also enjoy this time the most. I get to bond with my family, chat about our days and just be silly with my kids.</p><p name=\"edd3\" id=\"edd3\" class=\"graf graf--p graf-after--p\">After the kids are in bed, I&#8217;ll usually hop on for an hour or so, just to finish up any loose ends and catch up with team mates in later time zones.</p><p name=\"525b\" id=\"525b\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Weekends: </strong>I might work on weekends, but never at the expense of family time or other things that might crop up. I tend to think of weekend work as finishing up something that I really wanted to get done during the week, fixing something urgent or just fun work that I haven&#8217;t gotten a chance to do. Very often a weekend goes by where I don&#8217;t touch my computer.</p><p name=\"6e03\" id=\"6e03\" class=\"graf graf--p graf-after--p\">Surprisingly, my days ended up looking very similar to my pre-remote life. However the few small tweaks I was was able to make let&#8217;s me pair my work theme perfectly with my life.</p><h3 name=\"3a5a\" id=\"3a5a\" class=\"graf graf--h3 graf-after--p\">One year&#160;in</h3><p name=\"362f\" id=\"362f\" class=\"graf graf--p graf-after--h3\">I&#8217;ve been at Buffer for almost a year now, shy a few days. My overwhelming feeling is that I never want to go back to working non-remote. In a year&#8217;s time, this way of working has become so ingrained and natural that I find it hard to imagine any other way.</p><p name=\"efba\" id=\"efba\" class=\"graf graf--p graf-after--p\">Over the last century, we as a society have become conditioned to think that our work should always come first at the expense of the rest of our lives. We can&#8217;t choose one over the other. I think ideas like remote working and distributed teams are opening our eyes to a whole new world of possibilities, where we can fit work into our lives in a way that makes sense to us and be happy and productive at the same time.</p><p name=\"f12d\" id=\"f12d\" class=\"graf graf--p graf-after--p\">If, like I did, you&#8217;re feeling stuck in rut and it seems like your work rules your life, I hope this post will encourage you to look at your situation, not feel powerless to change things, to challenge the status quo. We are all in charge of our own happiness, and the world is changing in ways that gives us the power to shape our lives like never before.</p><p name=\"3a5d\" id=\"3a5d\" class=\"graf graf--p graf-after--p\">I hope you can find your ideal lifestyle and live happy!</p><p name=\"0953\" id=\"0953\" class=\"graf graf--p graf-after--p graf--trailing\">Interested in remote working? I help run <a href=\"https://twitter.com/wannaremote\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">curated Twitter feed </a>of remote working posts. You should follow us!</p></div>","title":"How I found my ideal lifestyle through working remotely"}},"pageContext":{"id":"5b93834087be056953db7e42"}}