{"data":{"mongodbDatabaseArticles":{"id":"5b9382fb87be056953db7e14","content":"<div><p name=\"97eb\" id=\"97eb\" class=\"graf graf--p graf--leading\">One of the most frequent complaints about Chromecast has been that it doesn&#8217;t come with a remote control, requiring users to fiddle with their phone even if they just want to pause a program for a few seconds. Well, complain no more: A recent update to Google&#8217;s streaming stick has added the ability to pause and resume playback with any old TV remote control (hat tip <a href=\"http://www.reddit.com/r/Chromecast/comments/2z23gq/hdmicec_can_pauseplay_youtube_any_others/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">to Reddit/r/chromecast</a>).</p><p name=\"dd36\" id=\"dd36\" class=\"graf graf--p graf-after--p\">This new feature is possible due to Chromecast&#8217;s use of HDMI-CEC, an extension of the HDMI protocol that&#8217;s capable of sending control commands back and forth between your TV and any attached device. HDMI-CEC is what allows your TV remote to control your Blu-ray player, and Chromecast has been using it since day one to turn on your TV and switch inputs whenever you start to cast media to the dongle&#8202;&#8212;&#8202;something I&#8217;ve called <a href=\"https://gigaom.com/2013/07/24/chromecast-hdmi-cec/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Chromecast&#8217;s secret weapon</a> when the device was first released a little less than two years ago.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*gSAEyE2SnfzX2_u4Sh45nA.jpeg\">I know, John, I couldn&#8217;t believe it either. Playback via Chromecast, paused with my old TV remote&#160;control.<p name=\"5f66\" id=\"5f66\" class=\"graf graf--p graf-after--figure\">Pause and resume functionality for HDMI-CEC was added to Chromecast with the latest 27946 firmware update. Your mileage may vary based on whether your TV actually supports CEC, but I&#8217;ve successfully tested it with YouTube. Folks on Reddit are reporting that it also works with apps like WatchESPN, HBO Go, Allcast, iPlayer, TuneIn, Plex and others.</p><p name=\"5abe\" id=\"5abe\" class=\"graf graf--p graf-after--p\">Player state is reported back to your mobile device, so you can pause playback with your remote control and resume it with your phone if you feel like it. However, there seem to be some apps that don&#8217;t support this latest functionality yet, with Netflix being one of them.</p><p name=\"773a\" id=\"773a\" class=\"graf graf--p graf-after--p graf--trailing\">Adding remote control capabilities to Chromecast is great news for existing Chromecast users, but there&#8217;s another reason why Google may have chosen to enable this now: Android TV devices, some of which are starting to reach shelves this spring, also support casting via Google Cast, and most of these devices come with a traditional TV remote control. Not being able to use that remote to control media played back via Google Cast would have been confusing. Adding support for all kinds of standards-compliant remote controls may just have been the easiest way to make this work for Android TVs and beyond.</p></div>","title":"Chromecast now works with your TV’s remote control – Janko Roettgers – Medium"}},"pageContext":{"id":"5b9382fb87be056953db7e14"}}