{"data":{"mongodbDatabaseArticles":{"id":"5b95ee3a87be0583274900d1","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Foreign ATM Fee Solution &#8211; Banking Abroad</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>There were a million things to consider before we moved to Thailand, and one that was foremost in our minds was how we were going to cost effectively access our money with the hope of avoiding the dreaded foreign ATM fee. Here is our best recommendation for coming out on top against the greedy banksters!</p>\n<p><strong></strong></p>\n<h2><p>What is a Foreign ATM Fee?</p></h2>\n<p>Simply put, a foreign ATM fee is a charge that banks slam you with for using an ATM outside of their home country.</p>\n<p>We had heard horror stories about the outrageous fees imposed by US based banks on foreign ATM withdrawals. This is actually slapped on top of the fee charged by each individual ATM, which happens to be 150 baht ($5 USD) a pop in Thailand. We found that most US banks charge an average 3% foreign ATM fee on each withdrawal.<br>\n</p>\n<p>For example, if we were to withdrawal $500 to pay our rent, we would be slammed with a $15 foreign transaction fee plus the $5 ATM withdrawal fee. That&#8217;s a whopping $20 in fees just to access our own money. And because we rarely are able to pay with a credit card (Thailand is a predominantly cash based economy) we need to make a second withdrawal of $700 to cover our various living expenses. That is $46 a month &#8211; a minimum of <strong>$552 a year in fees</strong> &#8211; if we used a bank that didn&#8217;t have our best interests in mind! </p>\n<p>If you&#8217;re truly on a budget, $554 in yearly fees isn&#8217;t something that you can just simply shrug your shoulders at. Luckily, we found a way to avoid this headache completely.</p>\n<p>After doing a few hours of research, we came across the <a title=\"Open an Account Here\" href=\"http://www.schwab.com/public/schwab/banking_lending/checking_account/checking_account_faqs\" target=\"_blank\">Charles Schwab High Yield Investor Checking Account</a>. As far as we could gather they were (and still are) the only bank that would not impose a foreign ATM fee.&#160; And get this&#8230;they actually reimburse you for every withdrawal fee levied by ATMs on an unlimited amount withdrawals. During our first month here, when we frequented the ATM five times or more for various reasons trying to settle in, we were absolutely slammed with fees. We made sure to use our Charles Schwab ATM/Debit card for every transaction and at the end of the month noticed we had been reimbursed for each withdrawal for a total of $35.71 back in our pockets. We couldn&#8217;t believe it. We surely expected that we would be stuck eating the bill for at least one or two of the transactions, but we were quickly proven wrong.</p>\n<h2><p>Things to Consider When Choosing a Bank For Your Needs Abroad:</p></h2>\n<ul>\n<li><p>Monthly service fees</p></li>\n<li><p>Minimum account balance</p></li>\n<li><p>Overdraft protection fees</p></li>\n<li><p>Interest earnings</p></li>\n<li><p>Foreign ATM Fee reimbursement</p></li>\n<li><p>Options for depositing money</p></li>\n<li><p>Quality of customer service</p></li>\n</ul>\n<p>Charles Schwab Bank has easily checked these boxes for us so far. Remember, this is not just for the people who would like to live abroad on a permanent basis, but also for the backpacker, weekend traveler, or the couple that takes the vacation abroad once a year.</p>\n<p><strong>NOTE:</strong> This type of account must be opened with a free Charles Schwab Brokerage Account. No worries though, as you are not ever required to actually use it. Our account has remained dormant since we opened the account about a year ago. </p>\n<h2><p>Common Sense Money Tips While Traveling Abroad:</p></h2>\n<ul>\n<li><p>Withdraw your limit each time you visit the ATM, especially if you don&#8217;t know when you might have access to an ATM again</p></li>\n<li><p>Have a backup bank account with a separate ATM card in the case that your primary account card is lost or stolen</p></li>\n<li><p>Have a backup credit card that does not charge foreign transaction fees e.g. The Capital One Venture Card</p></li>\n<li><p>If you have a large amount of money that you don&#8217;t intend to use, keep what you won&#8217;t be using in a high yield checking/savings account e.g. The Capital One High Yield Checking Account</p></li>\n<li><p>Keep up with the current daily exchange rate</p></li>\n<li><p>Monitor all of your accounts for any signs of fraud or identity theft</p></li>\n<li><p>Always notify your banks and/or credit card companies of the dates and location(s) of your upcoming travel. Don&#8217;t get stuck with empty pockets and frozen account for an unknown period of time!</p></li>\n</ul>\n<p>Please pass this on. As discussed here, you could really be saving someone you know a ton of money and helping them to avoid a major headache! Know of any other money-saving tips for others traveling abroad? Please share you knowledge in the comment section below!</p>\n<p><strong>NOTE: </strong>We are in no way compensated for this post, nor are we in an agreement with Charles Schwab Bank or Capital One Bank. We are satisfied customers that would like to spread the word to anyone who is looking to travel overseas and is concerned about accessing their money intelligently and cheaply.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Foreign ATM Fee Solution – Banking Abroad"}},"pageContext":{"id":"5b95ee3a87be0583274900d1"}}