{"data":{"mongodbDatabaseArticles":{"id":"5b937b2987be056953db7d2e","content":"<div><p name=\"8219\" id=\"8219\" class=\"graf graf--p graf--leading\"><strong class=\"markup--strong markup--p-strong\">Things You Should Know Before Flying with Children</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*JvPslx8x4zbvVXjK0WZlBw.jpeg\"><p name=\"8315\" id=\"8315\" class=\"graf graf--p graf-after--figure\">There are not many things I am an expert on, but flying alone with children is one. Given I travel from San Francisco to Boston with three kids on a regular basis gives me some legit street cred. So, if you want some tips, listen up.</p><p name=\"799a\" id=\"799a\" class=\"graf graf--p graf-after--p\">First, a quick background: I&#8217;ve started flying alone with each of my children when they were three months old. Perhaps some of my most challenging flights were when they were 3 months, 2 years and 4 years old. Today, at 6, 8 and 10, they fly not only cross-country but cross-continent without missing a beat. I no longer sweat profusely&#8202;&#8212;&#8202;or get jammed in small bathrooms while pregnant trying to change a diaper. So, before I forget all those little pearls of wisdom I&#8217;ve learned (or earned) along the way, here they are:</p><p name=\"314c\" id=\"314c\" class=\"graf graf--p graf-after--p\">1. If you have a spouse or family member taking you to the airport, ask for a gate pass. The airline worker will complain but they will give it to you. This will mean you will not have to put your infant on the floor as you struggle to take off your boots (because you have not yet learned being stylish and traveling with children do not go together). Your husband will be forced to watch the children while you browse for magazines or pee way more times than you really need, just so you can be alone. And if you don&#8217;t have someone with you, ask for a gate assist. You will then be whisked with an airline official pleased for some time away from the complainers at check-in to go blissfully through the security line ahead of everyone else. (By the way, the gate assist doesn&#8217;t work with kids as old as mine, but my husband still gets a gate pass every time. He is so grateful.)</p><h4 name=\"728c\" id=\"728c\" class=\"graf graf--h4 graf-after--p\">2. Get a stroller specifically for airline travel. Make it as cheap as possible. It will be ruined no matter what you&#160;do.</h4><p name=\"f580\" id=\"f580\" class=\"graf graf--p graf-after--h4\">3. Don&#8217;t bother changing your baby&#8217;s diaper. She will poop on the plane, likely diarrhea. And don&#8217;t forget to pack extra clothes for your 6 year old. He may decide to pee his pants for no apparent reason half-way over the Atlantic.</p><h4 name=\"193b\" id=\"193b\" class=\"graf graf--h4 graf-after--p\">4. Don&#8217;t bother packing snacks. Your kids will want to buy snacks. Surviving air travel is all about novelty not nutrition.</h4><p name=\"b750\" id=\"b750\" class=\"graf graf--p graf-after--h4\">5. Embrace screens of all sorts. Fly on planes with screens. Let your children use your iPhone, iPod, iAnything. But watch out for Cartoon Network at night. I learned the hard way just how adult &#8220;Adult Swim&#8221; is. <strong class=\"markup--strong markup--p-strong\">(Here I have to give a shout out to Virgin America for having both Disney and free on-demand kid movies! Virgin, if you are listening, you can thank me with some free flights!)</strong></p><p name=\"12e6\" id=\"12e6\" class=\"graf graf--p graf-after--p\">6. Sit in the very back row. Sure, it will smell bad but so will your kids. And if you are in the very back you can get drinks and snacks quickly and flight attendants will even hold your baby while you pee.</p><h4 name=\"ccf1\" id=\"ccf1\" class=\"graf graf--h4 graf-after--p\">7. Speaking of pee, if it is just pee go ahead and change the baby on the seat. Be sneaky about it but seriously just do it. It&#8217;s worth the&#160;risk.</h4><p name=\"b826\" id=\"b826\" class=\"graf graf--p graf-after--h4\">8. Never get your children cups with ice in them. Ask for a can of apple juice with a small straw, or get a water in a coffee cup with a small straw. Spills will still happen but at least they will be quicker to clean. And if you have a baby, don&#8217;t hesitate to whip out your boob. Who cares who sees? An hour of sleep is worth giving a peep show to your neighbors. You&#8217;ll all leave satisfied.</p><p name=\"cd79\" id=\"cd79\" class=\"graf graf--p graf-after--p\">9. You can get away with having your child on your lap until he is about three, not the mandated two. Just tell him not to talk (and bribe him with some food or screen time to make sure he complies) and it will all be OK. And if your kid is small, try for 4!</p><p name=\"69ca\" id=\"69ca\" class=\"graf graf--p graf-after--p\">10. Take red eyes whenever you can. They aren&#8217;t comfortable but they are often cheap and your kids will sleep (eventually, after giving you the stink eye 100 or so times). Yes, there is a certain horror to getting on a plane at 10 p.m. but I am here to tell you it&#8217;s OK. You might even sleep a bit yourself. And face it, you&#8217;re a parent. Your eyes are red already.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*k6PzkHezXoPTY3GAduOuPQ.jpeg\"><p name=\"6eb1\" id=\"6eb1\" class=\"graf graf--p graf-after--figure graf--trailing\">Do you have other travel tips to share? Please post them here. Medium has a lot of great code and design how-to&#8217;s out there&#8230;let&#8217;s get some more parenting self-help in the mix! And please give me a follow if you don&#8217;t mind!</p></div>","title":"Things You Should Know Before Flying with Children – Future Travel"}},"pageContext":{"id":"5b937b2987be056953db7d2e"}}