{"data":{"mongodbDatabaseArticles":{"id":"5b96295087be058327491181","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What I was up to other than here:</h2><ul><li>This week was so busy from 4th of July parties, seeing old friends, visiting family, and the USA women&#8217;s soccer game, and it was a blast!</li><li>I gave some tips about <span><a href=\"http://www.amexessentials.com/the-best-of-india-by-travel-bloggers/\" target=\"_blank\">luxury lodging in India</a></span><span><a href=\"http://bindiandjeans.com/electronics-and-apps-for-the-frequent-traveler/\" target=\"_blank\">electronics and apps for the frequent traveler</a></span></li></ul><h1>Now your story,</h1><p>The longer I stay in India the more it surprises me and the less I understand it. I would to just tell a scene I saw that combined so many different types of India all together and for some reason just made me smile.</p><p>I was at Thalassa, a popular restaurant in Vagator. Before the night ends they have shows: a smoking hot fire dancer in skimpy clothes, two Russian girls who dance to party music, and lastly the boys doing Greek dancing. It&#8217;s a bit of a party place, but also a place for a nice dinner.</p><p>I was observing the family at a table next to me.</p><p>The young girl of the family was in jeans and t-shirt and was dancing like no one was watching while drinking a glass of Sangria. Her dad sat at the table not bothered. The mom was in an Indian pantsuit, which is fairly traditional for a place like Thalassa. She was also drinking Sangria and seemed a little tipsy. Then there was the grandmother, looking very traditional in a saree.. drinking one cocktail after another!</p><p>I don&#8217;t know why it made me smile so much, but it was just one of those moments that I was so surprised by. Like, even my grandma wouldn&#8217;t go to Thalassa and drink a cocktail&#8230; so to see a strict looking Indian grandma partying at Thalassa, singing along to the words of the Hindi songs in a saree was a reminder I don&#8217;t know India at all!</p><p>&#160;</p><h1>This is India!</h1><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on&#160;<a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>,&#160;<a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>,&#160;<a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a>&#160;&amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p>feature image: <a href=\"https://www.flickr.com/photos/nithiclicks/16941248075\" target=\"_blank\">sunset</a></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! 58"}},"pageContext":{"id":"5b96295087be058327491181"}}