{"data":{"mongodbDatabaseArticles":{"id":"5b937af587be056953db7cf9","content":"<div><h1 name=\"6669\" id=\"6669\" class=\"graf graf--h3 graf--leading graf--title\">The Dark Side of Digital Nomad Life, Going Beyond Bad Guru Techniques</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*8PGFicc1vuzPcgtXL0JRDA.jpeg\">These men may seem like harmless, badly dressed doofuses but the truth is far more sinister.<p name=\"2553\" id=\"2553\" class=\"graf graf--p graf-after--figure\">I have a confession to make and I owe you an apology. Last week, <a href=\"https://medium.com/@nicholasbarang/why-i-never-use-co-working-spaces-as-a-digital-nomad-and-why-you-might-not-want-to-either-2c3cfa9a6999#.7mocmhmiz\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">I wrote about co-working spaces</a> and why I don&#8217;t use them. In that article I made a huge mistake and this week, I need to address it. Sadly, this is no laughing matter.</p><p name=\"573b\" id=\"573b\" class=\"graf graf--p graf-after--p\">I started writing this column as a reaction to the endless stream of low quality material written about &#8220;digital nomad lifestyles&#8221; and it&#8217;s good to know that many of you are equally sick of being told about how you can &#8220;live like a boss for $300 a month!&#8221; this is, of course, only true if your boss lives in a cardboard box under a bridge and raids other people&#8217;s trash for their food.</p><p name=\"9096\" id=\"9096\" class=\"graf graf--p graf-after--p\">This material does have an upside. It provides me with an endless pile of stuff to poke fun at. Who can&#8217;t help but laugh at the earnest &#8220;guru&#8221; detailing their trip to Kuala Lumpur and expressing shock at paying $10, that&#8217;s 10 whole dollars folks, for a meal for two? While still claiming to be &#8220;crushing it&#8221; and living the life of their dreams? I had never realized that so many people aspire to malnutrition and a boring diet until I started reading digital nomad lifestyle tips.</p><p name=\"8f89\" id=\"8f89\" class=\"graf graf--p graf-after--p\">The same &#8220;guru&#8221; also says that they don&#8217;t like Kuala Lumpur because it has no co-working spaces. That probably explains why it&#8217;s one of my favorite cities in Asia. It&#8217;s a multi-cultural wonderland where nearly everyone speaks four languages (English, Malay, Putonghua and at least one Indian language) and every part of the city has its own unique identity. It has awesome nightlife, plenty of cultural expeditions, fireflies on the river and no &#8220;official&#8221; digital nomad scene&#8202;&#8212;&#8202;it really couldn&#8217;t be any better if it tried.</p><p name=\"e576\" id=\"e576\" class=\"graf graf--p graf-after--p\">In last week&#8217;s column, I decided to make fun of a pair of &#8220;gurus&#8221; from the United States who had moved to Chiang Mai so that they could consider a $5 pizza a luxury beyond their meager budget. This was my mistake.</p><h3 name=\"1a85\" id=\"1a85\" class=\"graf graf--h3 graf-after--p\">Travis and Aaron Atlas&#8202;&#8212;&#8202;What I Knew&#160;Then</h3><p name=\"6721\" id=\"6721\" class=\"graf graf--p graf-after--h3\">Travis and Aaron Atlas are identical twins hailing from Indiana in the United States of America. They moved to Chiang Mai in the latter half of 2016. Before they set sail for Thailand this pair of hard-working industrious adults, don&#8217;t let their picture fool you folks, these guys are in their mid-40s, had achieved precisely nothing with their lives.</p><p name=\"6fc7\" id=\"6fc7\" class=\"graf graf--p graf-after--p\">They were living in a garage at their parent&#8217;s house. Neither had a job nor a profession. Their aim in life was to live off welfare and do as little as possible. I&#8217;m not criticizing that decision, it would have been best for everybody if they had stuck to that.</p><p name=\"524d\" id=\"524d\" class=\"graf graf--p graf-after--p\">Travis Atlas had another dream though. He&#8217;d been following Johnny FD on the internet, one of Chiang Mai&#8217;s &#8220;elder-statesman gurus&#8221;, and aspired to be just like him. We&#8217;ll be taking a look at Johnny in another article on another day&#8202;&#8212;&#8202;there&#8217;s a lot more to Johnny than meets the eye and much of it is out of keeping with his publicly projected image. But I digress.</p><p name=\"27c8\" id=\"27c8\" class=\"graf graf--p graf-after--p\">When the brothers arrived in Chiang Mai, they decided to follow the Johnny&#8217;s footsteps, selling aspirational lifestyle junk to would-be digital nomads without having anything of value to sell. After all, if it works for one guy, why wouldn&#8217;t it work for them?</p><p name=\"01ae\" id=\"01ae\" class=\"graf graf--p graf-after--p\">So Digital Nomad Campus was born. For $1,500 a month you could come and &#8220;learn&#8221; how to be a digital nomad from two guys who regularly recorded videos on being broke in Chiang Mai. The video of Aaron Atlas praying for God to feed him when his cash ran out is especially instructional in setting realistic expectations of what people could hope to gain for their investment in this &#8220;training&#8221;.</p><p name=\"03cc\" id=\"03cc\" class=\"graf graf--p graf-after--p\">While Aaron Atlas seemed to spend most of his time recording inane videos, without topping his brother&#8217;s achievement of pretending to be a white rapper to introduce his school of stupidity, Travis was rather more industrious.</p><p name=\"9e97\" id=\"9e97\" class=\"graf graf--p graf-after--p\">He landed himself a job as an English teacher. As Travis has no qualifications, experience or indeed aptitude for teaching English&#8202;&#8212;&#8202;it should come as no surprise that this wasn&#8217;t a legal position but rather one of the many jobs that are filled by foreigners, in language schools across Asia, illegally.</p><p name=\"a57e\" id=\"a57e\" class=\"graf graf--p graf-after--p\">Travis also fancied himself as an author. Where Aaron claimed to be an author despite not having so much as a 400 word SEO fluff piece to his name, Travis went right ahead and wrote a short book entitled &#8220;10 Keys to Becoming a Digital Nomad&#8221; and while this book is absolutely dreadful in content and language, it is an honest endeavor which didn&#8217;t come at a ridiculous price tag of $1,500 but rather $2.99. Even though $2.99 is too much, it should have allowed a smart person to evaluate what they would get for placing $1,500 in his sweaty paw.</p><p name=\"f5d5\" id=\"f5d5\" class=\"graf graf--p graf-after--p\">They also managed to land 5 paying suckers for their $1,500 a month course. Though, none of these suckers paid $1,500 because as it is with all of these low-quality ventures they needed a &#8220;bait and switch&#8221; routine to fool future customers and these 5 folks each coughed up the princely sum of &#8220;only&#8221; $300 each to learn how to be a digital nomad from a guy who appears to have done no paid work at all and a guy working as an illegal English teacher.</p><p name=\"cb63\" id=\"cb63\" class=\"graf graf--p graf-after--p\">Now, I know that some of you will argue, so what? Isn&#8217;t this the digital nomad dream? Turning up on foreign shores with no money and building a business empire anyway?</p><p name=\"2503\" id=\"2503\" class=\"graf graf--p graf-after--p\">I&#8217;m just going to say that it&#8217;s not my dream. I don&#8217;t want to be associated with a scene that makes its money bilking the gullible. That&#8217;s as challenging as shooting fish in a barrel but far more embarrassing. Is that what you really stand for? A complete lack of ethics? Selling people any old rubbish just so you can get your hands on their stash?</p><p name=\"454f\" id=\"454f\" class=\"graf graf--p graf-after--p\">Don&#8217;t answer that. If you asked &#8220;so what?&#8221; in the first place; we know where you stand, sadly.</p><p name=\"78b2\" id=\"78b2\" class=\"graf graf--p graf-after--p\">None of this, however, is cause for a lynch mob or for these two chancers to be run out of town. As I said before, this is what I knew about the Atlas brothers when I wrote the article last week.</p><h3 name=\"d9e6\" id=\"d9e6\" class=\"graf graf--h3 graf-after--p\">Travis and Aaron Hankins&#8202;&#8212;&#8202;What We Know&#160;Now</h3><p name=\"6778\" id=\"6778\" class=\"graf graf--p graf-after--h3\">I&#8217;m not the only one in the digital nomad life to be tired of being tarnished by the behavior of people like those in the Chiang Mai guru scene. That&#8217;s obvious in the reads, likes and shares of my articles and it&#8217;s also obvious in the growing willingness of some people to challenge the way these people operate in a public space.</p><p name=\"c995\" id=\"c995\" class=\"graf graf--p graf-after--p\">And so it came to be for the Atlas brothers. Their posts in groups around Chiang Mai came under some scrutiny, logically so&#8202;&#8212;&#8202;when somebody is asking you to hand them $1,500, right? This attention was also pretty mild&#8202;&#8212;&#8202;a few people concluding that &#8220;Digital Nomad Campus&#8221; was for all intents and purposes the worst value since betting on the &#8220;British Remain campaign&#8221; and &#8220;Hillary Clinton to win the US Presidential election&#8221; double.</p><p name=\"1243\" id=\"1243\" class=\"graf graf--p graf-after--p\">This didn&#8217;t make Travis and Aaron very happy. In typical low value internet marketer fashion, instead of ignoring these comments, they went ballistic instead. Threats were made. Angry tirades were unleashed. Meetings were held.</p><p name=\"75a6\" id=\"75a6\" class=\"graf graf--p graf-after--p\">But this is the Internet and this is the stuff of everyday disputes everywhere, right? Well, that was my mistake and it might be yours too.</p><p name=\"2743\" id=\"2743\" class=\"graf graf--p graf-after--p\">I believe in forgiveness. I believe that each and every one of us has made mistakes in our lives. It&#8217;s part of what makes us human. My natural inclination to forgive has brought me a fair amount of trouble in life but I don&#8217;t regret that in the slightest. I&#8217;ve always felt that people deserve a second chance in life and a third if necessary (though they may not get that third chance from me, if they burn the second one) and I&#8217;ll live with the fallout from it.</p><p name=\"e900\" id=\"e900\" class=\"graf graf--p graf-after--p\">However, I also think that there are some things which are beyond forgiveness and I strongly feel that if you want forgiveness, you have to be trying to change your ways. Travis and Aaron managed to strike through any capacity for forgiveness by what was revealed next.</p><p name=\"13d1\" id=\"13d1\" class=\"graf graf--p graf-after--p\">The first revelations were pretty minor. The two claimed they&#8217;d been running a successful real estate business in Indiana, despite living in their parents&#8217; garage, it turned out&#8202;&#8212;&#8202;unsurprisingly&#8202;&#8212;&#8202;that this wasn&#8217;t true. There was a real estate company of the same name but that company was registered in a different state and had no association with them.</p><p name=\"27d3\" id=\"27d3\" class=\"graf graf--p graf-after--p\">It also came to light that Travis and Aaron&#8217;s real name was not Atlas but rather Hankins.</p><p name=\"ff53\" id=\"ff53\" class=\"graf graf--p graf-after--p\">It transpired that Travis might have tried to run on the Republican ticket for Congress. Probably because if you&#8217;re going to live on state welfare, why not make it a big check rather than a small one?</p><p name=\"1774\" id=\"1774\" class=\"graf graf--p graf-after--p\">Of all the claims here, I&#8217;m going to say that I&#8217;m dubious about this information, the Travis Hankins who ran for congress has a picture on his Wikipedia page and he bears very little physical resemblance to the Travis Hankins who arrived in Chiang Mai. It&#8217;s not impossible that they&#8217;re the same guy but apart from the coincidence of having the same name in the same location, it just seems unlikely.</p><p name=\"f375\" id=\"f375\" class=\"graf graf--p graf-after--p\">All of this is pretty petty stuff. Who cares in the scheme of things? People make mistakes and can earn forgiveness. In an internet age where even the smallest mistake can haunt someone for a lifetime is it any wonder that so many people adopt a second identity?</p><p name=\"6fe4\" id=\"6fe4\" class=\"graf graf--p graf-after--p\">If it had stopped here, it would have been a storm in a tea cup and this article would have been about something completely different.</p><h3 name=\"dff5\" id=\"dff5\" class=\"graf graf--h3 graf-after--p\">Rape Allegations</h3><p name=\"c454\" id=\"c454\" class=\"graf graf--p graf-after--h3\">Then the first shock arrived. Several people in the Hankins&#8217; brothers hometown claimed that the brothers had been involved in a series of rapes and that they&#8217;d used their local connections to avoid prosecution and punishment.</p><p name=\"08de\" id=\"08de\" class=\"graf graf--p graf-after--p\">Now, it needs to be stressed that these are allegations rather than conviction records. If this had been the only sign that the Hankins brothers were not what they claimed to be, it would have been hard to feel that it was appropriate to take any action against them.</p><p name=\"9049\" id=\"9049\" class=\"graf graf--p graf-after--p\">I don&#8217;t like the statement &#8220;there&#8217;s no smoke without fire&#8221; whoever wrote it has never seen a dry ice machine in a disco. Sometimes there is smoke without fire.</p><p name=\"8bb5\" id=\"8bb5\" class=\"graf graf--p graf-after--p\">However, it wasn&#8217;t me that discovered these allegations and they were published online anyway. The next step in the process brought some clarity regarding these claims.</p><p name=\"d1a4\" id=\"d1a4\" class=\"graf graf--p graf-after--p\">I was then contacted, privately, by someone who knew two girls at the school Travis worked in and both of them claimed to have been sexually assaulted by him. I encouraged the person who contacted me to take the allegations forward to the school to deal with. They did and the school did deal with it.</p><p name=\"1533\" id=\"1533\" class=\"graf graf--p graf-after--p\">To their credit the school immediately dismissed Travis Hankins from their employ. They also reported his actions to the police.</p><p name=\"468c\" id=\"468c\" class=\"graf graf--p graf-after--p\">In the Chiang Mai digital nomad group on Facebook, the revelations from America had given several nomads in Chiang Mai the courage to speak up and say that they&#8217;d been harassed or assaulted by Aaron Hankins.</p><h3 name=\"b7a9\" id=\"b7a9\" class=\"graf graf--h3 graf-after--p\">Rape Confession</h3><p name=\"ef84\" id=\"ef84\" class=\"graf graf--p graf-after--h3\">If this wasn&#8217;t enough to be certain that these two men were not the usual harmless scammers that infest the waters of digital nomadism&#8202;&#8212;&#8202;a pair of videos came to light that were truly disturbing. These videos and some other material released by the brothers have been neatly summarized by <a href=\"https://www.youtube.com/watch?v=J7mznfK9_ok\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Sebastian Johnsson over on YouTube and you can watch the video at this link.</a></p><p name=\"f32a\" id=\"f32a\" class=\"graf graf--p graf-after--p\">In the first video Aaron smiles for the camera and says; &#8220;I&#8217;m telling you guys, always grab a girl&#8217;s booty first if you want to have sex&#8230; every time I&#8217;ve grabbed a girl&#8217;s booty first&#8230; you know it&#8217;s always worked out pretty well. They also give you &#8220;false resistance&#8221; so just keep pushing. Don&#8217;t worry about it. Smile&#8230; at the end of the day they&#8217;ll thank you and say &#8216;Oh, you make me happy,&#8217;&#8221;</p><p name=\"9528\" id=\"9528\" class=\"graf graf--p graf-after--p\">Pretty creepy, right?</p><p name=\"24c0\" id=\"24c0\" class=\"graf graf--p graf-after--p\">But that wasn&#8217;t enough for Aaron. He needed to spell it out on camera. In his next confessional video he went further:</p><p name=\"5c53\" id=\"5c53\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;You just gotta wait until you can isolate and get them alone. So then, you take them to a quiet place or a dark place or a secluded place and then you make your move. Most likely you just take them back to your bedroom and there&#8217;s going to be like this little token resistance&#8230; AND THAT&#8217;S WHAT HAPPENED LAST NIGHT&#8230; but it&#8217;s fake. So, don&#8217;t even worry about that. That&#8217;s just the little game that these girls have to play, unfortunately man.&#8221;</p><p name=\"0859\" id=\"0859\" class=\"graf graf--p graf-after--p\">That is a direct confession to rape. This isn&#8217;t the overactive imagination of other people. This is Aaron Atlas confessing to raping someone and teaching other people how to be a rapist.</p><p name=\"d96c\" id=\"d96c\" class=\"graf graf--p graf-after--p\">These two videos were apparently shot during the time the two brothers were in Brazil. That means that it&#8217;s not just Chiang Mai and the United States where a trail of victims can be found in their wake.</p><h3 name=\"d27c\" id=\"d27c\" class=\"graf graf--h3 graf-after--p\">Even Creepier&#8202;&#8212;&#8202;Male Prostitution</h3><p name=\"1e70\" id=\"1e70\" class=\"graf graf--p graf-after--h3\">What&#8217;s the best possible profession for a self-confessed rapist? Well, Aaron Hankins thought that it would be &#8220;male prostitute&#8221;. In another one of his appalling videos he can be found trying to sell his body to older Brazilian women. He specified that he&#8217;s looking for somebody in their 50s and that they can eat together and talk together before they pay him for sex. What a charmer.</p><h3 name=\"ab7e\" id=\"ab7e\" class=\"graf graf--h3 graf-after--p\">Charitable Fraud</h3><p name=\"35b4\" id=\"35b4\" class=\"graf graf--p graf-after--h3\">There is also an article about a charitable fraud perpetuated by these two less than lovely gentleman in Spain. Apparently and once again unsurprisingly, they ran out of money during their escapades in the Southern European nation and decided that it would be a good idea to raise money by pretending to represent a charity there. They e-mailed thousands of people to solicit donations which then went into their own bank accounts.</p><h3 name=\"ead6\" id=\"ead6\" class=\"graf graf--h3 graf-after--p\">One Last Desperate Attempt to Rescue&#160;Things</h3><p name=\"3f0f\" id=\"3f0f\" class=\"graf graf--p graf-after--h3\">The shocking revelations about the Hankins brothers led several decent members of the digital nomad community to want to confront them, in a non-violent manner, at a public meeting which was to be held last Sunday. The meeting, as with all the brothers&#8217; meetings, was designed to be a &#8220;gateway drug&#8221; for their Digital Nomad Campus offering.</p><p name=\"87aa\" id=\"87aa\" class=\"graf graf--p graf-after--p\">They regularly claimed that 80+ people attend these meetings. Yet, ignoring the three people who turned up to talk to the Hankins&#8217; brothers about the allegations, there were only two people in attendance waiting for them. This moment was captured on video by one of the three digital nomads who went to talk to Travis.</p><p name=\"81f2\" id=\"81f2\" class=\"graf graf--p graf-after--p\">Sadly, they didn&#8217;t capture the next part. Travis did arrive for the meeting but quickly drove away when he realized that he might not be able to talk his way out of things this time. No conversation was had between Travis and either the confronting nomads or his two unwitting victims.</p><p name=\"8647\" id=\"8647\" class=\"graf graf--p graf-after--p\">Instead of seeing the writing on the wall at this point in time, they decided to up the ante. What do wounded animals do when they&#8217;re cornered? They strike out.</p><p name=\"502a\" id=\"502a\" class=\"graf graf--p graf-after--p\">They called another public meeting. This time to debate the position of leadership held by their now &#8220;fallen in their eyes, former hero&#8221; Johnny FD.</p><p name=\"8ea5\" id=\"8ea5\" class=\"graf graf--p graf-after--p\">Now, it&#8217;s fair to say that I&#8217;m no fan of Johnny&#8217;s but this was quite incredible.</p><p name=\"9843\" id=\"9843\" class=\"graf graf--p graf-after--p\">They claimed that Johnny had asked them to leave him alone when he appears to have had some early insight into their true form. If this is true then Johnny is to be commended for his wisdom; though he should take a closer look at himself and ask why he didn&#8217;t look deeper into the allegations.</p><p name=\"5c95\" id=\"5c95\" class=\"graf graf--p graf-after--p\">Then they alleged that I am, in fact, Johnny FD. This is quite funny if you know Johnny&#8217;s work and read mine, you&#8217;ll know that I stand for the opposite of the things Johnny stands for. Why would Johnny create someone who doesn&#8217;t support his business, his behavior or the &#8220;cult of the digital nomad?&#8221;</p><p name=\"abc1\" id=\"abc1\" class=\"graf graf--p graf-after--p\">They also issued a formal challenge for Johnny to appear at this meeting and debate with them. They accused him of working illegally, pot-kettle-black. They denounced drop shipping as a business model (possibly the only thing I agree with this pair of low lives on) and much more.</p><p name=\"11c3\" id=\"11c3\" class=\"graf graf--p graf-after--p\">The problem is that Johnny was very publicly out of the country on the date of the meeting. He&#8217;d announced he would be in Taiwan attending a relative&#8217;s wedding on his blog quite some time ago.</p><p name=\"28f5\" id=\"28f5\" class=\"graf graf--p graf-after--p\">I have no issue at all with people examining Johnny in more detail, I think the world would be a better place for it but I also think that he should have the chance to answer any allegations made against him and that these scum were aiming for the mote in somebody else&#8217;s eye rather than focusing on the plank in their own.</p><p name=\"8228\" id=\"8228\" class=\"graf graf--p graf-after--p\">When the day of the meeting came round, many members of an interested digital nomad community arrived to discover how these two thought they could talk themselves out of the pit that they&#8217;d dug and were still digging for themselves. It will come as no surprise to learn that the brothers didn&#8217;t show up to this meeting.</p><p name=\"b669\" id=\"b669\" class=\"graf graf--p graf-after--p\">In the interim, Travis also issued personal threats to some of the people he felt had been responsible for his downfall. He sent angry messages to one couple and waited outside their apartment at 11 o&#8217;clock at night with the clear intention of doing violence. While the couple were sensible enough to stay away from him, one of them was left very much distressed by the incident.</p><h3 name=\"8a8d\" id=\"8a8d\" class=\"graf graf--h3 graf-after--p\">What Next for the Hankins Brothers?</h3><p name=\"1bc6\" id=\"1bc6\" class=\"graf graf--p graf-after--h3\">Travis and Aaron Hankins are finished in Chiang Mai. Their actions have the police and immigration service seeking them and they&#8217;d probably better hope that they find them too. The relatives of the Thai girls that Travis attacked during his teaching stint are looking for them too; Thai street justice is not famed for the quality of its mercy.</p><p name=\"0cb5\" id=\"0cb5\" class=\"graf graf--p graf-after--p\">They had rented a block of four apartments (two for them and two for attendees of the Digital Nomad Campus) at the Siri Condominium complex and decided to quit those because they were broke and looking for a way out. To its credit, the Siri refused to refund their deposits and the two fled the building empty handed. They are said to be in a desperate financial position by people they have mailed asking for help with less than 10,000 Baht (approx. $300) to their names.</p><p name=\"7210\" id=\"7210\" class=\"graf graf--p graf-after--p\">Travis is rumored to be selling &#8220;his&#8221; motorcycle. Given that we can track, thanks to their endless video confessions, roughly how much money these two have earned since they entered Thailand&#8202;&#8212;&#8202;it seems unlikely that this actually belongs to him. It is more likely to be a rental bike. If you&#8217;re offered an amazing deal on a motorbike this week in Chiang Mai just remember Caveat Emptor.</p><p name=\"9764\" id=\"9764\" class=\"graf graf--p graf-after--p\">Thai law isn&#8217;t terribly forgiving of people who buy stolen property. If the person selling the bike won&#8217;t accompany you to the registration center, you shouldn&#8217;t buy it and you should only pay them after the registration documents have been processed and are in your hands.</p><p name=\"bec4\" id=\"bec4\" class=\"graf graf--p graf-after--p\">The five victims of their Digital Nomad Campus have, in the main, remained silent. Though given that they were to be selling an affiliate program with large commissions to recruit more attendees for Digital Nomad Campus; one of them has spoken up to defend the brothers&#8217; indefensible behavior.</p><p name=\"44c4\" id=\"44c4\" class=\"graf graf--p graf-after--p\">I&#8217;m going to give this person the benefit of the doubt and leave them unnamed. Some of the techniques that I&#8217;ve seen used by the Hankins&#8217; brothers and that others have witnessed at their public meetings, suggest that they&#8217;ve been working on cult-style brain washing and evangelical proselytizing designed to take advantage of people in their weakest most vulnerable moments. As I said earlier, we all make mistakes and I&#8217;m hoping that one day, this person will realize the mistake they made here.</p><p name=\"c64e\" id=\"c64e\" class=\"graf graf--p graf-after--p\">I also think that many of us would have been foolish enough to do something similar, if we&#8217;d moved half way across the world to start a new life studying under a &#8220;guru&#8221;.<a href=\"https://entrepreneurs.maqtoob.com/10-signs-that-your-digital-nomad-guru-or-advisor-is-a-crackpot-bd63727f9cad#.mwy738dez\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\"> If you&#8217;re considering studying under a &#8220;digital nomad guru&#8221;, I wrote a piece on that too recently.</a></p><h3 name=\"c684\" id=\"c684\" class=\"graf graf--h3 graf-after--p\">An Apology and A&#160;Warning</h3><p name=\"c2d2\" id=\"c2d2\" class=\"graf graf--p graf-after--h3\">I said at the beginning that I owe you an apology if you read last week&#8217;s article. I do. I mistakenly trivialized the impact of two dangerous men on the nomads and people of Chiang Mai. I&#8217;m sorry for that.</p><p name=\"756d\" id=\"756d\" class=\"graf graf--p graf-after--p\">While Travis and Aaron may come to justice here in Thailand either at the hands of the law or at the rougher hands of the Thai populace, it&#8217;s also quite possible that they will move somewhere else, change their names again and return to their predatory ways. That&#8217;s why I included their photograph at the top of this article; it will help you recognize them wherever they are.</p><p name=\"e1ad\" id=\"e1ad\" class=\"graf graf--p graf-after--p\">I don&#8217;t advise you to mete out any form of perceived justice to them; I don&#8217;t think it&#8217;s wise to put yourself in harm&#8217;s way or to risk the wrath of the legal system. I do, however, encourage you to share this warning with others and in particular any women that you know, if you encounter them. Tack it up in a Facebook group, send it via Instant Messaging, do whatever it takes so that they have no opportunity to rape or assault someone again.</p><p name=\"9839\" id=\"9839\" class=\"graf graf--p graf-after--p\">Also, please remember that these guys are good at charming people and worming their way into others&#8217; lives. Do not assume that people around them are &#8220;guilty by association&#8221;; it is far more likely that they&#8217;ve been fooled, as badly as I and others here in Chiang Mai were, into thinking that they are just harmless, deluded idiots.</p><p name=\"70f1\" id=\"70f1\" class=\"graf graf--p graf-after--p\">Finally, please also make sure that you don&#8217;t send abuse to people called &#8220;Atlas&#8221; on the Internet, it&#8217;s a real surname and there are decent people living good lives that have no association with these two. The Hankins brothers have already deleted as many of their &#8220;Atlas&#8221; profiles and accounts as they could remember and it seems likely that they&#8217;ll delete others in the future too. Their Digital Nomad Campus and Digital Nomadness (seriously) websites have already been shuttered too.</p><p name=\"d048\" id=\"d048\" class=\"graf graf--p graf-after--p\">Their real names are Travis and Aaron Hankins. It is unlikely that when they eventually reappear (and they will reappear) that it will be using the surname &#8220;Atlas&#8221; or the surname of &#8220;Hankins&#8221;.</p><h3 name=\"3e43\" id=\"3e43\" class=\"graf graf--h3 graf-after--p\">What&#8217;s Next for&#160;Me?</h3><p name=\"af0f\" id=\"af0f\" class=\"graf graf--p graf-after--h3\">I&#8217;ll be back next week and back with the snarky material that I normally write. I&#8217;ll be looking at the power of negativity then and I have a mountain of other material that will come over the next few weeks, some serious and some not so much.</p><p name=\"b51b\" id=\"b51b\" class=\"graf graf--p graf-after--p\">Amusingly, though I don&#8217;t really write about travel&#8202;&#8212;&#8202;I received a nice e-mail from Medium this week to tell me that I am one of their &#8220;top travel writers&#8221; and I could have a special badge if I wanted it but if I wanted to keep the badge, I&#8217;d better keep on writing. Passive-aggressive encouragement at its finest.</p><p name=\"cc0f\" id=\"cc0f\" class=\"graf graf--p graf-after--p\">Thank you to all those of you who have written in support and/or in contradiction of what I write and a massive thank you to those who&#8217;ve shared my material on social media and through e-mail and IM, I really appreciate it.</p><p name=\"304d\" id=\"304d\" class=\"graf graf--p graf-after--p graf--trailing\">I&#8217;d also like to thank those persistent nomads in Chiang Mai who didn&#8217;t let this matter rest and who did the groundwork to bring these appalling matters to light. You folks are stars in my book. I&#8217;m looking forward to meeting you this weekend in real life.</p></div>","title":"The Dark Side of Digital Nomad Life, Going Beyond Bad Guru Techniques"}},"pageContext":{"id":"5b937af587be056953db7cf9"}}