{"data":{"mongodbDatabaseArticles":{"id":"5b937b2087be056953db7d24","content":"<div><h1 name=\"4f95\" id=\"4f95\" class=\"graf graf--h3 graf--leading graf--title\">Why I left San Francisco to build my new startup while traveling the&#160;world</h1><h2 name=\"b405\" id=\"b405\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">Career choices, budgets, travel tips, itineraries, and everything that matters explained in&#160;detail</h2><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Y3TGJ8_SEQyb0BEs3fnXKQ.jpeg\">Sleeping in a hut in the middle of the jungle in Palawan (Philippines)<p name=\"161c\" id=\"161c\" class=\"graf graf--p graf-after--figure\">One year ago, my girlfriend Gaby and I were talking about career choices and life dreams while having dinner with a friend in San Francisco&#8217;s SoMa neighborhood.</p><p name=\"b61d\" id=\"b61d\" class=\"graf graf--p graf-after--p\">At some point in the conversation, I said in a cocky tone:</p><blockquote name=\"733f\" id=\"733f\" class=\"graf graf--blockquote graf-after--p\">If I was not in a relationship, and if I didn&#8217;t have a dog, I&#8217;d quit my job tomorrow and leave San Francisco to start my new company while traveling around Southeast Asia.</blockquote><p name=\"4ea9\" id=\"4ea9\" class=\"graf graf--p graf-after--blockquote\">To my surprise, my girlfriend looked at me and she said:</p><blockquote name=\"12ab\" id=\"12ab\" class=\"graf graf--blockquote graf-after--p\">I will quit my job tomorrow, and we will leave our dog with my mom.</blockquote><p name=\"36ab\" id=\"36ab\" class=\"graf graf--p graf-after--blockquote\">I was terrified. She was totally serious about it! And all kinds of doubts started kicking in in my brain: Is that really a good idea? Should I really leave a job that I enjoy in a city that I love? Do I really want to travel for a year? Can I really build a startup while traveling? How is that going to affect our relationship?</p><p name=\"9f5c\" id=\"9f5c\" class=\"graf graf--p graf-after--p\">We talked about all those questions for a week, and then we made a decision: we were quitting our jobs right before Christmas, we were spending the holidays with our family, and then we were going to start traveling the world for a year, all while working full-time on building <a href=\"https://www.microverse.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">my new startup</a>.</p><p name=\"c7c2\" id=\"c7c2\" class=\"graf graf--p graf-after--p\">On December 2017, we quit our jobs, we organized a yard sale and sold everything we owned (we had a lot of stuff! Thank you Amazon Prime&#8230;), we left our apartment, we took a flight to El Salvador to leave our dog Luna with my girlfriend&#8217;s mom, and then we started our journey. Exactly as my girlfriend had suggested!</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*HZzAYml7ArtKZ_J7RoIT7g.jpeg\">Selling everything we had in our yard sale, and our dog Luna welcoming the&#160;shoppers<p name=\"d9c7\" id=\"d9c7\" class=\"graf graf--p graf-after--figure\">It&#8217;s been 7 months since that, and we have spent 3 months in Vietnam, 3 months in Indonesia, and several weeks doing short trips to places such as Borneo, Komodo Island, the Philippines and Malaysia.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*k4CwVJm21btqOcAILnjX9g.jpeg\">Buying fresh lobster from a local fisherman in Lake Toba (Indonesia)<p name=\"4e99\" id=\"4e99\" class=\"graf graf--p graf-after--figure\">Back in February, just one month after starting our trip, I also launched my new startup, <a href=\"https://www.microverse.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Microverse</a>. Since then, I have helped students from Taiwan, Serbia, Kenya, Spain, Morocco, Mexico, Canada and the USA become remote software developers and connect with life-changing professional opportunities.</p><p name=\"8e63\" id=\"8e63\" class=\"graf graf--p graf-after--p\">We are now at the middle of our year-long trip, and I just wanted to take a moment to think about the reasons why we decided to take this long trip and recap on how we are making it possible, especially having to balance traveling and working full-time.</p><h3 name=\"2abc\" id=\"2abc\" class=\"graf graf--h3 graf-after--p\">Why we did&#160;it</h3><p name=\"a915\" id=\"a915\" class=\"graf graf--p graf-after--h3\"><strong class=\"markup--strong markup--p-strong\">We did it because we could</strong>; because we were privileged enough to have the savings to travel for a year with no income (more on this later), and because our brains were used to the idea of moving from place to place without feeling much anxiety about it. I had already lived for 12 years in Argentina, 13 years in Spain and 5 years in the US before this trip.</p><p name=\"84db\" id=\"84db\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Because the timing was right</strong>. It doesn&#8217;t happen too often that both people in a relationship are in sync to quit their jobs and radically change their lives with no major responsibilities to take care of. If we didn&#8217;t do it then, chances were that we were never going to have another chance like that one.</p><p name=\"4178\" id=\"4178\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Because San Francisco is expensive and Asia is not</strong>. I was working for <a href=\"https://techcrunch.com/2013/11/13/lonely-planet-touristeye/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the company that had acquired my previous startup</a>, and I was ready to quit that job and work full-time on my new company. However, quitting a job and staying in San Francisco was incredibly expensive. I needed at least $4,000 per month to live in San Francisco without any kind of crazy luxury. In Asia, we have managed to live really well with $900/month (more on this later too).</p><p name=\"d2f6\" id=\"d2f6\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Because at the beginning you just need to get things done</strong>. Even though San Francisco is THE place in the world where you maximize your opportunities if you work in tech, what you really need when you are starting a company is to focus on validating your idea and its underlying hypotheses. The customers of my new company were not in San Francisco, so there was no reason for me to actually be there.</p><p name=\"f2ed\" id=\"f2ed\" class=\"graf graf--p graf-after--p\">I can&#8217;t stress enough how liberating it has been to not have to worry about money and to stay focused on actually getting things done. When I was in San Francisco, I knew that quitting my job was going to limit my runway to build a company. On the other hand, keeping that job gave me a false sense of safety while stopping me from going all in with my new startup.</p><h3 name=\"68aa\" id=\"68aa\" class=\"graf graf--h3 graf-after--p\">How we did&#160;it</h3><p name=\"c996\" id=\"c996\" class=\"graf graf--p graf-after--h3\">We are both obsessive planners, so we started by making <strong class=\"markup--strong markup--p-strong\">a detailed itinerary</strong>. We chose a region of the world, Southeast Asia, and we voted on the destinations we wanted to visit and the things we wanted to do. With all those decisions made, we drafted a spreadsheet with our itinerary. It&#8217;s a document that changes every day as we adjust our plans, but it&#8217;s been really helpful to give us some sense of stability.</p><p name=\"2ef3\" id=\"2ef3\" class=\"graf graf--p graf-after--mixtapeEmbed\">We also saw this as an opportunity to go back into <strong class=\"markup--strong markup--p-strong\">a more frugal way of living</strong>. After a few years in San Francisco of saying yes to almost every dinner and weekend plan, it was not easy to start exercising this muscle again.</p><p name=\"2acc\" id=\"2acc\" class=\"graf graf--p graf-after--p\">We knew the best way to hold ourselves accountable for our spending was to set a total budget for the year, create a detailed budget per category, and to track our expenses on a daily basis.</p><p name=\"0bf5\" id=\"0bf5\" class=\"graf graf--p graf-after--p\">So far we have been really good at keeping our monthly expenses within the limits of our budget, and here is how we did it:</p><ol class=\"postList\"><li name=\"dce4\" id=\"dce4\" class=\"graf graf--li graf-after--p\">We set a budget for the year: $11,000. That&#8217;s equivalent to $916 per month.</li><li name=\"3193\" id=\"3193\" class=\"graf graf--li graf-after--li\">We created a list of categories for our expenses (e.g. flights, housing, food, travel activities, etc).</li><li name=\"21d5\" id=\"21d5\" class=\"graf graf--li graf-after--li\">We used blogs and websites like <a href=\"https://nomadlist.com/\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">Nomad List</a> to assign a reasonable amount to each category.</li><li name=\"efe4\" id=\"efe4\" class=\"graf graf--li graf-after--li\">We opened a <a href=\"https://www.schwab.com/public/schwab/banking_lending/checking_account\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">checking account on Schwab</a> because they offer unlimited ATM withdrawals outside the US and they refund you all the ATM fees.</li><li name=\"3d7c\" id=\"3d7c\" class=\"graf graf--li graf-after--li\">We created a savings account on <a href=\"https://www.ally.com/\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">Ally</a> with all the money we needed for the entire year ($11,000).</li><li name=\"ccfc\" id=\"ccfc\" class=\"graf graf--li graf-after--li\">We created automated monthly transfers from the savings account to the checking account for the exact money that we needed for the month. Not seeing more money than what you actually budget for has been extremely effective.</li><li name=\"dda0\" id=\"dda0\" class=\"graf graf--li graf-after--li\">We created an emergency fund to cover living expenses for 4 months after finishing our trip and some additional money in case we had some kind of medical urgency (we also pay for a year-long travel insurance with <a href=\"https://www.worldnomads.com/\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">World Nomad</a>).</li><li name=\"e636\" id=\"e636\" class=\"graf graf--li graf-after--li\">Finally, we put everything else (all our savings) in index funds (we are fans of <a href=\"https://www.betterment.com/invite/arielcamus\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">Betterment</a>) to force ourselves to plan our lives (and budgets) around the idea that we can&#8217;t count on that money in the short-term. We can only count, to a certain extent, on the long-term performance of the index funds.</li></ol><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*pCula608w7WzK1rVXdigxg.jpeg\">Celebrating a death anniversary with a local family and a Portuguese friend in Hoi An (Vietnam)<p name=\"ee5a\" id=\"ee5a\" class=\"graf graf--p graf-after--figure\">Here is the spreadsheet with our budget in case you are interested in seeing where our money goes:</p><p name=\"9178\" id=\"9178\" class=\"graf graf--p graf-after--mixtapeEmbed\">Finally, we started using <a href=\"https://www.mint.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Mint</a> to keep track of every single transaction, even if we pay in cash for a coffee that costs 45 cents.</p><p name=\"409f\" id=\"409f\" class=\"graf graf--p graf-after--p graf--trailing\">At the end of every week, and every month, we can now see how we are doing with our budget and we can re-adjust our plans accordingly.</p></div>","title":"Why I left San Francisco to build my new startup while traveling the world"}},"pageContext":{"id":"5b937b2087be056953db7d24"}}