{"data":{"mongodbDatabaseArticles":{"id":"5b96246e87be058327490e69","content":"<div><p><em><a href=\"http://travelblogsuccess.com/go.php?offer=foxnomad&amp;pid=2\"><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/02/travel-blog-success.jpg\" alt=\"travel blog success\" width=\"300\" height=\"250\"></a>World traveler Dave Lee blogged his way around the world in 2007 and is the founder of <a href=\"http://gobackpacking.com\">GoBackpacking.com</a> and <a href=\"http://medellinliving.com/\">MedellinLiving.com</a> (both nominated for 2010 Bloggies). On Monday he launched Travel Blog Success, a community for those looking to improve their travel blogs and potentially use them to earn money for traveling.</em></p>\n<p>More travelers are becoming interested in travel blogging, particularly as a way of earning income to fund part of their travels. <a href=\"http://travelblogsuccess.com/go.php?offer=foxnomad&amp;pid=2\">Travel Blog Success</a> is a membership site that consists of 12 core lessons ranging from creating a travel blog, the technical details of maintaining a website, and managing a travel blog while you actually travel.</p>\n<p><strong>Who Is Travel Blog Success For?</strong></p>\n<p>Travel Blog Success isn&#8217;t for the casual writer but those of you looking to turn your new or existing travel blogs into a more professional outlet or earn a side income blogging. Dave doesn&#8217;t promise that you&#8217;ll triple your readership or make thousands of dollars but Travel Blog Success can help your travel blog beyond more than just the 12 core lessons.</p>\n<ul>\n<li>An active community and forum where you can meet other travel bloggers, ask questions, and get advice about blogging and travel.</li>\n<li>Podcasts and audio interviews with other experienced travel bloggers.</li>\n</ul>\n<p>Travel Blog Success is a membership site that runs <a href=\"http://travelblogsuccess.com/go.php?offer=foxnomad&amp;pid=2\">$75 for premium membership</a> and access to all of the lessons, forums, and audio interviews. Dave has pulled together some of travel blogging&#8217;s best minds and put together a valuable resource if you&#8217;re serious about travel blogging.</p>\n<p>You can read more on my full <a href=\"http://travelblogadvice.com/travel-blogging/a-review-of-travel-blog-success/\">review of Travel Blog Success</a> over on my other blog, <a href=\"http://travelblogadvice.com/\">Travel Blog Advice</a>.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Travel Blog Success Launched This Week"}},"pageContext":{"id":"5b96246e87be058327490e69"}}