{"data":{"mongodbDatabaseArticles":{"id":"5b92397287be0583cfde6804","content":"<div><p></p><img src=\"http://nomadcapitalist.com/wp-content/uploads/2017/04/Lessons-learned-from-obtaining-economic-citizenship.png\" alt=\"Lessons learned from obtaining economic citizenship\" width=\"700\" height=\"467\" class=\"size-full wp-image-19852\"><br>\nThis is Week TwentyTwo of the 26 week series <a></a><a></a><a></a><p>This is Week TwentyTwo of the 26 week series <a href=\"http://nomadcapitalist.com/my-economic-citizenship/\" target=\"_blank\">#MyEconomicCitizenship</a> . Each week I give you a glimpse into my life as I share the ups and downs experienced in pursuit of a second passport through economic citizenship. Each feature includes my weekly journal walking you through the process of obtaining economic citizenship, followed by an in-depth look at some of the most important topics people considering economic citizenship should understand. The series is presented by <a href=\"http://nomadcapitalist.com\" target=\"_blank\">Nomad Capitalist</a> in partnership with Peter Macfarlane &amp; Associates, whom I worked with to obtain my passport. To read the entire series, just click <a href=\"http://nomadcapitalist.com/my-economic-citizenship/\" target=\"_blank\">here</a> </p><p>Dateline: Tbilisi, Georgia</p>\n<p>Becoming an economic citizen has been an interesting process for me. If you take a look back at this 26 week journey, it&#8217;s easy to see the development and learning that happened as I actually went through the citizenship by investment process myself. </p>\n<p>When I started out, the idea was to work with Peter McFarland and Associates to get an economic citizenship in order to increase my flexibility. Right now, having US citizenship is serving me in some ways with what I&#8217;m doing with Nomad Capitalist, despite the fact that I do have to file tax returns. However, I want the flexibility and the clarity of knowing that that citizenship is always serving me and that, if one day it doesn&#8217;t, I have the option to opt out. </p>\n<p>That was one of the big things that I thought about at the beginning of the process. </p>\n<p>Now that I&#8217;m at the end of the process, it&#8217;s been a good experience. As I always talk about, the end goal is what&#8217;s most important. Did I accomplish the end goal? Yes. I&#8217;ve worked with Peter McFarland and they got me through it all. The whole team, and especially Nick and Yuri have been very helpful. </p>\n<p>But if you take a look at the 26 weeks and the entire journey, the beginning articles were more blog posts. There was a little bit of diary from my own experience, but it was more information than anything else. There were the how-to and info articles on how to get <a href=\"http://nomadcapitalist.com/2016/10/16/dominican-citizenship-investment/\" target=\"_blank\">Dominica citizenship by investment</a>, how to use the <a href=\"http://nomadcapitalist.com/2016/11/06/belt-and-suspenders-strategy/\" target=\"_blank\">Belt and Suspenders Strategy</a>, or comparing <a href=\"http://nomadcapitalist.com/2016/10/23/visa-free-travel-economic-citizens/\" target=\"_blank\">visa-free travel for economic citizens</a>. There were also the articles addressing concerns about <a href=\"http://nomadcapitalist.com/2016/10/30/lose-government-benefits-renounce-citizenship/\" target=\"_blank\">losing government benefits</a> or being able to <a href=\"http://nomadcapitalist.com/2016/11/13/use-us-banks-if-renounce-citizenship/\" target=\"_blank\">use US banks</a> if you were to renounce your citizenship.</p>\n<p>As the 26 weeks have gone on, however, it&#8217;s been more of a journal recording my experiences, feelings and the results from what I&#8217;m doing. And with those actions and feelings I&#8217;ve gained more clarity.</p>\n<h2>Clarity comes in doing</h2>\n<p>This is an interesting experience and an interesting reminder of what I tell everybody &#8212; because I&#8217;ve experienced this before &#8212; that when you do something you start off with questions, you start off thinking strategically and thinking about the hard (vs. soft) topics. Can I renounce my citizenship? What are the tax consequences? etc. Those questions are important, strategy is important, but it&#8217;s interesting that when you dive in and do something and the result is in or on its way, that there is a great clarity that comes with that. </p>\n<p>Throughout these 26 weeks as I&#8217;ve gone through the process, I&#8217;ve been talking less and less about what you and I can do, and less about the opportunities, and more about what&#8217;s happening and what I&#8217;ve actually been doing.</p>\n<p>And I think this is what a lot of people face &#8212; especially when they&#8217;re looking at getting a second passport, but really with anything related to going offshore and the subjects we talk about at Nomad Capitalist &#8212; but everyone talks about Well, if I get a second passport I could do this, I could do that. Okay, great. Go do it and then you&#8217;ll have more clarity. And that&#8217;s where I&#8217;m at right now. </p>\n<h2>Flexibility is best when you have it</h2>\n<p>I&#8217;ve been doing this stuff for a long time, but there is still a clarity that I&#8217;ve had from getting this passport. I started out saying that, for me, being a US citizen is still serving me for a couple reasons, but I&#8217;d still like the flexibility. For people who want that flexibility, let me tell you that the flexibility is best when you actually have it. </p>\n<p>It&#8217;s easy to sit and think that if you get a Dominica passport, then you&#8217;d have the ability to go and renounce your US citizenship. Well, guess what, you feel differently about it &#8212; in my experience &#8212; when you actually have that passport. It causes you to reevaluate your choices in a way that you can only really do when you actually have the thing that gives you the flexibility. Just imagining Hey, if I pay $100,000 and I get that flexibility&#8230; is very different from the conversation you would have if you already had that second passport. </p>\n<p>Those who already have the flexibility, knowing that they&#8217;re okay, knowing that they have the option is important. Options are important; that&#8217;s been a lesson that I&#8217;ve relearned throughout this process.</p>\n</div>","title":"Lessons Learned from Obtaining Economic Citizenship"}},"pageContext":{"id":"5b92397287be0583cfde6804"}}