{"data":{"mongodbDatabaseArticles":{"id":"5b95ea5787be05832748ff9b","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/changingplans1.jpg\" alt=\"going into the sunset\">I realize I don&#8217;t talk about my personal life a lot. I made a conscious effort years ago that I wouldn&#8217;t make this site another travel blog of where I go and what I do. Frankly, I don&#8217;t think that my life is interesting enough that people would care that today I ate good food and saw sites x, y, and z.  I wanted my site to contain more practical tips on saving money, and stories that could be applicable to any traveler.</p><p>I didn&#8217;t want to limit this site. I wanted my life to simply be an example of what can be done, and not bother with the mundane details.</p><p>Lately, though, I&#8217;ve felt that I&#8217;ve gone too far. I think the posts have gotten too impersonal.  It&#8217;s not to say I don&#8217;t write personal posts. I do. Here&#8217;s an example. But looking through the last 5 months of posts, I feel there hasn&#8217;t been enough of a personal story woven through many of them.</p><p>That&#8217;s going to change! I plan to start writing more personal stories about my travels.</p><p>I&#8217;ll still keep the same goal of making them applicable to others, though. I am not going to bore you with the whole &#8220;today I did this&#8221; stuff. But I&#8217;ll be including more personal stories about my life on the road from now on.</p><p>And what&#8217;s been going on lately?</p><p>Today, I was going to fly back to New York City for my friend&#8217;s wedding. I wrote this long post about this not being the end of my trip but rather the end of Chapter One, and now it&#8217;s useless.  I&#8217;m not flying back to New York today. I&#8217;m not flying back at all.</p><p>You see, I lost my passport on the way from Copenhagen to Amsterdam. While I have an emergency passport, I&#8217;ve been warned against traveling back to the States and then to the UK on one.  Anyways, there&#8217;s a long blog post about losing my passport coming up. So more on that later.</p><p>I had been preparing for New York City since I left for Scandinavia. It was a mental marker that separated the different parts of my trip. There was the little trip before NYC, and then the typical backpacking trip that was to come after it.  That&#8217;s when I plan to train-hop through European cities and hostels. Chapter One was just cruising around on my own, visiting friends and taking a sponsored trip to Norway.</p><p>Now, I&#8217;m in Amsterdam and starting the &#8220;backpacker&#8221; portion of my trip sooner than I had planned.  I&#8217;ll be going to Greece on Monday. I&#8217;m going to start the application process for a real passport, then go spend my birthday on the Greek Islands. Then it is up through the Eastern block to Finland, Oktoberfest at the end of September, and a month in Poland before going to TBEX Europe in Prague.</p><p>After that, I might go to Korea. Or Japan. Or right back to Southeast Asia. I don&#8217;t know. I can&#8217;t plan that far in advance.</p><p>Seven years ago, I made the decision to travel the world. Now, I&#8217;ve made the decision to stop such a permanent nomadic lifestyle. And as I move one chapter closer to the end, the weight of the huge lifestyle change I&#8217;m about to undergo is finally hitting me.  I&#8217;ve been quite reflective over this major life change.</p><p>But for now, I&#8217;m not going to worry about it. I&#8217;m just going to sort out my passport, go to Greece, and enjoy the non-stop adventure of the next few months.</p><p>After all, the universe always unfolds the way it should.</p></div>","title":"Changing Plans and Getting Personal"}},"pageContext":{"id":"5b95ea5787be05832748ff9b"}}