{"data":{"mongodbDatabaseArticles":{"id":"5b93832a87be056953db7e33","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"677b\" id=\"677b\" class=\"graf graf--h3 graf--leading graf--title\">How Are Remote Workers Changing the World&#8217;s&#160;Cities?</h1></p><p name=\"7dbd\" id=\"7dbd\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf--startsWithDoubleQuote graf-after--figure\">&#8220;N<strong class=\"markup--strong markup--p-strong\">umber one is lack of pollution</strong>. Number two is physical safety, lack of crime, or low crime. Number three is a tolerant society. Number four is rental cost.&#8221;</p><p name=\"4977\" id=\"4977\" class=\"graf graf--p graf-after--p\">That&#8217;s Sten Tamkivi talking about the priorities people have when picking a new city to move to. He&#8217;s an Estonian entrepreneur and the creator of a company called <a href=\"https://teleport.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Teleport</a> that purports to help people move to their &#8220;best place to live and work.&#8221;</p><p name=\"235f\" id=\"235f\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;People very often think that budgetary things matter, but the top three are not financial,&#8221; Tamkivi said. &#8220;They&#8217;re much more about the softer side of life, and being safe and being tolerated. The last thing you want to do is go somewhere where you get harassed for your skin color or whatnot.&#8221;</p><p name=\"d791\" id=\"d791\" class=\"graf graf--p graf-after--p\">On <a href=\"https://teleport.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Teleport&#8217;s website</a>, after a short sign-up process, you&#8217;ll find a questionnaire that ranks more than 250 different cities in terms of how well they&#8217;re likely to suit you. It&#8217;s surprisingly detailed&#8202;&#8212;&#8202;you can tweak it for personal preferences related to climate, education, safety, language, job market, taxes, pollution, and even traffic. What&#8217;s more, if you specify your monthly rent and salary, you&#8217;ll be shown how much more disposable income you&#8217;ll have in different cities around the world. The company earns its money by helping to facilitate that move&#8202;&#8212;&#8202;putting you in touch with local contacts and services to make the transition easier.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*Rl21RydRDGYchkqnWdW73A.jpeg\"><p name=\"97d8\" id=\"97d8\" class=\"graf graf--p graf-after--figure\">At the top of my chart was Singapore, which was a bit of a surprise because I indicated that I like the weather in Stockholm and was expecting rather chillier locations as a result. Singapore&#8217;s high scores in internet access, safety, and environmental quality&#8212;which are also important to me&#8212;seemed to have trumped its humid climate.</p><p name=\"74cd\" id=\"74cd\" class=\"graf graf--p graf-after--p\">Singapore was followed by Glasgow, Edinburgh, and Stockholm, which were less of a surprise given the city I actually live in&#8202;&#8212;&#8202;Gothenburg, on Sweden&#8217;s west coast, which wasn&#8217;t even up for consideration.</p><p name=\"09ee\" id=\"09ee\" class=\"graf graf--p graf-after--p\">I moved from London to Gothenburg <a href=\"http://radioedit.tumblr.com/post/26548907262/sweden\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">about three and a half years ago</a> to get a master&#8217;s degree. I&#8217;m still not totally sure if I moved so that I could study, or if I signed up for the degree program so I could move. Either way, it&#8217;s great and I love it&#8202;&#8212;&#8202;Gothenburg is small enough to easily navigate on public transport, filled with parks and green spaces, accessible to most of Europe and, despite its small size in comparison to many cities, there&#8217;s always something going on. Living here feels like a perpetual holiday: It&#8217;s the perfect place for me.</p><p name=\"4579\" id=\"4579\" class=\"graf graf--p graf-after--p\">But I recognize that having the freedom to decide to live elsewhere is a massive privilege. I had the money, familial support, career flexibility, and <a href=\"https://www.passportindex.org/byRank.php\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">passport power</a> to uproot myself from London and relocate to Gothenburg. A young woman living in a slum in Nairobi has none of those things. The vast majority of people in the world have none of those things, and many of them are <a href=\"https://en.wikipedia.org/wiki/Refugee\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">forced to move anyway</a>.</p><p name=\"3fc7\" id=\"3fc7\" class=\"graf graf--p graf-after--p\">Think about this subject for too long, and it&#8217;s hard to escape the conclusion that the practice of &#8220;<a href=\"https://en.wikipedia.org/wiki/Digital_nomad\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">digital nomads</a>&#8221; moving from the West to cheaper cities in developing nations (I&#8217;m not including Gothenburg here, of course) is essentially just a form of global gentrification. These knowledge workers push up local prices, drive longtime residents out of fashionable neighborhoods, and rarely engage in any meaningful way with the local culture and community. This has its troubling historical parallels with colonialism, too&#8212;particularly in Asia.</p><p name=\"4260\" id=\"4260\" class=\"graf graf--p graf-after--p graf--trailing\">While knowledge workers usually end up paying more in taxes than permanent residents because their salaries are higher, that only benefits the local economy if the workers are actually registered for taxes, and if corruption isn&#8217;t a thing (which it unavoidably is in much of the developing world). And while the presence of digital nomads in a city tends to correlate with a reasonable local startup scene, any wealth generated often fails to trickle down to the people who need it the most.</p></div>","title":"How Are Remote Workers Changing the World’s Cities?"}},"pageContext":{"id":"5b93832a87be056953db7e33"}}