{"data":{"data":{"edges":[{"node":{"id":"5b962b9987be0583274911df","title":"Hippie In Heels","source":"hippie_inheels","summary":"This award isn’t bad though, because they aren’t saying I’m bad, just that I’m new.\nUnlike a chain emails I’ve never passed on, I am happy to send this award on to other newbie travel bloggers.\nShe’s an Indian blogger here and I love her site as a reference when I’m looking for a nice getaway.\nWhat travel tips would you tell your readers if you could only give them one?\nI’d love to keep giving you travel tricks & tips so feel free to subscribe by e-mail in the big purple box below.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2013-11-22-at-5.21.39-PM.jpg?fit=479%2C323&ssl=1"}}},{"node":{"id":"5b962b9387be0583274911de","title":"Travel Blog Interview with Jo from Dirty Paws- Hippie in Heels","source":"hippie_inheels","summary":"“It’s time to get your paws dirty…” a travel blog interview.\nJo really caught my attention when she posted how “the shopaholic” saved money for travel.\nWhen you have bit of a tan, this colour can look really pretty (Think Amber Heard in The Rum Diaries).\nI really think that travel gives you that confidence and freedom and develop’s the most important part of you, your character!\nMy bed is definitely something I will miss because in the process of saving money for travel I have become such a homebody.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/diving-photo-002.jpg?fit=457%2C596&ssl=1"}}},{"node":{"id":"5b962b8487be0583274911dd","title":"Want to Win a Free Vacation in the UK?","source":"hippie_inheels","summary":"Want a chance to win a free vacation!?\nI just took a quiz from a UK travel agency called Parkdean Holidays to be entered to win a prize of a 7 day stay at one of their two dozen resorts across the UK for your family- it’s worth 750 pounds.\nMake sure after you finish the quiz, you enter you e-mail after so they can contact you if you win.\nThe only time I’ve spent beachside in the UK is when Ben took me to Brighton Pier, but I’ve always wanted to see more.\nI’d love to keep giving you travel tricks & tips so feel free to subscribe by e-mail in the big purple box below.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-05-11-at-3.04.56-PM.jpg?fit=800%2C501&ssl=1"}}},{"node":{"id":"5b962b6287be0583274911dc","title":"India Someday – India travel with a little assistance","source":"hippie_inheels","summary":"-This post is brought to you and written by India Someday-India Someday is a travel service that offers just the right amount of assistance to independent travelers looking at planning a trip to India.\nDepending on how much assistance you are looking at we will help you fill in the gaps of your India travel.\nIndia someday is a travel service that fills in that gap.\nDepending on what you need we help you plan your route, help you book right places to stay and book your trains/buses/cars and flights.\nHippie on Heels has not had a chance to experience our services yet but do take a look at the reviews by people who’ve used our service on how they benefited travelling with India someday assistance.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/Screen-shot-2015-03-24-at-6.16.08-PM.jpg?fit=800%2C372&ssl=1"}}},{"node":{"id":"5b962b0d87be0583274911db","title":"3 Packing Tips that will Ensure you get the Most out of Your Vacation Time","source":"hippie_inheels","summary":"You’ve been saving up your vacation days all year so you can kick back and relax for a full week of nothing but sunshine and sightseeing.\nFollow these tips and plan ahead by packing light and efficiently so you can get to your final destination as quickly and painlessly as possible!\nSkip the check in line and eliminate the risk of your bag not arriving when you do by only packing a carry-on.\nGet enough rest and hydratePrepare your body for the journey and you wont feel as jet lagged when you finally make it to your vacation spot!\nBy following these 3 simple tricks you can give yourself the no hassle stress-free vacation you’ve been hoping for!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/06/packing-for-florida-IT-luggage8.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b962aba87be0583274911da","title":"How to Change to a Nomadic Lifestyle in the Modern Era","source":"hippie_inheels","summary":"Regardless of whether you are a writer, computer programmer, design expert or photographer, there are ways to make a considerable amount of money online.\nThe Best Places in the World to Live the Digital Nomad LifestyleIt is important to consider the cost of living ratio when deciding where to become a digital nomad.\nFor example, parts of the world such as Southeast Asia, Africa, Latin America, and parts of Europe naturally lend themselves to being ideal digital nomad hubs.\nThese parts of the world are gorgeous, but are also peaceful for the digital nomad to enjoy.\nConcluding RemarksBecoming a digital nomad is something that many individuals fantasize about.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/05/2016-04-27-11.56.20-1.jpg?fit=560%2C416&ssl=1"}}},{"node":{"id":"5b962a9887be0583274911d9","title":"4 Unexplored & Hidden Places to Visit in Dirang, India","source":"hippie_inheels","summary":"There are about 10 main tourist places in Arunachal Pradesh to visit and Dirang is one of the smaller ones.\nWe basically spent one day there on our way North, then again one day on our way back down South.\nIt’s a good stopover and there are a couple decent hotels in Dirang and a handful of attractions or places to visit in Dirang and Dirang valley.\nWe stayed at Pemaling Hotel Dirang which is the #1 hotel in Dirang….\nDirang DzongWe wandering Dirang and went to a place called Dirang Dzong which is a tribal area with a 9th century prison.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/11/dirang-feature.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b962a9787be0583274911d8","title":"Secret Little Sangti Valley in NE India","source":"hippie_inheels","summary":"Sangti Valley is 15 km outside Dirang, buried in the Eastern Himalayas, and another stop in Arunachal Pradesh tourism that many won’t see as it’s often overlooked.\nWhile touring the backwaters of Kerala became famous for its beauty and now everyone goes, one day when Arunachal tourism picks up, Sangti Valley will be flooded by tourists.\nIt’s one of the most stunning places I’ve been.\nSangti Valley is where the black neck crane comes each year.\nThey deserve some attention, especially Sangti Valley!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/11/sangti-feature.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b962a8e87be0583274911d7","title":"Why the Urbex Travel Trend is The Coolest New Thing in Adventure Travel","source":"hippie_inheels","summary":"This is a guest post about the new urbex travel trends that are so popular especially in Europe and Japan.\nI have always had this thing with abandoned places, roofs, not-so-tapped destinations, and spots.\nBriefly speaking, urbex is all about exploring and indulging the abandoned, urban areas.\nWhat Type of Traveler Will Enjoy Urbex?\nWhy Is This Urbex Travel Trend so Popular Right Now?","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/What-Is-Urbex-Travel-Trends-10.jpg?fit=683%2C1024&ssl=1"}}},{"node":{"id":"5b962a5e87be0583274911d6","title":"The Ultimate Packing Guide For China","source":"hippie_inheels","summary":"When I first moved to China 3 years ago, I followed a packing list that was outdated.\nJokes aside, there still are some essentials of what to pack for China that you may even know you need.\nVPNI’ve known foreigners who travel to China (or even live in China) without acquiring a VPN.\nA China travel guidebookThis can be an incredibly useful tool.\nShe writes for Career China, a premier resource for living, traveling, and working in China.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/11/yellow-mountains-532857_1280.jpg?fit=1280%2C853&ssl=1"}}},{"node":{"id":"5b962a5b87be0583274911d5","title":"Awesome Travel Resource for Indian Travelers","source":"hippie_inheels","summary":"I’m always writing about how non-Indians can travel in India, but today I want to share a travel resource for Indian travelers that I think will be very useful to you guys!\nTravel Resource for Indian TravelersI know I am blessed to have a passport that allows me to travel easily in and out of the US to a huge variety of countries, but for my Indian readers I know that is not the case.\nSometimes, for Indians, getting a visa can be such an issue that it can mess up their travel plans completely.\nExample of the Visa Free tool for Indian travelersSo, let’s take Thailand for example.\nPin this travel resource for Indian travelers for later:Did you enjoy this post?","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/1.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b962a5087be0583274911d4","title":"Get Rid of ATM Fees and “Do Good” With Aspiration Summit","source":"hippie_inheels","summary":"The following post is in partnership with Aspiration and I was compensated for my time in writing it.\nThere can never be enough good information to help travelers manage their money abroad, so when Aspiration reached out to see if I’d be interested in their Aspiration Summit account, I was all for it after reading about the perks.\nAspiration Summit Checking AccountThis account was named by Money magazine as the “best checking accounts in America”.\nIf you’re interested in reading more about this traveler focused checking account, or looking for a way to save on ATM fees for your next trip, click here for more information.\nPin the Aspiration Summit Account for later:Related","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/Aspiration-Summit-Account-7.jpg?fit=1080%2C810&ssl=1"}}},{"node":{"id":"5b962a4387be0583274911d3","title":"Luxury Guide to Stockhom","source":"hippie_inheels","summary":"A Luxury Guide to StockholmTell us a little about yourself and tell us why you’re an expert on luxury travel in Stockholm.\nWe quickly realized backpacking wasn’t quite our niche, and we’re now on a journey to find the perfect balance between adventure and luxury.\nStallmästaregården is Sweden’s oldest continually running inn that exemplifies Swedish design and architecture without neglecting classic décor and contemporary amenities.\nThe Inn overlooks the beautiful Bay of Brunnsviken and is only a quick walk away from the Stockholm city center.\nFor all of the best places to fika in Stockholm, check out our article: The Art of Fika.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/08/luxury-guide-to-stockholm.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b962a3b87be0583274911d2","title":"Should I Get Travel Health Insurance?","source":"hippie_inheels","summary":"Lots of new travelers ask me: Should I get travel health insurance?\nSo, which travel insurance should I get?\nThey wrote about how travel insurance was a life saver for them.\nAt all times, I am under my parents health insurance because I’m under 26.\nBut if you have the money to go abroad, then you should absolute take that extra shift at work, or save that extra $200 bucks so that you can buy adequate travel health insurance.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2013/12/travel-insurance-feature-image.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b962a3987be0583274911d1","title":"Step by Step: How to Apply for Indian Tourist Visa from USA","source":"hippie_inheels","summary":"This post is an incredibly detailed guide, step by step, for how to apply for an Indian visa from USA for US citizens.\nHow to Apply for Indian Tourist Visa from USA – Step by Step guideEverything is being outsourced to Cox and King.\nThis is a step by step guide on how to apply for Indian tourist Visa from USA.\nNext, under “visa” in the top left dropbox, click “visa application – get started”.\nWhile filling out this application, refer to FAQ About the Visa Application form and read number 9.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-02-13-at-2.04.08-PM.jpg?fit=791%2C548&ssl=1"}}},{"node":{"id":"5b962a1d87be0583274911cf","title":"Air Canada Business Class Review: Mumbai to Toronto","source":"hippie_inheels","summary":"The B787 Dreamliner & Business Class HeavenThat moment when the airline flight attendant crosses out your seat and writes in “1A”… bliss.\nGetting priority boarding for business class is enough of a perk to booking it, haha!\nBelow, you can see the amenities that are given to the business class passengers.\nBusiness class was not full and it was very quiet up there but I still wore my earplugs when I slept.\nEven if you are not going to fly business class, consider flying out of Toronto with Air Canada to India direct rather than the US airlines that stop in Europe.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Air-Canada-Mumbai-Toronto-2.jpg?fit=1024%2C769&ssl=1"}}},{"node":{"id":"5b962a1b87be0583274911ce","title":"Travel to India Made Easy With This Step By Step Guide","source":"hippie_inheels","summary":"Not everyone feels called to travel to India, but those who do feel it strongly and tend to have a huge desire to explore India.\nWhile there are travelers who feel called to India, there are others who feel it’s too difficult to travel; it’s true – India travel can be intense.\nStep by Step Guide: Travel To India Made EasyIf you took the time to read my 400+ posts about India, you’ll find a lot of information, but I wanted one big whopper of an article that just tells you how to start planning your India trip from scratch.\nWhile you travel, you’ll notice differences in the dal, curries, bread, and even flavors of rice.\n7.How to Meet PeopleMeeting people while traveling India use to be kind of hard and I would go weeks traveling without seeing other buddies.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/India-Travel-Made-Easy-3.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b962a0c87be0583274911cd","title":"Save Yourself Hassle: Buy a Local SIM Card in India","source":"hippie_inheels","summary":"Getting a local SIM card in India and having access to the internet will make your trip WAY easier and less stressful.\nThis is slowly changing, but it could be that you’ve never seen a SIM card and don’t have a SIM card slot in your smartphone.\nBuy a Local SIM Card in IndiaIn most other countries, you buy a SIM card that you can put in any phone you want and you can refill with “Talktime” as you please.\nIn this article, I’m going to share how to get a SIM card in India.\nWhich is the best SIM card in India?","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2014/04/SIM-card-india.jpg?fit=467%2C700&ssl=1"}}},{"node":{"id":"5b962a0b87be0583274911cc","title":"Are Points and Miles Over Your Head? Here’s Your Easy Guide Toward Free Travel","source":"hippie_inheels","summary":"Because I just got my first credit card and signed up to points programs.\nOther sites on points seemed like they were selling credit card sign-ups or talked with vocabulary that confused me.\nApply for a credit card and get some points, sign up for a loyalty program.\nFor me, the next step is getting more credit cards and more points (then probably canceling them) and using his credit card guide for the next steps.\nI hope that this helps you get stoked for free travel and I hope you join me in his Facebook group to learn more and get started!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/margo-brodowicz-183156-unsplash.jpg?fit=2000%2C1333&ssl=1"}}},{"node":{"id":"5b962a0987be0583274911cb","title":"Book a Yoga Retreat in India: The Top 5 Yoga Retreats in India with Prices & Reviews","source":"hippie_inheels","summary":"So many yogis feel called to the birthplace of yoga but then overwhelmed when they start looking to book a yoga retreat in India.\nI want to help you find classes by summing up some of the best yoga retreats in India and include some of the most affordable yoga retreats in India.\nFor yoga retreats, the website bookyogaretreats.com is the most legitimate trustworthy site out there, so that is what I’ll be linking to throughout this post.\nBook a Yoga Retreat in India – The Top 5 Retreats for Beginners and Intermediate Yoga Students Based on Reviews1.\nPin this info to book a yoga retreat in India for later:Related","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/Book-Yoga-Retreats-in-India-1.jpg?fit=1024%2C683&ssl=1"}}},{"node":{"id":"5b962a0887be0583274911ca","title":"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)","source":"hippie_inheels","summary":"When I started my travel blog, that was my only skill and I wasn’t even very good at photos back then.\nThis post is going to share exactly how to start a travel blog from scratch the easiest and CHEAPEST way, step by step.\nIt is 100% possible to create a travel blog and become successful financially even if you know nothing about it.\nLearn EVERYTHING about Travel BloggingWhen I started my blog there were no posts about starting a travel blog.\nYou are also going to want to read up on everything about travel blogging, join Facebook groups about travel blogging, network, meet other travel bloggers, comment on their blogs.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-11-1.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b962a0687be0583274911c9","title":"Do You Need a Filtered Water Bottle For India Travel?","source":"hippie_inheels","summary":"Whether or not to get a filtered water bottle for India travel is something I am asked about at least once a week – and it’s asked in my India travel tips Facebook group often.\nI lived and traveled in India since 2012 and I never used a filtered water bottle.\nWhen traveling, I would buy bottled water (20 INR around $1) or if I was in a nice tourist-friendly restaurant, I would drink filtered water (served free).\nOptions for a filtered water bottle for India travelIf you would rather bring a filtered water bottle, usually the biggest concern is if the bottle will clean the water enough to make sure you won’t get sick.\nPIN these tips on if you need a filtered water bottle for India travel:Related","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/07/Goa-Hippie-in-Heels-Mapusa-103.jpg?fit=1024%2C683&ssl=1"}}},{"node":{"id":"5b9629f687be0583274911c8","title":"The New Cheapest Way to Find Multicity Flights","source":"hippie_inheels","summary":"The Kiwi nomad tool is the coolest thing I’ve seen for travel this year and I had to share it with you because it’s definitely the cheapest way to find multicity flights that I’ve found.\nKiwi’s Nomad Tool: the new cheapest way to find multicity flightsSo in the past, I’ve written about how you can use Kiwi.com’s multicity tool to fly to a bunch of cities in one booking, super cheap.\nNo more figuring out which order to go in to get the cheapest flights and doing from point A to B to C, etc.\nAs you can see, it created the order for me in which I’d get the cheapest flight.\nPin this info on the cheapest way to find multicity flights for later:Related","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/stephen-leonardi-412897-unsplash.jpg?fit=1600%2C2000&ssl=1"}}},{"node":{"id":"5b9629f687be0583274911c7","title":"Best Travel Gadgets: These Are the Ones I Swear By!","source":"hippie_inheels","summary":"I’ve tried my fair share of gadgets and gizmos over my years of travel, and it seems like there are new things coming out every day.\nHere are some of the best travel gadgets I personally use and swear by and have for quite a while.\nBest Travel GadgetsLuggage WeigherYou guys – GET a luggage weigher!\nTurn on your JavaScript to view contentWhen you travel with a phone, kindle, and camera it seems like there are never enough plugs.\nTurn on your JavaScript to view contentFor More Best of PostsPin “Best Travel Gadgets” for later!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/08/best-travel-gadgets.jpg?fit=700%2C400&ssl=1"}}},{"node":{"id":"5b9629f387be0583274911c6","title":"First Time Using Airbnb Guide - Hippie in Heels","source":"hippie_inheels","summary":"This Airbnb discount code is only for your first time using Airbnb and setting up a new account.\nClick search.\nTheir customer service is known to be good but in my years of using Airbnb, I’ve never had to reach out to them.\nHere is the Airbnb promo code again: click here to sign upI hope you enjoy your first Airbnb stay!\nPin this guide to Airbnb and Airbnb promo code for later:Related","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/12/Merida-Airbnb-4.jpg?fit=1024%2C769&ssl=1"}}},{"node":{"id":"5b9629f387be0583274911c5","title":"I'm Moving: We Are Leaving India This Week","source":"hippie_inheels","summary":"But, since my flight out of India is Tuesday and I really am moving, I can’t put it off any longer.\nI have been in India since 2012 and now we are moving out of India.\nEven getting our animals out of India, was so typical India, we got scammed completely and lost a lot of money.\nThat’s where I am now – looking out over the balcony, enjoying Mumbai this weekend and just trying to believe that I’m really moving from India after all this time.\nI’ve never written just about India and usually do just one big India trip each year, spending most of my time in Goa.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Goa-Friends-Home-4.jpg?fit=1032%2C774&ssl=1"}}},{"node":{"id":"5b9629ef87be0583274911c3","title":"Luxury Guide to Perth","source":"hippie_inheels","summary":"A Luxury Guide to PerthTell us a little about yourself and tell us why you’re an expert on luxury travel in Perth.\nI’m obsessed with finding the best of everything that Perth has to offer – and this includes luxury travel.\nAre there any fun luxury activities for the adventurous traveler in Perth?\nScarborough Beach has the most to offer with a white sand beach perfect for swimming and lounging, nearby restaurants, and shops.\nCoco’s is also a favorite place of mine, an upscale venue in South Perth with views of downtown Perth known for its seafood and prime beef.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/06/luxury-guide-to-perth.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b9629ee87be0583274911c2","title":"Ultimate Bangalore Local Food Guide","source":"hippie_inheels","summary":"I want to share with you my personal Bangalore local food guide.\nBangalore Local Food Guide01 | CTRShree Sagar, popularly known as CTR, is one of the oldest restaurants in Bangalore.\n03 | Veena Food StoreSourceVeena Food Store is a small food joint in Old Bangalore, serving excellent authentic breakfast dishes at super cheap prices since 1977.\nLet me know in comments if you have any other place serving exotic local food in Bangalore.\nPin this Bangalore Local Food Guide for later:Related","info":{"author":"Reshma Narasing","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Bangalore-Food-Guide-2.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629ec87be0583274911c1","title":"Luxury Guide to Adelaide","source":"hippie_inheels","summary":"A Luxury Guide to AdelaideTell us a little about yourself and tell us why you’re an expert on luxury travel in Adelaide.\nSleek rooms with amazing views of Adelaide and jaw droppingly fabulous bathrooms and make this a perfect city destination.\nIf swimming with sharks is your idea of adventurous, then Adelaide is the perfect place!\nGlenelg is the best place to be in Adelaide, in my biased opinion!\nIn Glenelg, the Grand (again) offers a great view, as do any of the bars along the marina.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Adelaide.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629ec87be0583274911c0","title":"Luxury Guide to Hobart","source":"hippie_inheels","summary":"A Luxury Guide to HobartTell us a little about yourself and tell us why you’re an expert on luxury travel in Hobart, Australia.\nYou can’t go past the iconic Lenna of Hobart Hotel.\nThe rooms are gorgeous and overlook Salamanca Place and the Hobart waterfront, which is exactly what you want on a trip to Hobart.\nAgain, there are so many great hang outs in Hobart, but you absolutely can’t go past my three favourites: Sullivan’s Cove, Battery Point and Salamanca Place.\nEvery other day, it’s the perfect place to potter away the hours as you hop between cafes, art houses, boutique shops and trendy bars.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/05/luxury-guide-to-hobart.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b9629eb87be0583274911bf","title":"Luxury Guide to Sydney","source":"hippie_inheels","summary":"A Luxury Guide to SydneyTell us a little about yourself and tell us why you’re an expert on luxury travel in Sydney.\nThe Park Hyatt on the Sydney Harbour has to be the best spot.\nThere isn’t a bad place to hang out in Sydney if you’re by the water.\nOriginally from Ireland, he has made Sydney his home, opening two of the best (in my opinion) restaurants in the city.\nThey now have several branches around Sydney – Surry Hills, Darlinghurst and the Star Casino.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Sydney.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629e987be0583274911be","title":"Luxury Guide to Leuven","source":"hippie_inheels","summary":"A Luxury Guide to LeuvenTell us a little about yourself and tell us why you’re an expert on luxury travel in Leuven, BelgiumHi there!\nLuxury in Leuven isn’t screamy or glittery, it’s classy, subtle and you need to know where to find it.\nCouvert Couvert on the Sint-Jansbersesteenweg 171 in Heverlee, just outside the city center, boasts a Michelin star.\nIf you want to stay in the city center, head to Zarza on Bondgenotenlaan 92.\nBeing a rather small city, Leuven doesn’t really have a club scene.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/luxury-guide-to-leuven.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629e787be0583274911bd","title":"Luxury Guide to Vienna","source":"hippie_inheels","summary":"A Luxury Guide to ViennaTell us a little about yourself and tell us why you’re an expert on luxury travel in Vienna.\nThe Grand Dame of luxury hotels in Vienna is the Hotel Imperial.\nBut if you want more local luxury designers you are better off heading to the grittier 4th district.\nThere’s some gorgeous Heurigers with views looking over the city of Vienna and the Danube which are perfect for sunset views.\nRead on: Travel Guide to Austria — there’s so much more to see after Vienna!","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/11/luxury-guide-to-vienna-feature.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b9629e587be0583274911bc","title":"Rio de Janeiro Brazil - Hippie In Heels","source":"hippie_inheels","summary":"The following is a guest post by Fleur Rollet-Manus about how to have the best time at Rio!\nThis guide to Rio Carnival will hopefully help you plan your trip to Rio de Janeiro.\nI’m now reliving my time in Rio de Janerio to bring you my crazy guide to Rio Carnival, the most famous and celebrated festival on Earth!\nStreet parties take place all over Rio, but there isn’t a party like a Lapa street party.\nWhere to Sleep At Rio CarnivalTired, weary, hung-over, Carnival will test even the most religious partygoers.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-12.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629da87be0583274911bb","title":"You’ve Got Me Wonton More: A Guide to Hong Kong’s Best Hidden Eateries","source":"hippie_inheels","summary":"Hong Kong has an overwhelming amount of choice for a quick bite to eat, but with this guide to Hong Kong’s best hidden eateries, we’re letting you in on all the secrets.\nguide to Hong Kong’s best hidden eateriesI frowned at the mystery meat floating in my broth and looked at my friend, Jeff, questioningly.\nA classic Hong Kong scene.\nIn my quest to find the best truly local Hong Kong eateries I enlisted the help of 3 local foodies; Jeff, Justin, and Chia.\nEach of them is worth visiting not only for their food but also for their uniquely Hong Kong setting.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/hong-kong-best-food-2.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629d787be0583274911b9","title":"a week in Hong Kong - Hippie In Heels","source":"hippie_inheels","summary":"This is a Hong Kong itinerary for one week in Hong Kong, although you can tweak it to shorter or longer!\nHong Kong ItineraryHong Kong is, above all, a place where different cultures meet together -Cantonese, British and Mandarin.\nDay 1: Overlooking The Hong Kong City & Victoria HarborAfter landing, it’s best to take some rest, have your lunch and then to witness the Hong Kong Skyline.\nDay 3: Hong Kong Museum Of HistoryOn the third day, you can get the best of Hong Kong by visiting Hong Kong Museum of History.\nSo, make sure to make the most of your one week Hong Kong itinerary.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/hong-kong-itinerary3.jpg?fit=560%2C419&ssl=1"}}},{"node":{"id":"5b9629d787be0583274911b8","title":"A Luxury Guide to Beijing","source":"hippie_inheels","summary":"A Luxury Guide to BeijingTell us a little about Beijing and tell us why you’re an expert on luxury travel there.\nBeijing is much less expensive than other cosmopolitan cities around the world, meaning you can have a luxury vacation on a budget.\nIf you’re looking for luxury, be sure to check out the Shangrila’s World Summit Wing Hotel.\nThis park is by far the best place for people watching in all of Beijing.\nThe best place for pampering in Beijing is Green T House.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Beijing.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629d387be0583274911b7","title":"Luxury Guide to Cochabamba","source":"hippie_inheels","summary":"A Luxury Guide to CochabambaTell us a little about yourself and tell us why you’re an expert on luxury travel in Cochabamba.\nDue to living in this city for a long time, and the lifestyle I have here, I consider myself as an expert in luxury travel here in Cochabamba.\nCochabamba, is not a very well-known destination, and therefore maybe not the most obvious destination if you look for glamor.\nThat must be Gran Hotel Cochabamba.\nA stay at Gran Hotel Cochabamba, is like being in the countryside in the city due to the big gardens.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Cochabamba.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629ce87be0583274911b6","title":"A Complete Guide to Costa Rica - Hippie In Heels","source":"hippie_inheels","summary":"I’m going to share exactly where to go in Costa Rica to have the best trip possible!\nOut of all of the countries I’ve ever had the fortune of visiting, Costa Rica tops several notorious lists.\nBut just because Costa Rica emphasizes protected environmental activities doesn’t mean that they can’t be fun and exciting, too.\nSnorkeling in the CahuitaI’m a sucker for a beautiful body of water — a feature which Costa Rica certainly doesn’t fail to deliver.\nTasting Authentic Costa Rican CuisineWhat would a trip to Costa Rica be without a bit of tasty food — or comida rica, as the natives like to say?","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/02/Where-to-go-in-Costa-Rica.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629c587be0583274911b5","title":"Chilling Out in St Ives With Ben’s Family (and some travel tips)","source":"hippie_inheels","summary":"Ben was really excited when this year his family decided to do their holiday in St. Ives!\nGetting to St IvesYou can take the train to St Ives from London, no problem.\nWhen to visit St Ives and How to find a hotel in St IvesSt Ives is SO popular and beautiful that it can get crowded.\nWhat to do in St IvesThe best thing to do in St Ives is, of course, the beach!\nThere are a few beaches in St Ives, and the best beach for surfing is Porthmeor, which is pictured here.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/St-Ives-Travel-50.jpg?fit=683%2C1024&ssl=1"}}},{"node":{"id":"5b9629c487be0583274911b4","title":"Luxury Guide to Tofino","source":"hippie_inheels","summary":"A Luxury Guide to TofinoTell us a little about yourself and tell us why you’re an expert on luxury travel in Tofino.\nOne day I’ve been told by a fellow traveller there exists a magical place onVancouver Island called Tofino.\nWhat about boutique hotels in Tofino, of them all, which would you send your friends or family to stay at?\nThere are many other unique affordable places to choose from and thanks to the geography they all are facing the Pacific ocean.\nIf you have a big date night, what are the most delicious restaurants in Tofino and what are their best dishes?","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/02/luxury-guide-to-tofino.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b9629c387be0583274911b3","title":"Luxury Guide to Whistler","source":"hippie_inheels","summary":"A Luxury Guide to WhistlerTell us a little about yourself and tell us why you’re an expert on luxury travel in Whistler.\nThere are hundreds of reasons why you should make Whistler your next luxury travel destination.\nFrom luxury hotels back-dropped by snow-capped mountains to some of the best restaurants in the world – Whistler has everything you could ask for of a luxury travel destination.\nWhistler has everythng from dog-sledding the nearby Callaghan Valley, a wine tasting tour of Whistler village and surrounding areas and heli skiing over Whistler Blackcomb Mountain.\nA close second is Araxi in Whistler village which has some very innovative dishes includingQuebec Rabbit dish (which is my personal favourite) .","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-whistler.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b9629c187be0583274911b2","title":"Luxury Guide to York","source":"hippie_inheels","summary":"A Luxury Guide to YorkTell us a little about yourself and tell us why you’re an expert on luxury travel in York.\nThe city of York boasts one of the highest numbers of independent shops within a city centre in the UK.\nThe Royal York Hotel is my Top 5* hotel in York, although the gym and spa are currently going under some renovation.\nThe Royal York Hotel has luxury rooms and is situated right by York railway station.\nThe Grand Hotel in York (formerly Cedar Court) is another top luxury hotel choice.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/03/luxury-guide-to-york-001.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b9629c187be0583274911b1","title":"Luxury Guide To Isle Of Wight- Hippie in Heels","source":"hippie_inheels","summary":"A Luxury Guide to New ForestTell us a little about yourself and tell us why you’re an expert on luxury travel in the New Forest.\nThank goodness he did – it is a massive area of unenclosed grazing and heathland in between Southampton and Bournemouth.\nWith such a good choice of luxury hotels there is of course a plethora of fantastic restaurants to enjoy too.\nIt is easy to hire bikes or arrange a hack – with so much choice, each hotel will have their own recommendations.\nI wouldn’t say we have designer hotspots but there is plenty of choice for a spot of shopping.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-new-forest.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b9629c087be0583274911b0","title":"Luxury Guide to Sheffield","source":"hippie_inheels","summary":"A Luxury Guide to SheffieldTell us a little about yourself and tell us why you’re an expert on luxury travel in Sheffield.\nLocation: 111 Arundel Street, Sheffield, S1 2NTLet’s talk desserts in Sheffield– what place makes the best?\nLocation: COW Sheffield, 156-160 West Street, S1 4ESWhat are a couple of the best salons and spas in Sheffield?\nLocation: 67 Victoria St, Sheffield S3 7QDTime for a great sunset view in Sheffield… where would you go?\nThe sun setting over these craggy, green hills is by far the best place to nature spot in Sheffield.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-sheffield.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b9629be87be0583274911af","title":"Luxury Guide to Toronto Financial District","source":"hippie_inheels","summary":"A Luxury Guide to Toronto Financial DistrictTell us a little about yourself and tell us why you’re an expert on luxury travel in the Financial district of Toronto.\nFinancial district, is in the heart of Toronto with a number of great restaurants, sports centers, shopping and of course, spas.\nFinancial district, quiet on the weekend, is hustling and bustling during the week and easily accessible through the internal PATH system or outdoors.\nWhat about boutique hotels in the Financial district, of them all, which would you send your friends or family to stay at?\nIt’s more chilled out during the weekdays but if you are looking to party.. these would be some places near financial district.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/05/LUXURY-GUIDE-TORONTO.jpg?fit=560%2C430&ssl=1"}}},{"node":{"id":"5b9629bd87be0583274911ae","title":"Luxury Guide to Vancouver","source":"hippie_inheels","summary":"A Luxury Guide to VancouverTell us a little about yourself and tell us why you’re an expert on luxury travel in Vancouver.\nOf course in a beautiful place like Vancouver my curiosity went wild and I spent every minute I wasn’t working exploring the city.\nWhat 5 star hotel is the best in Vancouver?\nThe Pan Pacific Vancouver is the perfect luxury hotel to be spoiled at.\nWhat about boutique hotels in Vancouver, of them all, which would you send your friends or family to stay at?","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-vancouver-feature.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b9629bd87be0583274911ad","title":"How to Stop at Niagara Falls from Toronto to Ohio","source":"hippie_inheels","summary":"We took a family vacation from Ohio to Toronto and on the way home wanted to see Niagara Falls.\nIf you want to stop at Niagara Falls on your way home from Toronto to Ohio, it’s easy to do just before crossing Rainbow Bridge.\nFrom Toronto you get on Queen Elizabeth way to 420E which takes you right to the falls.\nThen after seeing the falls, you can follow signs to “USA” or “Rainbow bridge” easy peasy!\nNiagara falls was amazing and totally worth a stop!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/07/IMG_20150717_091453_HDR-002.jpg?fit=720%2C405&ssl=1"}}},{"node":{"id":"5b9629bb87be0583274911ac","title":"Top 5 Reasons to Make a Stopover in Iceland","source":"hippie_inheels","summary":"Making a stopover in Iceland has been of my best travel decisions of 2017 thus far.\nI’m going to share a handful of reasons to make a stopover in Iceland, although the images alone will probably convince you.\nSo, here are my top 5 reasons to make a stopover in Iceland – even just for 48 hours1.)\nPonies, ponies, and more ponies.\nAll over Iceland, you can find natural hot springs and many hotels have manmade springs on site.","info":{"author":"Monet Sommers","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/05/TOP-5-REASONS-TO.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629ba87be0583274911ab","title":"Luxury Guide to Liverpool","source":"hippie_inheels","summary":"A Luxury Guide to LiverpoolTell us a little about yourself and tell us why you’re an expert on luxury travel in Liverpool.\nBefore living in Liverpool my understanding of the city was tracksuits, perms and mustaches thanks to the Fast Show.\nAre there any fun luxury activities for the adventurous traveler in Liverpool?\nThis Liverpool hotel spa offers its visitors a chance to enjoy a host of amazing treatments from massages and facials to body contouring and champagne wraps.\nCombine all this with a 40sqft hydrotherapy pool and you have the best spa experience in Liverpool.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/luxury-guide-to-liverpool.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b9629b787be0583274911aa","title":"Luxury Guide to Amsterdam","source":"hippie_inheels","summary":"A Luxury Guide to AmsterdamTell us a little about yourself and tell us why you’re an expert on luxury travel in Amsterdam.\nMy work actually required me to get into the luxury places as the clients simply demanded the hottest and most luxurious places in the city as event locations.\nMy boyfriend is an artist manager in the dance music industry so he always knows the best places to dance.\nAlso I have journalist friends in the city who always update me about the best places to go.\nBorn in former Jugoslavia, now a Dutch National living in Amsterdam, Ivana is never in the same place for long.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/11/luxury-guide-to-amsterdam-feature.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b9629b687be0583274911a9","title":"Luxury Guide to Phnom Penh","source":"hippie_inheels","summary":"A Luxury Guide to Phnom PenhTell us a little about yourself and tell us why you’re an expert on luxury travel in Phnom Penh.\nWe’ve been living, working and traveling in Asia since 2011 and have recently made Phnom Penh our new home.\nWhat makes Phnom Penh a perfect destination for travelers seeking a glamorous trip?\nPhnom Penh may not be known as a glamorous destination, but that is quickly changing.\nYou can live in luxury for very little money, so we can live and travel much more comfortably here in Phnom Penh than we could in the USA.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/2.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629b087be0583274911a8","title":"A Luxury Guide to Hamburg, Germany","source":"hippie_inheels","summary":"A Luxury Guide to Hamburg Germanyone of the many canals of HamburgTell us a little about Hamburg and tell us why you’re an expert on luxury travel there.\nHamburg is one of the three cities in Germany with over one million inhabitants.\nThis rather suburban area is located right at the river Elbe and makes this part of Hamburg very idyllic.\nMake sure you grab a drink or a bite to eat at the “Alex” as you will have a great view over the Binnenalster .\n[Book a room | Book a flight to Hamburg Germany] Julia Haase (23) is a German expat and a recent graduate of Political Communications in London.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Hamburg.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629ab87be0583274911a7","title":"4 Clichés About French Travelers They Wish You’d Stop Thinking","source":"hippie_inheels","summary":"The following is a guest post about breaking stereotypes of French girls and clichés about French travelers.\nI do wear scarves, love red wine and think french bread is the only kind of real bread.\nWrong Clichés About French Travelers1.\nSometimes it’s just sexism, but it often gets worse when people find out I’m French.\nJust, please, get the above clichés about French travelers out of your head.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/Cliche-About-French-Travelers-6.jpg?fit=683%2C1024&ssl=1"}}},{"node":{"id":"5b9629a987be0583274911a6","title":"Luxury Guide to Jakarta","source":"hippie_inheels","summary":"A Luxury Guide to JakartaTell us a little about yourself and tell us why you’re an expert on luxury travel in Jakarta.\nA lot of people don’t really know this but Jakarta is a great city for indulging in all things luxury.\nAnd most of them are really, really high end.\nThis is tough because Jakarta is full of really, really great restaurants, so I’ll just name a couple!\nProbably the best place to get crème brulee is at Labruletory (located in a funky “anti-mall” called Pasar Santa).","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/08/luxury.jpg?fit=780%2C585&ssl=1"}}},{"node":{"id":"5b9629a887be0583274911a5","title":"A Luxury Guide to Bali","source":"hippie_inheels","summary":"A Luxury Guide to BaliTell us a little about yourself and tell us why you’re an expert on luxury travel in Bali.\nI’m Claire, author of BackpackingBella.com, where I share my stories and tips for enjoying beautiful travel on a budget.\nFor over a decade I worked in the media and was lucky enough to visit top restaurants and 5 star hotels.\nThen I discovered Bali, where you can enjoy a stay in beautiful surroundings and feel like a VIP, on a tiny budget.\nA lover of food, yoga, beaches and nature, you can follow Claire’s insight into beautiful travel on a budget at BackpackingBella.com.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Bali.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629a787be0583274911a4","title":"Villa Sungai Bali: Private Pool Villa","source":"hippie_inheels","summary":"If you’re on Instagram, no doubt you see girls staying at private pool villas every 10 photos on your feed!\nIt seems like most “digital nomads” live in Bali, and bounce from villa to villa.\nI stayed for two nights at Villa Sungai, which is inland about 40 minutes from Seminyak (driving through Canggu).\nThe Villa Pool & FoodThe whole villa has three rooms and they look about the same although one is larger than the other two.\nWe ended up watching Lion which was so good and I don’t think anyone can watch this without crying.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Villa-Sungai-Bali-Pool-Villa-35.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629a587be0583274911a3","title":"A Luxury Guide to Lake Bled","source":"hippie_inheels","summary":"Tell us a little about yourself and tell us why you’re an expert on luxury travel in Lake Bled.\nWhat makes Lake Bled a perfect destination for travelers seeking a glamorous trip?\nLake Bled is known worldwide for its stunning beauty, but maybe not everybody knows that Slovenia is a leader in the wellness and thermal Spas field, as well as in hospitality, making of Lake Bled a mecca for people seeking for a 5 stars getaway.\nMy favorite hotel in Lake Bled is the Hotel Golf , which is actually a 4 star.\nIt’s a very big block of cream and pastry, and it’s really really good.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Lake-Bled.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629a487be0583274911a2","title":"Luxury Guide to Santa Marta","source":"hippie_inheels","summary":"A Luxury Guide to Santa MartaTell us a little about yourself and tell us why you’re an expert on luxury travel in Santa Marta.\n5”2 ½, Scottish with a love for all things vintage and thrift store so luxury isn’t always my bag but we struck it lucky last year in Santa Marta, Colombia!\nWhat makes Santa Marta a perfect destination for travelers seeking a glamorous trip?\nSanta Marta is sunny!\nI’d recommend heading to Careera 3 in Santa Marta, especially at the weekend.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-santa-marta.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b9629a387be0583274911a1","title":"Adventure on Colombian Coast (5 EPIC things to do)","source":"hippie_inheels","summary":"If you want adventure on Colombian coast, look no further.\nInevitably, most backpackers hit up the extraordinary Caribbean coast, basing themselves in the gringo hotspots of Cartagena and Santa Marta.\nAlthough the Colombian coast is actually home to a few of these volcanoes, Volcán de Lodo El Totumo is the most accessible, via a half-day trip from Cartagena.\nMotorcycle along the coast to RiohachaYou don’t have to be a hefty tattooed man to embrace the freedom of a motorcycle.\nThough most visitors choose to also sleep at Elemento, you can visit on a day pass for a cool 20,000 pesos.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/04/COLOMBIAN-COAST-1.jpg?fit=683%2C1024&ssl=1"}}},{"node":{"id":"5b9629a387be0583274911a0","title":"A Luxury Guide to Medellin","source":"hippie_inheels","summary":"A Luxury Guide to MedellinTell us a little about Medellin and tell us why you’re an expert on luxury travel there.\nI’ve been living in Medellin, Colombia’s second largest city for the last 7 months and I absolutely love it here.\nI definitely recommend taking the Medellin city tour to learn more about the city.\nIf you have a big date night, what are the most delicious restaurants in Medellin and what are their best dishes?\n[ Book a room / Book a flight to Medellin ] Lisa Eldridge is a travel writer and self-confessed travel addict currently living in Medellín, Colombia.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Medellin.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b9629a187be05832749119f","title":"Glamping at Sandat Glamping in Ubud Bali (a Review)","source":"hippie_inheels","summary":"Upon checking in at Sandat Glamping, you’re given a welcome drink and left to explore while they get your room key.\nUnfortunately, I only had one morning here and I had other plans (exploring with Duara Travels, which I’ll write about later on).\nThe Rooms at Sandat GlampingJust wait for these rooms…How amazing are these tents!\nI really wish I had one more day to spend here so I could just chill at the room.\nFood & Spa at Sandat GlampingBreakfast is a buffet down in the main bamboo room.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Sandat-Glamping-Ubud-Bali-53.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b9629a087be05832749119e","title":"The “P.S. I Love You” Guide to Ireland","source":"hippie_inheels","summary":"Call me a hopeless romantic, but I just love the Rom-com, P.S.\nThe PS I Love You Guide to IrelandIf you’re like me and found yourself daydreaming about Ireland; casually boating around beautiful lakes by day, and being serenaded at the local pub by night…then this post is for you.\nAbout an hour’s drive south of Dublin, you enter into Ireland’s gorgeous countryside where the majority of the Ireland scenes from P.S.\nI Love You isn’t the first movie filmed in this part of Ireland.\nFor more Western Europe Travel Guides:Pin the PS I Love You guide to Ireland for later:Tiffany is the founder behind the faith-based travel blog, Lavender Vines.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/ps-i-love-you-guide-to-ireland-20.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b96299c87be05832749119d","title":"Luxury Guide to Cannes- Hippie in Heels","source":"hippie_inheels","summary":"feature image: Bs0u10e0A Luxury Guide to CannesTell us a little about yourself and tell us why you’re an expert on luxury travel in Cannes.\nI have been to Cannes about 10 times as I regularly attend the Cannes Film Festival that takes place every May.\nDuring the 10 days of the festival, Cannes becomes a melting pot of celebrities, billionaires and wannabes.\nIt is situated right on the middle of the Croisette at at 58 Boulevard de la Croisette.\nSome of the biggest yachts in the World show up during the Film Festival in Cannes and many of them can be chartered.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/luxury-guide-to-cannes.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b96299b87be05832749119c","title":"Luxury Guide to Saint Tropez","source":"hippie_inheels","summary":"Luxury Guide to Saint TropezTell us a little about yourself and tell us why you’re an expert on luxury travel in St. Tropez.\nSaint Tropez is the epitome of luxury travel and perfect for those seeking a luxury lifestyle.\nWhat about boutique hotels in Saint Tropez, of them all, which would you send your friends or family to stay at?\nMy favourite fine dining experience in Saint Tropez can be found at L’Escale, located in the Port of Saint Tropez.\nI always enjoy a sunset cocktail at the Senequier in Saint Tropez port as I settle down for a good old spot of people watching in the circus that is Saint Tropez marina at sundown.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/01/BB-st-Tropez-1.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b96299a87be05832749119b","title":"Tokyo Travel Tips: 10 Things You Need to Know Before You Travel to Tokyo","source":"hippie_inheels","summary":"Travelers love, love, love to finally make that trip to Tokyo, Japan: home of renowned intersections, sparkling skyscrapers, dream cuisine, and so much more.\nRead the following list of Tokyo travel tips and prepare to have the ultimate experience as you navigate Tokyo.\nTokyo Travel Tips For First Time VisitorsVisitors love to discover “weird Tokyo,” i.e.\nIt gets rather annoying having to buy a one-time use train pass each time you need to go somewhere.\nYou can get one at the same ticket stands you buy your standard train pass.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/08/tokyo-travel-tips-1.jpg?fit=683%2C1024&ssl=1"}}},{"node":{"id":"5b96299787be05832749119a","title":"Luxury Guide to Kiev","source":"hippie_inheels","summary":"Every Sunday, this spot will feature the luxury side of an awesome city.\nA Luxury Guide to KievTell us a little about yourself and tell us why you’re an expert on luxury travel in Kyiv, Ukraine.\nAfter spending six months in Kyiv I had the opportunity to experience luxury travel on every level, including a warm welcome as a foreigner.\nWhat about boutique hotels in Kiev, of them all, which would you send your friends or family to stay at?\nLet’s talk desserts in Kiev- what place makes the best?","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/luxury-guide-to-kiev.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b96298f87be058327491199","title":"A Luxury Guide to Nairobi","source":"hippie_inheels","summary":"A Luxury Guide to NairobiTell us a little about yourself and why you’re an expert on luxury travel in Nairobi.\nI first visited Nairobi, Kenya way back in 2002.\nTravelers seeking an authentic Out of Africa luxury safari experience won’t be disappointed in Kenya.\nThen, enjoy a 4-course meal under canvas followed by bed in a luxury safari tent.\n[Book a room | Book a Flight] Denver-based travel blogger Sarah Fazendin has spent her entire career in luxury travel, adventuring in style across 30+ countries.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Nairobi.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b96298e87be058327491198","title":"Luxury Guide to Kathmandu","source":"hippie_inheels","summary":"A Luxury Guide to KathmanduTell us a little about yourself and tell us why you’re an expert on luxury travel in Kathmandu.\nNepal isn’t widely known as a luxury travel destination, but there plenty of high-end hotels, resorts, spas and boutiques around the country—and particularly in Kathmandu—to attract travellers who like a bit of luxury.\nLuxury hotels and other experiences are uniquely Nepali in design and flavor.\nIn Patan, the Patan Museum and Patan Durbar Square cannot be topped.\nThe luxury hotels provide good massage and spa services, but my favourite is Wellness Spa, above Café Cheeno in Patan.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-kathmandu.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b96298b87be058327491197","title":"Funny Peek Inside Langkawi 3D Museum","source":"hippie_inheels","summary":"The brand new Langkawi 3D museum was such a silly fun way to spend the day.\nIt’s funny that in Asia, to me anyways, it seems people are more apt to take lots of photos.\nI see more selfie sticks here, more people taking selfies, and so it just seems perfect to have a museum like this.\nThere are over 100 pieces of 3D art to play around with.\nThis is located in Oriental Village and you can spend a whole day here doing the 3D museum, skycab, shopping, and much more I explain over in this post: what to do in Langkawi.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/IMG_20150610_151613_HDR-01.jpg?fit=560%2C315&ssl=1"}}},{"node":{"id":"5b96298187be058327491196","title":"This is India! (two)- Hippie in Heels","source":"hippie_inheels","summary":"We walk into an Indian shop in Little India, Singapore.\nThe Indian man reminds us of home and Ben asks, do you do Indian recharge?\nThe man says, “you have Indian SIM, Indian phone?” Ben assures him he does.\nIn case you aren’t familiar with the recharge process, most people have cell phones with refill-able SIM cards in India.\nNow, it would have been simpler to say, “I don’t do Indian recharge” but he didn’t want to say that!","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-0061-e1401989462955.jpg?fit=357%2C532&ssl=1"}}},{"node":{"id":"5b96298087be058327491195","title":"This is India! (nine)","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nWhat else I’ve been up to:This week I’ve been up to nothing outside this site in terms of writing!\nThis is India!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-19-at-11.31.48-AM.jpg?fit=560%2C368&ssl=1"}}},{"node":{"id":"5b96297f87be058327491194","title":"This is India! (eight)","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nEveryone loves smoking in India, but this was new.\nThis is India!","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-19-at-11.31.37-AM.jpg?fit=560%2C372&ssl=1"}}},{"node":{"id":"5b96297f87be058327491193","title":"This is India! (twelve)","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nThe teacher says I’m “slow” and “not very good” ha ha ha!\nThe bank teller saw my passport and said, “why don’t you open a bank account?” I told him I didn’t think I could open a bank account in India without OCI or PIO.\nThis would mean I could wire money money from home, online, and not deal with Mapusa traffic.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/23b06d79adc7c17db74201affd37eda6-001.jpg?fit=374%2C560&ssl=1"}}},{"node":{"id":"5b96297c87be058327491192","title":"This is India! (seven)","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nThe flight attendants were losing their minds over it!\nIf you’ve ever been on a plane or train in India you know exactly what I’m talking about.\nSo the flight attendants yelled, I laughed, it was the start of a terrible 16 hour flight.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-19-at-11.14.41-AM.jpg?fit=535%2C254&ssl=1"}}},{"node":{"id":"5b96297b87be058327491191","title":"This is India! (six)","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nSometimes when you think the objective is impossible, especially in the chaos of India, you get a big surprise.\nWhat’s worse than the aiports in India are the long-ass lines at customs.\nAn Indian man in the initial line starts to yell, “You embarrass India!","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-19-at-11.31.32-AM.jpg?fit=560%2C269&ssl=1"}}},{"node":{"id":"5b96297487be058327491190","title":"This is India! (eighteen)","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nThis really has more to do with a blonde moment than India, but hey at least you learned an important lesson about voltage- imagine what it can do to your electronics!\nHere’s to hoping I don’t get electrocuted in India again.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/78cfe0a1b9c4bd5ab8106be86682c7d5.jpg?fit=378%2C560&ssl=1"}}},{"node":{"id":"5b96297287be05832749118f","title":"Luxury Guide to Riviera Maya","source":"hippie_inheels","summary":"A Luxury Guide to Riviera MayaTell us a little about yourself and tell us why you’re an expert on luxury travel in Riviera Maya.\nCheck out our guide to Riviera Maya here!\nWhat makes Riviera Maya a perfect destination for travellers seeking a glamorous trip?\nWhat about boutique hotels in Riviera Maya, of them all, which would you send your friends or family to stay at?\nAre there any fun activities for the adventurous traveler in Riviera Maya?","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/luxury-guide-to-riviera-maya.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b96296e87be05832749118e","title":"This is India! 28","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nI think it’s because secretly we love watching other people’s drama and thank god we’re not involved.\nI think watching fighting in India is like watching a Spanish soap opera when everyone starts joining in on the fight.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2359695612_6bd034e6d1_b.jpg?fit=560%2C419&ssl=1"}}},{"node":{"id":"5b96296887be05832749118d","title":"This is India! 36","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nWhat I was up to other than here:I answered some questions from a really cool Indian blogger, Renuka about being an expat in India: Is India an Ideal Country for Expats?\nand also participated in a post full of travel bloggers answering this question What’s your Craziest Story from a Foreign Country?","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/b560c31317127fcd0fd1c49fdd0dfc32.jpg?fit=427%2C640&ssl=1"}}},{"node":{"id":"5b96296787be05832749118c","title":"This is India! 27","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nThere isn’t much to say except that this sand is legally required at petrol pumps in India, you know, in case of fire:Luckily Vagator pump has four, so I think they’re set.\nThis is India!","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/8523236119_91f0c5dd26_b.jpg?fit=560%2C374&ssl=1"}}},{"node":{"id":"5b96296587be05832749118b","title":"This is India! 33","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nNow your story,You’ll notice in India lots of ads are paintings.\nThese ads are on virtually every building in India, and I would be so sad for the people if these huge companies weren’t paying.\nNot sure the truth on this one, does anyone know – share in the comments!","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/IMG_46771.jpg?fit=800%2C601&ssl=1"}}},{"node":{"id":"5b96296287be05832749118a","title":"Airbnb in Merida, Mexico: The Cutest Merida Airbnb's + Unique Merida Hotels","source":"hippie_inheels","summary":"I LOVED the unique boutique hotels here but loved the Airbnb’s in Merida even more.\nAirbnb in Merida: Cool, Cute, Affordable Airbnb’s in Merida + Some Unique Hotel OptionsWhy do I love Airbnb?\nThis is the first Airbnb in Merida we stayed at – we booked two nights but then wanted to stay longer.\nThe way this place has been restored is so stylish; it’s the coolest Airbnb I’ve stayed at.\nIf you want a hotel, I can recommend Hotel Hacienda Merida.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/12/Merida-Airbnb-4.jpg?fit=1024%2C769&ssl=1"}}},{"node":{"id":"5b96296087be058327491189","title":"Luxury Guide to Oslo","source":"hippie_inheels","summary":"A Luxury Guide to OsloTell us a little about yourself and tell us why you’re an expert on luxury travel in Oslo.\nAlso, as the Content Manager for travel app and website Stay.com, I meet many inspiring locals and they help me discover the best luxury places in the city.\nThe Thief is definitely my number one luxury hotel in Oslo.\nWhat about the best boutique hotels in Oslo, of them all, which would you send your friends or family to stay at?\nClaudia is a Dutch world traveler who moved to Oslo after a one-year backpacking trip around the world.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/02/luxury-guide-to-oslo.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b96295f87be058327491188","title":"This is India! 45","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nI got used to it, thank God, because something similar happens in India- although I don’t know if it’s because of the cost of diapers or just personal preference.\nSince you know that for adults in India, the toilet situation is different from the west, of course it would be for babies too.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/af81d912a590e0991cb561bc0a990ff2.jpg?fit=427%2C640&ssl=1"}}},{"node":{"id":"5b96295e87be058327491187","title":"This is India! 39","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nWhen in my friend Nami’s rental car, we backed up to reverse into the street and Jingle Bells started playing.\nBut, cars in India do play music outside the car so other people know they are reversing.\nHere’s a video I found on YouTube of a car reversing with music:This is India!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/e5f07906f55af0ee97831b1a4aadeda5.jpg?fit=534%2C800&ssl=1"}}},{"node":{"id":"5b96295987be058327491186","title":"Luxury Guide to Tromsø","source":"hippie_inheels","summary":"A Luxury Guide to TromsøTell us a little about yourself and tell us why you’re an expert on luxury travel in Tromso.\nIf you’re okay with staying outside of the city though, I’d recommend Malangen Brygger and Sommaroy Arctic Hotel.\nSommaroy Arctic Hotel then again is situated north of Tromso on the so called “Summer Island” where you’ll find sandy beaches and turquoise waters.\nIf you’re visiting Tromso during summer and you’d like to experience the Midnight Sun, the best place for this would be Fjellheisen.\nVanessa is a German expat living in Tromso in the Norwegian Arctic.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/luxury-guide-to-tromso-001.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b96295487be058327491185","title":"Luxury Guide to Queenstown","source":"hippie_inheels","summary":"A Luxury Guide to QueenstownTell us a little about yourself and tell us why you’re an expert on luxury travel in Queenstown.\nI’m Petra, and I’m one half of The Global Couple travel blog (the other half is my husband Shaun).\nWe have visited the town many times over the past few years, and we have tried out many luxury options that Queenstown has to offer!\nBlanket Bay, about 45 minutes’ drive from Queenstown in the small town of Glenorchy, is one of New Zealand’s top luxury hotels.\nOne of the best activities we have done (and highly recommend) is a scenic flight to Milford Sound.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/09/luxury-guide-to-queenstown9.jpg?fit=720%2C540&ssl=1"}}},{"node":{"id":"5b96295387be058327491184","title":"A Luxury Guide to Auckland","source":"hippie_inheels","summary":"I am an expert on luxury travel as I really enjoy sipping on good quality local wine and I keep up with all the latest fashion.\nAuckland has a good selection of shopping malls and nightlife with live jazz music, pently of bars and clubs in the city center.\nAuckland is built on 48 volcanos and has around 1.5 million people with a large melting pot of cultures.\nSkydive Auckland has a beautiful drop zone which lets you see Auckland city from a unique birds eye view (US$229)Where are the best hang outs during the day?\nYou don’t have to go very far – the XO bar is on the same level as the casino, XO is one of the most exclusive and up market bars in Auckland city.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-Auckland.jpg?fit=900%2C675&ssl=1"}}},{"node":{"id":"5b96295287be058327491183","title":"A Luxury Guide to Lisbon, Portugal","source":"hippie_inheels","summary":"This week is a luxury guide to Lisbon, Portugal.\nTips on Visiting LisbonA Luxury Guide to LisbonTell us a little about yourself and tell us why you can write this luxury guide to Lisbon.\nFor more things to do in Lisbon, check out that link.\n>> For more tours and activities in Lisbon, check out ViatorWhere are the best hang outs in Lisbon during the day?\nPin “Luxury Guide to Lisbon” for later!","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/07/luxury-guide-to-lisbon.jpg?fit=700%2C400&ssl=1"}}},{"node":{"id":"5b96295187be058327491182","title":"This is India! 59","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nMake sure you’re following on my InstagramI did an interview Expert – India for Girl About the GlobeA list came out called Top 100 Travel Blogs and Hippie in Heels was in the top 100.. woo hoo.\nI’m not sure what they spray in India but it’s strong and it’s pretty intense.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/04/this-is-india-59.jpg?fit=640%2C426&ssl=1"}}},{"node":{"id":"5b96295087be058327491181","title":"This is India! 58","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nI gave some tips about luxury lodging in India electronics and apps for the frequent travelerNow your story,The longer I stay in India the more it surprises me and the less I understand it.\nI would to just tell a scene I saw that combined so many different types of India all together and for some reason just made me smile.\nI don’t know why it made me smile so much, but it was just one of those moments that I was so surprised by.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/04/this-is-india-58.jpg?fit=800%2C494&ssl=1"}}},{"node":{"id":"5b96294e87be058327491180","title":"This is India! 57","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nNow your story,If you’ve been to India or read my blog often, you’ll know that of all the habits the Brits gave to India, standing patiently in the queue isn’t one of them.\nOn a flight in India is when you’ll see things that shock you… I promise you that.\nOutside India, I stay seated until it’s my aisles turn, but if you do that flying in India no one will give you a turn.\nI know, I know I’m supposed to love everything about India and only say nice things… but I do lost my temper.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/04/this-is-india-57.jpg?fit=800%2C549&ssl=1"}}},{"node":{"id":"5b96294987be05832749117f","title":"Luxury Guide to Krakow","source":"hippie_inheels","summary":"Tourist from all over to world visit Krakow to see beautiful Rynek (Old Town) and go for one-day trip to neighbouring Wieliczka, famous salt-mine.\nThere are many 5-star hotels in Krakow, but we would choose Hotel Stary.\nMainly because it’s situated in the heart of Old Town and the views from the hotel rooms are really amazing!\nWhen you are in Krakow, there’s no point for staying anywhere else.\nSo again, we’d recommend Hotel Stary and maybe Grand Hotel or Copernicus.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/08/luxury-guide-to-krakow-poland.jpg?fit=800%2C600&ssl=1"}}},{"node":{"id":"5b96294587be05832749117e","title":"This is India! (three)","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them, which has inspired this new series This is India!\nIt’s not that I want to make fun of people or have a rant- this is just meant to be an honest portrayal about my life in India through short anecdotes.\nWriting I do other than Hippie in Heels:Now for your story:One of my favorite things is that everyone rides a motorbike in India.\nI have never seen a child wear a helmet on a bike in India.\nI feel like I don’t even need to mention this, but… traffic in India is INSANE.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-0062.jpg?fit=451%2C391&ssl=1"}}},{"node":{"id":"5b96294487be05832749117d","title":"The Best Restaurants in Pretoria, South Africa (markets, too!)","source":"hippie_inheels","summary":"Because sharing is caring, below is my top choices for delicious food and where the find the best restaurants in Pretoria, South Africa.\nBest Restaurants in PretoriaFor Indian cuisine: GeetI love the fact that there are lots of Indian restaurants popping up everywhere in Pretoria!\nFor the best pizza: Toni’sFor the best pizza in Pretoria, go to Toni’s Fully Furnished Pizza Co.\nWhen it comes to food, Capital Craft serves some of the best food in Pretoria.\nThe next time you’re in Pretoria, make sure you visit these restaurants and markets for delicious food!","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/06/best-restaurants-in-pretoria-3.jpg?fit=1024%2C768&ssl=1"}}},{"node":{"id":"5b96294187be05832749117c","title":"Iconic Raffles Singapore Review","source":"hippie_inheels","summary":"The hippie made it to the Raffles & I’m going to share my Raffles Singapore review!\nRaffles Singapore ReviewI suppose you’ve already realized I love the place but I’d like to share a few photos and show you what you can expect when you stay at the Raffles Singapore hotel.\nIt’s one of the most iconic and historical buildings in Singapore and dates back to the East India trading company, hence it being named after Mr. Raffles.\nThere are a few must do’s in Singapore and awesomely two of them are right in the Raffles hotel!\nTripadvisor puts Raffles High Tea at the #2 coffee/tea place in the country.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/05/raffles-singapore-review-iconic-hotel.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b96293d87be05832749117b","title":"This is India! 75","source":"hippie_inheels","summary":"I always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nWhen I come to India, I bring loads of junk food back with me but I also bring a lot of toiletries… deodorant, lotions for skin and face and stuff like that.\nOne of the reasons is that I like certain brands, but another is that many of the toiletries you can get in India are for fairness.\nAll the commercials for beauty in India are about fairness.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/09/this-is-india-75.jpg?fit=680%2C510&ssl=1"}}},{"node":{"id":"5b96293a87be05832749117a","title":"This is India! (four)","source":"hippie_inheels","summary":"Welcome back to This is India!\nI always have funny/weird stories about India to share with friends or family when I talk to them.\nThis is just meant to be an honest portrayal about my life in India through short anecdotes.\nWriting I did Other than Hippie in Heels:an interview for Girls That Go , one of my favorite sites about female travelThis is India (four)I’ve actually mentioned this in passing when I told you last year how hard it was learning to drive in India, but it’s story worth telling in full.\nThis is India!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-05-at-1.39.55-PM.jpg?fit=560%2C466&ssl=1"}}},{"node":{"id":"5b96293787be058327491179","title":"3 Ugandan Orphans that Changed My Life","source":"hippie_inheels","summary":"Nicholas Uganda Children’s Fund thought it’d be a great idea for me to meet a few of the Ugandan orphans they help put in school.\nThe girls didn’t have watches so they guessed) they girls arrived with a baby boy in tow.\nThey handed me the baby, laughing, “white people love our babies!” and told me they were watching him for their neighbor.\nIf you didn’t know what stripper shoes were and you were 17, I suppose you’d think they were the most gorgeous shoes in the world, like Cinderella’s glass slippers.\nI can’t remember if it was their cousin or sister that they didn’t know about, but Michelle now had another mouth to feed.","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/IMG_1673.jpg?fit=800%2C601&ssl=1"}}}]}},"pageContext":{"source":"hippie_inheels","alias":"location","label":"了解地点"}}