{"data":{"mongodbDatabaseArticles":{"id":"5b937b3187be056953db7d35","content":"<div><p name=\"dc12\" id=\"dc12\" class=\"graf graf--p graf--leading\">2. I needed money &amp;/or a source of income</p><p name=\"093a\" id=\"093a\" class=\"graf graf--p graf-after--p\">At the time, I was working 20 hours a week as a shoe salesman at Bon-Ton. Unless I wanted shoe sales on a 2% commission to be my career (and salary) then I had to find a better way to earn money.</p><p name=\"4b8b\" id=\"4b8b\" class=\"graf graf--p graf-after--p\">I decided to become focused on learning a specific skillset. I started considering different skills that I could learn online and get paid as a freelancer or consultant.</p><p name=\"cf08\" id=\"cf08\" class=\"graf graf--p graf-after--p\">Here are a few things I considered learning how to do online:</p><ul class=\"postList\"><li name=\"a21e\" id=\"a21e\" class=\"graf graf--li graf-after--p\">Video editing</li><li name=\"920f\" id=\"920f\" class=\"graf graf--li graf-after--li\">Writing Copy</li><li name=\"59a2\" id=\"59a2\" class=\"graf graf--li graf-after--li\">Photographer</li><li name=\"080a\" id=\"080a\" class=\"graf graf--li graf-after--li\">Photo editing</li><li name=\"66f1\" id=\"66f1\" class=\"graf graf--li graf-after--li\">Programming</li><li name=\"fefb\" id=\"fefb\" class=\"graf graf--li graf-after--li\">Graphic design</li><li name=\"b9ab\" id=\"b9ab\" class=\"graf graf--li graf-after--li\">Online marketing (Facebook, Instagram, Snapchat, etc.)</li><li name=\"06ea\" id=\"06ea\" class=\"graf graf--li graf-after--li\">Drop-shipping</li><li name=\"4be7\" id=\"4be7\" class=\"graf graf--li graf-after--li\">Affiliate marketing (Amazon)</li><li name=\"d8e0\" id=\"d8e0\" class=\"graf graf--li graf-after--li\">Blogging</li><li name=\"587d\" id=\"587d\" class=\"graf graf--li graf-after--li\">Stock trading (day trading, options trading)</li><li name=\"c443\" id=\"c443\" class=\"graf graf--li graf-after--li\">Making Youtube videos</li><li name=\"1909\" id=\"1909\" class=\"graf graf--li graf-after--li\">Buying and selling on eBay or Amazon</li></ul><p name=\"2d38\" id=\"2d38\" class=\"graf graf--p graf-after--li\">I narrowed the list down to skills that would be the quickest and easiest to get started with that also had the most income potential. I strived to acquire as much knowledge as I could around what was involved to perform these marketable skills effectively.</p><p name=\"0479\" id=\"0479\" class=\"graf graf--p graf-after--p\">I remember sitting in my apartment considering all of these options. I had a little bit of a background in graphic design but I was at a point where I could have switched to something new and would have never looked back. I&#8217;d only dabbled a bit in photoshop at that point so I was definitely not a graphic designer but I had a fascination with different logos and graphics&#8202;&#8212;&#8202;specifically mascot logos for sports teams.</p><p name=\"c796\" id=\"c796\" class=\"graf graf--p graf-after--p\">I watched a few Youtube videos about everything from the list to familiarize myself with the knowledge that was involved to become proficient at the skills and achieve my desired results.</p><p name=\"80e2\" id=\"80e2\" class=\"graf graf--p graf-after--p\">I don&#8217;t remember if I ever solidified a specific choice for a skill that I wanted to learn. I kind of became interested in all of the things from the list but decided to pursue graphic design as something that I would charge people money for.</p><p name=\"b914\" id=\"b914\" class=\"graf graf--p graf-after--p\">Graphic design had the smallest barrier to entry for me and I could learn new design skills in as little as 15 minutes by watching a Youtube video. An example of this is the storefront mockups that I would create. I learned how to make mockups like the one below by watching a 5 minute Youtube video. These mockups would take me less than 5 minutes to complete. I started providing this as a service for small businesses on Fiverr.com and they would pay me between $5-$20.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*_J7t6Rfmtafd2_skrzfaRA.png\">Photoshop building&#160;mockup<p name=\"9686\" id=\"9686\" class=\"graf graf--p graf-after--figure\">Once I started getting real results ($$$) from learning design skills on Youtube, it started a snowball&#160;effect. I began learning new, more complex skills that demanded a higher premium. My results were directly tied to my willingness to become proficient at different designs skills and disciplines.</p><p name=\"be5c\" id=\"be5c\" class=\"graf graf--p graf-after--p\">I became addicted to progress because every time I learned a new skill, I could make money for providing it as a service. It also felt good to see improvement in the designs that I was creating.</p><p name=\"80c6\" id=\"80c6\" class=\"graf graf--p graf-after--p\">For example, removing the background from a photo in Photoshop might be worth $5&#8211;$15, but creating an original logo for a business in Illustrator could be worth hundreds or even thousands.</p><p name=\"c24e\" id=\"c24e\" class=\"graf graf--p graf-after--p\">It was at this point that I realized all I needed to do to earn a full-time income was to keep expanding my skillset as a graphic designer.</p><h4 name=\"ba6b\" id=\"ba6b\" class=\"graf graf--h4 graf-after--p\">Practice, Practice, Practice</h4><p name=\"8207\" id=\"8207\" class=\"graf graf--p graf-after--h4\">In plain English, there was no magic in this process. I would find work that I liked on websites like <a href=\"http://dribbble.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Dribbble</a> and <a href=\"http://behance.net\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Behance</a> then try and replicate it or watch tutorials on how to achieve similar results.</p><p name=\"5c2b\" id=\"5c2b\" class=\"graf graf--p graf-after--p\">I spent the majority of my free time designing for fun or for friends for free.</p><p name=\"5d05\" id=\"5d05\" class=\"graf graf--p graf-after--p\">Once I felt confident in my abilities with a new design task, I would post a gig for it on Fiverr. If you&#8217;re interested in learning more about Fiverr and <a href=\"https://medium.com/@dansapio/how-i-went-from-broke-shoe-salesman-to-making-1-000-per-week-on-fiverr-6e177d325272\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">how I started making $1,000 per week using it, then click here to read my article</a>.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*1o-B2w_iHqFjdSieU3xYaQ.png\">This is a few month progression of a mascot logo as I evolved as a&#160;designer<p name=\"0093\" id=\"0093\" class=\"graf graf--p graf-after--figure\">After a few months, I was receiving a steady stream of orders on Fiverr. People were actually willing to pay me real money for my work and I was starting to make good money as a freelancer. I didn&#8217;t have enough time in the day to balance college classes and my freelance design gig&#8202;&#8212;&#8202;so I dropped out of college. It was a liberating decision. I knew that I could always go back to college at some point if I needed to, but that was by no means my intention.</p><h4 name=\"6798\" id=\"6798\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Becoming a Digital&#160;Nomad</strong></h4><p name=\"c607\" id=\"c607\" class=\"graf graf--p graf-after--h4\">Since I was in high school I knew I wanted to be able to travel the world at some point in my life and make money while doing it. While daydreaming about the idea in my high school classrooms, I was unaware that there was a community of awesome people already doing it called digital nomads.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*ynxnXgi51dqKfhxP8eGXNQ.jpeg\">Krabi, Thailand<p name=\"2ef1\" id=\"2ef1\" class=\"graf graf--p graf-after--figure\">After dropping out and enjoying a few months of working from my apartment, I started researching places to live and work remotely. I wanted to go somewhere exciting to shake up my boring day-to-day routine. I inevitably stumbled upon a blog that listed Chiang Mai, Thailand, and Bali, Indonesia as the most affordable and best places to work remotely. They called Chiang Mai &#8220;The Digital Nomad Capital.&#8221; I quickly discovered that there is a growing community of remote workers living in cheap cities in South East Asia getting by on only a few hundred dollars per month. This was exactly what I needed to get a fresh start and begin living the life of freedom that I desired.</p><p name=\"c520\" id=\"c520\" class=\"graf graf--p graf-after--p\">As I continued my research into digital nomads, I came across a program called <a href=\"http://hackerparadise.org\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Hacker Paradise</a> that had an upcoming trip to both of those locations. I was content with going to Thailand or Bali on my own but knowing that there was a facilitated program waiting for me when I landed gave me (and my parents) peace of mind. I decided to apply for their upcoming 3 month trip to South Korea, Thailand, and Indonesia. I was accepted into the program and decided that it was the perfect next steps for my life.</p><p name=\"f29e\" id=\"f29e\" class=\"graf graf--p graf-after--p\">A few months later, I left the USA for the first time in my life and flew halfway around the world to a tiny island called Jeju off the coast of South Korea to join Hacker Paradise.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*n5dCvkXzHTVG_ei9-YrOTg.png\">Hacker Paradise&#8202;&#8212;&#8202;Chiang Mai,&#160;Thailand<p name=\"1a77\" id=\"1a77\" class=\"graf graf--p graf-after--figure graf--trailing\">When I arrived on my first Hacker Paradise trip I had a lot of adapting to do, but for the first time in my life, I was surrounded by people who understood tech and shared similar passions as mine.</p></div>","title":"How I Went From A Broke College Kid To Traveling The World As A Digital Nomad"}},"pageContext":{"id":"5b937b3187be056953db7d35"}}