{"data":{"mongodbDatabaseArticles":{"id":"5b921d1887be0571ac1b04f4","content":"<div><h1></h1>\n<p>Expatriation can refer to simply leaving your country and living somewhere else. But it can also mean renouncing your citizenship.</p>\n<p>This page is for US citizens who are wondering if <a href=\"http://nomadcapitalist.com/2018/01/17/renounce-us-citizenship-ultimate-guide/\">renouncing their citizenship</a> and becoming an expat is the right decision. </p>\n<p>Does any of this sound familiar? You&#8217;re a US citizen who:</p>\n<ul>\n<li><span><a></a><p>Has no way to escape paying really <a href=\"http://nomadcapitalist.com/2017/08/07/countries-with-the-highest-tax/\"> high taxes</a> on your trading activities or active business</p></span></li>\n<li><p>Is tired of being restricted in how you can invest in cryptocurrencies and ICOs</p></li>\n<li><p>Is tired of filling out endless paperwork</p></li>\n<li><p>Isn&#8217;t happy with your lack of privacy, especially from FBAR and FATCA</p></li>\n<li><span><a></a><p>Is confused and bewildered about <a href=\"http://nomadcapitalist.com/2017/12/29/unforeseen-consequences-trump-tax-reform-us-expats/\">the tax reform</a> (and other ongoing requirements) that makes doing legitimate business overseas increasingly more difficult</p></span></li>\n<li><span><a></a><p>Is done with being part of the system and subject to <a href=\"http://nomadcapitalist.com/2018/01/08/citizenship-based-taxation-countries/\">citizenship based taxation</a> </p></span></li>\n<li><p>Could see yourself leaving your own country if it meant living a happier, wealthier life</p></li>\n</ul>\n<p>If any of these sound like you, you&#8217;re in the right place. </p>\n<p>If you&#8217;re British, Canadian, or Australian and you&#8217;re considering expatriation, check out our <a href=\"http://nomadcapitalist.com/2016/10/26/end-tax-nonresident-status/\">tax non-residency article</a>. </p>\n<p>This Expatriation page won&#8217;t help you if you&#8217;re looking to leave your country but keep your citizenship. </p>\n<p><strong>Quick note:</strong> Expatriation could benefit US green card holders, too. There&#8217;s a provision with green cards where, if you&#8217;ve held your green card for a certain length of time, you could be <a href=\"https://www.forbes.com/sites/robertwood/2017/05/08/reverse-immigration-how-irs-taxes-giving-up-green-cards/\">subject to an exit tax</a>. </p>\n<p>That means if you&#8217;re a green card holder and you&#8217;re thinking of leaving the US, the sooner the better (because of that exit tax). </p>\n<p>Expatriation isn&#8217;t right for everyone, but if you&#8217;re US citizen or green card holder who is considering renouncing your citizenship, you&#8217;re in the right place.</p>\n<p></p>\n<h1><b>The Big Misconceptions About Expatriation That Hold Others Back</b></h1>\n<p>&#160;</p>\n<p>There are a number of misconceptions floating around about expatriation and renouncing your citizenship.</p>\n<p>Some of the most common myths and misconceptions about expatriation are also the strongest deterrents, like:</p>\n<ul>\n<li><p>You can&#8217;t return to the US after you renounce &#8211; you&#8217;re banned for life</p></li>\n<li><p>You have to pay taxes for 10 years after you renounce</p></li>\n<li><p>You can only have one second passport</p></li>\n<li><p>You need to spend years (and/or hundreds of thousands of dollars) getting a second passport</p></li>\n<li><p>You can&#8217;t have any US assets after you renounce</p></li>\n<li><p>You need to close your US bank accounts</p></li>\n<li><p>You don&#8217;t need a plan before you renounce &#8211; you can just buy a new passport and leave forever (this advice comes from the guys that </p><i><p>haven&#8217;t</p></i><p> renounced)</p></li>\n</ul>\n<p>Here&#8217;s the good news: <strong>none of these are true.</strong></p>\n<p>You <i>can</i> return to the US after you renounce your US citizenship (and it&#8217;s actually a pretty simple process that I&#8217;d be happy to help you with).</p>\n<p>There&#8217;s no decade-long citizenship taxation policy (and we might be able to<a href=\"http://nomadcapitalist.com/tax-reduction/\"> lower your taxes now, legally</a>, without you having to renounce at all).</p>\n<p>You can have more than one passport, and you don&#8217;t need to wait four years or spend $600,000 to get a solid passport with all the benefits and perks you need. </p>\n<p>You can have assets in the US, like property, and keep your bank accounts and savings accounts (in many cases). </p>\n<p>Certain US institutions treat non-citizens even <i>better</i> than US citizens (like<a href=\"https://www.capitalone.com/\"> Capital One</a>, where a non-citizen doesn&#8217;t have to pay tax on their 360 savings account). </p>\n<p>But here&#8217;s the thing: if you&#8217;re <i>only</i> considering renouncing your citizenship as a way to reduce your taxes, stop. </p>\n<p>There are likely better ways for you to <a href=\"http://nomadcapitalist.com/tax-reduction/\"><i>legally</i> reduce your taxes </a><i>without</i> having to renounce your citizenship.</p>\n<p>I&#8217;ve legally paid 0% tax as a Nomad Capitalist and US citizen for many years. For me, renouncing was about more than tax. </p>\n<p>It was about freedom, lifting a weight off my shoulders, and<a href=\"http://nomadcapitalist.com/2017/05/15/how-to-go-where-youre-treated-best/\"> going where I&#8217;m treated best</a>. </p>\n<p>There are scenarios where expatriation really makes sense. But it&#8217;s important to make sure it&#8217;s actually the right decision for you. </p>\n<h1><b>Criteria to Help You Decide If Renouncing Would Improve Your Life</b></h1>\n<p>&#160;</p>\n<p>I don&#8217;t always agree with laws and regulations, but what I think doesn&#8217;t matter&#8211;I always follow the law. </p>\n<p>There are <i>legal</i> ways to reduce your obligation to the US government and to resolve it completely. This page is about helping you decide what&#8217;s best for you.</p>\n<p>If you&#8217;re a six or seven figure entrepreneur or investor who&#8217;s frustrated by a system of endless tax obligations and money siphons, even if you&#8217;re not living in the United States, the answer might be legally renouncing your citizenship. </p>\n<p>If you&#8217;re getting annoyed about the smaller and smaller exemptions for legitimate offshore business investments, it might make sense for you to renounce. </p>\n<p>If you&#8217;re dreading the paperwork to report your bank accounts and corporations, or the increasing regulations dictating who you can and can&#8217;t do business with overseas, your best bet might be renouncing your citizenship. </p>\n<p>If you&#8217;re frustrated by the government&#8217;s &#8220;second-class citizen&#8221; treatment (or even occasionally being made to feel like a &#8220;traitor&#8221;) for wanting to live overseas, for wanting to keep more of your own money, and for wanting to live a different life than the one your government wants you to live, renouncing could make your life better.</p>\n<p>Expatriation isn&#8217;t for people who want to squirrel away money, or people who think they&#8217;re smarter than the system. </p>\n<p>Renouncing won&#8217;t help you if you&#8217;re angry at the government, your tax rates, or your country.</p>\n<p> It won&#8217;t help you if you&#8217;re motivated entirely by politics (The political &#8220;norm&#8221; changes every 4-8 years, don&#8217;t make a permanent decision based on something so fluid). </p>\n<p>Renouncing won&#8217;t cure your case of the &#8220;doom and gloom&#8221; either. </p>\n<p>Renouncing your citizenship is about a legal way to open up new opportunities, to go where you&#8217;re treated best, and to have a happier, easier, wealthier life. </p>\n<p>This is a permanent decision. You should treat it like one.</p>\n<h1><b>Planning For Your Future: Stroll to Freedom, Don&#8217;t Scramble</b></h1>\n<p>&#160;</p>\n<p>I&#8217;ve had guys come to me (with multi-million dollar net worths) and say &#8220;Andrew, I just renounced and I don&#8217;t have a plan&#8211;what do I do next?&#8221;</p>\n<p>Renouncing only makes sense if you have a plan in place (something passport commodity centers and the guys who haven&#8217;t done this before can&#8217;t give you).</p>\n<p>There are a lot of things to think about&#8230;</p>\n<p>Your tax plan.<br>\nYour travel plan.<br>\nYour house plan.<br>\nYour bank account plan.<br>\nYour company plan.<br>\nYour Visa plan.</p>\n<p>The list goes on&#8230;</p>\n<p>What will you do with your assets in the US?</p>\n<p> What about your pension or your social security income? </p>\n<p>What taxes are you liable for? </p>\n<p>You&#8217;ll need to plan your real estate&#8211;not just your new home, but what about property holdings in the US? </p>\n<p>When you renounce, you open up <i>a lot </i>of new overseas opportunities. You want to make sure you&#8217;re in a position to take advantage of them! That&#8217;s where planning comes in. </p>\n<p>New bank account options, new business creation opportunities, new freedom with passive investing (especially cryptocurrency investors)&#8211;there&#8217;s so much to think about.</p>\n<p>Even a visit to the states requires some thought before you renounce (if you want to return to the US at all, you&#8217;ll need a plan to get a Visa). </p>\n<p>A plan for these elements will keep you from scrambling once your renounce. And trying to do it by yourself, without help from someone who has actually done it, could lead to some big screw ups. </p>\n<h1><b>The Biggest Roadblock: Your Second Passport</b></h1>\n<p>&#160;</p>\n<p>Speaking of screw ups, one of the biggest hangups most guys experience in the expatriation process is probably <a href=\"http://nomadcapitalist.com/second-passport/\">getting their second passport. </a></p>\n<p>You can&#8217;t renounce your citizenship from US soil (it&#8217;s not like you say the oath and then they make you leave the country&#8211;you have to turn in your passport!). </p>\n<p>You have to renounce overseas at an embassy (it usually takes two visits). </p>\n<p>Not every embassy will require you to have a second passport, but most embassies will want to see <i>something</i> that proves you&#8217;ll have citizenship somewhere.</p>\n<p>If you&#8217;re reading this, you probably don&#8217;t have a second passport. </p>\n<p>This step is so easy to screw up because there&#8217;s so much bad advice out there (diving in and calling the commodity centers is not the way to go).</p>\n<p>I know guys that have spent $600,000 to get a passport when they didn&#8217;t. Paying that kind of money for a passport is not the only option&#8211;there are ways to get a second passport that offers the same benefits just as quickly for much less money. </p>\n<p>Other guys have huge tax bills, but want to spend four years trying to get their Italian passport. Instead, they could get an easier passport in the next 6 to 12 months, <i>then</i> go <a href=\"http://nomadcapitalist.com/2016/11/02/get-italian-citizenship-by-descent/\">for the Italian passport</a>.</p>\n<p>A second passport doesn&#8217;t have to be a ten year, several hundred thousand dollar investment&#8211;you can get great passports for less time and money if you know what you&#8217;re doing (most people don&#8217;t). </p>\n<h1><b>Helping From Experience: Don&#8217;t Take Advice from People Who Can&#8217;t Help You</b></h1>\n<p>&#160;</p>\n<p>I made a very big decision recently. After deliberating for years, I decided to renounce my US citizenship. </p>\n<p>Emotionally, I feel much better. I have more freedom. I have access to better bank accounts. I have less paperwork to file. My taxes were low before, but renouncing didn&#8217;t hurt. </p>\n<p>And, reflecting back on it now, it was a lot like breaking up with a girlfriend. That long relationship that did not make you happy, but you still stay out of&#8230;routine, habit, fear of change.</p>\n<p>It&#8217;s a tough decision to make. It&#8217;s tough to go through with it (you love her!). But once you do, you feel a lot better. </p>\n<p>On my second trip to the embassy (the one where you read the official pronunciation), I was nervous. </p>\n<p>It&#8217;s awkward walking in there. You don&#8217;t know how to do it. You don&#8217;t know what you&#8217;re going to say. The corner of my lip trembled as I walked in. I don&#8217;t mind being honest about that&#8211;this is a huge, emotional decision. </p>\n<p>When you read the pronunciation, when you say &#8220;I renounce this oath&#8221; you feel it. You get that&#160;tear in the corner of your eye, your heart beats a little faster, you have the rush of doubt and regret and uncertainty. </p>\n<p>But then you say it. And it&#8217;s official. </p>\n<p>You walk out of the embassy and it&#8217;s the best thing you&#8217;ve ever done. The weight is lifted. You&#8217;re excited, at peace, and relieved. </p>\n<p>Of course, you might be less emotional than that. That&#8217;s fine, too. </p>\n<p>But I know what you&#8217;re going through. I know what it&#8217;s like to renounce my US citizenship. I understand the decision and the emotional weight behind it. </p>\n<p>It&#8217;s normal to feel that way, and it&#8217;s good to acknowledge the gravity of the decision. Don&#8217;t hold it against yourself, work through that feeling. Having someone who has done it, who understands that the feeling is normal, is important. </p>\n<p>With the right advice and planning, you can walk out of there with your head held high because you know that you&#8217;ve planned for this. </p>\n<p>You&#8217;ve accounted for everything: exit tax, income tax, your type of business, where your wealth is held and how it&#8217;s held, your family or your single status.</p>\n<p>It&#8217;s not just <i>if</i> you should renounce, it&#8217;s <i>how</i> you should announce, too.</p>\n<p>The other guys giving advice on expatriation? </p>\n<p>Most of them haven&#8217;t done it. They don&#8217;t know what it will be like for you. </p>\n<p>That&#8217;s like getting breakup advice from the man who married his first girlfriend from high school and hasn&#8217;t divorced her yet, even though they&#8217;re both miserable.</p>\n<p>What could that guy possibly know about what you&#8217;re going through? How could he possibly help?</p>\n<p>You&#8217;re entitled to real, open, vulnerable help. Figure out what you want and what you don&#8217;t want, then <a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\">we&#8217;ll figure out how to solve your problem. </a></p>\n<h1><b>Understanding How it Works: Nomad Capitalist Has Your Back</b></h1>\n<p>&#160;</p>\n<p>I understand what goes into renouncing your US citizenship. Not only literally, but emotionally, as well. </p>\n<p>I understand the situation, not because I&#8217;ve thought about it, but because <i>I&#8217;ve actually done it</i>. </p>\n<p>I don&#8217;t say this to brag or to boast or to stir the pot. I say it because it&#8217;s true. And in this business of opaque characters, I believe you deserve transparency and the truth. </p>\n<p>You&#8217;re making a tough, permanent decision. You deserve help from someone who&#8217;s willing to be vulnerable, real, and <i>helpful</i>&#8211;someone who can help you create a &#8220;complete picture&#8221; plan. </p>\n<p>We might talk and find out that some simple tax planning could help you save a fortune (especially if you&#8217;re married). </p>\n<p>What if you could save 75% in taxes and get a second passport <i>without</i> having to renounce?</p>\n<p> It&#8217;s different for everybody. Renouncing may or may not be the best option for you. But we can talk about that and get your crystal clear on your decision.</p>\n<p>If renouncing your US citizenship is the right move for you, you don&#8217;t want to screw it up. You only have one chance to do it right, so get the help you need.</p>\n<p>The other guys haven&#8217;t done it. </p>\n<p>I&#8217;ve done it, and I want to help you determine:</p>\n<p>1. If you need to do it. </p>\n<p>2. How to do it, if it&#8217;s right for you. </p>\n<p>You deserve someone who knows what you&#8217;re going through, and can guide you through a process they&#8217;ve experienced themselves. </p>\n<p>If you&#8217;re here, and you want my help, doing nothing is not an option. </p>\n<p>Either you need to renounce to accomplish what you want in life, or you don&#8217;t need to renounce. </p>\n<p>Either way, you need to solve the problem you came here to solve. </p>\n<p><a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\">I am here to help.</a></p>\n<p>&#160;</p>\n</div>","title":"Expatriation: How to Renounce your Citizenship"}},"pageContext":{"id":"5b921d1887be0571ac1b04f4"}}