{"data":{"mongodbDatabaseArticles":{"id":"5b92488b87be056953db7bb3","content":"<div><p>I lived in &#127481;&#127484; Taiwan for 3 months. Here's my TL;DR on Taipei: great food, friendly people, mellow vibes, great for working, great infrastructure and slightly boring but in a good way. Here's what happened:</p> <h2>Why visit Taipei?</h2> <p>Soooo....I'm not brand namedropping, but I wanted to see if my algorithm for cities was getting accurate. I'm User #0, so how about it tells me where to go and seeing if it was actually right?</p> <a href=\"//nomadlist.com/safe-mild-cities-in-asia-in-february-with-fast-internet-with-places-to-work\"><img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-03-17.15.55.png\" alt=\"\" width=\"2408\" height=\"1104\" class=\"alignnone size-full wp-image-7702 responsively-lazy\"></a> <p>When I went on Nomad List and selected mild (not too hot) weather, fast internet, safe and relatively cheap, it kept recommending me <a href=\"//nomadlist.com/taipei-taiwan\">Taipei</a>. It wasn't always #1 but, consistently in the top 5 for those queries. Now I was in Bali, so it was only a few hours away.</p> <p>I'd been to Taipei before in 2014, but only for a week. I was a noobmad. I stayed in the city and tourist center (around Taipei Main Station):</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">More pics of Taipei, as requested by <a href=\"//twitter.com/marckohlbrugge\">@marckohlbrugge</a> ^___0 <a href=\"http://t.co/ZtWGcQ9SL1\">pic.twitter.com/ZtWGcQ9SL1</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/504974612258488320\">August 28, 2014</a></p></blockquote> <p></p> <p>Terrible decision. Back then I remember it felt mostly just really boring to me. There wasn't much to do, it wasn't that lively and nobody spoke English. I mostly saw some tourist attractions (of which there were, like, about 4, haha). But didn't really gave it a chance.</p> <h2>Let's try Taiwan again</h2> <p>It's been 3 years since. And cities change. And I changed. A LOT. So let's try again and stay for a bit longer. How about 3 months?</p> <p>I arrived. First thing (and I recommend everyone does this wherever they arrive ALWAYS), get a 4G SIM card:</p> <img src=\"/wp-content/uploads/2017/04/ChunghwaTelecomTPE.jpg\" alt=\"\" width=\"1842\" height=\"1382\" class=\"alignnone size-full wp-image-7679 responsively-lazy\"> <p>It's only 1000 TWD (or $33) for UNLIMITED 4G! And it's VERY fast. The only other country I know that has this for foreigners is South Korea.</p> <p>If you tell me 4G is not trivial, it's not for me. It literally affects how much I like a place now. It means I can talk, share photos/videos with my friends wherever I am. It means I can go anywhere, open my laptop, tether my 4G and do some work. 4G should be a human right.</p> <p>When I arrived for the first week I booked an Airbnb in Datong.</p> <p></p> <p></p> <p>There's a few hipster areas in Taipei and I'd say this is one of them. I don't have much to say about Datong. It's better than the tourist center around Taipei Main Station. But also not much to do. The other hipster area is Da'an, where I moved soon after. Let's talk about Da'an.</p> <h2>Da'an</h2> <p>Da'an is my favorite area. It's the center of Taipei for fashion, shopping, hipsters, mixed Taiwanese and foreigners a like. Da'an itself is pretty giant and it has lots of sub-neighborhoods with <a href=\"//thirdwavenearme.com/#taipei\">third wave coffee shops</a>, boutique vintage fashion and lots of excellent (and cheap) Taiwanese and (not so cheap) Western food.</p>   <p></p> <p>For Taiwanese, Da'an is supposedly expensive af. But internationally it really isn't. I had a good deal but I paid $23/night for a clean studio with bathroom right smack in the center. The more normal price would be $40/night. That's $1,200/month for an Airbnb. That means the rent is generally half here, so $600/month. As I said, that's pretty cheap to live in a really cool area. I was told houses here cost upwards of a million dollars. Okay.</p> <h2>Economy</h2> <p>Now, if you're not Taiwanese. You might already have been in contact with Taiwan in your daily life. Your iPhone is made in China, but by a company from here called Foxconn. You used to have a laptop that always broke and it was probably by a company from here called ASUS. You might not have an ASUS laptop but there's a 30% chance your laptop is still made by a Taiwanese company called Quanta, who actually makes the laptops sold by Dell, HP, Lenovo and Toshiba. Their microchips are great and they're probably in almost every electronic device you have made by Taiwan Semiconductor Manufacturing (TSMC). This is most of their entire economy. It's high tech AF. And it's for a reason. They're smart AF too. They're the <a href=\"//en.wikipedia.org/wiki/Taiwan#Education.2C_research.2C_and_academia\">highest educated people in the world</a>.</p> <p>There's more reasons for this. Historically, China's intellectual elite fled during the <a href=\"//en.wikipedia.org/wiki/Cultural_Revolution\">Cultural Revolution</a> as it wanted to reset its culture to zero (just like Cambodia did). That meant libraries were burnt down, scientists and professors were persecuted and murdered. Meanwhile, Taiwan did the opposite organizing the <a href=\"//en.wikipedia.org/wiki/Chinese_Cultural_Renaissance\">Chinese Cultural Renaissance</a>. That's why many people have said to find the real old China, you have to go to Taiwan, because China destroyed their history. That's very interesting.</p> <p>You might also know Taiwan from their politics. They call themselves China, but they're not actually China (not anymore). The big story here is that the young people don't really give AF and just wanna be happy and do cool stuff. It's kinda clickbaity to still call yourself China. Get over yourself, Taiwan, it's 2017.</p> <h2>Infrastructure</h2> <p>The fact that they're high-tech means that their internet is super fast and solid everywhere. Their 4G is also on-par with the best in the world, which is Korea. Generally, technology is approached just very proper in Taiwan. Government somehow gets it and most interfaces you'll use in Taiwan will work very very well.</p> <p>I can only guess here but it seems the government is filled with smart high educated tech-enabled people. The government even has a <a href=\"//qz.com/767298/taiwans-new-digital-minister-is-a-transgender-software-programmer-who-wants-to-make-government-more-open/_\">Minister of Digital Affairs</a>, who's a self-described \"civic-hacker\". How great is that? Take notice countries!</p> <p>Non-digital infrastructure is also solid. Roads are not broken down like in South East Asia. Sidewalks are all pedestrian and wheelchair friendly. A lot of thought seems to go into the way people live, work and play in this city.</p> <h2>Culture</h2>   <p></p> <p>So what's the vibe here? Culturally? Well, it's pretty unique. You can see the strong Japanese influence in their aesthetics. It's still here. Girls wear giant lenses to make their eyes look bigger (that's a predominantly Japanese thing) and their make up looks strongly Japanese, not at all Chinese. \"Oh Pieter, why do you talk about how people look?\". Well, because it's a pretty good indicator of their cultural influences.</p> <img src=\"/wp-content/uploads/2017/05/Taipei-199-1024x679.jpg\" alt=\"\" width=\"1024\" height=\"679\" class=\"alignnone size-full wp-image-7712 responsively-lazy\"> <p>Generally, fashion seems a bit behind, let's say 5 years, of that of for example Korea (which leads the trends in Asia now). In that way it's a lot like the Netherlands, people don't have a strong focus on dressing up (especially not outside the hipster areas of Taipei) and dress mostly functional.</p> <p>Then there's that definite Western vibe. As in, people talk, move and behave very Western (unlike the rest of Asia). Now, there's not many foreigners here at all. So I can only presume that comes from the Taiwanese diaspora (that means people living outside the country), which is massive and predominantly in America. That means you get lots of American-born Taiwanese and Taiwanese studying and working in America. You know a few of them probably, like YouTube's co-founder Steve Chen and Yahoo's co-founder Jerry Yang.</p> <h2>City</h2> <p>What about the city? Taipei has one skyscraper. It's Taipei 101. And it's looks lonely, as if it could use some friends. There's a reason for this though, Taiwan is heavily prone to earthquakes. And skyscrapers aren't a very good idea then. There are more lots of 100m+ buildngs, but they're not exactly skyscrapers.</p> <p>Now, apartments here look clean and modern from the inside. But really dirty from the outside.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">My new house in Taipei could use a rinse &#8205;&#9792;&#65039; <a href=\"//t.co/vmcKDj3Ohk\">pic.twitter.com/vmcKDj3Ohk</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/839075158795018242\">March 7, 2017</a></p></blockquote> <p></p> <p>Someone said it's because when it's typhoon season, all the buildings get a natural rinse. Good point. They also just don't seem to care about the outside of the buildings. Just like the Hong-Kongnese really.</p> <h2>It's so calm</h2> <p>Another thing is, it's a dense city but somehow it's not busy on the streets. There's so much space. I've never seen any crowds in the street in Taipei. That has a very calming effect.</p> <p>Actually, yes, that's the keyword. Taipei is calm. It doesn't stress me out like Tokyo or Bangkok or (sometimes) Bali does. It's not loud here. It's not busy. People are mellow. I'd go as far to again call Taipei boring, but unlike when I was here 3 years ago, now I like that it's boring. It's boring in a good way.</p> <p>It means I don't have to wait in lines everwhere, it means most restaurants are not crowded when you want to eat there. It means when you're on a bicycle, actually in most little side streets (not the main roads though) you can safely drive in the streets. Generally, the sounds of the city are quite soft too.</p> <p>And yes, before you ask, they have cats, ofcourse they do and they're super cute:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Sleepy Taipei scooter cat is sleepy ^___^ <a href=\"//t.co/DYMFLmT176\">pic.twitter.com/DYMFLmT176</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/832229369036763136\">February 16, 2017</a></p></blockquote> <p></p> <h2>Air quality</h2> <p>There's one big thing that makes it hard to live in Taipei. The air is one of the most unhealthy in Asia.</p> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-03-16.08.37.png\" alt=\"\" width=\"2092\" height=\"1138\" class=\"alignnone size-full wp-image-7685 responsively-lazy\"> <p>And it's not so much their fault, but China's. When the wind blows east, China's pollution goes straight to Taiwan. But it doesn't pass over. Taiwan is pretty much an island that is half one big mountain that crosses it. And that mountain is so high it blocks the air pollution, so it gets stuck. I don't really know what you can do about this except blowing up that mountain. But that's probably unfavorable.</p> <p>The unfortunate thing is, unless China fixes up its game, you don't want to be living here for longer than a few years. Realistically, it will <a href=\"//www.theguardian.com/environment/2015/sep/16/more-people-die-from-air-pollution-than-malaria-and-hivaids-new-study-shows\">reduce your lifespan drastically</a>.</p> <h2>Food</h2> <p>Okay, this is obviously the best part about Taiwan. The food here is excellent and comparatively cheap. It's pretty much Chinese food. But it's quite different. It has the tastes of traditional food, that means it's less oily, less sweet than in China. A similar thing happened with Korean food, before the Korean War it wasn't spicy at all. It was neutral. But when times get tough, you have to mask bad ingredients with, lots of spice and oil. That means in Taiwan, the flavors are generally much more nuanced and subtle. I like that.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"tl\" dir=\"ltr\">Taipei Lunch</p> <p>8x Xiaolongbao (or Chinese soup dumplings)</p> <p>$4.96 (150TWD) <a href=\"//t.co/wT12oX46T0\">pic.twitter.com/wT12oX46T0</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/856436180836950017\">April 24, 2017</a></p></blockquote> <p></p> <p>There's Xiaolongbao (literally: bamboo steamed buns). As a foreigner, you would call them Dim Sum. But it's not really Dim Sum. It's Xiaolongbao. They are hot and freshly made out of dough and have soup and meat inside. You get them in a basket of 8 for about $4.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"nl\" dir=\"ltr\"> Taipei lunch</p> <p>Beef noodles</p> <p>$3.20 (100TWD) <a href=\"//t.co/NqFvPdZYob\">pic.twitter.com/NqFvPdZYob</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/843672658784927745\">March 20, 2017</a></p></blockquote> <p></p> <p>You can order them with other stuff like egg pancakes:</p>   <p></p> <p>Arguably more famous is Taiwan's beef noodles. I like them, but also don't think they're THAT special. Kinda similar to Vietnamese stewed beef noodles. You get a bowl of them for about $3.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\"> Taipei dinner</p> <p>Mixed pork and vegetable wonton soup w/ noodles</p> <p>$2.47 (75TWD) <a href=\"//t.co/9xmcbyNVpi\">pic.twitter.com/9xmcbyNVpi</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/852473738788347904\">April 13, 2017</a></p></blockquote> <p></p> <p>Then there's Wonton. Similar to Xialongbao, it's dough packages with meat in them. But in Taiwan with a very different less sweet taste, maybe even slightly bitter. They sell it in a soup with vegetables for $2.50.</p> <p>The only issue I have with Taiwanese food is, it's relatively light weight. You need to eat a lot to fill up. I have to embarassingly admit every week I had to run to McDonald's just to maintain my (already skinny) weight, and I've heard I'm not the only one.</p> <h2>EasyCard</h2> <p>Let's talk about the elephant in the room (not really) and one of the coolest tings I've seen in a city ever: Taiwan's EasyCard. It's the most modern implementation of a digital payment and access card I've seen in any country. Most of us now use some form of touch-based public transport card where we're from. But in Taiwan, you use this card not just for public transport, but for EVERYTHING.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">I just bought a Hello Kitty key ring that I can charge w/ $$$ + it lets me pay for metro, taxi, coffee, dinner and groceries in Taiwan <a href=\"//t.co/clVzuqjyIh\">pic.twitter.com/clVzuqjyIh</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/831802361223843840\">February 15, 2017</a></p></blockquote> <p></p> <p>The best thing is they can be in any shape or form. Mine is a Hello Kitty keychain with a chip inside</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Using public transport with &#127872;Hello Kitty <a href=\"//t.co/ZOhQjbFHUo\">pic.twitter.com/ZOhQjbFHUo</a></p> <p>&#8212; Pieter Levels @ &#127471;&#127477; (@levelsio) <a href=\"//twitter.com/levelsio/status/832263833984995328\">February 16, 2017</a></p></blockquote> <p><br> I can access public transport with it.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Renting a public bike in Taipei with Hello Kitty <a href=\"//t.co/dZcSSl8jZJ\">pic.twitter.com/dZcSSl8jZJ</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/832486287948935169\">February 17, 2017</a></p></blockquote> <p></p> <p>Or access my coworking space. There's many more appliactions, like renting a small car (kinda like ZipCar).</p> <p>It's really how it should be everywhere. And this chip can be easily integrated into phones in a few years. In fact, Taiwanese are ahead with that. They cut open the EasyCard, take out the tiny chip and glue it inside their phone case:</p> <img src=\"/wp-content/uploads/2017/04/hqdefault.jpg\" alt=\"\" width=\"480\" height=\"360\" class=\"alignnone size-full wp-image-7683 responsively-lazy\"> <h2>Public bicycles</h2> <p>There's one more thing you can do with your EasyCard.</p> <img src=\"/wp-content/uploads/2017/04/user_guide_01.jpg\" alt=\"\" width=\"872\" height=\"417\" class=\"alignnone size-full wp-image-7681 responsively-lazy\"> <p>That is renting a public bicycle called <a href=\"//taipei.youbike.com.tw/en/index.php\">YouBike</a>.</p> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-03-15.33.51.png\" alt=\"\" width=\"1978\" height=\"1132\" class=\"alignnone size-full wp-image-7686 responsively-lazy\"> <p>They're all over the city and it makes Taipei very attractive to live.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Renting a public bike in Taipei with Hello Kitty <a href=\"//t.co/dZcSSl8jZJ\">pic.twitter.com/dZcSSl8jZJ</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/832486287948935169\">February 17, 2017</a></p></blockquote> <p></p> <p>First time, you register on a terminal next to each bike stall and from then you just walk up to a bicycle, touch your card, and it's yours. I think the first half hour is free, then it's 20TWD/hour, or $0.66/hour. The laws about bikes are weird, they want you to ride on the street. But that's fairly dangerous in Taipei traffic (did I already tell you Taiwanese transform into crazy monsters when they drive cars), so you drive mostly on the sidewalks. Luckily, sidewalks are giant in Taipei and easily accomodate both pedestrians and slow moving bicycles.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Live streaming from my public bicycle driving to Taipei 101 because 4G &#10084;&#65039;&#10084;&#65039;&#10084;&#65039; <a href=\"//t.co/5mPkA9HvnH\">pic.twitter.com/5mPkA9HvnH</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/832499606999097344\">February 17, 2017</a></p></blockquote> <p></p> <p>There's an iOS app called YouBike in Chinese. But if you click the Map icon, it'll show you a map of bicycle stalls around you to pick up or park your bicycle.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Trying to create a vicarious IRL GTA V via Twitter vibe for you here so I'm cycling through Taipei at night and streaming it <a href=\"//t.co/ogwqPGKktK\">pic.twitter.com/ogwqPGKktK</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/832616533373251584\">February 17, 2017</a></p></blockquote> <p></p> <img src=\"/wp-content/uploads/2017/04/user_guide_0113_bg.png\" alt=\"\" width=\"910\" height=\"449\" class=\"alignnone size-full wp-image-7682 responsively-lazy\"> <p>The bicycle has an in-built lock (which is a bit wieldy). But it means, you can park anywhere and go in for a coffee and then drive to the next place.</p> <p>Now, I was hiking on a mountain and suddenly my phone rang.</p> <p>I heard \"Ni hao, xiasfdl kjsafd ksjd fsjfd\".</p> <p>I was like \"u wot m8\".</p> <p>And he was like \"sir, where is your bike\".</p> <p>OOOOOOH SHIIIIIIIIIIIITTTT YES THE BIKE THAT I RENTED 4 DAYS AGO. OOOOOHH FUUUAAAARARKRakrRKarkAKRkararkaKRkarakr.</p> <p>\"Umm, I think I forgot to bring it back\".</p> <p>-\"Okay, well park it in the bike stall ASAP and call us, okay?\".</p> <p>So I did. But I was on a hiking trip so it took me a few days to get back to Taipei.</p> <p>When I came back, I called them and they told me \"you have to pay 9000 TWD ($300) in fees for renting the bike\".</p> <img src=\"/wp-content/uploads/2017/04/B0eebrtIUAEVFad.jpg\" alt=\"\" width=\"500\" height=\"388\" class=\"alignnone size-full wp-image-7680 responsively-lazy\"> <p>I was like \"but but but but\" and tried to do my puppy face over the phone.</p> <p>silence</p> <p>\"Okay but only this time, next time you pay, now you pay 200 TWD ($6), okay?\"</p> <ul> <li>\"YES THANK YOU GOOD TAIWAN MAN\"</li> </ul> <p>So don't forget returning it to a bicycle stall though. They'll hunt you down and make you pay. Maybe not the first time. Definitely the second time.</p> <h2>Taipei cafes are another thing</h2> <p>I don't think Taiwanese realize they have a very peculiar type of coffee place. It's hard to explain how they're so different. But, they all have this desk lamp:</p> <img src=\"/wp-content/uploads/2017/05/img_0090.jpg\" alt=\"\" width=\"2592\" height=\"1936\" class=\"alignnone size-full wp-image-7699 responsively-lazy\"> <p>They all play this kinda emo music (yes, I love it):</p> <p></p> <p>In the day it's a mix of people chatting and working, but in the evening it becomes mostly <a href=\"http://www.ntu.edu.tw/\">NTU students</a> studying. Really great vibes cause everybody is silent and hyperfocused.</p> <p>The cafes are filled with activist posters. A big thing now you'll see here is rainbow flags as the law for legalizing gay marriage is going through parliament now. There's a cool lefty East-Berlin vibe in these cafes. Not communist though. They don't like communism here for certain well-known reasons :P (oh dare I make a joke)</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">It's hard to get across why Taiwanese cafes are so amazing, but I'll try: they look like this and play this music <a href=\"//t.co/hBhkn2ybnW\">https://t.co/hBhkn2ybnW</a> <a href=\"//t.co/5JKHYtGgM3\">pic.twitter.com/5JKHYtGgM3</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/855396678974582784\">April 21, 2017</a></p></blockquote> <p></p> <p>There's a whole area dedicated to this. Well, kinda. It's Wenzhou Street near the university:</p> <a href=\"//www.google.com/maps/search/cafe+near+wenzhou+street+taipei/@25.019754,121.5317574,18z\"><img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-03-17.11.21.png\" alt=\"\" width=\"2098\" height=\"1146\" class=\"alignnone size-full wp-image-7700 responsively-lazy\"></a> <p>I've seen these kinds of cafes in only one place before. Amsterdam's UVA university has literally the same old run-down cafes where people hang out and study. But they drink mostly beer, not coffee :)</p> <p>There's also a web app called <a href=\"//cafenomad.tw/en/\">Cafe Nomad</a>, dedicated to cafes to work from in Taiwan. I met the maker at the nomad meetup and it was inspired by Nomad List (yay!!!). It's a great app.</p> <h2>Nightlife</h2> <p>So someone asked about nightlife. Now we're in Asia. And if you're from Holland like me, discussing nightlife in the rest of the world, is like, well, well, it gets dark fast. Because for us nightlife is electronic music. And we like refined stuff. Like British, Germans and French do. Electronic music in America has been behind for a decade (but is now starting to catch up) and electronic music in Asia has mostly been a mutated form of American trash EDM made even worse. Clubbing in Asia is predominantly sitting in a group around a table ordering expensive whisky and cola mixers and posing how rich you are. It's a terrible fucking joke.</p> <p>Not in Taiwan though. There's actually some good clubs here:</p> <img src=\"/wp-content/uploads/2017/04/img_5101.jpg\" alt=\"\" width=\"981\" height=\"654\" class=\"alignnone size-full wp-image-7684 responsively-lazy\"> <p>There's Korner, where I went a few times, where they've hosted artists like Nicolas Jaar and Ben Klock. It's pitch black without decoration, like a club should be:</p> <p></p> <h2>Nomad scene</h2> <p>A few years back there wasn't even a nomad scene here. This year though, we're seeing it change slowly. A more diverse set of people is becoming nomad and for many Thailand and Bali are simply too easy and superficial. I get it. I feel it. People are considering Taiwan as a place to live and work. It's probably suited for the more mature, intellectual, nerdy and introvert nomad. Life isn't in your face here like South East Asia.</p>   <p></p> <p>I organized 2 nomad meetups here, which actually got out about 20 to 40 people.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">I'm at the <a href=\"//twitter.com/NomadList\">@nomadlist</a> meetup in Taipei with 35 people and I think we took over the cocktail bar <a href=\"//t.co/Z53dy1QoVS\">pic.twitter.com/Z53dy1QoVS</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/840204839778897920\">March 10, 2017</a></p></blockquote> <p></p> <p>So the nomads are here, but they're not very densely socializing. Again this just means it's a different type of nomad. More introvert. That's okay.</p> <h2>Socializing</h2> <p>What about locals? They're mostly very friendly, happy to talk to you and tell you where to go. The only problem is that the English here is probably the worst in Asia (except for maybe Japan, even Koreans speak better English). They literally can't or won't speak it. Usually you can get basic things across. Hand gestures will work. But a deeper conversation in English. Hell no. You'll need to learn some Mandarin for that.</p> <p>If you want to meet locals who do speak English, you'll find yourself around Taiwanese who have studied abroad or mixed Taiwanese. That's cool but it does limit who can be your friends.</p> <p>With a nomad scene that is quite introvert and a limited pool of locals to make friends with if you don't speak Mandarin, Taiwan can definitely become very isolating. It's a thing in East Asia in general, Japan, Korea, Taiwan, they can make you feel more alone than you've ever felt. Remember this before you visit. I'm not saying it's terrible. But it's a thing.</p> <h2>Leisure</h2> <p>If you like hiking (I'm not a super big fan), you're in the right country. Taiwan's mountains and hills are perfect for it. There's even hills inside Taipei where you can go hiking.</p> <p>What else is there to do? I will be honest. Not a lot. Taiwan is relatively small.</p> <p>Near Taipei, there's Beitou, a famous hot spring village built by Japanese.</p> <p>You can also do city trips to Taichung and from there visit <a href=\"//en.wikipedia.org/wiki/Sun_Moon_Lake\">Sun Moon Lake</a>, this is the biggest lake in Taiwan and home to aboriginal tribes. I went there. I bicycled around the lake. I can't say it was terribly interesting.</p> <p>I also went to Jiufen, a town that Spirited Away's anime was modeled after. It's cool to drive there, you'll go way up in the mountains and then there's a cute small town. It's absolutely filled with Chinese, Korean and Japanese tourists though. Cute, but also not very interesting to me.</p> <p>So yeah, leisure, eh? I know <a href=\"http://synapticism.com/\">Alexander</a>, a somewhat famous nomad living in Taipei does lots of urban exploring. His blog is also full of stuff to do. I'm sure you can do more stuff, but it'll take some effort.</p> <p>So yes, Taipei is boring. In a way this is good, if you're looking for a place to write a book, finish a project, come to Taipei. <a href=\"http://twitter.com/oskarth\">@oskarth</a> was in Taipei at the same time as me and it worked for him:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Three months of TODOs done in Taipei <a href=\"//twitter.com/levelsio\">@levelsio</a> <a href=\"//t.co/h1UjjthIWy\">pic.twitter.com/h1UjjthIWy</a></p> <p>&#8212; OSKAR (@oskarth) <a href=\"//twitter.com/oskarth/status/857540783766880257\">April 27, 2017</a></p></blockquote> <p></p> <p>In Taipei, you won't be distracted by the chaos of most cities.</p> <h2>Was Nomad List right?</h2> <p>Mostly, yes. One thing it got very wrong was the weather. It told me it was \"mild\". As in not too cold, not too hot. That was based on temperature averages though. What it didn't consider is that Taiwan has some of the most wide-range climates. It literally went from 30'C in the day to 10'C at night. The temperatures changed so hard, it actually gave me a cold sometimes as my nose couldn't keep up with it (kinda like walking into A/C areas does).</p> <h2>Conclusion</h2> <p>Here's my TL;DR on Taipei: great food, friendly people, mellow vibes, great for working, great infrastructure (like 4G, roads, etc.), slightly boring but in a good way.</p> <p>The most important word though is, Taipei is mellow. Maybe boring. But in a good way.</p> <h2>Update</h2> <p>How cool is this, Taiwan's government read this post and replied:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Taiwan government just announced to me over Twitter they're working on a visa for remote workers! They'll be the first country to do so! <a href=\"//t.co/YmxVtNBS4F\">https://t.co/YmxVtNBS4F</a></p> <p>&#8212; Pieter Levels @ &#127471;&#127477; (@levelsio) <a href=\"//twitter.com/levelsio/status/859797945356439552\">May 3, 2017</a></p></blockquote> <p></p> <p>(Timelapse by <a href=\"http://vimeo.com/57914684\">C&#233;dric Charlesia</a>, thanks <a href=\"//twitter.com/x3nome\">@x3nome</a> and <a href=\"//twitter.com/olimuchacha\">@olimuchacha</a> for fact-checking this post)</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Taipei is boring, and maybe that’s not such a bad thing"}},"pageContext":{"id":"5b92488b87be056953db7bb3"}}