{"data":{"mongodbDatabaseArticles":{"id":"5b937ad687be056953db7cd9","content":"<div><p>Whether you stay a week or a month, you pack and unpack every time you change destinations. Know that fear of whether you packed everything when you leave a vacation behind? That, but every week or two or month. Every single time.</p><p>If you want to be a nomad, you need to be prepared for the reality of being a nomad.</p><p>The folks at home who follow my journey know these little victories (or struggles) consume my life. Every now and then there&#8217;s an exotic locale thrown into the mix, which can be awesome, but if you think I wake each morning to glamour and glory, it&#8217;s time for a reality check.</p><p>Like falafel instead of fries. Or the victory of making your way through a foreign city&#8217;s transit system for the first time, or surviving your first drive on narrow twisty foreign streets, or ordering pizza over the phone with a guy who speaks Portuguese and your white ass can&#8217;t even pronounce the street name or the restaurant you&#8217;re living above for delivery directions.</p><p>When I decided to be a nomad, I did enough research to know it comes with as many ups and downs as home life, but they tend to come from smaller things.</p><p>That was 120 days ago. Today I&#8217;m sitting in a kebab shop in Madrid, a mix of Spanish and Arabic chatter all around me, after pulling out Google translate to negotiate a Mixta Platter with falafel instead of French fries. You chuckle but little negotiations like those leave me feeling like I just ooze victory. That&#8217;s nomad life for you.</p><p>I spent 2015 planning, researching, minimizing, selling off my life, until one day I walked out of my apartment, handed my landlord my keys, hopped in my friend&#8217;s truck, and left behind all semblance of normalcy.</p><h4 name=\"3dab\" id=\"3dab\" class=\"graf graf--h4 graf-after--figure\">Travel with a side of&#160;panic.</h4><p name=\"7adb\" id=\"7adb\" class=\"graf graf--p graf-after--h4\">Every flight you hop, you wonder what might be stolen. You&#8217;ll get anxiety on travel days. Will the train connect on time? Will flights be smooth? Will the new lodgings be livable? Will you get the directions right? Will security be a breeze?</p><h4 name=\"4c1b\" id=\"4c1b\" class=\"graf graf--h4 graf-after--p\">Humility and handwashing.</h4><p name=\"2480\" id=\"2480\" class=\"graf graf--p graf-after--h4\">To keep it simple, you&#8217;ll have just a few clothes. If the weather goes sideways, everything&#8217;s wet, where will you wash and/or dry it? My most recent lodgings promised a washer but when I got there, it had mold in the soap tray and a filter clogged with dog hair. I was forced to use a laundromat that couldn&#8217;t adjust amounts of auto-injected soap/softener/rinse agents, and I&#8217;m allergic. It was a scratchy week. C&#8217;est la vie. Is there a heater you can dry your clothes on? &#8216;Cos 90% of the world doesn&#8217;t have the hot clothes dryer you&#8217;re used to in North America.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*hX2HX5l5mivf3b_yNPsShg.jpeg\">I had a rental car in remote Istria, in northern Croatia, and took a wrong turn one day that found me driving up the scariest road of my life. This was on the way down. It was also one of the most beautiful roads I&#8217;ve ever been on. And that, right there, is a life of travel in a nutshell.<h4 name=\"e022\" id=\"e022\" class=\"graf graf--h4 graf-after--figure\">Gotta get yourself connected.</h4><p name=\"26f9\" id=\"26f9\" class=\"graf graf--p graf-after--h4\">If you&#8217;re working, like me, you&#8217;ll never know how fast the internet is and, worse, you likely will have no ability to reboot it. Those backups you left waiting for the next town? Man, shoulda done &#8217;em last time you had a good connection &#8216;cos it&#8217;s a crawl now. Too bad you were out, you know, seeing the world instead of being responsible.</p><h4 name=\"f5f9\" id=\"f5f9\" class=\"graf graf--h4 graf-after--p\">Have laptop, will work.&#160;*scoff*</h4><p name=\"25fa\" id=\"25fa\" class=\"graf graf--p graf-after--h4\">Speaking of being responsible, you&#8217;ll think it takes a couple weeks to get into the groove, but guess what? It might take months. The culture shock of being on the road, of newness everywhere, of unpredictable living conditions (hint: the ads lie), the threat of poor wifi, the distractions, the jetlag, the need to connect with other humans, the sightseeing&#8202;&#8212;&#8202;it all gets in the way. It took me two months to earn money, which meant I lost money for 6 weeks, and once I did start working, my currency jumped off a cliff and massively devalued. That 6 weeks of income would&#8217;ve been swell.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*QegJUecKTy7Ke5oAsechkQ.jpeg\">That same beach as above. Some moments, you stand there, surrounded by incredible beauty, and the luggage that got lost in Paris, the coat that got stolen in Reykjavik, the currency plummeting, or whatever the hell&#8217;s been stressing you out&#8230; it all falls away and you know, without a doubt, this is what you&#8217;re meant to be doing&#8202;&#8212;&#8202;but if this doesn&#8217;t sell you on it, then maybe you&#8217;re not a nomad at&#160;heart.<h4 name=\"04a7\" id=\"04a7\" class=\"graf graf--h4 graf-after--figure\">Go with the flow,&#160;bro.</h4><p name=\"46d9\" id=\"46d9\" class=\"graf graf--p graf-after--h4\">As a nomad, you have less control than ever (and more control than ever). It&#8217;s a Zen Catch-22. One reason <a href=\"http://fullnomad.com/a-beginners-guide-to-airbnb/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">I rent from AirBNB</a> is they want you to rely on them, so there&#8217;s an accountability I can&#8217;t find elsewhere, and that gives me a measure of control, but I pay a premium for that. What I can&#8217;t control, though, is currency, or weather, or cultural norms around me. I think some Karate Kid movie says you must bend like a willow so you don&#8217;t break when the wind changes. Maybe it was Confucius. Either way, I be willowing like mad.</p><h4 name=\"ed6d\" id=\"ed6d\" class=\"graf graf--h4 graf-after--p\">Money mitigates risk.</h4><p name=\"a78a\" id=\"a78a\" class=\"graf graf--p graf-after--h4\">As a digital nomad, travel isn&#8217;t just your life, it&#8217;s kinda your business too. And when you&#8217;re travelling the world, running out of funds isn&#8217;t an option. You absolutely must know how to hustle, but you also have to treat it like any new business owner should: If you don&#8217;t have 6 months of funds for living in nearly any country in the world, then absolutely do not get on that plane. Stay home, grasshopper. You ain&#8217;t ready. If you don&#8217;t have the savings, then at least get credit that can cover your ass in lean times&#8202;&#8212;&#8202;but that piper comes calling too, and it&#8217;s not worth the stress to rack up funds you&#8217;ll be on the hook for.</p><h4 name=\"1a8b\" id=\"1a8b\" class=\"graf graf--h4 graf-after--p\">Should you stay or should you&#160;go?</h4><p name=\"4128\" id=\"4128\" class=\"graf graf--p graf-after--h4\">There&#8217;s a rock and a hard place you&#8217;ll be stuck between: For budget stays, you need to commit to at least two weeks, but a month gets better rates. For AirBNB, anything over 28 days is a long-term stay and not adjustable or refundable. Another risk. With hotels and such, you likely won&#8217;t get a big price break, but I&#8217;ve gotten as much as 65% off for month-long stays with AirBNB. But will you like the place? Lodging photos are often like your high school graduation or wedding photographs: Highly unrealistic. It&#8217;s taken at the right time with a lot of frou-frou fussing. Maybe you&#8217;ll hate the city, maybe there&#8217;s construction outside, maybe you show up and there&#8217;s a hurricane battering the region for 10 days. Not quite as flexible a travel life you had in mind, is it, when that budget long stay traps you right where you don&#8217;t wanna be.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*BNPWREYC3lt5uxJTUukJhQ.jpeg\">I stayed in this AirBNB for 50% off because I stayed a month. This was the view from my apartment. Motovun, Istria,&#160;Croatia.<h4 name=\"ab0c\" id=\"ab0c\" class=\"graf graf--h4 graf-after--figure\">The mysteries of nomad&#160;life.</h4><p name=\"fe2c\" id=\"fe2c\" class=\"graf graf--p graf-after--h4\">The old &#8220;don&#8217;t know what you&#8217;re getting into&#8221; has never been more true than of travelling. Every time I pack my bags, I wonder what the next bed will be like. What will shower pressure be like? How long will it take for a shower to run hot? Took 4 minutes at one place, which makes both my and Al Gore&#8217;s heart run cold. Will there be funny smells? Are the roads steep? Are the sidewalks in good condition? One time I couldn&#8217;t work the bathroom key and locked myself in a hostel bathroom until some other travellers could rescue me. There are so many variables you have to learn every single time.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*xUGouf4d_3iaKKeNvidWSw.jpeg\">I have eaten so much meat and bread in recent months. I long for vegetables. This, however, is heaven, <strong class=\"markup--strong markup--figure-strong\">&#263;evap&#269;i&#263;i </strong>is a Balkan sandwich of spiced meat with ajvar (spicy red pepper spread) and onions on a grilled glatbread called somun. I ate this three days in a row in Zagreb and loved it so&#160;hard.<h4 name=\"ce75\" id=\"ce75\" class=\"graf graf--h4 graf-after--figure\">Food consumes&#160;you.</h4><p name=\"d148\" id=\"d148\" class=\"graf graf--p graf-after--h4\">Travel is eating. You have to eat the food to enjoy the culture, but the diet and finances can be brutal. Where will you eat? Was your research accurate on price-point? Will your budget survive? Are you in a good place for finding a variety of food? Can you cook at home? Did they give you any decent dishes or cookware? You may think eating out every day is pure awesome, but if you&#8217;re in a place like Spain or Portugal, like I have been, where finding vegetables can be hard work, you&#8217;ll deal with everything from bowels that hate you to skin breakouts and bad moods and serious cravings for Anything But Cheese. You wouldn&#8217;t think &#8220;craving anything but cheese&#8221; is a thing, but I can tell you this is crazy-true from my cheese-loving experience. I almost wept when I saw a properly dressed salad three weeks ago for the first time in 95 days, and soon I&#8217;ll be in countries where they tell you to eat nothing raw that can&#8217;t be peeled. Like lettuce. Sigh. I also long for a kitchen where I can slow-braise some meat and saute some greens.</p><h4 name=\"e353\" id=\"e353\" class=\"graf graf--h4 graf-after--p\">Hey, buddy, got the&#160;time?</h4><p name=\"9c6e\" id=\"9c6e\" class=\"graf graf--p graf-after--h4\">Time zones are a thing too, and not just in the ways you think. Want to text your best buddy? Their schedule may be completely opposite yours. Want to banter on Twitter or Facebook? Again, everyone might be just rushing off to work when you get home from a day of exploring and want to tell someone how great it was. It heightens that isolation of feeling a million miles from home. (Luckily there are new ways to connect abroad too. More on that next time.) Working overseas for people back home? Again, that time zone difference means you&#8217;ll be faced with lulls and silences when you really want to be productive, and if you&#8217;re self-employed, you&#8217;ll need total flexibility to make that work for you. (And sometimes it means you can pinch-hit on a deadline &#8216;cos you can work in what are &#8220;after-hours&#8221; for the office at home. That&#8217;s a win!)</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*UWgccfbJVgzLYgiXLGG0KA.jpeg\">I worked ahead one day and found myself here all alone, a 2,000&#8211;year-old Roman Coliseum, the best-preserved in the world, in Pula, Croatia. Only a security guard was there with me. I spent two hours being whipped by the wind and thinking I would not EVER get this chance of being alone in one of the great pieces of architectural antiquity the world has left standing. And that&#8217;s travel. There are lousy, sad, moody, expensive days, and then there&#8217;s something like&#160;this.<h3 name=\"dee4\" id=\"dee4\" class=\"graf graf--h3 graf-after--figure\">But wait, there&#8217;s&#160;more!</h3><p name=\"a304\" id=\"a304\" class=\"graf graf--p graf-after--h3\">Oh, so, so much more. The challenge of finding new SIM cards in every country, trying to buy travel tickets, dealing with language barriers, loneliness, anxiety, and so on. Even just planning out your life can be a full time job, in a way. It took me 20 hours to figure out 5 weeks of my life last week.</p><p name=\"5c82\" id=\"5c82\" class=\"graf graf--p graf-after--p\">I&#8217;m not telling you all this to dissuade you from taking up the nomad life. But you need to know this if you have fantasies of glamour and amazing days all the time. It just doesn&#8217;t work that way.</p><h4 name=\"892e\" id=\"892e\" class=\"graf graf--h4 graf-after--p\">Would I sell everything and take up this life&#160;again?</h4><p name=\"9f37\" id=\"9f37\" class=\"graf graf--p graf-after--h4\">Absolutely.</p><h4 name=\"995f\" id=\"995f\" class=\"graf graf--h4 graf-after--p\">Do I think I&#8217;ll last five years of&#160;this?</h4><p name=\"0ca0\" id=\"0ca0\" class=\"graf graf--p graf-after--h4\">Absolutely.</p><h4 name=\"1084\" id=\"1084\" class=\"graf graf--h4 graf-after--p\">Will this change me as a&#160;person?</h4><p name=\"3431\" id=\"3431\" class=\"graf graf--p graf-after--h4\">I bloody hope so, if it hasn&#8217;t already.</p><h4 name=\"d798\" id=\"d798\" class=\"graf graf--h4 graf-after--p\">Is it worth all of&#160;THAT?</h4><p name=\"0b39\" id=\"0b39\" class=\"graf graf--p graf-after--h4\">Seven days a week and twice on Sundays.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*3n9XehYrRXxGTq3CP6I0dA.jpeg\">There&#8217;s so much more to this picture than you see. Like how I just happened to go to the bathroom after lunch for just the right amount of time that I should step onto a patio for a view of Porto, Portugal, when a man named Fernando came out for the view, and we should start chatting, and then I would spend the day walking with him and his wife, and then a week later they would rent a car and drive me around and show me the city that I couldn&#8217;t see by transit, and how we stopped here and this dog walked up to me right when I was snapping photos. Travel is whatever comes your way. It&#8217;s usually not awesome but when it&#8217;s awesome, then none of the rest matters&#160;anymore.<h3 name=\"8c0e\" id=\"8c0e\" class=\"graf graf--h3 graf-after--figure\">THAT is the prize, the everything</h3><p name=\"0a47\" id=\"0a47\" class=\"graf graf--p graf-after--h3\">There&#8217;s Sufi wisdom that it&#8217;s the lows that make the highs so ecstatic, that suffering amplifies joy. All of that is true. For every bad day I have travelling, there&#8217;s one day where everything is a delightful surprise and full of magic, like my first sunny day in Lisbon where I had a smile ear-to-ear for hours, and those are the days where you know that every single thing is worth it for that moment, right there, right then.</p><p name=\"8056\" id=\"8056\" class=\"graf graf--p graf-after--p\">Even now, sipping bitter Turkish coffee amidst a bunch of Arabs in a weird shawarma joint in the third-largest city in Europe, Madrid, it&#8217;s awesome. I&#8217;m living a life many people dream of and will never experience. Every day, I see how different people live. Daily, I notice something I&#8217;ve never seen or even considered before. I&#8217;m constantly grateful I was raised Canadian in the &#8217;70s and &#8217;80s as a result of hardships I witness abroad, and that gratitude is a gift. I&#8217;m forever seeing beautiful things, amazing architecture, stunning art, jaw-dropping landscapes. I&#8217;m tasting new foods, ordering things that are a mystery until they arrive, drinking wines and liqueurs I may never find again.</p><p name=\"2775\" id=\"2775\" class=\"graf graf--p graf-after--p\">I worry about my budget, I panic on travel days, I dread bad beds, I struggle to communicate&#8230;</p><p name=\"18ce\" id=\"18ce\" class=\"graf graf--p graf-after--p\">&#8230;And I look forward doing it for the next 1,700 days, because nothing I&#8217;ve ever done has been this worthwhile.</p><p name=\"0760\" id=\"0760\" class=\"graf graf--p graf-after--p\">I will never regret this undertaking.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*s99Zt_TnB78XBv0mfZgPRA.jpeg\">The other day I was having a bad day, had to buy an expensive new memory card for my camera, was struggling with something else, and then, in that store, I saw this sunset, and I told myself to shut up and suck it up. This is&#160;Madrid.<p name=\"2ba5\" id=\"2ba5\" class=\"graf graf--p graf-after--figure\">Fact is, when I was packing up and wondering if I was making a mistake getting rid of this &#8220;dream apartment&#8221; I finally could afford and loved living in, selling all the furniture I&#8217;d dreamed of owning and now was surrounded by, I found a list of life goals I&#8217;d made 20 years ago, in my early 20s. Not one was about having any kind of home or husband or kids. More than 85% of the goals on that list (135 goals) were about travel and photography and writing. I achieved all the consumer-in-the-city things I&#8217;d set out to achieve but none of it was what I had been dreaming of for more than half my life.</p><p name=\"e0ec\" id=\"e0ec\" class=\"graf graf--p graf-after--p\">Now, instead of living a routine consumerist life I&#8217;m supposed to love because the Big Marketing Machine&#8482; says so, I&#8217;m actually living what I dreamed about before my life got in my way.</p><p name=\"7fd7\" id=\"7fd7\" class=\"graf graf--p graf-after--p\">One day I&#8217;ll be ready for a &#8220;dream home&#8221; again. But today I&#8217;m living for my dreams.</p><p name=\"f643\" id=\"f643\" class=\"graf graf--p graf-after--p graf--trailing\">Listen to the voices inside. If everything I&#8217;ve said actually registers in your head and then you still shrug and say, &#8220;Well, that&#8217;s the price to pay for living my dreams,&#8221; then yeah, you might be ready for nomad life, grasshopper.</p></div>","title":"So You Wanna Be A Digital Nomad? – ART + marketing"}},"pageContext":{"id":"5b937ad687be056953db7cd9"}}