{"data":{"mongodbDatabaseArticles":{"id":"5b937adf87be056953db7ce3","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"bd33\" id=\"bd33\" class=\"graf graf--h3 graf--leading graf--title\">Why Becoming a Digital Nomad Didn&#8217;t Give me the Freedom I Longed&#160;For</h1></p><h4 name=\"7d97\" id=\"7d97\" class=\"graf graf--h4 graf-after--figure\">Freedom has always been a fundamental value of&#160;mine.</h4><p name=\"810a\" id=\"810a\" class=\"graf graf--p graf-after--h4\">In my last job, I was a C-level executive at a small startup and maintained a very high degree of autonomy and independence. I was free to choose my own project-related goals, the people I wished to work with on these projects, and even the timelines by which most of these projects operated.</p><p name=\"9a1c\" id=\"9a1c\" class=\"graf graf--p graf-after--p\">On top, I was able to negotiate an agreement which allowed me to work remotely for 2 weeks out of each quarter.</p><p name=\"3d13\" id=\"3d13\" class=\"graf graf--p graf-after--p\">When even this failed to feed my freedom-hungry soul, I set myself on convincing the CEO of the company to enforce core working times of 10 am to 4 pm. That way, aside from required office time, people would be able to work whenever (and wherever) they chose.</p><p name=\"a0d3\" id=\"a0d3\" class=\"graf graf--p graf-after--p\">This allowed me great flexibility during the day. I was able to work on my own side business during peak times (which, for me, were the early mornings), instead of rushing to the office at 8 am. I also used my &#8220;mental dead time&#8221; in the afternoons to go to the gym (rather than waste them counting down the hours while having cup after cup of coffee).</p><h4 name=\"1e58\" id=\"1e58\" class=\"graf graf--h4 graf-after--p\">I was as independent as it gets (at least for someone employed in a dedicated office).</h4><p name=\"bd50\" id=\"bd50\" class=\"graf graf--p graf-after--h4\">But still, I felt so trapped. I craved total, uninhibited freedom&#8202;&#8212;&#8202;the ability to choose what to do, when to do it, and where to do it.</p><p name=\"4e58\" id=\"4e58\" class=\"graf graf--p graf-after--p\">My inability to choose all those things simultaneously caused me a lot of pain. Instead of seeing the freedom I had already managed to create for myself and others through consistent peak performance and negotiation, I just couldn&#8217;t stop seeing the prison I was in.</p><h4 name=\"eeff\" id=\"eeff\" class=\"graf graf--h4 graf-after--p\">And it killed&#160;me.</h4><p name=\"7834\" id=\"7834\" class=\"graf graf--p graf-after--h4\">I still had to work on Mondays, even if I felt like doing anything but. I still had to go to the office, even when I&#8217;d rather stay home or work from Bangkok. And I still had to give periodic updates and report to a boss.</p><h4 name=\"ea78\" id=\"ea78\" class=\"graf graf--h4 graf-after--p\">I longed to find the <strong class=\"markup--strong markup--h4-strong\">ultimate&#160;freedom</strong>.</h4><p name=\"ff71\" id=\"ff71\" class=\"graf graf--p graf-after--h4\">I figured financial and geographical independence would be the way to go. After all, having nobody to report to or manage (besides myself) would be equivalent to getting to do whatever I wanted, whenever I wanted&#8230; Right?</p><p name=\"738e\" id=\"738e\" class=\"graf graf--p graf-after--p\">So I became a solopreneur and digital nomad.</p><h4 name=\"3e0d\" id=\"3e0d\" class=\"graf graf--h4 graf-after--p\">For the first few weeks, I was&#160;psyched.</h4><p name=\"7125\" id=\"7125\" class=\"graf graf--p graf-after--h4\">It was mid-November (probably the worst time to be in Europe,) when I decided to take a flight to Bali.</p><p name=\"639b\" id=\"639b\" class=\"graf graf--p graf-after--p\">Once I was there, I woke up without an alarm clock every day and worked from my guesthouse bed for a few hours. When I got hungry enough, I&#8217;d have a big portion of gluten-free sweet potato pancakes at one of the hipster caf&#233;s down the road. I&#8217;d then continue to work on whatever seemed right, until I felt I was done, and ended the day by spending a few hours on the beach. Life was good.</p><p name=\"4a43\" id=\"4a43\" class=\"graf graf--p graf-after--p\">Fast-forward a couple of months and I had decided to move to Berlin with my partner (who was also a digital nomad). We were renting an Airbnb in the city center, chosen for its ideal home-office conditions.</p><p name=\"feed\" id=\"feed\" class=\"graf graf--p graf-after--p\">Like many digital nomads, we chose to extend our stay in Berlin for a couple of months, to avoid having to pack up and get back on the road too soon. For us, being a nomad meant having the freedom to choose where to stay, and for how long. We weren&#8217;t interested in ticking off as many cities as possible.</p><h4 name=\"c108\" id=\"c108\" class=\"graf graf--h4 graf-after--p\">We felt like the luckiest people on&#160;earth.</h4><p name=\"512a\" id=\"512a\" class=\"graf graf--p graf-after--h4\">We woke up together every day and enjoyed a relaxing breakfast&#8202;&#8212;&#8202;and occasionally some extended time in bed.</p><p name=\"1099\" id=\"1099\" class=\"graf graf--p graf-after--p\">I especially loved the big kitchen in our Airbnb; it allowed us to have freshly-made healthy meals 3 times a day. The freedom to cook our own food (instead of grabbing something to go in a rush for lunch) was the ultimate luxury for me.</p><p name=\"de54\" id=\"de54\" class=\"graf graf--p graf-after--p\">I had even eliminated the need to commute every day.</p><h4 name=\"c32e\" id=\"c32e\" class=\"graf graf--h4 graf-after--p\">I had given myself the freedom to design my own self-dictated schedule from the bottom up. I was ecstatic.</h4><p name=\"371e\" id=\"371e\" class=\"graf graf--p graf-after--h4\">But soon, something strange began to happen.</p><p name=\"c5c9\" id=\"c5c9\" class=\"graf graf--p graf-after--p\">When I felt tired and unproductive in the afternoons, I stopping taking my usual break from work and instead pushed through until 6pm. When I woke up feeling a little off, I didn&#8217;t go to yoga class to center myself before heading straight to my computer.</p><p name=\"a600\" id=\"a600\" class=\"graf graf--p graf-after--p\">When a friend visited, I didn&#8217;t take the day off to show her around Berlin, but met her for an after-work drink only. When my mum called me at 11am on a Friday, I didn&#8217;t pick up. I called her back during my designated &#8220;time off&#8221;.</p><h4 name=\"8d6f\" id=\"8d6f\" class=\"graf graf--h4 graf-after--p\">I had built my own&#160;prison.</h4><blockquote name=\"cce6\" id=\"cce6\" class=\"graf graf--pullquote graf-after--h4\">My own rules and routines had become my chains. My &#8220;shoulds&#8221; and &#8220;musts&#8221; had become the walls that confined me. And my guilt had become the prison guard, taking away the freedom I had fought so hard to&#160;gain.</blockquote><p name=\"8a9c\" id=\"8a9c\" class=\"graf graf--p graf-after--pullquote\">That&#8217;s when I realized something: Discovering the ultimate freedom has nothing to do with becoming financially&#8202;&#8212;&#8202;or locationally&#8202;&#8212;&#8202;independent.</p><p name=\"7da4\" id=\"7da4\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">The ultimate freedom can only be achieved by liberating the mind.</strong></p><p name=\"f9cb\" id=\"f9cb\" class=\"graf graf--p graf-after--p\">We can remove all our external dependencies, but if we don&#8217;t free our mind, it will continue to keep us trapped with thoughts like:</p><p name=\"2c60\" id=\"2c60\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\"><strong class=\"markup--strong markup--p-strong\">&#8220;You should get up early so you can get ahead.&#8221;</strong></p><p name=\"0f09\" id=\"0f09\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\"><strong class=\"markup--strong markup--p-strong\">&#8220;You should work at least 10 hrs a day; then maybe you&#8217;ll be able to get enough done.&#8221;</strong></p><p name=\"0ffc\" id=\"0ffc\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\"><strong class=\"markup--strong markup--p-strong\">&#8220;You should not watch Netflix during the week; that&#8217;s time you could use to read emails.&#8221;</strong></p><p name=\"e38c\" id=\"e38c\" class=\"graf graf--p graf-after--p\">As with all emotions, guilt can act as a powerful internal signalling system which, in this case, causes us to feel guilty when we do something that goes against our own morals and rules.</p><p name=\"a76f\" id=\"a76f\" class=\"graf graf--p graf-after--p\">That&#8217;s a great thing, because most of our own rules are there for a reason. They can be an essential part of our freedom and are therefore foundational to our happiness, health and success. Otherwise, we wouldn&#8217;t have made them in the first place.</p><p name=\"43a0\" id=\"43a0\" class=\"graf graf--p graf-after--p\">But true freedom is having the ability to choose when&#8202;&#8212;&#8202;and when not&#8202;&#8212;&#8202;to follow the rules.</p><p name=\"0531\" id=\"0531\" class=\"graf graf--p graf-after--p\">The ultimate freedom lies in our ability to allow ourselves to create rules for ourselves and follow them because we <strong class=\"markup--strong markup--p-strong\">want</strong> to. And on some days, to not follow them because we <strong class=\"markup--strong markup--p-strong\">don&#8217;t </strong>want to&#8202;&#8212;&#8202;without feeling guilty about it.</p><blockquote name=\"04c8\" id=\"04c8\" class=\"graf graf--pullquote graf--hasDropCapModel graf-after--p\">There is true freedom to be found in questioning and rejecting our own&#160;rules.</blockquote><h4 name=\"9dc6\" id=\"9dc6\" class=\"graf graf--h4 graf-after--pullquote\">By letting go of the guilt that keeps us trapped and choosing our thoughts wisely, we can achieve true internal&#160;freedom.</h4><p name=\"713a\" id=\"713a\" class=\"graf graf--p graf-after--h4\">Most days I will continue to work from 9 to 5, despite calling myself a digital nomad, because it is my choice to do so. I do it because I want to persevere even when I get tired. And I have found it helpful to define designated working times.</p><p name=\"2415\" id=\"2415\" class=\"graf graf--p graf-after--p\">But there are days when I choose to go against my own rules and exercise my freedom to do whatever I want&#8202;&#8212;&#8202;wherever and whenever I want.</p><p name=\"39cd\" id=\"39cd\" class=\"graf graf--p graf-after--p graf--trailing\">And now, I can do so and feel good about it. Because when my mind is free, I am free.</p></div>","title":"Why Becoming a Digital Nomad Didn’t Give me the Freedom I Longed For"}},"pageContext":{"id":"5b937adf87be056953db7ce3"}}