{"data":{"mongodbDatabaseArticles":{"id":"5b95eb3a87be058327490009","content":"<div><p>Made with love by travelers for travelers! The purpose of my guides is to let you live large on a budget. I focus on activities that give you insight into the land, people, and culture.</p><p><strong>Updated:</strong> July 2018<br><strong>Return policy:</strong> No risk, 30 Day, 100% Money Back Guarantee<br><strong>Details:</strong> 96 pages of expert budget travel advice with maps</p><p>I loved Amsterdam from the moment I first wandered into the city in 2006. Every year since then, I&#8217;ve returned to this beautiful city.</p><p>I&#8217;ve lived there, I have local friends, and even lead tours there now (fun fact: I was a professional poker player there too!).</p><p>I know the city like the back of my hand and used my personal experience to write this direct and straightforward guidebook for people who want to be more than just a tourist.</p><p>Amsterdam is one of the most visually stunning cities in the world. Old brick buildings gaze over a patchwork of canals lined with tiny cobblestone streets and alleys. Wandering the streets as you zigzag through the city, you&#8217;ll feel as though you&#8217;ve stepped back into the 17th century and might see members of the historic Dutch East India Company around the next corner. It&#8217;s a truly magical place and I want you to love it the way I love it. I want you to experience it the way it&#8217;s meant to be experienced &#8211; the Dutch way!</p><p>Amsterdam has something for everyone and this book will give you all that on a budget. It shares the hidden secrets of the city and offers an authentic local experience into quaint cafes, beautiful parks, and architecture, and overlooked sights.</p><p>This comprehensive guide features insider tips on places to eat, stay, and play. I&#8217;ll give you local, off the beaten path knowledge to help you move around the city, get away from the tourists, and find the places listed in no other guidebook.</p></div>","title":"Amsterdam Travel Guide: Expert Travel Advice From Nomadic Matt"}},"pageContext":{"id":"5b95eb3a87be058327490009"}}