{"data":{"mongodbDatabaseArticles":{"id":"5b96248e87be058327490eaa","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">34 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p><strong>&#8220;Live everyday as if it were your last because someday you&#8217;re going to be right.&#8221;</strong><br>\n-Muhammad Ali</p>\n<p><img src=\"http://photos.foxnomad.com/NorthAmerica/Texas/Austin/i-H24gvKW/0/690x690/P106038234c-M.jpg\" alt=\"Angelina Eberly statue austin texas\" width=\"690\" height=\"515\"></p>\n<p>There&#8217;s a really big problem with New Year&#8217;s resolutions &#8211; namely, that most of us don&#8217;t keep them. And when it comes to <a href=\"https://foxnomad.com/category/travel/\">travel</a>, making plans in the middle of a holiday season that often involves being intoxicated doesn&#8217;t help get you anywhere in <a href=\"https://foxnomad.com/2011/06/\">June</a>. Fortunately for us, <a href=\"https://foxnomad.com/category/travel/tech/\">technology</a> is much less forgetful than we are and our brains can be hacked to get the results we want from them.</p>\n<p>Where do you want to go in 2017? Let&#8217;s get started:</p>\n<p><strong><img src=\"https://foxnomad.com/wp-content/uploads/2011/12/remember-the-milk-android.jpg\" alt=\"remember the milk android\" width=\"185\" height=\"308\">Refine Your To-Do List (aka. Resolutions) So It&#8217;s Believable</strong></p>\n<p>The most common list problem is the easiest to solve and neglect at the same time &#8211; where to keep your list. The free site <a href=\"https://www.rememberthemilk.com/\">Remember The Milk</a> lets you set specific lists (e.g. &#8216;2017 Travel Resolutions&#8217;), prioritize them, and set schedules to make sure you stay on track. Remember The Milk also syncs with your iPad, iPhone, Android, and email accounts if you choose, as well as a few other online services you&#8217;re likely using.</p>\n<ul>\n<li><strong>Read <a href=\"https://www.amazon.com/gp/product/0142000280/ref=as_li_tf_tl?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0142000280\">Getting Things Done: The Art of Stress-Free Productivity</a></strong> &#8211; I read this book several years ago and if you want to <a href=\"https://foxnomad.com/2009/08/27/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-7-you-will-travel-the-world-later/\">pounce procrastination</a> plus learn to make powerful lists, this is the book for you.</li>\n</ul>\n \n<p>There are <a href=\"https://foxnomad.com/2010/04/13/4-types-of-travel-lists-that-wont-help-you-very-much/\">4 types of travel lists that won&#8217;t help you very much</a> and you can avoid creating one by keeping your travel resolutions short, have well defined steps toward your final goal, and set rough timetables for each item.</p>\n<p><strong>Use The Winner Effect To Knock Out Resolutions</strong></p>\n<p>Don&#8217;t make the first resolutions you want to tackle be the most difficult. Rather, use the <a href=\"https://www.sciencedirect.com/science/article/pii/S0031938406002514\">winner effect to improve your chances</a> of accomplishing more difficult goals down the line by setting up easier victories now. It works for boxers, 3-point shooters in basketball, and can for you by modifying your physiology for increased confidence.</p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2011/12/3-pointer.jpg\" alt=\"3 pointer shot\" width=\"690\" height=\"460\"></p>\n<p>The winner effect in many studies was <a href=\"https://io9.gizmodo.com/5870151/the-winner-effect-and-how-to-stop-it\">nullified for subjects</a> not in their territory (think home-team advantage) so for added chances of success early on, set up your early travel resolutions in familiar surroundings. Rather than making your first goal &#8220;travel to Thailand and live for a year&#8221; set yourself up for smaller victories like &#8220;go to the bank and open a savings account&#8221;. (Here&#8217;s <a href=\"https://foxnomad.com/2010/04/14/how-to-choose-the-right-bank-before-going-overseas-to-save-time-and-avoid-fees/\">how to choose the right bank for international travel</a>.)</p>\n<p><strong>Digitize Peer Pressure</strong></p>\n<p>An effective way to get around saying one thing and doing another (a form of cognitive dissonance) is to hold yourself accountable to others. You can do that by informing close friends of your plans (and the key steps in your resolution lists &#8211; the winner effect can encourage them to believe in you more). That makes it all the harder to ditch your travel resolutions.</p>\n<p><img class=\"alignnone size-full\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-GnVPNdh/0/690x690/i-GnVPNdh-X3.jpg\" alt=\"habitlist app ios\" width=\"690\" height=\"541\"></p>\n<p>Another way to keep the pressure on yourself to get out the door and <a href=\"https://foxnomad.com/category/travel/\">travel</a> is to use apps where you can set goals, see progress towards them, and be nicely reminded when you might be falling off track. The <a href=\"http://habitlist.com/\">Habit List</a> app ($3.99 iOS) and free <a href=\"http://www.habitbull.com/\">Habit Bull</a> (Android/iOS) both let you set goals big and small, showing you streaks, and creating a flexible schedule so you can plan your way to success.</p>\n<p><strong>Motivate Yourself By Visualizing</strong></p>\n<p>The biggest path to our memories is through our eyes and we tend to believe what we see. That effect goes beyond what our eyes see to what our minds can visualize. Imagine yourself accomplishing each of your travel resolutions and you&#8217;re much more likely to believe it&#8217;s possible, less risky, and rewarding. (For more on this bias check out <a href=\"https://www.amazon.com/gp/product/0071629696/ref=as_li_tf_tl?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0071629696\">How Risky Is It?</a>)</p>\n<blockquote><p>We often spend much of our travel-motivational efforts externally, trying to <a href=\"https://foxnomad.com/2009/08/06/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-4-youll-miss-your-family-and-friends/\">convince our family and loved ones</a> who might not be as supportive initially as we&#8217;d like. The real conflict happens when their doubt becomes contagious or rather, they highlight flaws in our overall plans. Be an efficient and powerful dream-to-reality converter by motivating the most important person who needs it &#8211; you.</p></blockquote>\n \n<p>The <a href=\"https://www.amazon.com/gp/product/1451648537/ref=as_li_tf_tl?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1451648537\">Steve Jobs biography by Walter Isaacson</a> is a great read for geeks for the technical tale it weaves; but also highlights what an incredible motivator the stubborn innovator he was. His 2005 Stanford commencement speech is both touching and powerful. A 15 minute dose of confidence and conviction for your travel resolutions and other passions in life.</p>\n<p></p>\n<p><strong>The Hardest Steps Are The Ones You Haven&#8217;t Taken Yet</strong></p>\n<p>Traveling means many things to many people and there is no one way to go. Whether you want to take one trip to a nearby city once a year or go on a <a href=\"https://foxnomad.com/2010/01/13/what-is-an-rtw/\">one-year RTW</a>, define your goals for you. Once you know where you want to be, it&#8217;s up to you to get there. You can <a href=\"https://foxnomad.com/2011/10/14/how-to-get-from-your-desk-to-all-the-places-you-want-to-travel/\">get from your desk to all the places you want to travel</a>. Your craziest dreams are only crazy until you believe in them. Your biggest obstacle is yourself. I believe in you. Believe in yourself. Now go make those crazy dreams come true.</p>\n<p>Happy New Year,<br>\n-Anil</p>\n<p>This is an updated version of a <a href=\"https://foxnomad.com/2011/12/29/how-to-stick-to-your-2012-travel-resolutions/\">post originally written in 2012</a>.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"How To Stick To Your 2017 Travel Resolutions"}},"pageContext":{"id":"5b96248e87be058327490eaa"}}