{"data":{"mongodbDatabaseArticles":{"id":"5b95eed987be0583274900fa","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Crown Lanta: A Picture Perfect Koh Lanta Resort</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a title=\"Crown Lanta: A Picture Perfect Koh Lanta Resort\" href=\"https://www.tielandtothailand.com/crown-lanta-koh-lanta-resort/\"><img class=\"aligncenter size-full wp-image-15194\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Resort-Header.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta: A Picture Perfect Koh Lanta Resort\" width=\"1000\" height=\"550\"></a></p>\n<p>When we first traveled around Thailand, we were starstruck by hotels with rock-bottom price tags. But now, we&#8217;re more often in the market for something more elegant and comfortable for a higher (yet still reasonable) price tag. On our recent trip Thailand&#8217;s southern region, the Koh Lanta resort called Crown Lanta didn&#8217;t disappoint!</p>\n<p>Of course what&#8217;s cheap is in the eye of the beholder. Hostels that cost 5 USD per night have not and never will be a realistic option for us, so around 20 USD per night is the lowest we&#8217;ve ever paid in Thailand. But that still meant that we often dealt with creepy crawlies in the room, impossibly hard or sunken mattresses, or a bathroom so dank and dreary that we only went in when it was absolutely necessary.</p>\n<p>The novelty of that type of hotel has since worn off and now we don&#8217;t feel the need to book those cheaper options available when we travel. Nowadays when we search for hotels, we look at the price, quality, and comfort and not just the absolute dollar amount.</p>\n<p><img class=\"aligncenter size-full wp-image-15178\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Ocean-Villa.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Crown Lanta Resort &amp; Spa Ocean Sunset Villa on Koh Lanta, Thailand\" width=\"1000\" height=\"563\"></p>\n<p>So on our recent trip to Koh Lanta, we booked the earliest budget flight from Chiang Mai to Krabi and made it to our destination resort, <a href=\"https://www.agoda.com/crown-lanta-resort-spa/hotel/koh-lanta-th.html?cid=1608701\" target=\"_blank\" rel=\"noopener\">Crown Lanta</a>, by midday. After landing, we took a two-hour drive in the hotel&#8217;s shuttle van to the northern end of Koh Lanta Yai, which is closest to the ferry. That meant that as soon as we finished our ferry ride, it was just over five minutes later that we arrived at the resort and received refreshment drinks and cool cloths in the lobby.</p>\n<p>Just look at this amazingness!</p>\n<h2><p id=\"Ocean_Sunset_Villa\">Ocean Sunset Villa</p></h2>\n<p><img class=\"aligncenter wp-image-15157 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Ocean-Sunset-Villa-3.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta Ocean Sunset Villa, a Koh Lanta Resort\" width=\"1000\" height=\"550\"></p>\n<p>We walked into a high-ceilinged living room complete with a comfy day bed, a flat-screen TV, and a mini bar with two bottles of wine (first time that&#8217;s happened)! We distinctly remembered the room&#8217;s freshness and brightness. The glass French doors on one side opened up to our own private lounge area on a deck overlooking the Andaman Sea.</p>\n<p><img class=\"aligncenter size-full wp-image-15156\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Ocean-Sunset-Villa-6.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta Ocean Sunset Villa View\" width=\"1000\" height=\"550\"></p>\n<p>On the other side was our bedroom. It was beautiful. And spotless. We&#8217;ll even go so far as say immaculate. We ended up getting great sleep there, too, as the bed and pillows were super comfortable and it was very quiet at night.</p>\n<p><img class=\"aligncenter size-full wp-image-15191\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Villa-Bedroom-Collage.jpg?resize=1000%2C514&amp;ssl=1\" alt=\"Crown Lanta Ocean Sunset Villa on Koh Lanta, Thailand\" width=\"1000\" height=\"514\"></p>\n<p>Even our spacious bathroom had a window that allowed small glimpses of coastline if we peeked past the foliage. There was a rain shower and plenty of fluffy towels, nice smelling soaps, and washcloths. Brownie points for that last bit!</p>\n<p><img class=\"aligncenter size-full wp-image-15171\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-villa-Bathroom.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta Ocean Sunset Villa Bathroom\" width=\"1000\" height=\"550\"></p>\n<p>A cool feature of the room was the two-sided closet. We&#8217;d hang up our clothes and everything was accessible from both the bedroom and the bathroom. It&#8217;s worth mentioning that we also had extra bottles of drinking water (two is standard), especially because we drank so much water on this trip because we were out in the sun all day.</p>\n<h2><p id=\"Grounds\">Grounds</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15168\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Resort-1.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta Resort (1)\" width=\"1000\" height=\"550\"></p>\n<p>The grounds of the Crown Lanta had nice, tropical landscaping but were hilly. This wasn&#8217;t a problem though because there was a dedicated team of drivers that carted guests around to where they needed to be. In the time it took us to grab our sunglasses and slip on our shoes, a cabby would arrive to pick us up from our room and drive us to wherever we wanted to go whether it be the lobby, pool area, spa, or restaurant.</p>\n<p>Actually, before we chose to stay at this particular Koh Lanta resort, we read reviews about it and the biggest complaint seemed to be about the hilly walk around the property. But seriously, that&#8217;s what the drivers are there for! And the drivers were on top of their game. Not once during our stay did they take more than a minute to arrive after we called the front desk.</p>\n<h2><p id=\"Onsite_Bar_Crown_Reggae\">Onsite Bar: Crown Reggae</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15179\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Sunset-2.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta's Reggae Bar sunset view\" width=\"1000\" height=\"550\"></p>\n<p>Aside from relaxing in our room and on our private oceanfront deck, our favorite hangout spot was the Crown Reggae. This was the resort&#8217;s outdoor bar situated on a rocky coast with the perfect view of the sunset. We spent two evenings there enjoying snacks and drinks with great company and watching the sun go down in brilliant colors.</p>\n<p>There are a few different areas to sit. There&#8217;s the front row view on Thai style cushions on the beach near tiki torches, a thatched roof pavilion&#160;to lounge under, tables under a few strings of lanterns to enjoyed cocktails, or a treehouse to chill in. The kid in us loved this last feature!</p>\n<h2><p id=\"Pool_Spa_and_Gym\">Pool, Spa, and Gym</p></h2>\n<p><img class=\"aligncenter wp-image-15161 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Resort-Pool-and-Swim-Up-Bar.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Gorgeous pool and swim up bar at Crown Lanta, a high-end resort on Koh Lanta\" width=\"1000\" height=\"550\"></p>\n<p>Check out this crystal clear outdoor pool with a swim-up bar. There was plenty of lounge chairs and umbrellas, and some of the rooms even open up directly to the pool.</p>\n<p>Crown Lanta&#8217;s Infinity Spa, while pricier than your standard roadside foot massage, had several private rooms and even a jacuzzi. We enjoyed two back, neck, and shoulder massages here, but if we had wanted to, we could have gotten massages outside on tables like these below.</p>\n<p><img class=\"aligncenter size-full wp-image-15181\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-Spa.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Crown Lanta Infinite Spa\" width=\"1000\" height=\"550\"></p>\n<p>And although we had every intention of using Crown Lanta&#8217;s gym, we ended up spending our time doing <a href=\"https://www.tielandtothailand.com/unforgettable-things-to-do-in-koh-lanta/\">less work and more play</a> while on the island.</p>\n<h2><p id=\"Restaurants_The_Peak_and_The_Cliff\">Restaurants: The Peak and The Cliff</p></h2>\n<img class=\"wp-image-15182 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-The-Peak-Restaurant.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Breakfast at The Peak at Crown Lanta\" width=\"1000\" height=\"550\"><p>One feature we personally seek out in a hotel is the featured breakfast. Beginning with an endless flow of fresh drip coffee (thank you for not serving that instant powdered stuff), Crown Lanta&#8217;s The Peak served up an amazing complimentary breakfast that included mini Belgian waffles, homemade yogurt, fresh bread, and made-to-order omelets. There were Thai foods as well, but our hearts were set on the Western fare during this trip.</p>\n<p>And especially after our really late night out at the Crown Reggae the night before, we were happy to see some freshly blended fruit juices as part of the breakfast spread, perfect for flushing our system with much-needed antioxidants.</p>\n<img class=\"wp-image-15183 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Crown-Lanta-The-Cliff-Restaurant.jpg?resize=1000%2C332&amp;ssl=1\" alt=\"The Cliff Restaurant at Crown Lanta\" width=\"1000\" height=\"332\"><p>Lunch at the outdoor Cliff Restaurant was also yummy. The menu featured mostly standard Thai dishes, but the presentation was much nicer than anything we found at nearby street stalls and matches the quality we&#8217;d expect from a high-end resort. Although it might not sound like anything special, the fish cakes and the accompanying dipping sauce were out of this world.</p>\n<h2><p id=\"Service_and_Amenities\">Service and Amenities</p></h2>\n<p></p>\n<blockquote class=\"instagram-media\">\n<p></p>\n<p><a href=\"https://www.instagram.com/p/_QaL5coBsR/\" target=\"_blank\" rel=\"noopener\">Quiet Beach #Sunset in #KohLanta #Thailand. Yesterday we spent the day exploring several different areas of the island before retreating back to our sunset villa nestled in the cliffs of the @CrownLanta Resort. Today we are off to explore Old Town. Bring on the fruit smoothies and sunshine &#128107;</a></p>\n<p>A photo posted by Chris and Angela Scott (@tielandtothailand) on Dec 13, 2015 at 7:01pm PST</p>\n</blockquote>\n<p></p>\n<p>One thing that stood out was Crown Lanta&#8217;s wonderful hospitality. From the time we were picked up at the airport to the time we checked out of our rooms, the staff was incredibly friendly and helpful. Everything was so hassle-free: our airport pickup, booking a motorbike rental, requesting a driver pickup from our villa, and ordering food and drinks. The staff really made us feel welcomed and we felt well taken care of. That&#8217;s not to say we normally receive bad service, but the Crown Lanta&#8217;s staff really seemed to go above and beyond.</p>\n<p>Here&#8217;s a quick list of Crown Lanta&#8217;s amenities:</p>\n<ul>\n<li>Restaurants open for breakfast, lunch, and dinner. Seafood buffet on Friday evenings with fire and Thai dance show.</li>\n<li>Onsite gym and Infinity Spa</li>\n<li>Drivers to take you around the property</li>\n<li>Shuttle service to and from the airport</li>\n<li>Motorbike rental and excursion booking</li>\n<li>Outdoor swimming pool with swim-up bar</li>\n<li>Six different room types, ranging from a Gazebo Deluxe Room to Grand Villa Residence</li>\n<li>Amply stocked bathroom with towels, soaps, and toiletries; great shower pressure and temperature</li>\n<li>Stunning beach views from multiple areas of the property and rooms</li>\n</ul>\n<p>We&#8217;ve got to hand it to Crown Lanta for its quality and comfort. Sure, it&#8217;s not a budget hotel and may not be suitable for some travelers, but we definitely recommend this resort to those who are looking for something a step above the rest while visiting Koh Lanta.</p>\n<h2></h2>\n<p><strong>Phone:</strong> (075) 626-999<br>\n<strong>Email:</strong> <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a>, <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a><br>\n<strong>Website:</strong> www.crownlanta.com<br>\n<strong>Address:</strong> 315 Moo 1, Saladan, Koh Lanta, Krabi, 81150 Thailand</p>\n<p>The Crown Lanta is a popular place to be during the high tourist season (November through April), but that&#8217;s all the reason to visit during the low season. In fact, the low season is our favorite time to travel because you can almost guarantee that the price of any resort, guesthouse, or even bungalow on Thailand&#8217;s islands and beaches are nearly half the cost in low season as they are in the high season. Just a thought the next time you want to get the best bang for your buck and treat yourself to a tropical Koh Lanta resort!</p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"pinit aligncenter wp-image-15197 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/CrownLanta-Pinterest-500px.jpg?resize=500%2C909&amp;ssl=1\" alt=\"Crown Lanta is one of those Koh Lanta resorts perfect for treating yourself on an easygoing tropical island. | Tieland to Thailand\" width=\"500\" height=\"909\"></p>\n<p>Disclosure: Our stay at the Crown Lanta Resort &amp; Spa was sponsored but all of our opinions are our own. We are happy to share our experience so that you can choose whether to include this resort as part of your upcoming trip to Thailand.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Crown Lanta: A Picture Perfect Koh Lanta Resort"}},"pageContext":{"id":"5b95eed987be0583274900fa"}}