{"data":{"mongodbDatabaseArticles":{"id":"5b9248ca87be056953db7bf3","content":"<div><blockquote><p>The self is highly adaptable to its external environment, and ironically, the more you change your external environment, the more you lose track of who you actually are, because there&#8217;s nothing solid to compare yourself against.</p></blockquote> <blockquote><p>With frequent travel, so many variables in your life are changing that it&#8217;s hard to isolate a control variable and see the effect everything else has on it. You are in a constant state of upheaval.</p></blockquote> <blockquote><p>Frequent travel puts your identity into constant flux where it&#8217;s impossible to distinguish with certainty who you are or what you know, or whether you really know anything at all.</p> <p>And this is a good thing.</p> <p>Because uncertainty breeds skepticism, it breeds openness, and it breeds non-judgment. Because uncertainty helps you to grow and evolve.</p></blockquote> <blockquote><p>And when you go long enough being uncertain of who you really are, what results is a form of subtle, long-term meditation &#8212; a persistent and necessary acceptance of whatever is arising (..)</p> <p>And at some point, you just stop asking questions. And start listening. To the waves and the wind and the calls for love in all of the beautiful languages you will never understand.</p> <p>You just let it be. And keep moving.</p></blockquote> <p>&#8212;<a href=\"http://twitter.com/iammarkmanson\">Mark Manson</a> on <a href=\"http://markmanson.net/5-life-lessons-5-years-traveling-world/\">5 Life Lessons From 5 Years of Traveling the World</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Why traveling makes you feel lost"}},"pageContext":{"id":"5b9248ca87be056953db7bf3"}}