{"data":{"mongodbDatabaseArticles":{"id":"5b95ea4287be05832748ff93","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/pinterest/cheapusdollar.jpg\" alt=\"us dollars\"><br> <strong>Note:</strong> As of Feb 2016, the US dollar is very strong compared to other currencies. Every country in the world has become a lot cheaper, especially the countries listed in this article. So enjoy an even better time to travel and use this country as a guide to generate some ideas!</p><p>The US&#160;dollar isn&#8217;t what it once was. Though it has gained strength recently because of the ongoing debt crisis in Europe, it has fallen against the Australian, New Zealand, and Canadian dollars, as well as just about every other major currency in the world. (It dropped greatly against the Swedish krona while I was there this summer!)</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/18-lessons-from-5-years-around-the-world/\">As a constant traveler</a>, I worry about currency moves like only a Wall Street trader would. Small changes in the value of the dollar can wreck my entire budget. My <a href=\"https://www.nomadicmatt.com/travel-blogs/the-cost-of-traveling-oz/\">budget for Australia</a> was $1,000 short because the Australian dollar suddenly got stronger against the greenback.</p><p>Yet despite the sorry state of the US dollar, the world is still filled with great and cheap places where the dollar can go far. In fact, there are places in the world where the dollar has actually risen in value over the last few years. (I know &#8212;&#160;unbelievable, right?)</p><p>Here are <a href=\"http://forums.nomadicmatt.com/topic/883-whats-the-best-budget-travel-destination/\">some cheap destinations</a> where your dollar can go far:</p><h3>Costa Rica</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar3.jpg\" alt=\"costa rica is a cheap place to travel\"><br> Costa Rica is one of the few countries to have its currency lose ground to the dollar. A dollar now gets 539&#160;colones, up from 360 a few years ago. Though the country is one of the most expensive in Central America, your money goes a lot further than it used to, making it a better bargain. <a href=\"https://www.nomadicmatt.com/travel-blogs/my-favorite-destinations-in-costa-rica/\">Costa Rica</a> is a beautiful place and my favorite Central American country. As an added bonus, flights from the US are also very cheap. I paid $400 USD to fly round-trip from NYC, and you can sometimes gets fights as low as $300 USD. On the cheap end, you&#8217;ll need about $40 USD per day, while for your mid-range costs you&#8217;ll need about $60 USD. Compared to visiting NYC, Disney, or the Caribbean, Costa Rica is a steal.</p><p><strong>Learn more and plan your trip with <a href=\"https://www.nomadicmatt.com/travel-guides/costa-rica-travel-tips/\">my guide to traveling Costa Rica</a>.</strong></p><h3>Vietnam</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar1.jpg\" alt=\"vietnam is a cheap place to travel\"><br> While <a href=\"https://www.nomadicmatt.com/travel-blogs/why-ill-never-return-to-vietnam/\">I&#8217;m not a huge fan of Vietnam</a>, it&#8217;s certainly a cheap country. When I visited years ago, the US dollar got 16,000 dong. Now it&#8217;s more like 22,000 dong! Back then, I was spending $8 USD a day, which included cheap guest houses, local food, transportation, and a bit of drinking. Of course, the price of goods has gone up a lot since I was last there, but the country still remains incredibly affordable, especially when compared to many of its neighbors. Realistically, if you budgeted $20 USD a day, you would want for little. The Vietnamese dong is one of the few currencies that has gotten worse against the US dollar in recent years.</p><p><strong>Learn more and plan your trip with <a href=\"https://www.nomadicmatt.com/travel-guides/vietnam-travel-tips/\">my guide to traveling Vietnam</a>.</strong></p><h3>Ukraine/Romania/Bulgaria</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar2.jpg\" alt=\"towns in bulgaria are a cheap place to travel\"><br> The real eastern part of Europe is the cheapest part of Europe. Last year, <a href=\"https://www.nomadicmatt.com/travel-blogs/the-cost-of-traveling-far-eastern-europe/\">I visited these three countries</a>, and could not believe how affordable they were. I was living like a king for less than $40 USD per day, paying $8 USD a night for a room in Ukraine, $1.50 USD for a liter of beer, and a few dollars for a local meal. When most people envision a European vacation, they envision Paris, Rome, or Prague, but you can get that same charm here without the high prices of those other cities and you encounter far fewer tourists. These three countries offer some of the best value on the continent.</p><p><strong>Learn More: <a href=\"https://www.nomadicmatt.com/travel-blogs/finding-more-than-dracula-in-romania/\">Finding more than Dracula in Romania</a></strong></p><h3>&#8220;Central&#8221; Central America</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar4.jpg\" alt=\"tikal is a cheap place to travel\"><br> Outside of Costa Rica, other Central American countries such as El Salvador, Honduras, Guatemala, and Nicaragua are an even better bargain. You can get by in all of these countries for less than $30 USD per day, and they are a good alternative to touristy and &#8220;expensive&#8221; countries like Mexico, <a href=\"https://www.nomadicmatt.com/travel-guides/belize-travel-tips/\">Belize</a>, or Costa Rica. You&#8217;ll find wonderful historic ruins, jungles, food, and people in this part of the world. As the political situation in these countries stabilizes, more and more people are flocking to them (Nicaragua is becoming the new Costa Rica), so get going while the crowds and costs are few.</p><p><strong>Learn more and plan your trip with <a href=\"https://www.nomadicmatt.com/travel-guides/central-america-travel-tips/\">my guide to Central America</a>.</strong></p><h3>India</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar10.jpg\" alt=\"taj mahal is a cheap place to travel\"><br> While India has always been a cheap country, the Indian rupee used to ride high at 39 to the dollar. Now, you get 67&#160;to the dollar, almost twice as much! In an already inexpensive country like India where you can get by on as little as $20 USD per day, that extra money can go a long way. Even if you go for mid-range accommodation and food, you&#8217;ll be hard-pressed to spend more than $50 USD per day unless staying at five-star resorts. While the flights can be expensive, once there everything is a bargain, making the long flight to see the historic Taj Mahal, the beaches of Goa, and metropolises like New Delhi and Mumbai much more appealing.</p><h3>Argentina</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar9.jpg\" alt=\"argentina is a cheap place to travel\"><br> Another country whose currency has lost ground to the dollar.&#160;The economic depression is hitting the country hard, which&#160;makes amazing Argentina &#8212;&#160;filled with history, beautiful people, culture, wine, football, and outdoor wonders like Patagonia &#8212;&#160;even more worth a visit. Buenos Aires is considered one of the liveliest cities in the world, and most people speak English. The only problem with this country is its rampant inflation, but even with that, you can still get by on around $40-50 USD per day.</p><p><strong>Learn more and plan your trip with <a href=\"https://www.nomadicmatt.com/travel-guides/argentina-travel-tips/\">my guide to Argentina</a>.</strong></p><h3>Cambodia</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar8.jpg\" alt=\"cambodia is a cheap place to travel\"><br> Cambodia is one of my favorite countries in the world and <a href=\"https://www.nomadicmatt.com/travel-blogs/phnom-penh-same-same-but-different/\">I recently traveled back there after a five-year absence</a>. Prices have increased a little, but not by much. Cross-country buses still cost less than $10 USD, meals are $1&#8211;3 USD, private rooms are around $10 USD, and beer is still 75 cents. Everything here works in dollars. ATMs give them out, goods are priced in dollars, you get change in dollars: it makes converting pretty easy. I find the country to be cheap, <a href=\"https://www.nomadicmatt.com/travel-blogs/experiencing-cambodian-culture-on-bamboo-island/\">friendly</a>, and safe. Plus, <a href=\"https://www.nomadicmatt.com/travel-blogs/ten-historical-sites/\">Angkor Wat is one of the most amazing historical sites in the world.</a></p><p><strong>Learn more and plan your trip with <a href=\"https://www.nomadicmatt.com/travel-guides/cambodia-travel-tips/\">my guide to Cambodia</a>.</strong></p><h3>Greece</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar5.jpg\" alt=\"greece is a cheap place to travel\"><br> The falling euro has made Europe as a whole much cheaper than it was before. However, the county most hit by this crisis is Greece. Now this <a href=\"https://www.nomadicmatt.com/travel-blogs/how-much-does-greece-really-cost/\">once-cheap country</a> is even more of a bargain than it was previously. With 10-euro hostels, 20-euro hotels, and <a href=\"https://www.nomadicmatt.com/travel-blogs/my-guide-to-greek-food/\">3-euro gyros</a>, this country is a steal. You&#8217;ll get to enjoy beautiful islands, beaches, and delicious food at a fraction of the price of other European countries. Moreover, since the economic problems have caused a huge drop in tourist numbers, there are fewer crowds on those wonderful beaches! <a href=\"https://www.nomadicmatt.com/travel-blogs/five-destinations-under-30-dollars-per-day/\">Greece is a bargain destination</a>, and my friends there tell me that the summer season was really bad. Visiting will not only get you great deals, you&#8217;ll help put much needed money back into the economy.</p><p><strong>Learn more and plan your trip with <a href=\"https://www.nomadicmatt.com/travel-guides/greece-travel-tips/\">my guide to Greece</a>.</strong></p><h3>Hungary</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar6.jpg\" alt=\"hungary is a cheap place to travel\"><br> Hungary is a beautiful country with a rich history. The capital, <a href=\"https://www.nomadicmatt.com/travel-blogs/my-own-private-budapest/\">Budapest</a>, is a marvelous example of old European design. Plus, <a href=\"https://www.nomadicmatt.com/travel-blogs/the-ruin-bars-of-budapest/\">the ruin bars</a>, something completely unique to the city, are the best and most creative bars I&#8217;ve ever come across. Hands down the best bar scene in Europe. During the booming economic times of the earlier decade, Hungary was flying high with a growing economy and a strong currency. Now, one dollar gets you 284 Hungarian forint, up from 150 in 2008. You can enjoy huge meals in markets for $5 USD, ride the trains for $1 USD, and stay in hotels for $20 USD.</p><h3>South Korea</h3><p><img src=\"https://media.nomadicmatt.com/cheapdollar7.jpg\" alt=\"vietnam is a cheap place to travel\"><br> When I went to South Korea earlier this year, I was stunned by how cheap everything was. I had heard that South Korea was a bargain, but in many ways its prices rival those&#160;of Southeast Asia. With the South Korean currency (the&#160;won)&#160;at 1,202 per USD and most everything costing only a few thousand won, I can&#8217;t imagine busting your budget here. My friend and I went out for Korean BBQ complete with drinks, and we each spent $8 USD. You can pick up bottles of beer in 7-11 for less than a dollar. I don&#8217;t know why most people don&#8217;t talk about it, but if you want a cheap East Asian country with a stunning countryside, South Korea is it.</p><p>*******</p><p>All of these countries can provide a different and cheap alternative to expensive <a href=\"https://www.nomadicmatt.com/travel-guides/europe-travel-tips/\">Europe</a>, <a href=\"https://www.nomadicmatt.com/travel-guides/australia-travel-tips/\">Australia</a>, or <a href=\"https://www.nomadicmatt.com/travel-guides/japan-travel-tips/\">Japan</a>. Western Europe&#8217;s churches will be there 10 years from now, but the jungles of Central America? The rice fields of Asia? The old world of Eastern Europe? Probably not. With a weak dollar, it is time to think and travel differently and not pick the most obvious destination. Doing so will help you stretch your money and travel further and cheaper.</p><p><strong>What&#8217;s next? Now, start planning your trip to one of these (or other) destinations by reading on of the articles below: </strong></p><p><strong>Note:</strong> I&#160;know there are plenty of other cheap destinations in the world where the US dollar goes far (such as South Africa, Cambodia,&#160;Bolivia, and more), but there&#160;are&#160;only so many countries to include on one&#160;list (and many I haven&#8217;t visited yet)!&#160;</p></div>","title":"Cheap Places to Travel on the US Dollar"}},"pageContext":{"id":"5b95ea4287be05832748ff93"}}