{"data":{"mongodbDatabaseArticles":{"id":"5b93835b87be056953db7e55","content":"<div><p>Many of you may have noticed that there&#8217;s a new &#8220;perk&#8221; or &#8220;category&#8221; that&#8217;s been popping up in job listings a lot more lately.</p><p name=\"8973\" id=\"8973\" class=\"graf graf--p graf-after--figure\">You may also notice that the jobs look really interesting, possibly more interesting than the jobs that might currently be available in your acceptable commute radius. I think everyone should have the chance to work somewhere they&#8217;re passionate about. If I start a company, my first criteria is to find people that are passionate about what we&#8217;re doing, all other criteria follow and do not lead that one.</p><p name=\"83d3\" id=\"83d3\" class=\"graf graf--p graf-after--p\">So how do you interview for these dream remote positions? Let&#8217;s take a look at some guidelines and questions that you can ask a potential remote employer.</p><h4 name=\"52bb\" id=\"52bb\" class=\"graf graf--h4 graf-after--p\">Fully Remote Positions</h4><p name=\"c58f\" id=\"c58f\" class=\"graf graf--p graf-after--h4\">Most companies that I have worked for supported remote work in some fashion or another, some better than others, however there&#8217;s clearly a learning curve for employers as well as remote employees.</p><p name=\"788d\" id=\"788d\" class=\"graf graf--p graf-after--p\">Typically jobs listed as remote are <strong class=\"markup--strong markup--p-strong\">fully remote</strong>. That means that you might fly out to meet everyone for a week but after that you may only see them once a quarter or even less (aside from video chat obviously). Sometimes you don&#8217;t even have to physically meet everyone. Communication is done through things like Slack/Hipchat, video chat like Skype or Google Hangouts, project management tools and let&#8217;s not forget email and phone calls.</p><h4 name=\"47ff\" id=\"47ff\" class=\"graf graf--h4 graf-after--p\">What To Look&#160;For</h4><p name=\"2daf\" id=\"2daf\" class=\"graf graf--p graf-after--h4\">I&#8217;m sure there are many more great things to look for and I challenge you to comment and add more to this list.</p><ol class=\"postList\"><li name=\"fde4\" id=\"fde4\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--p\">&#8220;How many full time remote people do you currently have working for you?&#8221;&#160;<br>GOOD: &#8220;We have about 25% of our workforce remote.&#8221;<br>BAD: &#8220;You would be the first one and really, we just listed remote to get more applicants. Are you open to relocation?&#8221;</li><li name=\"fd44\" id=\"fd44\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;How do you typically communicate with your remote team?&#8221;<br>GOOD: &#8220;We&#8217;re mostly on chat but we usually have video chat for our stand ups in the morning, except for Fred, he doesn&#8217;t have a lot of bandwidth on his houseboat&#8221;<br>BAD: &#8220;We use XYZ project management software and email and that&#8217;s about it.&#8221;</li><li name=\"bfd5\" id=\"bfd5\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;How much does the onsite team use Slack/Hipchat on a daily basis?&#8221;<br>GOOD: &#8220;All day, they do that thing where they&#8217;re sitting right next to each other but they talk in the chat room.&#8221;<br>BAD: &#8220;The onsite team doesn&#8217;t really need to use chat since they&#8217;re together onsite&#8221;</li><li name=\"7fdc\" id=\"7fdc\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;How do you work through &#8216;collaborative problems&#8217; with remote team members?&#8221;<br>GOOD: &#8220;If there&#8217;s drawing we have an app that we use where anyone can draw and anyone can see what&#8217;s being drawn. We also will get everyone in a video call and hash things out on a regular basis if needed.&#8221;<br>BAD: &#8220;We don&#8217;t generally get everyone on a call. The people that are on site work at a whiteboard and then start implementing&#8221;</li><li name=\"2756\" id=\"2756\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;What time do people usually sign off for that day?&#8221;<br>GOOD: &#8220;Usually around 5&#8211;6 depending on when they started, things are usually pretty dead work wise by 6:30pm but there may be the occasional GIF or article that gets posted&#8221;<br>BAD: &#8220;Chat works so well at communicating with the team that we&#8217;re all available 24/7/365&#8221;</li><li name=\"218a\" id=\"218a\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;How many tools do you use with your remote workers?&#8221;<br>GOOD: &#8220;We have specific tools for specific intents. We use github for our project management, Slack for async communication, and Skype for video calls&#8221;<br>BAD: &#8220;We use email, a couple project management tools, bitbucket and github and some internal gitlab repos, some people are on AIM and some are in the IRC, others use slack, there&#8217;s a small group that uses email exclusively&#8230;&#8221;</li></ol><h4 name=\"d230\" id=\"d230\" class=\"graf graf--h4 graf-after--li\">Conclusion</h4><p name=\"aefc\" id=\"aefc\" class=\"graf graf--p graf-after--h4\">The main idea is to see if management is really serious about taking advantage of the benefits that remote jobs provide them. If management doesn&#8217;t support remote workers 100% then you may have a dream job working on a dream product but things can go sour when you try to navigate the company internally.</p><p name=\"e97e\" id=\"e97e\" class=\"graf graf--p graf-after--p\">You should try to get interviews with multiple companies that support remote workers and see how they answer your questions differently. You will be able to tell the difference between the ones that truly support remote in their culture and other companies that are transitioning or not really behind the concept.</p><p name=\"b95c\" id=\"b95c\" class=\"graf graf--p graf-after--p graf--trailing\">This article is really here to help people in the process of interviewing for a remote position, PLEASE comment with your thoughts and hints that you think could save someone from getting into a rough remote position versus a remote position where an employee can grow and thrive!</p></div>","title":"6 things to ask when interview for a remote job – freeCodeCamp.org"}},"pageContext":{"id":"5b93835b87be056953db7e55"}}