{"data":{"mongodbDatabaseArticles":{"id":"5b9248a387be056953db7bca","content":"<div><p>After the last post on <a href=\"/rsi\">RSI</a> did so well, I thought it'd be nice to talk about anxiety, another thing that seems to be an epidemic especially in the tech scene. And as more people enter the tech scene, it'd be nice if we could fix this.</p> <h2>My story</h2> <p>My whole life I've been kind of panic-y. More in a funny way really. When there's a fight I run away. I exaggerate danger in my mind (like flying, I hate flying!). When there's the least amount of potential unsafety, I GTFO. This has worked well. I've never been punched in my face, eventhough I probably have should have.</p> <h3>Nerves</h3> <p>The first \"nerves\" I can remember must have been when I went to school but there was a kid who didn't like me. He'd get up to me during the break and talk random shit at me. That went on for a few weeks until I realized if I copied his bullying style, and mirrored it on him, it worked just as well and he started getting even more embarrassed than me and then he quit.</p> <img src=\"/wp-content/uploads/2016/08/6def310817ee736eb2b737d2a8cf218e.png\" alt=\"6def310817ee736eb2b737d2a8cf218e\" width=\"4775\" height=\"3343\" class=\"alignnone size-full wp-image-6813 responsively-lazy\"> <p>I was happy I found out early how to fix that. But I remember for weeks I'd be nervous just entering the school hallways.</p> <h3>Anxiety</h3> <p>When nerves became anxiety was when I had my first business. Around 2010, I had a <a href=\"//pandamixshow.com/\">YouTube channel</a> that was doing well and making around $2,000/m. I was in college, so this was a lot of money. I knew when I graduated I had to get a job. Unless I had money. And I was getting in money.</p> <img src=\"/wp-content/uploads/2016/08/unemployment-stress.jpg\" alt=\"unemployment-stress\" width=\"735\" height=\"385\" class=\"alignnone size-full wp-image-6814 responsively-lazy\"> <p>But then the fear started. What if my YouTube channel would come crashing down? The money would stop. What would I do? There weren't lot of jobs. That became the first time I had a constant level of background anxiety going on inside me.</p> <p><img src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"Untitled-16\" width=\"2048\" height=\"1024\" class=\"alignnone size-full wp-image-6817 sl_lazyimg\"></p><img src=\"/wp-content/uploads/2016/08/Untitled-16-1.gif\" alt=\"Untitled-16\" width=\"2048\" height=\"1024\" class=\"alignnone size-full wp-image-6817\"> <p>Background anxiety feels like your brain is like the beach (I drew it for you). And then your clear mind is the water. But the shoreline (which is anxiety) keeps going higher and higher until there's no water left. It's just sand.</p> <img src=\"/wp-content/uploads/2016/08/3x.jpg\" alt=\"3x\" width=\"1752\" height=\"863\" class=\"alignnone size-full wp-image-6794 responsively-lazy\"> <p>When anxiety gets really bad, your mind feels like on the left. You have racing thoughts, a tight chest, and your short of breath. And your mind is like tangled wires. When your mind is normal it feels like on the right. Your mind is nice and relaxed and silent. You might call it \"stress\" or \"nerves\" as it's related.</p> <h3>Panic attack</h3> <p>After graduating and overdosing on coffee I got <a href=\"/reset-your-life\">my first panic attack out of nowhere</a>. And after that more background anxiety. The panic attack motivated me though in a good way. I had to GTFO and started to travel. That travel helped me start the business I run now. Travel was like the best medicine ever for anxiety. Getting so many new sensations simply removed any anxiety I had left. There wasn't enough space for in my brain anymore.</p> <p>When I got back from traveling though, the anxiety hit me even harder. I had simply self-medicated anxiety with travel but I never really cured the core issue. At all. My anxiety developed further into lying awake at night feeling short-breathed. And a feeling I can only describe as my head wanting to explode because there were so many racing thoughts.</p> <h3>Do you feel disconnected from reality?</h3> <img src=\"/wp-content/uploads/2016/08/bed94b2253d91d3fff8390a7fb352107.jpg\" alt=\"bed94b2253d91d3fff8390a7fb352107\" width=\"604\" height=\"482\" class=\"alignnone size-full wp-image-6798 responsively-lazy\"> <p>If you have a lot of anxiety or stress over a time, you may also start to get derealization, depersonalization or disassociation. They're all kinda related and they're about the most scary shit you can imagine. It feels like you're in The Matrix. The world feels fake and it looks like you're watching a movie of your life. It also saps you of wanting to do stuff because, well, it doesn't really feel like you're in control. I got that. Especially at night. The nights felt pretty different.</p> <p>If you're reading this and you have it. Don't panic. You're already IN a panic, that's WHY you have it. Your body is going fight-or-flight primal attack/defense mode, so it makes sense it doesn't have time to process reality accurately. The problem is that it's a response that doesn't make sense.</p> <p>I've had this on and off for years, it comes and goes with my anxiety. It's really annoying and literally I'm like \"oh god, the leaves on the trees look like a fake 3d render again, please make it real lol\".</p> <p>This stuff sounds like fucking bananas, and it is, but is very common though and comes along with anxiety and depression. So most people will have it at least at one point in their lives.</p> <p>If you don't break it, this becomes a pretty vicious cycle downward. You lay awake at night worrying about stuff, get short-breathed from it and your heart starts racing. Hopefully you get some sleep. Then when you wake up, it feels like you're in The Matrix, haha. Yes, sucks.</p> <p>When I'd work really hard and focus on a goal, it'd go away completely. That's why so many workaholics have anxiety. They're just self-medicating.</p> <img src=\"/wp-content/uploads/2016/08/Screen-Shot-2016-08-13-at-04.06.44.png\" alt=\"Screen Shot 2016-08-13 at 04.06.44\" width=\"2458\" height=\"1266\" class=\"alignnone size-full wp-image-6800 responsively-lazy\"> <p>The thing is, when I got drunk with friends, even after just one beer, ANY anxiety would be gone. That probably means my anxiety isn't that heavy if it can be removed with one drink. I instantly understood now why there's so many alcoholics (that have one beer after work every single day). It's because it's SO EFFECTIVE!</p> <p>You have to understand though, my life is pretty simple and by any account easy. There wasn't THAT much to worry about compared to most people. So my anxiety was distinctly physical or chemical.</p> <p>And it wasn't like I had this every day. It might be there one day, go for weeks, then come back for a week.</p> <p>Since I've had it for a few years now, I can also tell you it's not really different from when things were going well, and when things where going not well with my work etc. I always had it.</p> <h2>The tech scene</h2> <p>Now here's the thing.</p> <p>If you see that in the mainstream populace <a href=\"//www.theguardian.com/global/commentisfree/2016/may/07/mental-health-policy-anxiety-natasha-devon-young-people\">half of people now have anxiety</a>. Then imagine the tech scene?</p> <p>They're smart, status-oriented and ambitious people who generally overthink stuff. If you let their minds go free, they'll just start spinning in a recursive loop forever.</p> <p>If you're not aware that it is anxiety, you might not even know you have it. It's just how you've felt for ages. Also it usually only really starts occurring in late 20s, early 30s. So you might be fine during your 20s (like I was) until one day BAM! YUUUUUUUP. DEAL WITH IT!</p> <h2>How I cured it</h2> <p>Just like with RSI, over years I started testing stuff to cure it. It's still there but I think I've decreased it be a lot more manageable than before.</p> <h3>Quit coffee</h3> <p>There's a thing with tech people and coffee. We're obsessed with it. It gives us the energy to work for 8 hours on a single project trying to maneuver this computer into doing what we want it to do. We love drinking giant Starbucks takeaway cups. And the smell and taste of it is just amazing.</p> <img src=\"/wp-content/uploads/2016/08/starbucks-toasted-graham-latte.jpg\" alt=\"starbucks-toasted-graham-latte\" width=\"1680\" height=\"1120\" class=\"alignnone size-full wp-image-6801 responsively-lazy\"> <p>The problem is probably the caffeine. A Starbucks Venti Latte contains 150mg of caffeine. That's 6 cups of tea! And sometimes I'd drink two of them. And I wonder why I have anxiety! Haha!</p> <p><img src=\"/wp-content/uploads/2016/08/Screen-Shot-2016-08-13-at-03.46.39.png\" alt=\"Screen Shot 2016-08-13 at 03.46.39\" width=\"2282\" height=\"1184\" class=\"alignnone size-full wp-image-6805 responsively-lazy\"><br> Okay, this is probably the most unscientific chart ever, haha, but look at that correlation! :P</p> <p>So you have anxiety, and you drink coffee, you probably drink too much of it. Even if you've always been fine with it. Caffeine sensitivity can increase with age, and it can also simply increase by overdosing yourself with it. That, in turn, develops anxiety.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Cut my daily anxiety levels with like 75% by replacing coffee with tea &#128563;</p> <p>&#8212; levels (@levelsio) <a href=\"//twitter.com/levelsio/status/758127540720504832\">July 27, 2016</a></p></blockquote> <p></p> <p>I've quit coffee now for about 40 days. I've switched to black tea, green tea and in the evening Rooibos tea. I also get lots of decaf coffee. Most major coffee chains actually offer decaf coffee (at least in US and EU they do).</p> <h3>Meet friends</h3> <p>The fastest way to reduce any anxiety for me is just to see my friends or family outside. Talk to them about normal stuff. Go do stuff. Have fun. I immediately feel better. Don't sit inside alone, that makes it worse.</p> <h3>Quit alcohol</h3> <p>Every time when I drink alcohol, and I get tipsy, my anxiety clears. It's like \"oooh so THIS is how I am normally!\". But the next few days, it's worse. It's because alcohol sucks up the dopamine (happiness) hormones you have and the next days you have a lot less. Similar to what MDMA does. So you'll feel a little better for awhile, but worse after.</p> <p>That means it's another vicious cycle and better to just quit or drink very moderately only occasionally.</p> <h3>Take supplements (or not)</h3> <p>I've tried some supplements too. I took <a href=\"//en.wikipedia.org/wiki/5-Hydroxytryptophan\">5-HTP</a> fro awhile. That stuff is in lots of daily supplements. It produces extra serotonin in your body.</p> <blockquote><p> Since tryptophan is converted into 5-hydroxytryptophan (5-HTP) which is subsequently converted into the neurotransmitter serotonin, it has been proposed that consumption of tryptophan or 5-HTP may therefore improve depression symptoms by increasing the level of serotonin in the brain. </p> </blockquote> <p>There's no conclusive study if it works against depression. But from my experience, it does work INCREDIBLY well in reducing anxiety and increasing calmness. Just 50mg of it and it's like double the feeling that you feel after a workout, and for a whole day.</p> <p>I didn't want to get dependent on this stuff as it worked too well though so I quickly stopped taking it. Also, 5-HTP has side effects that may include <a href=\"//drugs-forum.com/forum/showthread.php?t=206528\">tearing your heart muscle</a> after a few years. Scary.</p> <p>There's also L-Tryptophane, which converts into 5-HTP in your body, and it's apparently pretty safe if you take it with Vitamin B6 and Magnesium. I've taken it as part of these over-the-counter <a href=\"//www.kruidvat.nl/sleepzz-power-sleep-tabletten/p/3497243\">sleeping pills</a> and it works REALLY amazingly well against anxiety for me. It helps to break the cycle of anxiety too as my body stops being conditioned to be anxious when I fall asleep.</p> <h3>Increase sensations</h3> <p>Like I said, travel worked for me because the sensations overpowered my anxiety. My brain was just too busy. I always think this is only half a solution because it can't be good to ONLY be healthy if you keep yourself busy. The striving should be too be able to be relaxed in the moment, even when nothing is going on!</p> <p>Any way, it works. Especially people working from home get less sensations than people working in an office. So just making sure you get out of the house a lot, meet with friends etc. helps!</p> <h3>Exercise</h3> <blockquote class=\"twitter-tweet\"> <p>My mind before and after workout <a href=\"//t.co/onjpo5SXfE\">pic.twitter.com/onjpo5SXfE</a></p> <p>&#8212; levels (@levelsio) <a href=\"//twitter.com/levelsio/status/725322210966020097\">April 27, 2016</a> </p></blockquote> <p><br> One of the biggest things that helps against anxiety is exercise. As I mentioned in the <a href=\"/rsi\">RSI article</a>, I do mainly weights now and some cardio. I feel both are pretty effective in boosting my serotonin and dopamine (happiness) and decreasing my adrenalin and cortisol (stress/anxiety) levels. I feel the effect of exercise for about 24 hours after. But then I have to do it again. That means if you exercise 3 times a week (which is recommended), the anxiety is pretty much gone.</p> <h3>Find why you're stressed</h3> <p>There's something I like to call \"loose ends\". It's the stuff in your mind you ruminate about repeatedly. I've done this a lot too. The problem is with anxiety on the loose, you're too confused to make any real actionable decision about the stuff that makes you anxious. This is a vicious cycle because now the real problem remains, you haven't done anything about it, and the anxiety remains or gets worse.</p> <img src=\"/wp-content/uploads/2016/08/Loose-Ends.jpg\" alt=\"Loose-Ends\" width=\"900\" height=\"829\" class=\"alignnone size-full wp-image-6820 responsively-lazy\"> <p>We all have stuff like that.</p> <p>It could be that you're not sure if you can pay your bills next month. It could be that you hate your job and want to do something you care about. Or you're not in love with your boyfriend or girlfriend anymore, but you're too afraid to get out and be forever alone. It could be that your family pressures you to get married and have kids, but you want freedom and want to live your own life and do whatever you want.</p> <p>With all this stuff the point I think is that you have to take the guts to take action and resolve those loose ends. Because they'll never go away by itself. They'll keep coming back. The first step is to see if you can reduce the chaos in your head by removing alcohol and coffee and starting to exercise. Then with your clearer mind, take action to change the stuff that bothers you.</p> <p>I remember when I didn't have any off this and it was as a teenager. There was nothing I did that I really didn't want (okay, except school). But I was pretty fierce about only doing what I wanted. That gets harder with age. The problem is as you get older, there's a higher risk involved cause you do more important stuff. So you get risk-averse, and you take less action to change your situation. Which is again a vicious cycle of fuckery.</p> <h3>Make a mindmap of all this</h3> <p>Use <a href=\"//mindmeister.com/\">Mindmeister</a> and make a mind map out of everything that bothers you. Go deep in that tree structure to really figure out what's going on there. Connect outer ends to other outer ends if they're related. Here's a basic map, but you need to add more sub divisions to it:</p> <img src=\"/wp-content/uploads/2016/08/Screen-Shot-2016-08-15-at-01.30.07.png\" alt=\"Screen Shot 2016-08-15 at 01.30.07\" width=\"2544\" height=\"1386\" class=\"alignnone size-full wp-image-6840 responsively-lazy\"> <p>Just getting all that stuff out on \"paper\" helps. But it also makes your anxious thoughts into somewhat more actionable steps. The most difficult part is obviously then taking action. You'll win some, you'll lose some. It's not sure. But if you don't take action, that stuff remains. YOLO.</p> <h3>DIY Cognitive Behavioral Therapy </h3> <p>CBT is the most common thing therapists do when you have anxious thoughts. It lets you analyze recurring thoughts you have that bother you, check if they're realistic and if not change them in your mind to a more realistic perspective. You can pay a therapist a lot of money to explain this to you, but I'd say do-it-yourself.</p> <p>For example, you're super scared to lose your job and it keeps you up all night. CBT would ask \"is there any evidence you will lose your job?\", if there is none it means that's an unrealistic thought and everytime you think it, think the realistic thought \"there is no evidence I will lose my job at this moment\".</p> <p>If there is evidence you DO might lose your job then you should think \"is losing your job really that bad to be anxious about?\", can't you get another job? If you can then it's not really something to lay awake at night over! This is typical doom scenario thinking and it's quite fixable by repeatedly doing this.</p> <p>You can also keep a journal, whenever a repetitive thought comes in to your mind, write it down in your notes on your phone, then in the next paragraph write a more realistic perspective on it, for example if you're a freelancer you could write this:</p> <blockquote><p> Omg, I'm a freelancer and I won't get any new assignments after this one and I'm running out of money and I won't be able to pay my bills and I'll get kicked out of this house and THINK ABOUT THE CHILDREN WHAT ABOUT TEH BABY OOH NOOEEZZ THE CHILD WILL BE ON THE STREET IT WILL GO HOMELESS OMG NOOOOOOOO</p> <p>Really? I've had clients all year every few months and have been able to pay my bills easily. Also I have enough savings to go for about 6 months, enough time to get new clients and pay for the house. I can easily pay the rent and if I couldn't then I can always borrow some money or move to a cheaper area of the city. Oh and the baby is a lie. Jk. </p></blockquote> <h3>Get therapy</h3> <p>Sometimes, it can be hard to even find out what is bothering you. Having someone help you find it was very beneficial for me. It can be layers upon layers of stuff build up over years. And the anxiety can originate from there. I've used <a href=\"//talklifeconnect.com/\">TalkLife Connect</a><a> which is really awesome. </a></p> <img src=\"/wp-content/uploads/2016/08/2Untitled-17.png\" alt=\"2Untitled-17\" width=\"2440\" height=\"1374\" class=\"alignnone size-full wp-image-6844 responsively-lazy\"> <p>It's cheap ($25/week) and lets you talk with a certified therapist. It's not really limited to any countries, so you can use it from anywhere. It's a text chat interface which honestly works much better as I can be more honest than face-to-face.</p> <p><a>I've also used one-on-one therapists, like </a><a href=\"//www.aarondutil.com/\">Aaron Dutil</a>, who is more aware of the stuff people deal with when they travel a lot (he's a nomad himself).</p> <p>I think everybody should have a therapist. It's super useful to have a regular talk with a professional about the stuff that concerns you in life. Life isn't easy. It's an existential challenge. You're an animal that has found consciousness and that's a GIANT problem in itself. So a therapist is like a personal trainer for your mind. Use it!</p> <h2>Conclusion</h2> <p>We have an epidemic of anxiety.</p> <p>But we're also filling ourselves up with giant cups of coffee every day. And then to release the stress we get drunk. The next day we feel even worse and we drink more coffee. Meanwhile, we're more isolated than ever and thus have less of an outlet for the stuff we're worried about. All that contributes to anxiety everywhere. Taking some small steps to change your nutrition and lifestyle can be a good test to see if that's where it comes from.</p> <p>Anxiety, left untreated, can change your personality over the long term. I've seen it happen in myself too. So best to see how you can reduce it.</p> <p>It worked for me as I got rid of most of my anxiety this way. I feel a lot better. I fall asleep a lot faster and easier, with less thoughts and worries.</p> <p>I'm not the only one either. Tobias van Schneider <a href=\"http://www.vanschneider.com/no-alcohol-no-coffee-for-15-months-this-is-what-happened/\">cured his anxiety</a> with it too.</p> <p>I hope this helps somebody :)</p> <p>Also I'd love to hear your stories about anxiety and how you fixed it (or not), <a href=\"//twitter.com/levelsio\">tweet me</a>!</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I cured (most of) my anxiety"}},"pageContext":{"id":"5b9248a387be056953db7bca"}}