{"data":{"mongodbDatabaseArticles":{"id":"5b937b1887be056953db7d1a","content":"<div><h1 name=\"a76f\" id=\"a76f\" class=\"graf graf--h3 graf--leading graf--title\">I&#8217;m Not Living The&#160;Dream</h1><p name=\"0eae\" id=\"0eae\" class=\"graf graf--p graf-after--h3\">I&#8217;m a nomad. I have been for more than two years now. I&#8217;ve hiked atop a glacier in New Zealand, enjoyed an opera beneath the Acropolis, spoken with teenage zinc miners in Bolivia, played with tiger cubs in Thailand, and done some very shady currency deals in Argentina.</p><p name=\"76ef\" id=\"76ef\" class=\"graf graf--p graf-after--p\">And I&#8217;m not living the dream.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*m8yNeF6J4HQ-2BRi8M3v5Q.jpeg\">Photo credit: Alexandre Perotto<p name=\"8cc3\" id=\"8cc3\" class=\"graf graf--p graf-after--figure\">I decided to write this after I had a conversation with a friend who wanted this lifestyle. She wanted to sell all her things and travel the world indefinitely. And she wasn&#8217;t the first friend to approach me with this kind of plan. I couldn&#8217;t be sure, but I had the sneaking suspicion that she was mentally picturing a stellar Insta feed and epic stories to tell upon her return. She&#8217;d get those things, but it would be disingenuous to say that that&#8217;s all she&#8217;d be getting.</p><p name=\"c29e\" id=\"c29e\" class=\"graf graf--p graf-after--p\">I wanted to tell her about standing on the bow of a sailboat off the coast of Australia. I had spent the day lounging on Whitehaven beach and snorkeling in between the Whitsunday islands. And yet, as I looked out over the ocean, I felt&#8230;empty. I felt alone on a boat full of people. I felt like this was yet another sunset, stunning to be sure, but not objectively better than a sunset off the coast of Kona, or Koh Tao, or Samara, or Santorini. I felt desensitized to the crazy beautiful landscape, and that scared the crap out of me.</p><p name=\"57a4\" id=\"57a4\" class=\"graf graf--p graf-after--p\">You might think I sound like an entitled jerk. You might think I have no right to whine (more on that in a minute). &#8220;How dare he complain whilst bragging about his jetsetting?&#8221;</p><p name=\"3225\" id=\"3225\" class=\"graf graf--p graf-after--p\">To be honest, I agree with you. There are some amazing things about how I&#8217;ve lived. Compared to the vast, vast majority of the world, I shouldn&#8217;t be complaining. But whenever I tell stories about who I&#8217;ve met and where I&#8217;ve been, I feel compelled to add &#8220;&#8230;but things aren&#8217;t perfect.&#8221;</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*0VM8CA7ChvaZSHAXbyHxcA.jpeg\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*tJvSYuTfHp6gj66dyJfPsg.jpeg\">Rio De Janeiro: Expectation vs&#160;Reality<p name=\"005f\" id=\"005f\" class=\"graf graf--p graf-after--figure\">The truth is, this lifestyle is fucking exhausting. For most of 2015 the longest I slept in the same bed was 3 weeks. It was an interesting experience, but not one that I want to have ever again. While I have made some lifelong new friends on my travels, the vast majority of friends I make are fleeting. We meet, we swap stories, we leave within 72 hours. Realistically, it&#8217;s unlikely that we&#8217;ll ever see each other again.</p><p name=\"b7ba\" id=\"b7ba\" class=\"graf graf--p graf-after--p\">And while I&#8217;ve been gone, my old friends have changed. I&#8217;ve missed my fair share of celebrating, commiserating, and reminiscing. Facebook has become a window into birthdays, graduations, and housewarmings; so close and yet so far. I&#8217;d love to be there in person, making inside jokes and new memories, but I&#8217;ve traded that for passport stamps and culture shocks. If anything, I&#8217;m lucky that I haven&#8217;t missed the truly important stuff&#8202;&#8212;&#8202;marriages, births, and deaths.</p><p name=\"f1c2\" id=\"f1c2\" class=\"graf graf--p graf-after--p\">Over the last two-plus years, I&#8217;ve had incredible experiences but nobody to consistently share them with. I&#8217;ve gotten better at sharing intimate details with complete strangers, but I&#8217;ve gotten worse at actually feeling connected to people. I&#8217;ve had moments of wonder and glory interspersed with profound loneliness.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*-ONl4fmBWZBVUnDSksJofA.jpeg\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*bb3aMcnB1m5hp5tjn3V14A.jpeg\">Santorini: Expectation vs&#160;Reality<p name=\"b99e\" id=\"b99e\" class=\"graf graf--p graf-after--figure\">Yet at the end of the day, I don&#8217;t feel like I have the right to complain. How dare I take these glorious sunsets and mountaintop views for granted? How dare I whine about being lonely when I have experiences that 1% of 1% of people get to have? So I bite my tongue, put on a smile, and I gloss over the bad parts (which is the decidedly <strong class=\"markup--strong markup--p-strong\">wrong</strong> approach, by the way).</p><p name=\"add3\" id=\"add3\" class=\"graf graf--p graf-after--p\">Even now as I&#8217;m writing this, I&#8217;m hesitant to hit publish. I&#8217;m really really really afraid of sounding like an entitled douche. I feel the need to apologize or profess my gratitude for these opportunities. Because I am grateful. Grateful for my portable skill set, for the fact that I&#8217;m (relatively) debt free, and for not being female/gay/trans/any number of things that would lead to danger and persecution in many parts of the world.</p><p name=\"c741\" id=\"c741\" class=\"graf graf--p graf-after--p\">And I&#8217;m not living the dream.</p><p name=\"b7c5\" id=\"b7c5\" class=\"graf graf--p graf-after--p\">So consider this me speaking up. I want to tell my stories, but a story isn&#8217;t authentic when it&#8217;s told with manufactured moments and filtered photos. I&#8217;m not going to promote the highs without also being upfront about the lows. Because let&#8217;s face it, glorifying this lifestyle is taking the easy way out. It&#8217;s easy to upload album after album to social media. It&#8217;s easy to snap a video of the Northern Lights, or a selfie in front of Machu Picchu. It&#8217;s <strong class=\"markup--strong markup--p-strong\">hard</strong> to talk about getting up at 5am to work as a tour guide, or how much you miss your friends and family. It&#8217;s hard to admit, even to yourself, that the lifestyle of a world traveler is imperfect.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*txeMFzCtY17pK7jlnUKK4w.jpeg\"><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*AYBb6ThHnYY3w7C4XxEMwg.jpeg\">Giza: Expectation vs&#160;Reality<p name=\"c799\" id=\"c799\" class=\"graf graf--p graf-after--figure\">And if you&#8217;re like me, a nomad feeling like they should be spending more time appreciating the highs and less time wallowing in the lows, then I encourage you to say something. I encourage you to talk to someone, because trust me I know how hard it is to build a support network when you&#8217;re constantly on the road. Making new plans and new friends every few days takes a toll, physically and mentally. Without someone to confide in or rely on, it&#8217;s easy to develop anxiety, isolation, or even depression.</p><p name=\"b47d\" id=\"b47d\" class=\"graf graf--p graf-after--p\">I might even encourage you to&#8202;&#8212;&#8202;gasp&#8202;&#8212;&#8202;take a break from traveling. Go home for a few months, wherever that is. See old friends, and make new ones without feeling the need to keep wandering (I know I intend to, because holy shit I&#8217;m tired). At the very least, <a href=\"http://tinyletter.com/charlierguo\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">shoot me an email</a> or <a href=\"https://twitter.com/charlierguo\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">message me on Twitter</a>. Let&#8217;s chat about it.</p><p name=\"372d\" id=\"372d\" class=\"graf graf--p graf-after--p\">Thanks to Molly Mackinlay, Runi Goswami and Rob Cole for reading drafts of this.</p><p name=\"f681\" id=\"f681\" class=\"graf graf--p graf-after--p graf--trailing\">If you liked reading this, hit the heart icon below so more people can see it. You can find more of my writing <a href=\"http://unscalablebook.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">via my book on startups, Unscalable</a>, <a href=\"http://tinyletter.com/charlierguo\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">through my mailing list</a>, and <a href=\"https://twitter.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">on Twitter</a>.</p></div>","title":"I’m Not Living The Dream – The Startup – Medium"}},"pageContext":{"id":"5b937b1887be056953db7d1a"}}