{"data":{"mongodbDatabaseArticles":{"id":"5b9624c887be058327490f07","content":"<div><p>This is a guest post by Darren Cronian, who writes the popular <a href=\"http://www.travel-rants.com/\">Travel Rants</a> blog. In addition to Travel Rants, he also writes <a href=\"http://www.mylifeinleeds.co.uk/\">My Life In Leeds</a>, a comprehensive online guide to the city. I&#8217;ve been following Darren&#8217;s writing for years and it was my pleasure to publish this guest post from him.</p>\n<p>Come to Leeds either on a short break or day trip and you will find that there is a lot to do and see for kids. This guide will give you some ideas to entertain all of the family during the school holidays. Here are our favorites:</p>\n<p><strong>1. Free Child Friendly Museum</strong></p>\n<p>The <a href=\"http://www.leeds.gov.uk/cityMuseum/\"><strong>Leeds City Museum</strong></a> in Millennium Square is open from 11:00 a.m. every day except Monday, and admission is free.&#160; There is even a special Learning Room with events for the kids on school holidays.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/06/leeds-city-museum.jpg\" alt=\"leeds city museum\" width=\"690\" height=\"518\"></p>\n<p>The animal/nature exhibit may be the most enticing for children, but the Mummy in the Egyptian exhibit also fascinates, and a beautifully presented history of the city is fascinating, especially for adults who grew up right here.</p>\n<p><strong>2. Burn Off Some Energy In The Vast Parkland</strong></p>\n<p><strong>Kirkstall Abbey</strong>, just 3.5 miles from the City Centre, is the most complete and best-preserved Cistercian abbey in the U.K.&#160; Located in lovely parkland on the banks of the River Aire, the grounds are ideal for walking, cycling or picnics.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/06/kirkstall-abbey.jpg\" alt=\"kirkstall abbey\" width=\"690\" height=\"518\"></p>\n<p>The reconstructed abbey offers a wonderful view of the way monks and Laybrothers lived and worked hundreds of years ago, with interactive displays that are both educational and fun.</p>\n<p><strong>3. Not As Boring As It Sounds, Very Educational</strong></p>\n<p><strong>Thackray Museum</strong>, about 2.5 miles from City Centre, offers a truly impressive look at medicine and medical practices past, present and future, including the sounds, sights and smells of a back street in Victorian-era Leeds, where visitors can follow the lives and ailments of &#8216;real&#8217; characters living amongst the bedbugs, rats and fleas.&#160; Kids especially seem to love the realistic gory Victorian operating theatre.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/06/thackray-musuem.jpg\" alt=\"thackray museum\" width=\"690\" height=\"1035\"></p>\n<p><strong>4. Let The Kids Run Free</strong></p>\n<p><strong>Roundhay Park</strong>, to the northeast of Leeds, is one of the largest city parks in the U.K. with over 700 acres of woodlands, lakes, parkland and gardens.&#160; It was originally a 13th century hunting park, but now it is filled with delightful exhibits including Tropical World, with amazing creatures such as the Arrowana fish, which leaps up to 8 feet in the air to catch insects and small birds.&#160; New additions are a colony of meerkats and a trio of crocodiles.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/06/Roundhay-Park.jpg\" alt=\"roundhay park\" width=\"690\" height=\"518\"></p>\n<p><strong>5. Bird Garden, Animals, And Open Space</strong></p>\n<p><strong> </strong></p>\n<p><strong>Lotherton Hall</strong> is an Edwardian country house set in gorgeous parkland, about 13 miles northeast of Leeds City Centre. The nature trails, red deer park and bird garden are best enjoyed in clement weather, but the costume and other exhibits are a real treat for young and old alike at any time. The Nightingale Gallery is also a venue for exhibitions by local artists.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/06/lotherton-hall-bird-park.jpg\" alt=\"lotherton hall bird park\" width=\"690\" height=\"426\"></p>\n<p>Hopefully this guide has given you a taste of what there&#8217;s to do and see in Leeds for kids. Read more guides on <a href=\"http://www.mylifeinleeds.co.uk/guides/leeds-attractions/\">attractions in Leeds</a>, on <a href=\"http://www.mylifeinleeds.co.uk/\">My Life in Leeds</a>, a locally written guide. Thank you Darren for the guest post!</p>\n<p>[photos by: Leeds City Museum and Kirkstall Abbey by <a href=\"https://www.flickr.com/photos/travelrants/\">dcronian</a>, <a href=\"https://www.flickr.com/photos/timojazz/\">timojazz</a> (Thackray Museum), <a href=\"https://www.flickr.com/photos/sovietuk/\">tricky</a> (Roundhay Park), <a href=\"https://www.flickr.com/photos/drown/\">Drown</a> (Lotheron Hall bird park)]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"5 Places to Entertain Kids in Leeds, England"}},"pageContext":{"id":"5b9624c887be058327490f07"}}