{"data":{"mongodbDatabaseArticles":{"id":"5b9248c987be056953db7bf1","content":"<div><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"IMG_2552\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2552-1024x768.jpg\" alt=\"IMG_2552\" width=\"100%\"> <p><a href=\"http://levels.io/bangkok-dive-bar-cheap-charlies-roof-top-bar-above-11/\">After 4 weeks in Bangkok</a>, Timo came to visit me. He is my old roommate from Amsterdam from the house <a href=\"/reset-your-life\">I left in April</a>, and one of my best friends. He came to check up on me and we decided to have a little Thai vacation of our own.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"IMG_2541\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2541-1024x768.jpg\" alt=\"IMG_2541\" width=\"100%\"> <p>I showed him Bangkok for a few days. Since we were both up for some swimming in the sea, we headed off to the islands in the south. Joining us was Mandie, my local Thai friend. Almost everybody in Thailand will try get you to pay foreigner prices for everything. Foreigner prices are often 10x higher than what a Thai pays for things. So it's always good to have a Thai with you to avoid that. Thailand might be very expensive for many tourists, since they simply don't know the actual prices of things. By paying too much, they don't exactly help future travellers, since prices will go up for everyone.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"IMG_2251\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2251-1024x764.jpg\" alt=\"IMG_2251\" width=\"100%\"> <p>Back in 2010, I had already visited the coastal town Krabi and the island Koh Lanta with Sam back. We really enjoyed the peace, quiet and beautiful beaches and light-blue water of Koh Lanta, eventhough we had to leave the island later due to the absolute worst food poisoning ever. I remember thinking how was ridiculous it was that Europeans go to Spain and spend more than $50 per night for a tiny hotel room. You can stay on a more beautiful Thai island and spend $10 per night to live in an entire beach resort and spend $2 to have breakfast/lunch/dinner. I am sure you can go down to $5 per night if you try islands or coastal towns in Cambodia or Vietnam. Europeans sure love spending too much money.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"IMG_2526\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2526-1024x768.jpg\" alt=\"IMG_2526\" width=\"100%\"> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2276-1024x764.jpg\" alt=\"\" width=\"100%\"> <p>This time, I wanted to visit Koh Samui. It's quite popular and busy although due to the low season, we had a pretty mellow experience. What is there really to say about an island like this? It looks like paradise. With typically Thai beautiful white beaches and light-blue translucent water, where you can see cute little fish swim around your feet. There's not a lot to do except for just walking around in the sun, lying on the beach and swimming in the sea or pool.</p> <p>Well, there's one more thing, you can venture into Samui's jungle though.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"IMG_2493\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2493-768x1024.jpg\" alt=\"IMG_2493\" width=\"100%\"> <p>Guided around by a 4-year old barefoot jungle kid who pretty much looked, sounded and moved like Mowgli from Jungle Book. Following Mowgli, we walked through narrow paths and climbed over huge rocks to suddenly find in the middle of nowhere, a huge waterfall!</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"IMG_2495\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2495-1024x768.jpg\" alt=\"IMG_2495\" width=\"100%\"> <p>We also drove around the island on motorcycles to find Samui's best view high up in the mountains...</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" alt=\"\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2512-1024x768.jpg\" alt=\"\" width=\"100%\"> <p>/* 2018-08 - hidden for sjw climate<br> After Koh Samui, <a href=\"/koh-phangan-is-the-disneyland-of-partying\">we ventured to Koh Phangan for the Half Moon Party &#194;&#187;</a>*/</p> <p>Returning to Bangkok and stuck in a nightly sleep cycle <a href=\"/the-24-hour-coffee-place-in-bangkok-too-fast-to-sleep/\">I found a place to work from at night &#187;</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Visiting Koh Samui, the island of paradise"}},"pageContext":{"id":"5b9248c987be056953db7bf1"}}