{"data":{"mongodbDatabaseArticles":{"id":"5b95eaa187be05832748ffbf","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/thaitemple01.jpg\" alt=\"Temple in Chiang Mai\"><br> Updated: 7/20/2017 | July 20th, 2018</p><p>Thailand is one of my favorite countries in the world. Going to Thailand is like going home. That sense of energy, of adventure, of hectic cities. I love it. I love the sense of wonder. The knowing that anything can happen.</p><p>I&#8217;ve been visiting for over a decade, and I&#8217;m always amazed by it. Every visit reminds me how much I love it, lets me learn more about the culture and discover new and exciting things to do. The country is so big that it would take a lifetime to really see it in depth.</p><p>I want to share with you what makes Thailand so special to me and give you a little overview of the best things to do and see there &#8212; no matter how long your visit is!</p><p><strong>Experience Bangkok&#8217;s chaotic nature</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/7reasonsthailand001.jpg\" alt=\"Bangkok skyline\" width=\"675\" height=\"395\"><br> The capital of Thailand, <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\" rel=\"noopener\" target=\"_blank\">Bangkok</a>, is a crazy city that moves at a lightning-fast pace. I didn&#8217;t like it when I first visited: the noise, crowds, heat, pollution, and seemingly endless number of people &#8212; it was all too much. But after living there, I saw how wonderful the city really is.</p><p>Bangkok is like an onion. There are lots of layers, and the best are far from the tourist haunts. They are the little places you only find if you live there (or read this blog!). In Bangkok, there is always some event being held; the food is incredible whether it&#8217;s from a street stall, market, or high-end restaurant; the parties&#8230;well, one night in Bangkok is like nothing else; the locals are very friendly; and, because of all the travelers and expats living here, it&#8217;s a very international city. You&#8217;ll never be bored here.</p><p><strong>Related articles:</strong></p><p><strong>Visit one of the many tropical beaches</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/7reasonsthailand002.jpg\" alt=\"gorgeous blue waters of one of the many beaches in Thailand\" width=\"675\" height=\"395\"><br> Thailand&#8217;s beaches and islands are some of the best, most photographed, and most beautiful in the world. A picture&#8217;s worth a thousand words, and this photo proves why you should visit Thailand better than any words I could say. There are islands for all needs: party islands, resort islands, dive islands, chill islands, empty islands filled with a few huts and not much else&#8230; islands with resorts, yoga retreats, or waterfalls, and some that mix a little bit of everything! With more than a thousand islands to choose from, you are going to find something that suits your needs.</p><p>My favorite islands in Thailand are <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/ko-lipe/\">Ko Lipe</a>, Ko Lanta, Ko Samet, <a href=\"https://nomadicmatt.com/travel-blogs/the-saturday-city-ko-phangan/\" rel=\"noopener\" target=\"_blank\">Ko Phangan</a> (where you&#8217;ll find the famous <a href=\"https://nomadicmatt.com/travel-blogs/the-ultimate-guide-to-the-full-moon-party/\" rel=\"noopener\" target=\"_blank\">Full Moon Party</a>), Ko Jam, and Ko Maak.</p><p><strong>Related articles:</strong></p><p><strong>Trek the tropical jungles</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/7reasonsthailand003.jpg\" alt=\"Jungle in Thailand\" width=\"675\" height=\"395\"><br> Trekking in northern Thailand offers wildlife, hill tribes, great views of the lush tropical jungles, and an appreciation for the landscape. Thailand is awash with tropical jungles filled with wildlife; these make for great day trip or multi-day trekking opportunity that will give you a sense of the rich biodiversity of Thailand! There&#8217;s nothing like trekking through a tropical jungle to nurture your inner explorer. Some of the best trekking can be found way up north near Chiang Rai, in Khao Yai Park (where you can see wild elephants), and in <a href=\"https://nomadicmatt.com/travel-blogs/jungle-trekking-and-leeches-in-khao-sok/\" rel=\"noopener\" target=\"_blank\">Khao Sok</a>, which is famous for its caves and limestone.</p><p><strong>Related articles:</strong></p><p><strong>Volunteer with elephants</strong><br> <img src=\"https://media.nomadicmatt.com/7reasonsthailand004.jpg\" alt=\"Nomadic Matt Kepnes playing with a Thai elephant at the Elephant Nature Park\"><br> From fish in the sea to elephants on the ground to birds in the air, Thailand has a wide variety of animals. Most people come here to go diving and see tropical fish, but there are plenty of great creatures to see on land and in the air, too, especially if you like birds. Exploring the jungles in parks like <a href=\"https://nomadicmatt.com/travel-blogs/khao-yai-national-park-thailand/\" rel=\"noopener\" target=\"_blank\">Khao Yai</a> or by <a href=\"https://nomadicmatt.com/travel-blogs/the-complete-guide-to-diving-in-koh-tao/\" rel=\"noopener\" target=\"_blank\">diving in Ko Tao</a> is a great way to see all the main species. Another thing you can do is help save elephants from abuse by working at the <a href=\"https://nomadicmatt.com/travel-blogs/thailand-elephant-conservation/\" rel=\"noopener\" target=\"_blank\">conservation camp near Chiang Mai</a>. Elephant riding has led to a lot of abuse, and now there are a number of animal-friendly sanctuaries where you can see the elephants up close, feed them, and take care of them in a manner that&#8217;s a win for everyone involved.</p><p><strong>Related articles:</strong></p><p><strong>Eat delicious food</strong><br> <img src=\"https://media.nomadicmatt.com/7reasonsthailand05.jpg\" alt=\"yummy fresh Thai Food\"><br> <a href=\"https://nomadicmatt.com/travel-blogs/the-best-thai-food-you-can-eat/\" rel=\"noopener\" target=\"_blank\">Thai food</a> is known around the world to be delicious, and you can bet it&#8217;s even more delicious in Thailand. The best food comes from the street vendors, who serve up the tastiest, spiciest food in the country. Just find the stalls where the locals are crowding around to get <a href=\"https://nomadicmatt.com/travel-blogs/eat-like-a-king-in-bangkok/\" rel=\"noopener\" target=\"_blank\">the best of the best</a>.</p><p>Thailand without the food would be like France without the wine. I highly recommend the pork noodle soup. It&#8217;s one of the few Thai dishes you won&#8217;t find elsewhere in the world. Other awesome dishes to try: khao soi, pad kra pao, som tam, laab, and endless amounts of mango sticky rice.</p><p><strong>Related articles:</strong></p><p><strong>Explore the historical capitals</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/7reasonsthailand005.jpg\" alt=\"Temple ruins in Korat\" width=\"675\" height=\"395\"><br> The massive archaeological sites of Sukothai, Lopburi, and Ayutthaya are windows into Thailand&#8217;s historic past, with ruins dating back centuries. These ancients cities were Thailand&#8217;s capitals during Khmer, Burmese, and local Thai kingdoms. These cities dot the center of Thailand, so they&#8217;re a perfect way to hop, skip, and jump your way to <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\" rel=\"noopener\" target=\"_blank\">Chiang Mai</a> and see the rural countryside. Additionally, you can find smaller ruins in Isaan on the way to Cambodia, also built in Khmer style.</p><p><strong>Related articles:</strong></p><p><strong>Enjoy the great diving</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/7reasonsthailand006.jpg\" alt=\"Diving with fish in the dark blue waters\" width=\"675\" height=\"395\"><br> Thailand has some of the best dive sites in the world, and it&#8217;s also one of the cheapest places in the world to learn to dive. The diving near Phuket, <a href=\"https://nomadicmatt.com/travel-blogs/the-complete-guide-to-diving-in-koh-tao/\" rel=\"noopener\" target=\"_blank\">Ko Tao</a>, the Similan Islands, and the Surin Islands is famous for brightly colored fish and coral. I find the diving near Ko Lanta and the Similan Islands to be the best as the reefs are better preserved.</p><p><strong>Related articles:</strong></p><p><strong>Explore Isaan</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/isaan_thailand.jpg\" alt=\"a temple in Isaan, Thailand\" width=\"675\" height=\"395\"><br> If you really want to see what Thai life is like outside the big cities, visit Isaan, the northeastern part of Thailand. It is extremely rural and contains small villages, parks, and ruins that hardly see any tourists. There were entire days I never saw another foreigner. I think it&#8217;s one of the most interesting areas in the country and gives you a true sense of Thailand away from the crowds. Isaan food is also a regional version of Thai food that is probably the best (and spiciest).</p><p><strong>Related articles:</strong></p><p><strong>Take a cooking class</strong><br> <img class=\"alignnone\" src=\"https://media.nomadicmatt.com/thai_cooking.jpg\" alt=\"cooking up some Thai food\" width=\"675\" height=\"395\"><br> You&#8217;ll find cooking classes all over Thailand, though Chiang Mai is the most popular place for them. Typically, you begin your class by going to the market and learning about Thai produce before heading to the kitchen. These hands-on classes teach you how to make your favorite Thai dishes; at the end, you&#8217;ll be able to eat your creations, so come hungry! (Just don&#8217;t try to eat my food. My curry never came out right.) Any guesthouse or tour agency can help you arrange a class.</p><p><strong>Related articles:</strong></p><p></p>***<p>And this is really just the tip of the iceberg. Thailand has a lot to offer travelers. There are <a href=\"https://nomadicmatt.com/travel-blogs/11-reasons-why-i-love-thailand/\" rel=\"noopener\" target=\"_blank\">plenty of good reasons to visit Thailand now</a> and tons of things to do here.</p><h3>NEW UPDATED EDITION!! Get all my best Thailand tips!</h3><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Thailand_Flat.jpg\" alt=\"\" width=\"180\" height=\"240\"></a>Recently, I just released a massive update for this guidebook. You&#8217;ll find NEW suggested itineraries, budget tips, ways to save money, on- and off-the-beaten-path things to see and do, and non-touristy restaurants, markets, and bars. In this edition, we also urevamped and expanded our information on the islands, added a section on Kanchaburi, and added TONS of maps to help you get around the country, plan your itinerary, and find your way around cities.</p><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\">Just click here to learn more about the book and get it today!</a></p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p><p>Photo credits: <a href=\"https://flic.kr/p/hrYv4L\" rel=\"noopener\" target=\"_blank\">10</a></p></div>","title":"9 Reasons to Visit Thailand in 2018"}},"pageContext":{"id":"5b95eaa187be05832748ffbf"}}