{"data":{"mongodbDatabaseArticles":{"id":"5b9248b887be056953db7bdf","content":"<div><p>This is the story about how technology is shaping a completely new kind of future. One that we didn't really expect at the onset. At the center of it is automation: how technology can do most things humans do in a cheaper and more efficient way. But that's not new. What's new is how we're now discovering that technology's end goal of efficiency, and capitalism's reward for efficiency perfectly match up. And how that means profits will be distributed in extremes. Let me explain...</p> <p>(Update: I was asked to present this story in Budapest two months after writing this post, here's the video if you don't like to read everything)<br> </p><p class=\"vid\"></p> <h2>1. The West's economies are still sick</h2> <blockquote class=\"twitter-tweet\" lang=\"en\"><p>1/ There's a few super clear trends right now that can give us some idea how the economy will look like in a few years</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573975417960337409\">March 6, 2015</a></p></blockquote> <p></p> <p>Let's start off with the disaster that is America and Europe's economy:</p> <h3>1.1. Unemployment</h3> <blockquote class=\"twitter-tweet\" lang=\"en\"><p> 2/ Unemployment in US and EU continues to be an issue, the only real jobs added are in tech</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573975616988430336\">March 6, 2015</a> </p></blockquote> <p></p> <p>Today, <a href=\"http://www.businessinsider.com/france-unemployment-record-high-q4-2014-2015-3\">unemployment in France hit 10%</a>, a record high.</p> <p>And the rest of Europe is not far off:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/EU-Unemployment-Comparison1.jpg\" alt=\"\"> <p>So there's not a lot of jobs, and also people aren't really spending. So everyone is cutting interest rates (so that you don't save, but spend your money). But that isn't working either. People are still not spending and that means interest rates have now become negative. Germany is now <a href=\"http://www.wsj.com/articles/germany-sells-five-year-debt-at-negative-yield-for-first-time-on-record-1424871074\">selling their bonds at negative interest rates</a>, this is what that means:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"><p>Germany sells 5-year bonds at negative yield &#8211; investors are paying Germany so they can lend it money. (From the FT) <a href=\"http://t.co/cy7hjmGR14\">pic.twitter.com/cy7hjmGR14</a></p> <p>&#8212; Ninja Economics (@NinjaEconomics) <a href=\"//twitter.com/NinjaEconomics/status/571800942527561729\">February 28, 2015</a></p></blockquote> <p></p> <p>It's a unique situation, and quite comparable to <a href=\"http://en.wikipedia.org/wiki/Disinflation#Japan_an_example_of_disinflated_economy\">Japan's horrible last twenty years</a>.</p> <p>Now, in case of the US, unemployment is \"officially\" decreasing, <b>but wait, no actually it's not</b>:</p> <blockquote><p> (..) overall unemployment rate can be misleading (..) Those who have given up [looking for work] are often referred to as &#8220;missing workers&#8221; [and not counted]. (..) there are about 1 million young missing workers &#8211; under 25 years old &#8211; and if they were included, the unemployment rate for young Americans would be closer to 16.2%. (..) Over the past year the number of employed young Americans has gone up by almost 400,000, to 14.1 million. </p></blockquote> <p>&#8212; from today's article in The Guardian: <a href=\"http://www.theguardian.com/business/2015/mar/06/us-economy-booms-youth-unemployment\">US unemployment at lowest since 2008 &#8211; but young people still can't find work</a></p> <p>That's really the point. Unemployment growth is being covered up by some statistical tricks. US and Europe's economies are still not doing well, on the contrary.</p> <h3>1.2. Only low-skilled jobs are coming back</h3> <p>And the jobs that are coming back? Well, it's not exactly the right ones:</p> <p>Washington Post writes <a href=\"http://www.washingtonpost.com/blogs/wonkblog/wp/2014/04/28/u-s-job-growth-is-coming-in-all-the-wrong-places/\">\"U.S. job growth is coming in all the wrong places\"</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screenshot 2015-03-07 17.10.05\"><img src=\"/wp-content/uploads/2015/03/Screenshot-2015-03-07-17.10.05-1024x865.png\" alt=\"Screenshot 2015-03-07 17.10.05\"> <p>This chart shows the jobs that are coming back are low-skilled and low paid. That's jobs for the working class (or lower class, but I think that's a non-PC term). Now it's great that at least the low-skilled get jobs back, right? Well no...because those are in line to be automated in the next few years. Because they're low skilled, so they're easy to automate:</p> <p>Think of stuff like transport (replaced by <a href=\"http://uber.com/\">self-driving vehicles</a>), administrative jobs (replaced by <a href=\"http://en.wikipedia.org/wiki/Software_as_a_service\">SaaS</a>), food services jobs (replaced by <a href=\"//www.youtube.com/watch?v=sBuIhH9aaSA\">automated restaurants</a>) and retail trade (replaced by <a href=\"http://amazon.com/\">online shops</a>).</p> <h3>1.3. Software is eating the middle class</h3> <p>What about the middle class? The high-skilled jobs are what the middle class need. They're not coming back:</p> <p>Forbes writes <a href=\"http://www.forbes.com/sites/eriksherman/2015/01/15/robert-reich-is-right-higher-wages-arent-coming-back-and-heres-why/\">\"Higher wages aren't coming back and here's why\"</a>:</p> <blockquote><p> (..) William Lazonick, professor of economics (..) wrote in the Harvard Business Review, we currently have profits without prosperity. Corporate profits are high and the stock market has never done better, but most Americans don&#8217;t partake of the benefits. (..) Companies aren&#8217;t investing their capital and are even borrowing money &#8212; and keeping wages low and not hiring people for expansion. </p></blockquote> <p>So the West's middle class is being wiped away and companies rather sit on money, than taking on the risk of hiring somebody. You're right, this is a temporary thing. You hope. So once the companies believe in the economy, they're going to hire back that middle class right? Well, no:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"><p> 5/ Enterprise software and SaaS are quickly automating away employees at most small, medium and big businesses (SMB)</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573977687305277441\">March 6, 2015</a> </p></blockquote> <p></p> <p>Computer World writes <a href=\"http://www.computerworld.com/article/2691607/one-in-three-jobs-will-be-taken-by-software-or-robots-by-2025.html\">one in three jobs will be taken by software by 2025</a>:</p> <p>So let's get back to those middle class jobs. They weren't coming back. So who is the middle class really? This is the most popular middle class jobs:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/Screenshot-2015-03-08-14.39.56-1024x415.png\" alt=\"\"> <p>So a few that stick out here are secretaries, managers, and sales people. A lot of those are on the line to be automated next by enterprise software. Enterprise software is any software that medium and big companies buy to make them more efficient. It's not just stuff your mom or dad probably used at their job like <a href=\"http://sap.com/\">SAP</a>, <a href=\"http://sharepoint.com/\">SharePoint</a>, it could also be more hip stuff like <a href=\"http://basecamp.com/\">Basecamp</a> or <a href=\"http://trello.com/\">Trello</a> that we startup-hipsters use. It's software that makes stuff more efficient, and that in turn can make it less necessary to hire new people.</p> <p>Think of stuff like project management software that can reduce the number of managers you have on staff. But that will evolve into more smarter software in more advanced industries in just 10 years.</p> <blockquote><p>This cognitive capability in software will extend to other areas, including financial analysis, medical diagnostics and data analytic jobs of all sorts, says Gartner. (..) \"Gartner predicts one in three jobs will be converted to software, robots and smart machines by 2025,\" said Sondergaard. \"New digital businesses require less labor; machines will be make sense of data faster than humans can.\"</p></blockquote> <p>So then you'll have a large share of the middle class wiped out.</p> <h3>1.4. The labor force feels entitled</h3> <blockquote class=\"twitter-tweet\" lang=\"en\"><p>3/ Especially in W-Europe people seem to be too stubborn to learn to make/code and become self-employed, as they feel entitled to a job</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573976251074904064\">March 6, 2015</a></p></blockquote> <p></p> <p>There's also a sense of entitlement. Especially in Europe (where I'm from), young people feel they studied a certain thing (history is a typical example) and are entitled to a job (in, well, history).</p> <p>I wish it worked that way, but it doesn't anymore. I personally know 28-year olds that have been sitting at home at their parents for 4 years waiting to get that PhD grant to do what they wanted to do. But <a href=\"//www.insidehighered.com/news/2015/03/05/dutch-phd-students-protest-proposed-shift-their-status\">their funding and positions are being cut</a> and there's probably not enough PhD grants to fund them.</p> <img class=\"alignnone size-full wp-image-4311 responsively-lazy\" src=\"/wp-content/uploads/2015/03/phd-circle-candidates.jpg\" alt=\"phd-circle-candidates\" width=\"400\" height=\"400\"> <p>Even crazier, there's probably not a job waiting for them after they get their PhD, as Times writes: <a href=\"http://www.timeshighereducation.co.uk/news/too-many-postdocs-not-enough-research-jobs/2017415.article\">too many postdocs, not enough research jobs</a>.</p> <p>That's sad. But what's interesting is that many young people without jobs are also not trying to take on any other job than they studied for. The entitlement to do what they studied for and be stubborn about it, has become a liability for them and makes their (economic) position even worse. Re-training themselves into a skill set that is in demand would be a better idea. But that goes against the destructive philosophy that babyboomer's kids have been raised with: <a href=\"http://waitbutwhy.com/2013/09/why-generation-y-yuppies-are-unhappy.html\">they feel special</a>. Entitled.</p> <blockquote class=\"twitter-tweet\" lang=\"en\"><p> 4/ The rest of the world embraces tech change and young people in emerging markets are learning to code/design and are becoming makers</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573976867012661249\">March 6, 2015</a> </p></blockquote> <p></p> <p>Everywhere I go outside Europe and the US, I see people very ambitious and eager to succeed. And they are quick to jump on new technology trends and get the skills for them. Obviously it's because most emerging markets come out of poverty. You don't have much to lose if you come out of poverty. Sure. But that means the unprecedented level of wealth the West gained in the 20th century is a liability now. It's made the West, well, entitled and lazy. The issue is that with the internet, we'll be competing exactly with those people from outside the West who are so eager to take over the work we're not skilled in.</p> <p>Already on freelance sites like <a href=\"http://odesk.com/\">Odesk</a>, a web developer from the U.S. will be competing with one from China or Ukraine:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/Screenshot-2015-03-07-16.15.36-1024x793.png\" alt=\"\"> <p>Quality? Well, the quality of work from outside the West and emerging markets is catching up quickly.</p> <h2>2. Infrastructure vs. creativity</h2> <blockquote class=\"twitter-tweet\" lang=\"en\"><p>6/ So what's left that can't be automated? Infrastructure and creativity. And they're both necessary and will be in high demand</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573978066898186240\">March 6, 2015</a></p></blockquote> <p></p> <p>Infrastructure has always primarily been about cost. It's a commodity, which means it's not highly unique. Like streets, the electricity net or the pipes your city's water goes through, they're mostly the same everywhere.</p> <p>Where's the modern day infrastructure? On the internet. What is the modern day infrastructure? Well, servers, app stores, payment services etc. Anything really that enables you to do stuff online.</p> <p>It mostly doesn't really matter where you have your smartphone's photos stored \"in the cloud\", or where your website is hosted. So with commodity stuff like infrastructure, if everything is the same, you'll pick the one who provides it for the lowest cost.</p> <p>Now how do you become low cost? Well, you get <a href=\"http://en.wikipedia.org/wiki/Economies_of_scale\">economies of scale</a>. That means if you do things at high scale, you get the advantage of buying lots off stuff (e.g. servers) and being able to get them cheaper. So big tech companies are building huge data centers like crazy. <a href=\"http://www.fastcompany.com/3042746/fast-feed/why-apple-is-spending-19-billion-to-open-data-centers-in-denmark-and-ireland\">Apple just spent almost $2 billion dollars on building its new data centers</a>.</p> <p>What does this mean?</p> <p>Pickaxes!</p> <h3>2.1. Infrastructure</h3> <img class=\"alignnone size-full wp-image-4308 responsively-lazy\" src=\"/wp-content/uploads/2015/03/e69d2dafe0fb7af7c2b4ac377bfc888f.jpg\" alt=\"e69d2dafe0fb7af7c2b4ac377bfc888f\" width=\"347\" height=\"346\"> <p>It means that the big tech companies know that they now have an opportunity to provide the infrastructure for the future. <b>And the most important infrastructure of future society will be virtual</b>. Startups try to win by making some new disruptive app/service/product, but the odds of a startup succeeding are like the odds of people finding gold during the gold rush. Who made money in the gold rush? The saying goes, not the people that dug for gold, but instead <a href=\"http://www.businessinsider.com/selling-pickaxes-during-a-gold-rush-2011-2\">the people that sold pickaxes</a> to the people that dug for gold. That's kind of like infrastructure. It's guaranteed to make money as it's like a utility.</p> <p>Especially if you're one of only a handful of companies owning the infrastructure. That's called an oligopoly. But you probably know it as a monopoly (which is when there's only one company controlling a market). It's the same kinda idea. I'll explain oligopolies later on.</p> <h4>2.1.a. Hardware</h4> <p>It's not just servers though. Look at your smartphone, it's probably made by Apple, Google, or Xiaomi (which <a href=\"http://www.ibtimes.com/alibaba-invest-590m-minority-stake-xiaomi-rival-meizu-1809530\">Alibaba has invested half a billion dollars in</a>). And they all look the same:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"iphone-6-plus-vs-nexus-6-vs-galaxy-note-4-three-quarter-540x334\"><img src=\"/wp-content/uploads/2015/03/iphone-6-plus-vs-nexus-6-vs-galaxy-note-4-three-quarter-540x334.jpg\" alt=\"iphone-6-plus-vs-nexus-6-vs-galaxy-note-4-three-quarter-540x334\"> <p>So they've become a commodity too. Which means there's about $0 profit to be made on them. So why are these big tech companies still making phones. Well, so you can use their infrastructure. And they'll charge you for that.</p> <h4>2.1.b. Banking</h4> <p>They will take over payments and thus banking. Apple has Apple Pay. <a href=\"http://9to5google.com/2015/02/20/google-wallet-relaunch/\">Google is relaunching Google Wallet</a>. Alibaba has <a href=\"http://en.wikipedia.org/wiki/Alipay\">Alipay</a>. And there's countless more like <a href=\"//www.techinasia.com/wechat-adds-payment-support-for-brands-and-retailers/\">Tencent's WePay</a>, Naver's <a href=\"http://techcrunch.com/2014/12/04/line-pay-the-messaging-apps-mobile-payments-service-makes-its-debut/\">Line Pay</a> and of course hip startups like <a href=\"//squareup.com/global/en/register\">Square</a> and <a href=\"http://stripe.com/\">Stripe</a>. You'll say Stripe is just a merchant app, but I promise they'll introduce their own wallet soon. And then they'll get acquired. All these smaller payment apps will get acquired by the big ones.</p> <p>And then the payment infrastructure war has been finished. You have those same big tech companies, and you'll be paying through them. Banks will go bankrupt (no pun) and will massively fail. They won't even be acquired probably because there's hardly anything traditional consumer banks are good at. And their entire business model is completely unfit for this tech-based future, e.g. remember how you hate your bank's internet banking site/app. Well I do too. So good riddance:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/image_2.png\" alt=\"\"> <p>With the banking sector replaced by big tech companies, you get a lot of massive lay offs. A lot of people will be fired. I don't really know a lot about investment banking, but I know there's massive lay offs there already: just three days ago <a href=\"http://fortune.com/2015/03/03/rbs-layoffs-investment-banking/\">Royal Bank of Scotland said they'll fire 19,000 people in the next 4 years</a>. Trust me, automation is a big reason for it. But they'll probably not even mention it.</p> <h4>2.1.c. Transport</h4> <p>So what about transport. Well, <a href=\"http://techcrunch.com/2015/02/02/uber-opening-robotics-research-facility-in-pittsburgh-to-build-self-driving-cars/\">Uber just launched a robotics facility</a> to build self-driving cars to replace their drivers with robots in a few years. Google is an investor in Uber, but think this will be such a big deal that <a href=\"http://www.bloomberg.com/news/articles/2015-02-02/exclusive-google-and-uber-are-going-to-war-over-taxis\">it wants to compete with its own investment</a>. And now, <a href=\"http://www.reuters.com/article/2015/02/14/us-apple-autos-idUSKBN0LI0IJ20150214\">Apple wants to build their own self-driving car</a>.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Vehicle prototype\"><img src=\"/wp-content/uploads/2015/03/Vehicle-prototype-1024x683.jpg\" alt=\"Vehicle prototype\"> <p>So then you'll get massive layoffs in consumer service transport like taxis, <a href=\"http://en.wikipedia.org/wiki/List_of_automated_urban_metro_subway_systems\">public transport</a> and tour bus operators. So now they're all without jobs.</p> <h4>2.1.d. So who will make money off this infrastructure?</h4> <p>The people that own it. If you own the infrastructure, you can levy fees.</p> <p>So remember when we spoke about oligopolies:</p> <blockquote><p> An oligopoly is a market form in which a market or industry is dominated by a small number of sellers (oligopolists). Oligopolies can result from various forms of collusion which reduce competition and lead to higher prices for consumers. </p></blockquote> <p>So this is funny, when the big companies actually get their dominating control over the infrastructure, they don't need to be cheap anymore. They'll start to levy fees. And since they're not competing with many, they can charge whatever they want.</p> <p>Like <a href=\"//support.apple.com/en-is/HT201238\">an iCloud subscription</a> to store my photos in the cloud, or taking 30% of every app sale or <a href=\"http://evolver.fm/2013/08/08/apple-takes-30-percent-of-in-app-subscriptions-some-developers-are-fine-with-that/\">in-app transaction</a> I buy through my smartphone's app store.</p> <p>Or Apple Pay taking a % off every purchase you make.</p> <p>Even stuff like transport. You go to school or work every day, so if they can transport you, that part is loads of money.</p> <p>And once big companies own all this (automated) infrastructure, it's pretty much just sitting still and there's unlimited cash flowing in.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"EarningsInsight_9.23.2014\"><img src=\"/wp-content/uploads/2015/03/EarningsInsight_9.23.2014.png\" alt=\"EarningsInsight_9.23.2014\"> <p>What about competition? Well you're seeing it now already. They're too big of monopolies for anyone to compete with. The idea was that Google (founded in 1998) would be replaced by a new company in a decade right? Well that's 2008, and it's 7 years later and Google is still a giant. Facebook? Founded in 2004. It's 11 years later. Etc. Etc.</p> <h4>2.1.e. This new infrastructure and its effect on jobs</h4> <p>Much of this new infrastructure, that's controlled by these mega corporations, is transformative in that it changes the entire society, economy and its labor market. It partly automates away jobs, but it mostly just makes a lot of jobs not make sense anymore.</p> <p>If most of our interaction is virtual, then we'll spend our money increasingly, well, virtual.</p> <h4>2.1.f. So, what about education?</h4> <p>In one area, all of this will actually have a great effect: education:</p> <p>Education will increasingly go online as well, with physical private study groups with personal mentors left. So you do most of your course material online and then you meet in the city in a coworking space, or teaching space, or maybe even a school/university, and have a small group where you review your course work etc. This can be from elementary education up to post graduate education.</p> <p>A teacher teaching 30 students or more never worked any way so this is actually a great thing. And it means that teachers will be well paid in the future, they're of extreme value and have been underpaid for decades now.</p> <h4>2.1.g. So what about public jobs? Like university jobs?</h4> <p>Then you think about scholars, professors, academics etc. right? Well historically they've been funded by public money. And now here's another issue, a lot of the governments are running out of money. In Europe, the whole <a href=\"http://en.wikipedia.org/wiki/Austerity\">austerity</a> thing, has cut stuff like universities drastically. Globally too, governments are cutting spending on public jobs drastically too.</p> <p>It's getting so bad universities are taking drastic measures: The <a href=\"http://www.marxist.com/occupations-beginning-new-wave-dutch-student-struggle.htm\">University of Amsterdam just last month sold their expensive centuries-old real estate</a> to afford, well, to afford existing really, and students are fiercely protesting about it:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/864x486.jpg\" alt=\"\"> <p class=\"vid\"></p> <p>What will the buyers do with it? Well, you can predict this really...</p> <blockquote><p> University of Amsterdam&#8217;s (UvA) humanities building, the Bungehuis, is scheduled for development into <b>an exclusive, membership-only Soho House club</b>, real estate developer Aedes announced. Soho House operates twelve <b>private clubs around the world where people from film, media and creative industries meet to schmooze</b>, drink and dine for an annual membership fee. </p></blockquote> <p>An annual membership to <a href=\"http://www.sohohouse.com/\">Soho House</a> is 1,400 GBP or 2,000 USD. I couldn't really ask for a more apt description of what's happening. Money is flowing away from public into private hands. This club is for \"creative industries to schmooze\".</p> <p>Which is a nice bridge to the next topic, because creatives are indeed the new rich:</p> <h3>2.2. Creativity</h3> <blockquote class=\"twitter-tweet\" lang=\"en\"><p> 9/ The only other group still having a job will be coders, app makers, designers, illustrators, artists; cause creativity can't be automated</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573980432263290882\">March 6, 2015</a> </p></blockquote> <p></p> <p><b>The only industries that won't be automated are where the service/product becomes less valuable if automated.</b></p> <p>What does that mean? Well, let's say you have two products. One cheap one made by robots. One expensive one made by humans. If you still buy the one made by humans, it means there's an added value there. Think of like being helped by staff in an expensive restaurant, you want that to be a highly trained person who has great service. But if I go out to have dinner like every day, then I want a super cheap place, and I don't care if it's humans or not. <b>I care if it's cheap.</b></p> <p>So high-touch, high service, creative stuff won't be automated soon. <b>The rest will</b>.</p> <p>Now many people in positions soon to be automated will defend their position and say stuff like \"a computer can never do what I do\".</p> <p>But don't underestimate how easy people switch to cheaper products/services though. They care a lot less if it's a human than you think. When butchers were replaced by supermarkets so fast, you saw butchers on the TV news say \"supermarkets can never give the same experience as a real butcher who knows his/her meat\". Well <a href=\"http://www.dailymail.co.uk/news/article-528412/23-butchers-shops-forced-close-month-face-supermarket-onslaught.html\">that didn't really work out for them, did it?</a></p> <h4>2.2.a. The self-employed makers</h4> <p class=\"indented\">My vision of this new future is billions of self-employed makers building apps, designing software/websites, illustrating for games, making music for apps etc. Creative stuff that makes or ties into software.</p> <p>Now you think, apps, that's a joke. Nobody makes real money with apps. But increasingly they are. And it's not huge teams that are doing it either. <a href=\"//www.youtube.com/watch?v=YHH2101OFfI\">Flappy Bird</a> was made by <a href=\"http://flappybird.wikia.com/wiki/Dong_Nguyen\">one guy from Vietnam</a> and <a href=\"http://en.wikipedia.org/wiki/Flappy_Bird\">grossed $50,000 per day</a> or $1,5M per month.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/bird1.jpg\" alt=\"\"> <p>SaaS apps like <a href=\"http://baremetrics.com/\">Baremetrics</a> are interesting because they're also built by (originally) non-VC-funded one-person teams. Just a girl or guy with a laptop building something that provides a real service and in 5 months they're making <a href=\"//baremetrics.com/blog/idea-to-5000-in-5-months\">$5,000</a> per month, a year later <a href=\"//baremetrics.com/blog/0-to-25000\">$25,000</a> per month.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/baremetrics-from-idea-to-5000-a-month-in-5-months-1-638.jpg\" alt=\"\"> <h4>2.2.b. Individuals are making lots and lots of money</h4> <p class=\"indented\">So you see this more and more. It's not huge teams, it's one-person teams building something that's fully online either as a mobile app or web app (what's the difference these days any way?) and they become successful. So they'll start hiring after right? That's good for the job market right? Tell me! Well no, increasingly these <a href=\"http://www.softwarehamilton.com/2013/08/23/why-hiring-contractors-instead-of-employees-is-better/\">companies just pay contractors to help them out instead of hiring employees</a>. And for good reason. The liabilities of hiring employees (especially in Europe) are just way too high to fit with these unstable times. An app like aforementioned Baremetrics can be wiped out in a month or two by a competitor. And who will that competitor be? Oh maybe some kid from Africa or anywhere else in the world...on a laptop.</p> <p>This new reality is kind of shocking to imagine and nobody I tell really believes this stuff. So why do I think I'm right here? Because I see the examples all around me. And I'm probably right in the middle of it too. I'm doing the same. Just a one-person band trying to build something that helps people and pay my bills.</p> <h4>2.2.c. Automation divides profits in extremes</h4> <p class=\"indented\">The issue is that once I build a site or app that works well, I won't just be making a normal salary (e.g. $3,000). Usually if a business model works well on the internet, you can scale an app quickly to $25,000 per month and then up and up.</p> <p>And here's why that creates more issues, the money probably doesn't flow into more jobs:</p> <p><b>If I make $25,000 per month, and I know my business can be wiped out in a month or two by another kid, then I'll obviously be rather cautious with my money and I'll probably sit on a large part of that</b> (<a href=\"http://www.bbc.co.uk/news/business-31016446\">a bit like Apple does too</a>).</p> <p><b>And as hiring employees is too risky, I'll hire contractors.</b> But then here's another bit of honesty. Increasingly it's been saving me more time to just code a script that does the same then going through the ordeal of hiring somebody, training them, dealing with them making mistakes or decreasing work performance. This is the honest reality of a programmer, if I code a PHP script and <a href=\"http://en.wikipedia.org/wiki/Cron\">hook it into a cron job</a>, I don't really need a human.</p> <h4>2.2.d. So what jobs are left?</h4> <p class=\"indented\">Well, I can't automate away someone who codes or creates something as an artist. So that's why I keep talking about creativity. Creative professions will remain. With creative I mean entrepreneurs, programmers, designers etc. just makers in general. People that make stuff that is unique, original. Because robots aren't original.</p> <p>What about service jobs like waiters? Here's an actual waiter's opinion:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"><p><a href=\"//twitter.com/levelsio\">@levelsio</a> <a href=\"//twitter.com/SuperWhelk\">@SuperWhelk</a> I bring food, conversation, take the dishes off the table, clean them, etc. I wish I could automate table clearing!</p> <p>&#8212; PunningPundit (@punningpundit) <a href=\"//twitter.com/punningpundit/status/574008474314498049\">March 7, 2015</a></p></blockquote> <p></p> <p>He has a good point IF people are willing to pay MORE for his service. Having a waiter is a luxury. Just like when supermarkets started selling meats, fish and vegetables, butchers, fish stores and crop markets where wiped away in a decade. Why? Because supermarkets offered it cheaper. So I know there's a kind of \"hipster\" revival of butchers and small food shops now again. And that's because they finally have something better to offer, it's not cost, it's quality. They have organic meats and a high amount of service. But that's only for people willing to pay MORE for that. Just like waiters and other service staff will be. If <a href=\"http://twitter.com/punningpundit\">@punningpundit</a> can make his restaurant more premium and target to wealthy people, he'll be with a job in a few years. And he'll be making more than he does now as well.</p> <p>That's the thing, automation makes profits get divided in extreme ways. Most people won't have a product/service that is in demand, but the ones that will have one will make A LOT of money. It's not divided fairly. I don't like that, but that's what's happening increasingly.</p> <h2>3. So, the future is a dichotomy</h2> <p>Dichotomy, that's a jargon word for two polar extremes. That's what this is. On one side you have mega corporations controlling infrastructure, and on the other side billions of individuals making stuff on top of that infrastructure, what's left in the middle? Well, not much. Say goodbye to medium and big businesses.</p> <blockquote class=\"twitter-tweet\" lang=\"en\"><p> 8/ These tech co's will probably be Google/Apple/Alibaba who will have a monopoly on cloud servers, hardware devices, payment, transport</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573979564658962434\">March 6, 2015</a> </p></blockquote> <p></p> <p>Apple is now on schedule to become the world's first <a href=\"http://www.forbes.com/sites/connieguglielmo/2012/04/03/apple-may-be-worlds-first-trillion-dollar-company/\">$1,000,000,000,000 company</a> (that's a trillion dollars) and is sitting on almost <a href=\"http://www.theguardian.com/business/2015/feb/02/apple-cash-mountain-grows\">$200 billion of cash</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/screen-shot-2014-11-25-at-8-39-53-am.png\" alt=\"\"> <p>There won't be a lot in between because big companies have the advantage of economies of scale (e.g. huge infrastructure building) and individuals have the advantage of diseconomies of scale (e.g. creativity and agility). And in the middle you have...well, companies that don't have either of those:</p> <p><b>Medium and big (but not giant) business will be too slow to be creative, but too small to compete on scale with tech giants.</b> So their economic reason of existence is gone (I'm not going to say <a href=\"http://en.wiktionary.org/wiki/raison_d%27%C3%AAtre\">raison d'etre</a> because I'm not a high-nosed jargon journalist :P). And so they're wiped out in the next few years.</p> <h2>4. Don't shoot the messenger</h2> <blockquote class=\"twitter-tweet\" lang=\"en\"><p>10/ People get angry if you tell them this, because they feel their existence threatened. But embracing change is probably a better idea</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/573981972961198080\">March 6, 2015</a></p></blockquote> <p></p> <p>I'll probably get these reactions after I post this blog too. Because just talking about this at parties makes you incredibly unpopular. People don't want to believe it. It threatens their entire thought model and their reason of existence. So they get angry. But it's not that I agree with it. I would love a utopic society where everybody has a job and is happy etc. I'm just observing and telling you. Don't shoot the messenger.</p> <h3>4.1 Are you next?</h3> <p>Think critically of your own job and skill set and judge how unique it is. Can it be automated easily? If your job is administrative, non-creative, repetitive, it'll probably be gone soon. If you're doing a lot of <a href=\"http://www.urbandictionary.com/define.php?term=IRL\">IRL</a> stuff like sales, meetings, driving around to visit companies and then talk <a href=\"http://en.wikipedia.org/wiki/Buzzword_bingo\">buzzword bingo</a> <a href=\"http://strikemag.org/bullshit-jobs/\">bullshit</a>, then you're probably out too.</p> <p>So if you didn't get angry and don't feel entitled, but instead are \"embracing\" this change, what's there to do?</p> <h3>4.2 Build your skill set</h3> <p>So what's the jobs you can train for? Well, if you do something creative, you're probably be doing well in this new age:</p> <p><a href=\"http://remoteok.io/tags\">Companies need programmers</a> (yes that's from my website):</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/Screenshot-2015-03-08-19.30.14-1024x480.png\" alt=\"\"> <p><a href=\"//www.odesk.com/o/jobs/browse/skill/character-design,game-design,game-development/\">Game developers need character designers</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/character_design___project_echo_by_elr_lash-d5iuimm-1024x570.png\" alt=\"\"> <p><a href=\"//www.airbnb.com/careers/departments/design\">Startups need artists</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/1082140417.jpeg\" alt=\"\"> <p>Creative workers need people that organize <a href=\"http://sharedesk.net/\">spaces for them to work from</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"\"><img src=\"/wp-content/uploads/2015/03/Camera_06_NEW_FINAL-1024x576.jpg\" alt=\"\"> <p>Getting yourself a unique skill set that fits with this super fast changing future helps. Being creative helps. <a href=\"//www.youtube.com/watch?v=dU1xS07N-FA\">Learning to code ALWAYS helps</a> if you ask me. But even stuff like illustration, drawing, making music, all that stuff is needed. Software is boring and they need that stuff to make it beautiful.</p> <h3>4.3. Can I just ignore this?</h3> <p class=\"indented\">Thinking that by ignoring this reality, it's just going to go away. That never worked. But that is what's going on with, well, mostly everyone I meet that has never programmed. The moment you've programmed, usually the penny drops quickly how powerful technology is and increasingly will be.</p> <p>You can't really ignore it anymore once you lose your job.</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How technology is shaping our future: billions of self-employed makers and a few mega corporations"}},"pageContext":{"id":"5b9248b887be056953db7bdf"}}