{"data":{"mongodbDatabaseArticles":{"id":"5b92397687be0583cfde6808","content":"<div><p></p><img class=\"wp-image-24266 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/expat-friendly-countries-no-capital-gain-taxes.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>Last updated November 15, 2017</p>\n<p>Dateline: Tbilisi, Georgia</p>\n<p>Here at Nomad Capitalist, we are about <a href=\"http://nomadcapitalist.com/five-magic-words/\">going where you are treated best</a>, which includes not paying taxes that discourage smart investments and disrespect your capital. We travel the world looking for places that are putting out the welcome mat for foreign investment, making it easy to grow your life and your wealth, and keep more of your own money.</p>\n<p>The idea behind capital gains tax &#8212; that is&#160;taxing a profit made from the sale of real property or financial holdings like stocks and bonds &#8212; is a major consideration when choosing where to invest and how to maximize your strategy overseas. </p>\n<p>Paying capital gains tax is not only a pain, but it also discourages investment and stops capital from reaching its highest use. We have talked before about the countries with the <a href=\"http://nomadcapitalist.com/2014/03/30/top-5-states-countries-highest-capital-gains-taxes/\">highest capital gains tax rates</a>, so on the other hand, we know savvy investors will want to know where they can invest in jurisdictions that better respect capital.</p>\n<p>Around the world, there are dozens of countries that impose no taxes on capital gains in one way or another. The list includes the usual suspects like Barbados and tax havens like the Isle of Man, as well as more surprising countries like Iran and Egypt (although the Arab Spring-inspired calls for a new tax on investments).</p>\n<p>In this list, we focus on countries friendly to expats with a high quality of life. For an investor looking to hold stocks and other investments in their own name, rather than an <a href=\"http://nomadcapitalist.com/offshore-company/\">offshore corporation</a>, these countries offer no capital gains taxes and also may provide key bases for your <a href=\"http://nomadcapitalist.com/lifestyle-design/\">nomadic lifestyle plan</a>.</p>\n<p>&#160;</p>\n<h2><b>9. Switzerland</b></h2>\n<p></p><img class=\"wp-image-23137 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Depositphotos_32865633_original.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Switzerland, one of the world&#8217;s renowned centers of banking and stores of wealth, makes the list with no capital gains tax on trades of securities. Gains from selling private property are not federally taxable while gains from business property are taxed as income. Cantonal and municipal taxes are imposed on both types of property. Of course, Switzerland taxes capital gains on other investments as income, but foreigners may be able to avail of a flat tax scheme as well.</p>\n<p>With its progressive tax rates, the longer the property is owned, the lower the tax. Canton-level rules apply for immovable property, with top burden ranging from 25% to 50%. After four to five years of ownership, a maximum relief of 50% to 70% of payable tax is allowed. Short-term gains may be imposed of up to 50% for properties sold within first four or five years.</p>\n<p>&#160;</p>\n<h2><b>8. Singapore</b></h2>\n<p></p><img class=\"wp-image-23139 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/pexels-photo-417377.jpeg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Singapore once again joins the list of nations offering competitive incentives for entrepreneurs and capital. The city-state as a whole has been renowned for making it attractive for foreign capital to flow into its small jurisdiction and be given a strong basis for banking security as well as tax incentive. Thus, there is no capital gains tax in Singapore. While certain elements of financial policy have gotten tighter for expats and newcomers to the country, Singapore still remains a solid choice for English-speaking low-tax nations.</p>\n<p>&#160;</p>\n<h2><b>7. Cayman Islands</b></h2>\n<p></p><img class=\"wp-image-23140 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/cayman-islands.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>The Cayman Islands is a well-known tax haven and overseas banking hub, and as one might expect from this pro-growth jurisdiction, there are no capital gains taxes charged on any transaction here. Cayman Islands entities may be taxed by other jurisdictions, but the British overseas territory will not impose additional tax burden on your capital gains itself. <a href=\"http://nomadcapitalist.com/2015/03/06/expat-countries-that-speak-english-language/\">This English-speaking island nation</a> offers high quality of life for foreign investors and perks of living in the Caribbean with a great business environment and solid tourism infrastructure.</p>\n<p>&#160;</p>\n<h2><b>6. Monaco</b></h2>\n<p></p><img class=\"wp-image-23141 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Depositphotos_23508557_original.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Monaco is among the most well-known tax havens and a magnet for the ultra-wealthy. The small nation imposes no capital gains taxes, except for French citizens. Monaco understands the benefits of making a tax and business environment that is attractive to foreign wealth and thus respects capital gains generally with no taxation. The micro-country offers many <a href=\"https://nomadcapitalist.com/2017/09/01/ultimate-guide-monaco-residency-citizenship/\">paths to residency</a> and may be a useful part of your capital gains strategy if you are a high-achieving entrepreneur looking to elevate your investments.</p>\n<p>&#160;</p>\n<h2><b>5. Belgium</b></h2>\n<p></p><img class=\"wp-image-23145 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Belgium.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Belgium is living proof that capital flight is real. Actor Gerald Depardieu famously moved a few miles over the French border to escape France&#8217;s high-income tax regime, and it was widely noted that Belgium has no capital gains tax. Bernard Arnault, the billionaire head of luxury giant LVMH, also moved from France to Belgium for &#8220;family inheritance reasons&#8221;, but most surmised it was to avoid a new &#8220;super tax&#8221; imposed by French socialists. </p>\n<p>While Belgium is mostly free from capital gains, there are corporate situations where a &#8220;participation exemption&#8221; is imposed and tax may be owed. Belgium isn&#8217;t exactly a low-tax country, even as far as Europe goes, but it&#8217;s zero capital gains rate in most cases is one of the best in Europe. The Netherlands also does not tax investment returns, but it does impose a sort of wealth tax in investments.</p>\n<p>&#160;</p>\n<h2><b>4. Malaysia</b></h2>\n<p></p><img class=\"wp-image-23146 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/18.-Malaysia-.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Like its neighbor Singapore to the south, Malaysia does not tax capital gains on equities. Malaysia also abolished its capital gains tax on real estate back in 2007. Additionally, Malaysia uses a territorial tax system, rather than a residential tax system, meaning non-Malaysia source income is not taxable; this includes investment income generated offshore, even &#8211; in many cases &#8211; if it is remitted to Malaysia.</p>\n<p>The Malaysian government has imposed a sort of de facto capital gains assessment on real estate, requiring non-residents to hold properties for at least five years or face a 30% withholding on gains under what is called a &#8220;real property gains tax&#8221;. The measure was designed to cool flipping transactions in the hot Kuala Lumpur and Johor Bahru markets.</p>\n<p>&#160;</p>\n<h2><b>3. New Zealand</b></h2>\n<p></p><img class=\"wp-image-23147 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Depositphotos_48919789_original.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>One of only six &#8220;free&#8221; economies in the world <a href=\"http://www.heritage.org/index/ranking\">according to the Heritage Foundation</a> (hint: the United States is not one of them), New Zealand offers stability and independence and is a growing &#8220;safe haven&#8221; jurisdiction for assets. New Zealand does not impose a capital gains tax on the sale of equities or other investments. It does have a formal law stating that real estate purchased for the express purpose of resale can be made subject to capital gains taxes, however, this law is rarely enforced. The Labour Party proposed a fresh tax on capital gains several years ago, only to see their worst election returns in years.</p>\n<p>&#160;</p>\n<h2><b>2. Belize</b></h2>\n<p></p><img class=\"wp-image-23149 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/belize-cay-caulker-ambergris-central-america-island-3.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Located not so far from the tourist-filled beaches of Cancun and the Yucatan Peninsula, Belize has been an expat-friendly haven for decades. Formerly known as British Honduras, the country has made itself one of the more attractive places for expats with cash. Considering Belize is a small, independent, <a href=\"http://nomadcapitalist.com/2015/03/06/expat-countries-that-speak-english-language/\">English-speaking country</a>, it&#8217;s no surprise so many expats would flock there. The country is also considering making its Qualified Resident Program easier to apply to in hopes of competing with <a href=\"http://nomadcapitalist.com/2014/03/09/top-5-best-second-residency-programs-central-south-america/\">second residency options </a>in other Central American countries. The fact that Belize boasts zero capital gains taxes for residents or non-residents alike doesn&#8217;t hurt its appeal, either.</p>\n<p>&#160;</p>\n<h2><b>1. Hong Kong</b></h2>\n<p></p><img class=\"wp-image-23150 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Depositphotos_3683015_original.jpg\" alt=\"countries with no capital gains taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>The freest economy in the world for years now, Hong Kong is one of the best places on earth for investors. And the Special Administrative Region of China is a bastion of expats, with bankers and professionals from all over the world. Go to any view bar on a Wednesday night and you&#8217;re more likely to run into someone from Long Island than Hainan Island. As part of its tradition of respect for capital, Hong Kong does not tax capital gains.</p>\n<p>The exception are shares issued to employees as part of a pay package; these are taxed at the city&#8217;s flat income tax rate. The potential issue with this is expats who leave before receiving all proceeds from their shares will likely owe tax in two countries, as Hong Kong has few dual taxation treaties. Unrestricted shares and options are, however, free from capital gains taxes.</p>\n<p>&#160;</p>\n<h2><b>Conclusion</b></h2>\n<p>&#160;</p>\n<p>The goal with this list is to get a bird&#8217;s eye view of where around the world &#8212; in many different kinds of countries &#8212; you might choose to invest your efforts to avoid paying unnecessary tax on capital gains. We believe strongly that opportunity comes in many forms. Countries that may surprise you appear on this list &#8212; offering incentives for high-achieving entrepreneurs like you who want to be smart in internationalizing. If you want to learn more about building your nomad strategy, go here and <a href=\"http://workwithnomad.com\">apply</a> today. </p>\n</div>","title":"9 Expat-Friendly Countries with No Capital Gains Taxes"}},"pageContext":{"id":"5b92397687be0583cfde6808"}}