{"data":{"mongodbDatabaseArticles":{"id":"5b95ef5087be05832749010f","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">A Tour of Bumrungrad International Hospital in Bangkok</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-13816\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Tour-of-Bumrungrad-International-Hospital-Header-1000px.jpg?resize=1000%2C600&amp;ssl=1\" alt=\"Tour of Bumrungrad International Hospital\" width=\"1000\" height=\"600\"></p>\n<p>Aside from a few drop-ins at a local clinic and a late night semi-emergency visit to the veterinarian for our cat, we&#8217;ve never had to step foot in a hospital in Thailand. But that doesn&#8217;t mean we&#8217;re not curious to know what would happen&#160;if we seriously needed to see a doctor. So when we were invited on a tour of Bumrungrad International Hospital in Bangkok, which is considered one of the best hospitals in all of Southeast Asia, we couldn&#8217;t turn it down.</p>\n<p><strong></strong></p>\n<p>Healthcare wasn&#8217;t a major determining factor for us when we decided to move to Thailand, but <strong>many prospective expats want to know how well the&#160;medical system abroad&#160;compares to that of their home country.</strong></p>\n<p>Admittedly&#160;medical&#160;standards do vary wildly in Thailand. There are some places that will cause some raised eyebrows. On the flip side there are also destination hospitals that meet Western standards, if not exceed them. After our tour of Bumrungrad International Hospital (pronounced buhm-run-grahd), we&#8217;re pretty sure this is a&#160;place where all of our medical dreams can&#160;come true.</p>\n<p><img class=\"aligncenter size-full wp-image-13817\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Ground-Floor-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital Ground Floor\" width=\"1000\" height=\"550\"></p>\n<p>Bumrungrad is unlike any hospital or clinic we&#8217;ve been to in America. Mind you that we once lived near Washington D.C., so we weren&#8217;t going to&#160;some potentially underfunded clinic in the boonies. Goodbye to&#160;the harsh antiseptic smells, sterile hallways, and unflattering fluorescent lighting and hello to wall paintings, plush lounge areas, and attentive&#160;services.</p>\n<p>Wait a minute, did we just step into a hospital or is this a high-end hotel?</p>\n<h2><p id=\"Patient_Services\"><p>Patient Services</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-13818\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-New-Patient-Registration-Center-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital10th Floor Sky Lobby New Patient Registration Center\" width=\"1000\" height=\"550\"></p>\n<p>After confirming that we were indeed in a hospital, we headed up to the <strong>10th floor Sky Lobby Patient Registration Center in the Bumrungrad International Clinic (BIC) building.</strong> This is where the magic begins for every prospective patient.</p>\n<p>There we were greeted by medical coordinators who are responsible for registering new patients and giving them a hospital card before setting up an appointment.</p>\n\n\n\n<strong><p>TIP:&#160;</p></strong>&#160;Bring your passport when registering at the hospital and your hospital card (given to all registered patients) for each subsequent visit. It&#8217;s not required that you have a referral from your&#160;primary care physician to be seen by a specialist at Bumrungrad.\n\n\n\n<p>If you need to be seen right away, a medical coordinator will direct you to the clinic or&#160;wellness center best for you based on your symptoms.&#160;Doctors accept&#160;walk-ins during clinic hours (9am to 5:30pm) while the 15th floor General Medicine Clinic accepts walk-ins until 8pm. Otherwise, <a href=\"https://www.bumrungrad.com/en/contact-us/request-an-appointment\">making an appointment</a> is encouraged&#160;to avoid waiting.</p>\n<p>Here&#8217;s something totally worth mentioning: as an expat or otherwise foreign patient, dealing with visas and traveling arrangements is part of the not-so-fun responsibilities&#160;when getting medical care overseas. Just around the corner of the 10th floor Sky Lobby Patient Registration Center is their&#160;<strong>Business Center that offers help with traveling and medical visa arrangements for inpatients if needed</strong>.</p>\n<p><img class=\"aligncenter size-full wp-image-13819\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Business-Center-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital Business Center offering visa and travel support for patients\" width=\"1000\" height=\"550\"></p>\n<p>For example, representatives can&#160;help you get to and from your hotel and even offer you tours of Bangkok while you recover from treatment. They can also&#160;extend your visa during your recovery period if needed and any accompanying spouse&#8217;s or companion&#8217;s visa, too.</p>\n<p>How incredibly convenient! This is not something we would&#8217;ve worried about if we were receiving medical treatment in our home country, but that&#8217;s the type of above and beyond customer care and service that can really make a world of a difference for foreign patients.</p>\n<h2><p id=\"Designed_for_Efficiency\"><p>Designed for Efficiency</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-13820\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Supply-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital Central Supply\" width=\"1000\" height=\"550\"></p>\n<p>We are advocates of efficiency, so when Bumrungrad mentioned a centralized lab, a database for assisting in personalized cancer treatments, and a&#160;robotic pharmacist, and they got an A+ in our books.</p>\n<p>For starters, <strong>Bumrungrad does in-house lab testing.</strong> None of this &#8220;Let me send every&#160;blood sample, biopsy, and MRI scan to a third-party lab that will take weeks to get results.&#8221; Instead, almost all&#160;are done at the hospital&#160;and the testing is completed and results are returned in less than an hour. There are a few tests that are sent away, but if that happens&#160;you&#8217;ll be told when to expect the&#160;results, which are delivered by email or can be picked up in person.</p>\n<p>Then we went on to witness their pneumatic tube transport network in action, which transfers specimens from the different clinics and centers on&#160;all floors of the hospital to the centralized lab for testing. You know, the same pressure-dropping tubes used at banks when you&#8217;re depositing and withdrawing cash?&#160;Samples zip right to the lab and technicians start testing immediately.</p>\n<p><strong>Bumrungrad&#160;also uses a cognitive computer technology known as &#8220;Watson for Oncology.&#8221;</strong> It&#8217;s a massive database used by oncologists that takes into account a&#160;cancer patient&#8217;s symptoms and combines that with information from medical literature and the knowledge and experience from medical experts before providing a specialized treatment. This is the first of its kind and a huge leap forward for cancer patient care.</p>\n<p>Further down the line is a pill dispensary system that is done by a robot. Inpatients&#8217; meds are ordered by a doctor but then the task of dispensing and packaging them in single-use dosages are done so by a fully automated drug management system dubbed &#8220;Pharmacy Robot.&#8221; <strong>This robot&#160;also triple-checks drug interactions and dosages before popping everything into little plastic baggies to be later picked up by a nurse and administered to patients.</strong> This frees up the pharmacists to do more important tasks and patients know they are always getting the right medications.</p>\n<p><img class=\"aligncenter size-full wp-image-13821\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Pharmacy-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital Pharmacy\" width=\"1000\" height=\"550\"></p>\n<p>And about medications, when a doctor hands over&#160;a prescription, you don&#8217;t have to go to a&#160;third-party pharmacy after leaving the hospital. You can go directly to any of the pharmacies (one on each floor) and get your prescription filled right then and there before leaving the hospital.</p>\n<p>This is not to say American or European hospitals don&#8217;t have on-site pharmacies because they do. But what about all the medication that your dentists, dermatologists, and ophthalmologists prescribe? Do these physicians have their own pharmacies on hand to give you your medication before&#160;you leave their offices? Nope, at least not from any of our experiences back home.</p>\n<p>Which leads us to our next point&#8230;</p>\n<h2><p id=\"Treatments_and_Centers\"><p>Treatments and Centers</p></p></h2>\n<img class=\"wp-image-13823 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Waiting-Rooms-1000px.jpg?resize=1000%2C551&amp;ssl=1\" alt=\"Bumrungrad International Hospital Waiting Rooms\" width=\"1000\" height=\"551\"><p>What we found interesting was<strong> the incredible variety of services Bumrungrad offers under one roof.</strong> When we think hospitals we usually think of having babies, getting a bone set after a car accident, and open heart surgery. But Bumrungrad also has dermatologists, dentists, and&#160;allergists all in one place.&#160;In fact, Bumrungrad has over <a href=\"https://www.bumrungrad.com/en/clinics-and-centers\" target=\"_blank\">36 different medical centers and programs</a> ranging from nutritional consulting and pediatric care to fertility treatments to evaluating sleep quality. There is no need to drive from one part of town to another when you need treatment because it&#8217;s all in one spot.</p>\n<p>Even with all these services, <strong>Bumrungrad is best known for its tertiary care. </strong>Doctors are trained in very&#160;complex procedures or treatments and use very specialized equipment.&#160;This is especially so in the following medical centers, which can be remembered by the acronym CONGO:</p>\n<p><strong>C</strong>ardiology (heart)<br>\n<strong>O</strong>ncology (cancer)<br>\n<strong>N</strong>eurology (nervous system)/Neonatal (infants)<br>\n<strong>G</strong>I (digestive disease)<br>\n<strong>O</strong>rthopedics (bones, muscles, ligaments)/Optometry (eyes)</p>\n<h2><p id=\"SurPassing_the_Bar_on_Western_Standards\"><p> (Sur)Passing the Bar on Western Standards</p></p></h2>\n<img class=\"size-full wp-image-13824\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Surgery-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital Surgery Room\" width=\"1000\" height=\"550\"><p>We learned that<strong> Bumrungrad is the first hospital in the entire continent of Asia to become Joint Commission International (JCI) accredited. </strong>It&#8217;s seen as the golden stamp of approval for anyone looking for overseas medical treatment.&#160;So although the hospital is in Thailand, it meets American medical and building safety standards with flying colors.</p>\n<p>Of the 1200+ doctors and 900+ nurses employed at Bumrungrad, many have either earned their doctorate or conducted their post-graduate training overseas and are now practicing back in Thailand. Rest assured the expertise&#160;is there.</p>\n<p>The medical staff also speaks both&#160;Thai and English. In the event that neither is your native language, Bumrungrad has 150 interpreters on duty for 25 different languages. These interpreters&#160;have medical backgrounds and are trained in medical terminology and conditions and help in translating what the doctors say.</p>\n<h2><p id=\"Competitive_Medical_Costs\"><p>Competitive Medical Costs</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-13826\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Emergency-1000px.jpg?resize=1000%2C440&amp;ssl=1\" alt=\"Bumrungrad International Hospital Emergency\" width=\"1000\" height=\"440\"></p>\n<p>A sore area for many patients is the cost of medical care. <strong>Even though Bumrungrad emphasizes top-rate quality over pricing, they are still able to offer their medical services&#160;at affordable rates.</strong></p>\n<p>Not only do medical procedures often cost less in Thailand than in the bureaucratic-filled Western hospitals, Bumrungrad does not impose&#160;the much-feared&#160;<a href=\"https://www.tielandtothailand.com/thai-dual-price-system/\" target=\"_blank\">dual pricing system</a>. As a matter of fact,&#160;prices are the same for both Thai citizens&#160;and foreign patients. We were also told that prices are also consistent whether you are paying through an insurance plan versus&#160;out-of-pocket.</p>\n<p>It was refreshing to learn that payment is expected&#160;on the way out the&#160;door and the process isn&#8217;t dragged out through claims.</p>\n<p>What really got our attention is that&#160;<strong>Bumrungrad posts medical costs online so you can price compare. </strong>That&#8217;s&#160;practically unheard of in the US, but you can get <a href=\"https://www.bumrungrad.com/en/realcost-thailand-surgery/procedures-surgery-cost-pricing\" target=\"_blank\">real cost estimates</a>&#160;for common medical procedures before stepping foot into their&#160;facility.</p>\n<h2><p id=\"Schedule_a_Tour_of_Bumrungrad_International_Hospital\"><p>Schedule a Tour of Bumrungrad International Hospital</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-13827\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Bumrungrad-International-Hospital-Interior-Floors-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Bumrungrad International Hospital Interior Floors\" width=\"1000\" height=\"550\"></p>\n<p>Anyone can take a free tour of Bumrungrad International Hospital. If you&#8217;re interested in seeing their facilities firsthand, go to the Customer Service Desk on the ground floor of the BIC building or call the service desk at the number below, particularly for large groups.</p>\n<p><strong>International Phone Number: </strong>+66 2 667 1555<br>\n<strong>Domestic Phone Number: </strong> 02 667 1555<br>\n<strong>Email: </strong><a href=\"/cdn-cgi/l/email-protection#f39a9d959cb391869e81869d94819297dd909c9e\" target=\"_blank\">[email&#160;protected]</a><br>\n<strong>24 hr Front Desk Hours:</strong> 8:30 AM to 6 PM (Main Hours)</p>\n<p>And lastly, although Bumrungrad International Hospital is in the heart of Bangkok, <strong>it&#8217;s easily accessible by both private and public transportation.</strong> It&#8217;s at the crossroads of two major expressways and there is&#160;a&#160;parking garage available if you decide to take your own vehicle.</p>\n<p>Free shuttles also make the short trip between the hospital and the Nana Station of the BTS (known also as the Sky Train) and there are also shuttles from the&#160;Don Mueang and Suvarnabhumi International Airports to the hospital, both less than 30 kms away.</p>\n<p>Hopefully our tour of Bumrungrad International Hospital sheds some light on the quality&#160;and type of treatments available in Thailand. It certainly put our worries to rest knowing that we can&#160;have almost any procedure imaginable taken care of here. What are your thoughts?</p>\n<p>&#8595;&#160;PIN THIS POST FOR LATER&#160;&#160;&#8595;</p>\n<p><img class=\"aligncenter size-full wp-image-14356\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/09/Tour-of-Bumrungrad-International-Hospital.png?resize=456%2C670&amp;ssl=1\" alt=\"Tour of Bumrungrad International Hospital, one of the best hospitals in all of SE Asia | Tieland to Thailand\" width=\"456\" height=\"670\"></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"A Tour of Bumrungrad International Hospital in Bangkok"}},"pageContext":{"id":"5b95ef5087be05832749010f"}}