{"data":{"mongodbDatabaseArticles":{"id":"5b9624d287be058327490f19","content":"<div><p><em><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/grabbing-money1.jpg\" alt=\"grabbing money\" width=\"295\" height=\"199\">This is a guest post by Kim Kinrade, a novel writer with four publications to his credit. He also writes the blog <a href=\"http://www.traveltonovascotia.com\">Travel To Nova Scotia</a> and enjoys showing visitors around Nova Scotia. When not on the road he enjoys renovating his Victorian farmhouse.</em></p>\n<p>The onslaught of &#224; la carte fees by the airlines is another in a growing number of reasons of why the airline industry needs to be run like a public utility. Air travel, like the failed Wall Street and the European banking communities, is too important to be run by CEO&#8217;s and their minions. As a result we have a $439USD advertised flight that, with added fees, ends up being almost $700. In fact, two weeks ago, BusinessWeek featured a cover story entitled: &#8220;<a href=\"http://www.businessweek.com/lifestyle/travelers_check/archives/2009/09/airline_fees_ar.html\">Airline Fees are Big Money; a Whopping 345% Jump</a>.&#8221;</p>\n<p>This week, with the three biggest American holidays just around the corner, the largest airlines in the U.S. &#8211; United, Delta and American &#8211; announced they are adding a $10 &#8220;Holiday Fee.&#8221;&#160; This means that from the last week in November until the week after New Year&#8217;s they can gouge and extra $10. Now this may not seem like a lot but let&#8217;s take stock of what is happening. You not only get the thrill of long line-ups and flight delays you have the opportunity of paying for the privilege. Here are some more fees:</p>\n<p><strong>1. Baggage Fees</strong></p>\n<p>There has always been an overweight charge for luggage on most airlines but now they are getting creative. For example, on American Airlines, passengers flying within the U.S. pay $20 USD for their first checked bag and $30 for the next one.</p>\n<p><strong>2. Meals</strong></p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/coke-and-pringles-on-a-plane1.jpg\" alt=\"coke and pringles on a plane\" width=\"381\" height=\"238\">Airline food was never great but it wasn&#8217;t bad either. You could always be assured that a morning flight would get you coffee and an omelet. Now, if you&#8217;re running late you don&#8217;t have time to stand in a lie-up at an overpriced, airport, fast-food place. In fact, selling meals becoming a shameless money-maker. Of course Goldfish are still free on most airlines.</p>\n<p><strong>3. Counter Services</strong></p>\n<p>Airline managers and employees don&#8217;t want to meet you. In fact, I don&#8217;t think they like people. So, many carriers are going to be adding surcharges for the privilege of seeing you face-to-face but electronic ticketing will be &#8220;free.&#8221;</p>\n<p><strong>4. Movies</strong></p>\n<p>Another bit of fun used to be the in-flight movie. The sound was bad and you either saw the movie from a distance or, if it was beside you, you had to crane your neck to see the monitor. Now, they have LCD screens directly in front of you and charge video prices plus the cost of the headphones to watch them. If you can read lips the movies on most airlines are still free &#8211; but not for long.</p>\n<p><strong>5. Drinks</strong></p>\n<p>I don&#8217;t drink alcoholic beverages on airliners anymore. This is because I&#8217;m older and don&#8217;t like to spend the first two days of my holiday getting over jet lag. Actually, I stopped around the time when some airlines (like Air New Zealand) were still handing out free beer. Now if I wanted a glass of wine it would be at well-above restaurant prices. (I believe coffee and water are still &#8220;free.&#8221;) They say it helps reduce &#8220;drunkenness&#8221; however some passengers will always find the coin to get drunk and be obnoxious.</p>\n<p><strong>6. Seat Selection</strong></p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/two-people-sleeping-on-plane1.jpg\" alt=\"two people sleeping on a plane\" width=\"367\" height=\"275\">This is a real kicker! No more first-come-first-served. You pay between $6 and $20USD for the seats with extra legroom or, for the nervous types, beside an exit.</p>\n<p><strong>7. Pillows and Blankets</strong></p>\n<p>I never use pillows or blankets on a plane. My coat is good enough. For those who still like the feel of course, artificial weave next to their skin can count on $5.</p>\n<p><strong>8. Wi-Fi</strong></p>\n<p>Satellite time is expensive. So, charging for Wi-Fi should make sense, right? However, the airline is already paying for it for their own purposes. Now the passengers pay for services the airlines already have to buy.</p>\n<p>American air carriers, like other commercial interests, have always been engaged in a &#8220;winner take all&#8221; scenario. The way they seem to gobble each other up in hostile take-overs reminds me of a small python swallowing a boar. This is how they first got into trouble. So they can use 9-11 or big gas prices as excuses for their gluttony but the spike in fuel and the shadow of 9-11 only lasted a year each. For the rest of those tens years they made money. And now with sky-shopping &#8211; a service of online shopping on onboard &#8211; passengers buy everything from duty-free liquor to T-shirts at boutique prices.</p>\n<p>In other words every seat is a profit center &#8211; and still the fees go on.</p>\n<p>[photo by: <a href=\"https://www.flickr.com/photos/calliope/\">Muffet</a>, <a href=\"https://www.flickr.com/photos/ensee/\">en_see89</a>, <a href=\"https://www.flickr.com/photos/iiiii/\">r5d4</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Airline Feeding Frenzy"}},"pageContext":{"id":"5b9624d287be058327490f19"}}