{"data":{"mongodbDatabaseArticles":{"id":"5b95eac487be05832748ffcf","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/keepingthespark.jpg\" alt=\"a couple watching the sunset\">Posted: 07/28/2011 | July 28th, 2011</p><p>This is a guest post by Ant, one half of Positive World Travel.</p><p>When <a href=\"https://www.nomadicmatt.com/travel-blogs/the-joy-of-traveling-as-a-couple/\">traveling the world as a couple</a>, there can come a time when your relationship &#8220;spark&#8221; loses some its brightness. While exploring new cultures and racing around the world, it&#8216;s easy for your relationship to fall to the wayside or end up in a rut.</p><p>I&#8217;m talking from experience. Our relationship has become boring and mundane a few times, but we&#8216;ve found many ways to keep igniting the flame over and over again. The important thing is to try and keep your relationship as fresh and as exciting as the countries you&#8216;re visiting.</p><p>Here are a few ways Elise and I have found to keep our relationship interesting:</p><p><strong>Date night</strong><br> As corny as it might sound, going out on an actual &#8220;date&#8221; can do wonders for your relationship. It can get monotonous sightseeing, eating cheap meals, or cooking your own food day in and day out, so making time for a special night can be something to look forward to. Elise and I plan a date night every two weeks. We spend a little extra money, go to a nice restaurant, and dress up as best we can. We spend that night not talking about our website or what we did that day but rather talking with one another, putting our dream caps on, and playing the &#8220;what if&#8221; game.</p><p>Elise loves to chat about our eventual wedding, and even though it can drive me crazy at times (I never knew you could talk so much about floral arrangements!), date nights are a great way to share and chat about her &#8212; err, I mean our &#8212; dream wedding. Date nights let you listen and reconnect with one another outside the traveling experience.</p><p><strong>Be spontaneous</strong><br> Traveling as a couple can take its toll on each of you, and this tip is one of our key ingredients to success. Elise likes our travels to be somewhat planned, and I try and mix things up and be spontaneous, which keeps her thinking because she doesn&#8216;t know what I have planned next.</p><p>If you have extra time in the city you&#8216;re in, head out for the day and just act on a whim. Do activities you hadn&#8217;t considered before and try romantic dates like having&#160;massages, seeing a movie, or going bowling. Traveling doesn&#8216;t always have to be about sightseeing, and you can spend time doing the normal things you did back home, too.</p><p><strong>Celebrations</strong><br> <img src=\"https://media.nomadicmatt.com/relationshipspark2.jpg\" alt=\"celebrating a birthday while traveling\"><br> Even while traveling, celebrating birthdays and anniversaries is important to any relationship. It doesn&#8217;t matter if you&#8216;re in the middle of nowhere, because the fact that you&#8216;ll go to a little extra effort and get creative will always make your partner happy.</p><p>Once when we were camping, it was Elise&#8217;s birthday and we were far from any nice restaurants. So, the morning of her birthday, I woke up early to blow up 23 balloons and then gently placed them throughout our tent. I woke her up to an out-of-tune singing birthday candle and a dry piece of cake I found at a corner store the day before. She was delighted that I had gone to the trouble of making her birthday a little special even though we were camping. We spent the rest of the day at a deserted beach, and Elise says that it was one of her best birthdays ever.</p><p><strong>Surprises</strong><br> Even though you&#8216;re traveling together and you may be on a limited budget, a surprise every now and again will always excite your better half. Elise knows that I&#8216;m a sucker for dark chocolate, and I always get excited when she&#8216;s been out to run some errands and jumps on the bed with both hands behind her back when she gets home. I love that she thinks of me while she&#8216;s out. It brings joy to our relationship.</p><p><strong>Face your fears</strong><br> Doing activities that one or both of you have a fear of can bring you together and bond you. Sharing a fear and overcoming it will definitely bring the spark back and a sense of achievement for you both.</p><p>Elise has a small fear of heights, and she has regularly pushed herself to confront this fear over the past 18 months. She has jumped out of planes and off cliffs into fast-flowing rivers. Each time she faces this fear I get so proud of her and it deepens my love for her.</p><p>Supporting your partner and giving them the encouragement they need to face their fears or overcoming them together is an instant bonding moment shared between the two of you and only strengthens your relationship.</p><p><strong>Getting intimate</strong><br> <img src=\"https://media.nomadicmatt.com/relationshipspark3.jpg\" alt=\"Female getting a romantic massage overseas\"><br> It has to be noted that sex is an important part of every relationship, and when you&#8217;re not having any, you&#8216;re bound to be fighting more. Traveling in dirty environments and staying in shared accommodation can be a dampener to sexual relations. Finding time for a romp when there are train schedules to work out, long and sweaty bus rides to take, or a day battling annoying touts can be difficult.</p><p>Spending a little extra money from time to time and staying in a private room is the best way to find some alone time, as <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-have-sex-in-hostels/\">having sex in hostels</a> can be quite tricky otherwise. Elise and I do this from time to time to make sure we can have intimate moments together.</p><p>Even couples that have been together for years and years all need to take time out every now and again to make sure the spark is still there. The most important tip is to work out what works for you as a couple. Elise and I always make sure we not only have time for long-term travel and all that entails but also for making our relationship work on the road and keeping the spark alive.</p><p>Ant is one half of the dynamic duo at Positive World Travel. Both are writing about their experiences and thoughts on what long-term travel is like as a couple. You can also follow them on <a href=\"http://www.facebook.com/positiveworldtravel\">Facebook</a> for more of their travel updates.</p></div>","title":"Keeping the Relationship Spark Alive on the Road"}},"pageContext":{"id":"5b95eac487be05832748ffcf"}}