{"data":{"mongodbDatabaseArticles":{"id":"5b937ad587be056953db7cd8","content":"<div><p name=\"76dd\" id=\"76dd\" class=\"graf graf--p graf--leading\">When I look up from my notebook I see a sparkling, turquoise ocean ahead of me. The small curved bay is surrounded by brown hills that are covered with large cacti. The birds are holding a song contest and almost every day an iguana sits down in a tree to my left, at what seems to be his favorite spot, and watches me with his big eyes.</p><p name=\"a23a\" id=\"a23a\" class=\"graf graf--p graf-after--p\">I&#8217;m currently working on the conference program for the first <a href=\"http://www.dnxglobal.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Digital Nomad Conference&#8202;&#8212;&#8202;DNX GLOBAL</a> aimed at helping people to start working and living location independent. My girlfriend Felicia and me founded that event after being overruned by the rising demand for infos on the Digital Nomad lifestyle.</p><p name=\"186e\" id=\"186e\" class=\"graf graf--p graf-after--p\">I&#8217;m not sitting on the beach, but almost. My workplace for the next few weeks is a large, shaded and quiet roof terrace complete with electricity and wireless internet. Sometimes I forget that I&#8217;m in the small fishing village Taganga on the Caribbean coast of Colombia. It&#8217;s almost 90 degrees Fahrenheit and beside me there&#8217;s a cool, refreshing fruit shake.</p><p name=\"829e\" id=\"829e\" class=\"graf graf--p graf-after--p\">For a moment, my thoughts wander back in time to when I was still working as an employee in various internet startup companies in Berlin; when I was expected to show up at the same time almost every day of the week at the same old workplace.</p><p name=\"c42a\" id=\"c42a\" class=\"graf graf--p graf-after--p\">Even then I always found it exciting to work-on-the-go every now and again. What do you need a fixed workplace for anyway nowadays? The internet is changing our lives in all areas. Relatives, friends, colleagues or business partners are now only one click away thanks to digital networking.</p><h3 name=\"f143\" id=\"f143\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Not doable? Today I know&#160;better.</strong></h3><p name=\"5005\" id=\"5005\" class=\"graf graf--p graf-after--h3\">I left what would be a secure job as head of marketing to start from scratch as an independent entrepreneur; letting go of a high monthly salary, car, flat-screen TV and a modern apartment in central Berlin.</p><p name=\"cf98\" id=\"cf98\" class=\"graf graf--p graf-after--p\">For 3 years <a href=\"http://www.marcusmeurer.de/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">I</a> have been traveling the world as a digital nomad with my girlfriend <a href=\"http://www.feliciahargarten.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Felicia</a>, able to live from my business. Never before have I learned as much as during this time. Not in school, not in college and not in my professional life.</p><p name=\"b78a\" id=\"b78a\" class=\"graf graf--p graf-after--p\">Every morning I wake up full of energy and look forward to my work, knowing that I can make a difference as entrepreneur.</p><p name=\"8c8e\" id=\"8c8e\" class=\"graf graf--p graf-after--p\">The personal learning curve on the path to independence is enormous and traveling changes a conservative way of thinking.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*qbnK_ApYkIfvXyXYOrFogw.jpeg\">Working on the island Kuta Lombok, Indonesia<h3 name=\"c93f\" id=\"c93f\" class=\"graf graf--h3 graf-after--figure\"><strong class=\"markup--strong markup--h3-strong\">5 Lessons I&#8217;ve Learned as a Digital Nomad In More Than 20 Countries.</strong></h3><h4 name=\"437d\" id=\"437d\" class=\"graf graf--h4 graf-after--h3\"><strong class=\"markup--strong markup--h4-strong\">1. Give and&#160;Share!</strong></h4><p name=\"f92b\" id=\"f92b\" class=\"graf graf--p graf-after--h4\">I&#8217;ve met people in the fishing village of El Nido in the Philippines, in Tanzania, in Guatemala, Myanmar and other regions who had few possessions</p><p name=\"eefa\" id=\"eefa\" class=\"graf graf--p graf-after--p\">All of the people had one thing in common: They smiled more and were gladly willing to share with me what little they had.</p><p name=\"6e4f\" id=\"6e4f\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Lesson learned: </strong>Share your knowledge with other people. Be a source of knowledge: Only when knowledge and experiences are shared, will it help others to grow faster and not repeat the same mistakes.</p><p name=\"15f2\" id=\"15f2\" class=\"graf graf--p graf-after--p\">Sharing your knowledge without anything in return is rather unpopular in most countries. If you do it anyway you&#8217;ll get all the more positive reactions.</p><p name=\"788f\" id=\"788f\" class=\"graf graf--p graf-after--p\">The more you give without expecting anything in return, the more you will get back over time. You and your business grow through the seeds that you sow.</p><p name=\"4e5c\" id=\"4e5c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Rule of thumb: Give 3 x more than you take</strong></p><h4 name=\"9636\" id=\"9636\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">2. Traveling helps with decision&#160;making!</strong></h4><p name=\"b953\" id=\"b953\" class=\"graf graf--p graf-after--h4\">Those who travel off the beaten tourist paths as a digital nomad are expanding their intellectual horizon: You will meet different people, get to know new cultures and customs.</p><p name=\"a352\" id=\"a352\" class=\"graf graf--p graf-after--p\">You might not speak the language or understand the questions, but you can communicate using your hands and feet to receive the help you need. You&#8217;re also learning to trust strangers and give up control.</p><p name=\"0d74\" id=\"0d74\" class=\"graf graf--p graf-after--p\">For this you have to leave your &#8220;comfort zone&#8221; and the micro cosmos or bubble you&#8217;ve been raised in. If you master the situation, it makes you more confident and you personally grow from the new experience.</p><p name=\"193a\" id=\"193a\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Lesson learned: </strong>This confidence doesn&#8217;t stop when you return to your &#8220;old&#8220; world and continues to make you more calm. If you can fight your way through unfamiliar territory, the challenges you face at home will look small. Difficult times no longer scare you.</p><p name=\"9db1\" id=\"9db1\" class=\"graf graf--p graf-after--p\">You trust your experiences and gut feeling and have the courage to make unpopular decisions.</p><p name=\"2efe\" id=\"2efe\" class=\"graf graf--p graf-after--p\">Being able to make clear decisions and implementing them will turbo-charge your business.</p><h4 name=\"4a82\" id=\"4a82\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">3. Listen!</strong></h4><p name=\"1027\" id=\"1027\" class=\"graf graf--p graf-after--h4\">I&#8217;ve met hundreds of exciting people during my travels and just listened. Other cultures, nonconformist views and wacky visions helped me realize how small my own world is.</p><p name=\"bebe\" id=\"bebe\" class=\"graf graf--p graf-after--p\">The fire in the eyes of a Philippine, who is watching the rising sun on a fishing boat with me, sharing his perspective on the world, is contagious.</p><p name=\"ee14\" id=\"ee14\" class=\"graf graf--p graf-after--p\">Back home, this fire gives you the strength to make your way professionally as well as personally despite or maybe even because of the naysayers. Remember, everything is possible!</p><p name=\"4412\" id=\"4412\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Lesson learned: </strong>Interact with other people as much as possible. Listen attentively, keep an open mind and allow for second opinions. This also applies to your business: Feedback is the key to success. Listen to your fans and customers. Solve problems and create solutions together with your customers.</p><h4 name=\"9712\" id=\"9712\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">4. Enjoy the&#160;ride</strong></h4><p name=\"284c\" id=\"284c\" class=\"graf graf--p graf-after--h4\">You don&#8217;t travel to check off your bucket list or to visit as many countries as possible. The journey is the reward. The experiences and what you learn while traveling make you stronger and let you grow.</p><p name=\"d7b4\" id=\"d7b4\" class=\"graf graf--p graf-after--p\">You never stop learning, life is a never-ending process. Every day and each moment is a new opportunity to steer you life into a new direction.</p><p name=\"ab41\" id=\"ab41\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Lesson learned: </strong>As a digital nomad and entrepreneur you&#8217;re continuously working on your own personal growth and business.</p><p name=\"9ce9\" id=\"9ce9\" class=\"graf graf--p graf-after--p\">You rise to the challenges: With every decision you make your knowledge increases. The goal is not to get somewhere by a certain point, but rather to enjoy the ride.</p><p name=\"513b\" id=\"513b\" class=\"graf graf--p graf-after--p\">In my opinion it&#8217;s the daily challenges that make entrepreneurship so exciting and not the goal of achieving X thousand Dollars within the shortest possible time.</p><h4 name=\"057f\" id=\"057f\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">5. Focus is important</strong></h4><p name=\"47a9\" id=\"47a9\" class=\"graf graf--p graf-after--h4\">Whether Columbia, Italy, Belize, the Philippines or Honduras&#8202;&#8212;&#8202;I&#8217;ve made the most important decisions for my business while on the road and was thereby even more productive than at my home base in Berlin.</p><p name=\"c5cd\" id=\"c5cd\" class=\"graf graf--p graf-after--p\">As a digital nomad you&#8217;re not on vacation but you&#8217;ve shifted the focal point of your life to other places in the world.</p><p name=\"0f0e\" id=\"0f0e\" class=\"graf graf--p graf-after--p\">You don&#8217;t use the internet as a distraction or pastime, but rather to create sustainable projects and values.</p><p name=\"69d6\" id=\"69d6\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Lesson learned: </strong>As an entrepreneur I suffer from shiny object syndrome: You constantly see new opportunities and ideas you want to implement.</p><p name=\"21d7\" id=\"21d7\" class=\"graf graf--p graf-after--p\">Focus is important to follow your vision and subordinate everything to this task. A new environment and new input make you more creative.</p><p name=\"770b\" id=\"770b\" class=\"graf graf--p graf-after--p\">As a digital nomad you&#8217;re constantly at new and cool places&#8202;&#8212;&#8202;you&#8217;re not constantly going to sit in front of a computer, because the environment is just way too exciting.</p><p name=\"3494\" id=\"3494\" class=\"graf graf--p graf-after--p\">However, you will start using the time that you do have available for your business with all the more focus and concentration.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*h8yYB6ibnpfNel94VSyJSA.jpeg\">Working at Coworking Camp &#8220;Surf Office&#8221; Gran&#160;Canaria<h3 name=\"e9ea\" id=\"e9ea\" class=\"graf graf--h3 graf-after--figure\"><strong class=\"markup--strong markup--h3-strong\">Conclusion after traveling to more than 20 countries as a digital&#160;nomad</strong></h3><p name=\"6336\" id=\"6336\" class=\"graf graf--p graf-after--h3\">Have you yourself made similar experiences?</p><p name=\"8bff\" id=\"8bff\" class=\"graf graf--p graf-after--p\">If not, I can only recommend you give the digital nomad lifestyle a try.</p><p name=\"fcdc\" id=\"fcdc\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Living and working as a digital nomad will lift you and your business to a whole new level.</strong></p><p name=\"3b7a\" id=\"3b7a\" class=\"graf graf--p graf-after--p\">If you want to find out more about living a location-independent lifestyle, I highly recommend you check out the <a href=\"http://www.dnxglobal.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">DNX GLOBAL &#9733; Digital Nomad Conference in Berlin</a>.</p><p name=\"e98e\" id=\"e98e\" class=\"graf graf--p graf-after--p\">At this event you&#8217;ll be able to exchange ideas with interesting like-minded people and receive tips for getting started as a digital nomad.</p><p name=\"6eac\" id=\"6eac\" class=\"graf graf--p graf-after--p graf--trailing\"><a href=\"https://medium.com/@marcusmeurer/digital-nomad-backpack-958cea70cf27\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Check out my digital gadgets on the road.</strong></a><strong class=\"markup--strong markup--p-strong\"> If you like my content please click the [</strong>&#9825; <strong class=\"markup--strong markup--p-strong\">recommend] button below. It would mean the world to me! THX</strong></p></div>","title":"Traveling the World as a Digital Nomad – This Publication is Moved – Medium"}},"pageContext":{"id":"5b937ad587be056953db7cd8"}}