{"data":{"mongodbDatabaseArticles":{"id":"5b9248c687be056953db7bee","content":"<div><p>Since Bitcoin is such a new currency, it is still heavily affected by media coverage surrounding it. Usually an article will hit a non-mainstream source like Hacker News or Reddit first. This then seeps through slowly into the mainstream media in the following days, resulting in a huge rise in price. Much of the money made by Bitcoin day traders is based on closely following these trends of news coverage on Bitcoin.</p> <p>A good example of this recently is: <a href=\"http://www.theguardian.com/technology/2013/oct/29/bitcoin-forgotten-currency-norway-oslo-home\">\"Man buys $27 of bitcoin, forgets about them, finds they're now worth $886k\"</a>. In the days after this article as posted, it hit every mainstream media source and days later spurred much of the rise in price from $200 to $900 in the last few weeks. But how can we spot these trends before anyone else? We need some trend data.</p> <p><a href=\"http://etc.levels.io/bitcoin-price-tweets/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"https://levels.io/wp-content/uploads/2013/11/Screen-Shot-2013-11-21-at-17.28.001.png\"></a></p> <p>Since Twitter is a good general measure for media coverage, I thought it'd be fun to put together a chart that displays the amount of Tweets about Bitcoin (from Topsy) and the price (from Bitcoin Charts). The two appear to be closely related. You can see the live <a href=\"./\">Bitcoin price vs. tweets chart</a> for yourself here (note: it's tested on Chrome on OSX, if it doesn't work, try it in incognito without extensions).</p> <p>You're obviously going to need a lot more sources to make this really useful. Including live Google searches and Facebook mentions will give you a pretty clear picture on where the price will be going (if it keeps following media coverage). With the increased interest in Bitcoin from China in the last few months, it would also be very interesting to see a chart overlaying the mentions on China's Twitter-clone Weibo over Bitcoin's price.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I predict Bitcoin’s price by tracking Twitter mentions"}},"pageContext":{"id":"5b9248c687be056953db7bee"}}