{"data":{"mongodbDatabaseArticles":{"id":"5b95ea7787be05832748ffab","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/phiphimatt11.jpg\" alt=\"tourist boats at koh phi phi\"><br> Yeah, I used the F word. That&#8217;s how much I hate Ko Phi Phi.</p><p>I was supposed to visit Ko Phi Phi in 2005, but the deadly 2004 tsunami destroyed the island. Thousands were killed and injured on the island. The entire coast was devastated, with Phi Phi one of the hardest it. It was one of the biggest natural disasters to ever hit the country. Determined to get there and wanting to contribute to the rebuilding, I made it my first stop in <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener\">Thailand</a> when I quit my job to travel the world in 2006.</p><p>Construction was all over the place, tourists were returning &#8212; some also helping rebuild &#8212; and the government was promising to make the island more sustainable. Spirits were high. Naturally, it wasn&#8217;t like the postcards. The inner beach was littered with coral swept in by the sea, but just outside town was beautiful Long Beach, an undeveloped stretch of white sand and turquoise water. I didn&#8217;t fall in love <a href=\"https://www.nomadicmatt.com/travel-blogs/ko-phi-phi/\" target=\"_blank\" rel=\"noopener\">Ko Phi Phi</a>, but I thought that if they limited development as they said, this place wouldn&#8217;t be half bad.</p><p>Fast forward two years.</p><p>I returned (twice) while living in <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\" target=\"_blank\" rel=\"noopener\">Bangkok</a> to discover that they hadn&#8217;t kept their promise: the island had become overdeveloped (again). Hotels were everywhere. Boats seemed to endlessly ring the island, ferrying an endless queue of tourists. There were bars on the beach; the little street stall food court near the dock was gone; and resorts, tourists, and loud music were inescapable. Ko Phi Phi had become an overpriced party island. Long Beach was still the only haven, but tiny guesthouses had popped up, chipping away at paradise. You could tell it wasn&#8217;t going to be too long before it was wholly consumed by the development sprawl creeping out from town.</p><p>Fast forward another two years.</p><p>Everything that was bad about the island had multiplied 10 times. Maya Bay, a location made famous by the movie <a href=\"http://amzn.to/2FdK2wv\" target=\"_blank\" rel=\"noopener\">The Beach</a>, was bursting at the seams. The island tours were filled with swim spots where you only saw dead coral. Long Beach, though still beautiful, now had resorts, and a thin layer of boat fuel coated the water.</p><p>I left disgusted.</p><p>It was crowded, dirty, filled with drunk tourists, terrible food, unfriendly locals*, and an environment destroyed by development.</p><p class=\"one\"><a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\">Download my detailed Thailand budget guidebook. <br>Just $10 will save you hundreds!</a></p><p><img src=\"https://media.nomadicmatt.com/mattphiphi3.jpg\" alt=\"a busy beach on koh phi phi\"></p><p>Fast forward to last month, when I went back to the island once again.</p><p>&#8220;I thought you hated this place,&#8221; a reader I ran into said to me. &#8220;Why are you here?&#8221;</p><p>&#8220;I&#8217;m here to update my guide. I need to see this place with fresh eyes.&#8221;</p><p>He laughed. &#8220;Mate, nothing has changed.&#8221;</p><p>He was right. It&#8217;s safe to say that the next time the guide needs updating, I won&#8217;t be checking up on Ko Phi Phi. I hated it more than ever.</p><p>Maya Bay has been destroyed even more, partially cleared to put in little huts, a snack bar, bathrooms, and even a smoking area. Trash is everywhere.</p><p>Ko Phi Phi charges 20 baht to visit (a conservation fee, they claim, though it&#8217;s obvious they are just conserving their bank balance), Long Beach has been fully developed with large resorts and hotels, music blasts throughout the island day and night, prices are high for no reason other than people will pay up, and the inner beach, still littered with coral, is now filled with bars, end to end. In the morning, there&#8217;s more trash than beach.  The water is super polluted with a thin film of&#8230;well, I don&#8217;t want to know&#8230;on top if it. Trash and sewage are dumped right into the water. There were booze cruises, pricey boat trips, a McDonald&#8217;s, and more restaurants serving Western food than Thai food. The town&#8217;s buildings are so tightly packed that one loses any sense of being on an island.<br> They literally paved over paradise:</p><p><img src=\"https://media.nomadicmatt.com/mattphiphi2.jpg\" alt=\"an empty street on koh phi phi in thailand\"><br> (That is me standing at one end of the island looking out to the beach across the way.) </p><p>As far as I&#8217;m concerned, Ko Phi Phi has lost what little soul it had left. It is an ugly, overpriced destination living off the fact people go there because&#8230;.well, I guess you&#8217;re supposed to go there?</p><p>I&#8217;ve been living in or visiting Thailand for thirteen years. I&#8217;ve been all over the country. Ko Phi Phi is one of those places that takes the worst of Thailand tourism and puts it all in one overpriced location. This place has nothing to offer you can&#8217;t get on another island. Thailand is full of beautiful, picturesque tropical islands like Ko Mak, Ko Jum, Ko Chang, Ko Adang, and Ko Lanta. Those are the ones you see on postcards, the ones that spur the imagination and entice adventure. And if you want to party, you will find parties equally as good &#8212; at cheaper prices &#8212; on Ko Chang, Ko Samui, Ko Phanang, and Ko Tao.</p><p>I can&#8217;t really figure why people go there. I asked people I met. &#8220;I hear the parties are good and I wanted to see Maya Bay. I dunno. It&#8217;s famous for a reason, right?&#8221;</p><p>If you&#8217;re looking for a beach paradise, there are better islands. If you&#8217;re looking for a party, there are better islands. If you&#8217;re looking to scuba dive, there are better islands. If you want great seafood, there are better islands. If you&#8217;re looking for an inexpensive place to go, well, this place is definitely not it.</p><p>Phi Phi has no redeeming qualities.</p><p>And I don&#8217;t see myself ever returning.</p><p>The island can&#8217;t support the number of people it gets anyway. Give nature a break. Save your bank account. Find a nicer place. Go elsewhere.</p><p>Please avoid this hellhole.</p><p>*I don&#8217;t fault the locals. If you dealt with the obnoxious party tourists I saw on that island every day of your life, you wouldn&#8217;t give a f*ck either!</p><p><strong>Note</strong>: I know they have recently decided to <a href=\"http://www.travelandleisure.com/travel-news/the-beach-maya-bay-thailand-closing\" rel=\"noopener\" target=\"_blank\">close Maya Bay in the off season</a> to give it a break. It&#8217;s the step in the right direction but I don&#8217;t think it will change much. They already developed the island. They need to remove all the structures there, limit the number of people who go, and give nature a time to heal. Given the government&#8217;s track record on following through with environmental promises, I won&#8217;t be holding my breath.</p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p><p><strong>Photo Credit:</strong> <a href=\"https://www.flickr.com/photos/153586958@N08/33437400050/\" target=\"_blank\" rel=\"noopener\">1</a></p></div>","title":"I Still F*ing Hate Ko Phi Phi"}},"pageContext":{"id":"5b95ea7787be05832748ffab"}}