{"data":{"mongodbDatabaseArticles":{"id":"5b95f4d987be058327490137","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Do I Really Need a TEFL to Teach in Thailand?</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/do-i-need-a-tefl/\"><img class=\"aligncenter wp-image-9647\" title=\"Do I Really Need a TEFL to Teach in Thailand?\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/04/TEFL.jpg?resize=563%2C391&amp;ssl=1\" alt=\"Do I really need a TEFL?\" width=\"563\" height=\"391\"></a></p>\n<p>&#8220;Do I really need a TEFL?&#8217; is a question we&#8217;ve been asked a lot by those interested in teaching English in Thailand. If you are hesitant about becoming TEFL certified, look at it as an investment that will lead to a more successful teaching career in Thailand. Here&#8217;s why:</p>\n<p>Technically, you don&#8217;t need a TEFL to teach. Thailand&#8217;s current (but ever-changing) labor laws don&#8217;t explicitly state that it&#8217;s a hiring requirement. However, just as you wouldn&#8217;t want someone to operate heavy machinery or handle your taxes without the proper training, Thai schools want prospective teachers who are aware of and prepared for the challenges they may face while teaching English as a foreign language.</p>\n<h2><p id=\"A_TEFL_is_a_Qualifier\"><p>A TEFL is a Qualifier</p></p></h2>\n<p>A TEFL certification is great to have on a resume. As a way to weed out under-qualified prospects and to encourage more experienced teachers to apply, schools like candidates who have been formally trained in teaching English as a foreign language. You may think you won&#8217;t need a TEFL if you&#8217;ve had prior teaching experience in your home country. Although that experience is excellent, keep in mind that a TEFL course gives instructions on how to teach English to non-native English speakers.</p>\n<h2><p id=\"A_TEFL_Prepares_You_for_a_Successful_Teaching_Career\"><p>A TEFL Prepares You for a Successful Teaching Career</p></p></h2>\n<p>If you don&#8217;t think you&#8217;ll need a TEFL, maybe you&#8217;ll reconsider after learning the benefits of taking a course. Although many of the information discussed in the course topics may be old news for veteran teachers, it&#8217;s immensely helpful to the people who&#8217;ve never formally taught before.</p>\n<h3><p id=\"Tactics_for_Teaching_Thai_Students\"><p>Tactics for Teaching Thai Students</p></p></h3>\n<p>A TEFL course shows the major differences in the grammatical structure, spelling rules, and spoken sounds between English and Thai. Being aware of these differences helps you understand why some concepts (that may seem simple to native English speakers) are hard to grasp by Thai students. Additionally, a good TEFL course often shares &#8220;tricks of the trade&#8221; that can be used in the classroom to help Thai students understand a new concept.</p>\n<h3><p id=\"Engaging_Lesson_Plans\"><p>Engaging Lesson Plans</p></p></h3>\n<p>A TEFL course teaches prospective teachers how to create lesson plans or modify existing lesson plans to suit their teaching style and the needs of the students. You&#8217;ll learn how to structure a class and balance time between teaching the students and allowing the students to reflect on what they&#8217;ve learned through quizzes, games, or projects. It&#8217;s takes a lot of effort to develop a great lesson plan!</p>\n<h3><p id=\"Handling_the_Classroom\"><p>Handling the Classroom</p></p></h3>\n<p>Teaching for the first time is intimidating. Although Thailand is often known for its well-behaved students, learning how to maintain order is still important for a smoothly operating classroom. A TEFL course should not only suggest how to get a rowdy class focused on the lesson, but also how to present yourself as the authority and handle more problematic students.</p>\n<h3><p id=\"English_Grammar\"><p>English Grammar</p></p></h3>\n<p>When was the last time you brushed up on English grammar? If you&#8217;re like us, it might have been high school English&#8230;yikes! A TEFL course&#8217;s curriculum will cover English grammar fundamentals so that you, the future English teacher, know what you are talking about.</p>\n<h2><p id=\"It_is_possible_to_find_a_job_without_a_TEFL\"><p>It is possible to find a job without a TEFL?</p></p></h2>\n<p>Yes, but the choices are more limited. You may have to:</p>\n<ul>\n<li><p> settle for your second or third school of choice</p></li>\n<li><p> accept a&#160;below-average paycheck</p></li>\n<li><p>take a longer commute or&#160;work where there are no other English speakers</p></li>\n</ul>\n<p>Reputable schools have their pick of teachers and, without a TEFL, you may be eliminated from the selection. This is not to say that you need a TEFL to get hired, but showing that you&#8217;ve earned the certification has its benefits.</p>\n<h2><p id=\"If_you_need_a_TEFL_we_recommend_SEE_TEFL\"><p>If you need a TEFL, we recommend SEE TEFL</p></p></h2>\n<p>For those who need a TEFL company, we recommend <a class=\"thirstylink\" title=\"SEE TEFL\" href=\"https://www.tielandtothailand.com/recommends/see-tefl/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">SEE TEFL</a>. Not all TEFL courses are created equal, and some do a poor job preparing you for your teaching career.</p>\n<p>The highly valuable course offered by SEE&#160;TEFL provides all the necessary&#160;information mentioned above and reinforces those classroom topics through frequent tests, quizzes, and homework. This company makes sure that you are truly prepared to teach English as a foreign language. If you&#8217;re looking for an easy course just to slap a TEFL certification on a resume, you&#8217;ll be in for a surprise!</p>\n<p><a href=\"https://seetefl.com?ap_id=tielandtothailand\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><img class=\"colorbox-1669 aligncenter\" src=\"https://i2.wp.com/seetefl.com/images-ads-seetefl/banner-seetefl-548x250.png?resize=548%2C250&amp;ssl=1\" alt=\"SEE TEFL 4 Week Course and Paid Internships\" border=\"0\"></a></p>\n<p>Another great perk about SEE TEFL is that they assist their graduates with job placement. They have a network of schools that they&#8217;ve built up over the years that are reputable and maintain a low teacher turn-over rate. SEE TEFL accommodates part-time, summer-time, and substitute positions, in addition to full-time positions. This also includes summer camps, English camps, and even volunteer opportunities. Knowing that you&#8217;ll have <a class=\"thirstylink\" title=\"help finding a job\" href=\"https://www.tielandtothailand.com/recommends/see-tefl-job-placement/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">help finding a job</a> after graduating is huge relief.</p>\n<h2></h2>\n<p>SEE TEFL offers a very organized and effective&#160;<a class=\"thirstylink\" title=\"four-week course for 1,395 USD\" href=\"https://www.tielandtothailand.com/recommends/see-tefl-4-week-course/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">four-week course for 1,395 USD</a>. Their Chiang Mai location offers courses every five weeks.&#160;Additionally, twice per year &#8211; in April and in September &#8211; SEE TEFL offers a two-week &#8220;Teaching Essentials&#8221; training course followed by a four to five month <a class=\"thirstylink\" title=\"paid internship position as a teacher\" href=\"https://www.tielandtothailand.com/recommends/see-tefl-internship/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">paid internship position as a teacher</a>. This coincides with the start of the first and second semesters of the public Thai school year.</p>\n<p><strong>Phone:</strong> (081) 885-4144<br>\n<strong>Email:</strong> <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a><br>\n<strong>Website:</strong> <a class=\"thirstylink\" title=\"www.seetefl.com\" href=\"https://www.tielandtothailand.com/recommends/see-tefl/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">www.seetefl.com</a><br>\n<strong>Enroll:</strong> <a class=\"thirstylink\" title=\"Course Dates\" href=\"https://www.tielandtothailand.com/recommends/see-tefl-course-dates/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Course Dates</a></p>\n<h2><p id=\"A_TEFL_is_Worth_the_Investment\"><p>A TEFL is Worth the Investment </p></p></h2>\n<p>We advocate earning a TEFL because it helps to secure a teaching position in Thailand and it prepares you for a successful teaching career. Since so many prospective teachers come to Thailand without prior teaching experience (as it was for Angela), finding a great TEFL course to take is well worth the investment.</p>\n<p>We owe a big thanks to Alana from <a title=\"Paper Planes\" href=\"http://www.paperplanesblog.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Paper Planes Blog</a>, who could only say great things about her experience there. We wish we had known about SEE&#160;TEFL sooner!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Do I Really Need a TEFL to Teach in Thailand?"}},"pageContext":{"id":"5b95f4d987be058327490137"}}