{"data":{"mongodbDatabaseArticles":{"id":"5b9248b787be056953db7bde","content":"<div><p>A few months ago, I set a goal to launch <a href=\"/12-startups-12-months\">12 startups in 12 months</a>. They're all minimum viable products, built to test a hypothesis and see if they can get a market fit in a month.</p> <p>They've all been doing relatively well. 1) <a href=\"http://playmyinbox.com/\">PlayMyInbox</a> got covered by <a href=\"http://twitter.com/MTVartists/status/444164328321978368\">MTV</a> and <a href=\"http://lifehacker.com/split-payments-air-conditioning-and-pocket-tags-1540847975\">Lifehacker</a>, 2) <a href=\"http://tubelytics.com/\">Tubelytics</a> was quickly adopted by some big media brands, 3) <a href=\"http://gofuckingdoit.com/\">GoFuckingDoIt</a> went completely viral and was featured all over the media including <a href=\"http://thenextweb.com/shareables/2014/04/29/gofuckingdoitdotcom/\">TheNextWeb</a>, <a href=\"http://www.appsumo.com/15-awesome-tools/\">AppSumo</a> and <a href=\"http://www.wired.co.uk/news/archive/2014-06/04/make-more-mischief\">WIRED</a>, 4) <a>NomadList</a> surpassed all of them hitting <a href=\"/product-hunt-hacker-news-number-one/\">#1 on Product Hunt and Hacker News</a> and getting covered by <a href=\"http://www.businessinsider.com/nomadlist-remote-work-list-2014-7\">Business Insider</a>, <a href=\"http://inc.com/jessica-stillman/the-best-cities-in-the-world-for-digital-nomads.html\">Inc.com</a> and <a href=\"http://facebook.com/TimFerriss/posts/10152592211767241\">Tim Ferriss</a> and 5) <a href=\"http://nomadjobs.io/\">Nomad Jobs</a> which is soft-launched and slowly receiving coverage now. I'm slightly delayed now as the success of <a href=\"http://nomadlist.io/\">Nomad List</a> was a bit overwhelming. But I'm almost back on schedule now.</p> <p>This month, I'm launching the 6th startup. It's called <strong><a href=\"//gifbook.io/\">GIFbook.io</a></strong> and it lets you order printed physical flipbooks from animated GIFs. If you like one too, you can go and <a href=\"http://gifbook.io/\">order one</a> now.</p> <h2>The problem</h2> <p>If <a href=\"http://producthunt.com/\">Product Hunt</a> teaches us one thing, it's that GIFs are huge.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-02-17.25.51-1024x878.png\"> <p>But there's one tiny problem, they stop moving once you print them. It seems like a problem that we've put people on the moon but haven't been able to put animated GIFs on paper.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"nyancat3\"><img src=\"/wp-content/uploads/2014/07/nyancat3.gif\" alt=\"nyancat3\"> <p>The infallible <a href=\"//answers.yahoo.com/question/index?qid=20130119191302AAyOyI6\">Yahoo! Answers</a> obviously agrees:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/07/Screenshot-2014-07-09-18.46.03x-942x1024.png\"> <h2>The solution</h2> <p>So even though this doesn't seem like a world shattering problem, I thought, let's fix this by letting people print <a href=\"http://gifbook.io/\">animated GIFs as flipbooks</a>.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/07/boka.png\"> <p>I searched around and I couldn't find anyone doing this yet. So there's a space! Could this be a business though? I thought so. <a href=\"http://printstagr.am/\">Printstagram</a> started by simply printing Instagram photos as polaroids. Now they've grown into a real startup called <a href=\"http://socialprintstudio.com/\">Social Print Studio</a> who offer a wide range of print products all connected to social networks. So it's more serious than you think.</p> <h2>Finding a supplier</h2> <p>It'd be a bit of hassle to print them myself though. So I jumped on Twitter and asked if anyone knew a printing company that did flipbooks. A few replies later I had a supplier who sent me a sample flipbook of <a href=\"http://en.wikipedia.org/wiki/Nyan_Cat\">Nyan Cat</a> by post! Awesome.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/07/photo-1.jpg\"> <p>The supplier's minimum was 3 flipbooks. And it wasn't very cheap either. So my margins are not very high right now. But if I get enough volume, I'm looking to push the cost down or otherwise switch suppliers. If you know anyone printing flip books, <a href=\"http://twitter.com/levelsio\">tweet me</a>!</p> <h2>Front-end</h2> <p>Like with my <a href=\"/how-i-build-my-minimum-viable-products/\">previous projects</a>, I tried to keep the interface of <a href=\"http://gifbook.io/\">GIFbook.io</a> as simple as possible. It features two colors, a video of the flipbook as a background (simply shot on my iPhone by my dad, while I held the flipbook).</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-02-17.09.15x-1024x608.png\"> <p>The upload bar is a nyan cat flying through space with its awesome rainbow cloud ^___^</p> <p>It lets you upload a GIF or paste a URL, lets you position it by dragging the GIF, crop its size right for the flip book, and then in the same page moves you through the ordering process and processes your payment via the always awesome <a href=\"http://stripe.com/\">Stripe</a>.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-02-17.21.11-1024x643.png\"> <p>It took awhile to get everything working on mobile, but with 50% of my traffic mobile now, that's mega important. People need to be able to upload a GIF, enter their CC details and order, all from a phone.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/a7029093-049b-4eb4-9c7d-8993a0e6cd09-1024x682.png\"> <h2>Back-end</h2> <p>The back-end required some not-so-trivial stuff. I needed to be able to resize/crop the GIF from the user's input, cut up the animated GIF frames, and since the flip book was set at 50 frames by my supplier, I had to somehow make sure the image sequence I sent them was exactly 50 frames.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-02-17.17.48-1024x519.png\"> <p>If you have a GIF with 25 frames, that's easy. You show 1 frame for 2 pages and you have 50 pages filled. If you have 36 frames, what do you do though? Interpolating frames makes stuff look blurry and that's sub-optimal. Another option would be to cut frames. Instead I opted to try and half or double the frame rate so it'd fit inside the 50 frames. Then if it was too many frames, I'd simply repeat the GIF until it was 50 frames long.</p> <p>After cutting it up, the final image sequence is then sent to my supplier with the customer's shipping address.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-02-17.24.18x1-1024x719.png\"> <p>For now, I'll be doing the payments to my supplier manually, but later, if there's enough sales, I'll automate that too. Right now it sums up the credit of each order's costs and then at the end of the month I PayPal that amount.</p> <h2>Conclusion</h2> <p>My first physical product startup! I'm super excited and wonder how the internets will respond to this. It seems to me like a fun product to give to someone. I've shown my friends the sample flip books I got, and they liked it. I don't know if liking it will be enough to buy it, but we'll see in a month when I'll update you on how this went! Fingers crossed :)</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/video.gif\"> <p>If it works, I can adapt this to print <a href=\"http://vine.co/\">Vines</a>, videos of <a href=\"//media.giphy.com/media/gw3I748P0dZQwKyI/giphy.gif\">Ryan Hoover's face</a>, YouTube/Facebook videos etc. That sounds like a fun market :)</p> <h2>Try it out</h2> <p>It's live now, so go try it out, upload your own GIF and get your own <a href=\"http://gifbook.io/\" title=\"animated GIF flipbook\">animated GIF flipbook</a>! Let me know if you have any feedback or ideas to improve it. I'd love to hear from you on Twitter or at hello at levels.io. If you'd like to write about it, please do so, I need any press I can get!</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"GIFbook, the first animated GIF flipbook"}},"pageContext":{"id":"5b9248b787be056953db7bde"}}