{"data":{"mongodbDatabaseArticles":{"id":"5b9248be87be056953db7be6","content":"<div><p>There's a very good chance the ideals you have when you're young do not necessarily match society's script of what an average life should be. But then again, when following society's script, you're rewarded well. Society will provide you with stability, certainty and safety.</p> <p>Following your ideals is therefore very difficult, since it means you have to write your own script of what life should be like. And it won't reward you in the short-term. Very often, there's no rewards for a long time. Instead, what you'll get is a lot of instability, uncertainty and risk.</p> <p>In the long term, following society's script becomes a liability though. For all the benefits it provides you with, it won't shape you into a very unique individual. Society's structure requires you to fit in and does not reward people who'd like to excel. By the hierarchical pyramid-like nature of its structure, only a few are allowed to break through and excel. But then, even they have to do so on society's terms.</p> <p>In the long term, following your ideals becomes a benefit though. First you might have the fear of not having life's script pre-written for you, but then you can start writing your own. You polish it like a diamond. You develop it, changing it to fit what you want from your life, at each moment. And then after awhile, when you have it worked out, you'll find yourself in a situation where you've created a unique script for yourself which matches your ideals. And by definition, you'll now be able to excel, since you're not competing with anyone else anymore but yourself.</p> <p>Which one do you choose?</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Ideals, fears and the script of life"}},"pageContext":{"id":"5b9248be87be056953db7be6"}}