{"data":{"mongodbDatabaseArticles":{"id":"5b9629b687be0583274911a9","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to&#160;Phnom Penh</h1><p><strong>Tell us a little about yourself and tell us why you&#8217;re an expert on luxury travel in Phnom Penh.</strong></p><p>We&#8217;re Jen and Stevo, a couple from California. We&#8217;ve been living, working and traveling in Asia since 2011 and have recently made Phnom Penh our new home. We love Cambodia and have been coming here for years to travel and volunteer, but it wasn&#8217;t until we moved here that we realized just how much this city has to offer in the way of luxurious living. Phnom Penh is a city on the rise, and now is the perfect time to come experience the capital&#8217;s chaotic charm in style.</p><p><img class=\"aligncenter size-full wp-image-10516\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-phnom-penh-2.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"560\" height=\"420\"></p><p><strong>What makes Phnom Penh a perfect destination for travelers seeking a glamorous trip?</strong></p><p>Phnom Penh may not be known as a glamorous destination, but that is quickly changing. An influx of foreign investment and expats has meant a lot of new businesses geared toward foreigners. There is no shortage of amazing restaurants with cuisines from around the world, luxurious hotels with fabulous pools to beat the heat, huge shopping malls full of popular international brands, trendy bars and even breweries. You can live in luxury for very little money, so we can live and travel much more comfortably here in Phnom Penh than we could in the USA.</p><p><strong>What 5 star hotel is the best in your town?</strong></p><p>That would have to be the <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Raffles_Hotel_Le_Royal.htm\">Raffles Hotel Le Royal</a>. This iconic hotel has been a haven for travelers, journalists and entrepreneurs since 1929. From their stunning pool grounds, gourmet restaurants, famous Elephant bar, and luxury spa, this is a truly world class hotel. Though we haven&#8217;t stayed here yet ourselves, it has a great reputation throughout the city. Even if you don&#8217;t end up staying there, it&#8217;s worth going into the Elephant Bar for a drink just to check it out.</p><p><strong>What about boutique hotels, of them all, which would you send your friends or </strong><strong>family to stay at?</strong></p><p>Our moms are coming to Phnom Penh this fall, and we will definitely send them to stay at <a href=\"http://www.agoda.com/amanjaya-pancam-hotel/hotel/phnom-penh-kh.html?cid=1716750\" target=\"_blank\" rel=\"noopener\">Amanjaya Pancam</a>, a gorgeous hotel suite located in the heart of the Riverside, a very exciting area of the city. The rooms are spacious and beautifully decorated plus every room has a balcony overlooking the Mekong river. There is a lovely restaurant on the ground floor offering multi-course meals, and a rooftop restaurant and bar with delicious cocktails, food and some of the best views in the city. Some nights they bring in live music on the rooftop. You can also book a masseuse to come to your room!</p><p>If you are looking for a quieter location still close to the action, <a href=\"http://www.agoda.com/the-pavilion-hotel/hotel/phnom-penh-kh.html?cid=1716750\" target=\"_blank\" rel=\"noopener\">The Pavilion Hotel</a> is the perfect little oasis in the city. It is located behind Wat Botum, just steps from the Royal Palace. However, once you step inside you are transported into a jungle paradise. There are several pools, two poolside bar-restaurants, a gym and a spa. Rooms are $75 per night in low season and $95 in high season, and guests receive a 25 minute complimentary massage on arrival. The hotel also owns two fabulous restaurants in the city, Tepui at the Chinese House and Naturae, a gourmet vegetarian restaurant, and they offer free transportation to both.</p><p><img class=\"aligncenter size-full wp-image-10519\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-phnom-penh4.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"560\" height=\"420\"></p><p><strong>Are there any fun activities for the adventurous traveler? </strong></p><p>We recently went on a boat cruise at sunset and loved it! It was great to take in a new perspective of the city and witness the activity on the Mekong river closer up. <strong>Cambo Cruise</strong> offers a sunset cruise with dinner and a large cocktail every day from 5:30-8pm. Be sure to book one day ahead.</p><p>Another great activity is spending a day on nearby <strong>Silk Island</strong>. Families living on the island make silk using hand-powered looms. You can purchase beautiful scarves, table runners, bed covers and more, all with a unique story to tell. The island is a beautiful little getaway in the city, just a short ferry ride across the Mekong river. Your hotel or a travel agency can easily make arrangements for you. Some eco-friendly boutique hotels have also popped up on the island if you want to stay the night.</p><p><img class=\"aligncenter size-full wp-image-10521\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-phnom-penh7.jpg?resize=560%2C373&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"560\" height=\"373\"></p><p><strong>Where are the best hang outs during the day?</strong></p><p>During the day it&#8217;s wise to be out of the heat with a cold drink in your hand. Pop into just about any cafe or restaurant in the city for a glass of iced coffee with sweet milk, a Cambodian specialty. If you&#8217;re in the <strong>Russian Market area, Joma Cafe</strong> makes a strong brew and has strong A/C.</p><p><strong>The Riverside area</strong> is a great spot to hang out in the late afternoon. Locals gather to do group exercise, kids run around feeding and chasing pigeons, vendors are selling everything from drinks and snacks to balloons and birds, it&#8217;s a lively scene. There are some small temples close to the river across from the <strong>Royal Palace</strong> where you can observe people praying, burning incense and purchasing lotus flowers. It&#8217;s a really bustling area, and we often go there to people watch and take photos. People are so friendly, and if you want to take a picture of someone you can ask in the local language, Khmer, &#8220;Som tot moy?&#8221; You are almost guaranteed to get a big smile and a lovely photo.</p><p><strong>If you have a big date night, what are the most delicious restaurants in Phnom Penh and </strong><strong>what are their best dishes?</strong></p><p>If you want to splash out on a fabulous five star meal, look no further than <strong>Van&#8217;s Heritage Restaurant</strong>, a French-Cambodian fusion restaurant that is highly regarded in Cambodia. Our friends recently went for their anniversary and were raving about the food, especially the desserts. The restaurant is located at #5 Street 102.</p><p>Our favorite place for a date night is <strong>Romdeng restaurant</strong>. Their menu is made up of classic and modern Cambodian dishes, and more adventurous fare like fried tarantulas and beef with fire ants! The setting is romantic and the decor is lovely with carved wood furniture, rich Cambodian silks and vibrant art on the walls. We like to sit outside enjoying the breeze and view of the pool. Not only is the food delicious and the decor beautiful, Romdeng also works to build the futures of former street children and marginalized young people. Sometimes your server will be accompanied by a student who is training in hospitality, making the experience all the more memorable. Romdeng&#8217;s location is #74 Street 174.</p><p><img class=\"aligncenter size-full wp-image-10517\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-phnom-penh.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"560\" height=\"420\"></p><p><strong>Let&#8217;s talk desserts- what place makes the best?</strong></p><p>Cambodia is a former French colony, so there are French quality pastries available all over the city! Our favorite place for dessert has got to be <strong>Bloom Cakes.</strong> They have 48 flavors of cupcakes, and we&#8217;re making our way through trying them all :) Highly recommend the Bailey&#8217;s latte and carrot cake with vanilla cream cheese.</p><p><img class=\"aligncenter size-full wp-image-10520\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-phnom-penh6.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"560\" height=\"420\"></p><p><strong>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers?</strong></p><p>Phnom Penh boasts some unique fashion. While you&#8217;re here, check out the latest Cambodian couture and local bridal fashion at <strong>Rasmei Thirika</strong>, a renowned tailor in the city since 1985, located at #58BC on Russian Boulevard. They create gorgeous Cambodian and western style dresses for special occasions, and the beadwork is stunning!</p><p>For every day wear, up and coming Cambodian fashion designer, <strong>Neou Leakhena,</strong> designs stylish dresses with a vintage couture influence. You can find her pieces at <strong>Lost N Found, a vintage clothing shop</strong> located at #321 on Street 63.</p><p>If you&#8217;re looking for high-end international brands head to <strong>Aeon Mall or Naga World</strong>, two of the largest malls in the country. Aeon even has a cinema playing the latest Hollywood movies. The malls are also great spots to hang out mid-day when it&#8217;s too hot to be outside.</p><p><strong>What are a couple of the best salons and spas in Phnom Penh?</strong></p><p><strong>Champei Spa</strong> at #38 on Street 57 in the trendy BKK1 district is my favorite. They have very professional staff who do a variety of massages, facials and body scrubs at really reasonable rates. I went for a <strong>Traditional Khmer</strong> massage this week-a bit painful like Thai massage, but feels so good afterwards! They also do mani-pedis and there&#8217;s a hair salon.</p><p><img class=\"aligncenter wp-image-10518\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/luxury-guide-to-phnom-penh3-001.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"560\" height=\"420\"></p><p><strong>Time for a great sunset view&#8230; where would you go?</strong></p><p>Phnom Penh is very flat. There is only one hill in the whole city! So the best place to take in a gorgeous Cambodian sunset is from a rooftop while sipping a delicious cocktail. Our favorite spot along the <strong>Riverside is Le Moon Terrace Bar</strong> located on the roof of <strong>Amanjaya Pancam Hotel</strong>. It&#8217;s corner location boasts some of the best views in the area.</p><p>If you&#8217;re in the Russian Market area, The <strong>Frangipani Fine Arts hotel</strong> has stunning rooftop views and their cocktail menu is stacked with flavorful specialty drinks.</p><p><strong>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot. If you end the night at a fancy club, which one do you head towards? </strong></p><p>A great spot for pre-dinner drinks is the <strong>Mansion Heritage Bar</strong>, located in a beautiful French colonial building across from the National Museum near the Riverside. They open at 5pm and occasionally they have live music as well.</p><p><strong>Pontoon</strong> is a popular nightclub in town. They have events seven night a week, including ladies night, international DJs and even drag shows! We aren&#8217;t big on the club scene, but we do frequent some great bars around town. One of our favorites is <strong>Che Culo</strong>, Italian for &#8216;lucky bastard&#8217;, for the ambiance and great selection of small bites and tasty drinks.</p><p>&#160;</p><p><em><p>[book a flight / book a room in Phnom Penh]</p><p>&#160;</p><p><img class=\"alignleft wp-image-10515 size-thumbnail\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/gravatar-luxury-guide-to-phnom-penh.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury Guide to Phnom Penh\" width=\"150\" height=\"150\">Jen and Stevo are the California couple behind <a href=\"http://twocantravel.com/\">Two Can Travel</a>, a blog about living, working and traveling in Asia. Since 2011 the pair have worked as English teachers in China, volunteered in the Cambodian countryside, and traveled throughout Asia, documenting their (mis)adventures along the way. Their aim is to provide stories, info and advice for those seeking an alternative lifestyle in Asia. Follow Two Can Travel on <a href=\"https://www.facebook.com/twocantravel\">Facebook</a>, <a href=\"https://twitter.com/two_can_travel\">Twitter</a>, <a href=\"https://www.youtube.com/twocantravel\">Youtube</a> and <a href=\"https://plus.google.com/+Twocantravel/about\">Google</a><a href=\"https://plus.google.com/+Twocantravel/about\">+</a>.</p><p>&#160;</p><p>&#160;</p><p class=\"fusion-clearfix\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> </p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2></em></p></div>","title":"Luxury Guide to Phnom Penh"}},"pageContext":{"id":"5b9629b687be0583274911a9"}}