{"data":{"mongodbDatabaseArticles":{"id":"5b92396a87be0583cfde67fc","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">How to Get a US E-2 Visa: the Ultimate Guide</h1>\n \n</p><img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/how-to-get-an-e2-visa-usa.jpeg\" alt=\"How to Get a US E-2 Visa\" width=\"700\" height=\"467\" class=\"size-full wp-image-26333\"><p>A <a href=\"http://nomadcapitalist.com/2018/05/09/second-passport-portfolio/\">passport portfolio</a> probably sounds like a fantasy, but for more and more internationally oriented capitalists, this is becoming not only a reality, but a brilliant way to save time and money by circumventing immigration laws that get in the way of doing business or just traveling the world. </p>\n<p>What&#8217;s a passport portfolio? It&#8217;s basically a collection of passports usually gained through investment, but we at Nomad Capitalist are adept at leveraging other factors to get you a second or third passport as well. Yes, it&#8217;s totally legal.</p>\n<p>Many governments have opened a pathway to citizenship through investment after realizing the obvious benefit of attracting more entrepreneurs to their countries. But you can read more about that <a href=\"http://nomadcapitalist.com/2018/06/23/what-is-citizenship-by-investment/\">here</a>. This article is more concerned with a specific non-immigrant visa investor program in the US that will never lead to a Green Card or citizenship: the E-2 visa for investors. </p>\n<p>When putting together your passport portfolio, you definitely want to include a passport from one of the E-2 Treaty countries, that is, countries that have signed a treaty of commerce and navigation with the US. This will open the door to treaty trader visa or investor visa options that will allow you to live part or full time in the US. </p>\n<p>E-2 countries make such a good addition to a passport portfolio because they grant you access to the coveted E-2 Treaty Investor visa in the US, which allows you to do business in the US, but without the tax burdens of a Green Card or US citizenship. Since the E-2 visa is not an immigrant visa, it&#8217;s an ideal option for an American entrepreneur who has decided to renounce citizenship, but still has business interests in the US. Many of the E-2 countries are E-1 countries as well, which could grant you the option of applying for the E-1 Treaty trader visa in the future, which is also not an immigrant visa. </p>\n<h2>The E-2 Investor Visa</h2>\n<p>The E-2 Treaty Investor visa allows an investor to live in the US in exchange for a significant investment made to the country&#8217;s economy. With an E-2 visa, you&#8217;ll be able to live and do business in the US for a potentially unlimited amount of time, but without the tax requirements of citizenship or a Green Card. </p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/us-e2-visa-coffee-shop.jpg\" alt=\"E-2 Visa Businesses\" width=\"700\" height=\"466\" class=\"size-full wp-image-26335\"><p>As we&#8217;ve <a href=\"http://nomadcapitalist.com/2013/06/17/americas-bad-excuse-for-citizenship-based-taxation/\">discussed at length</a>, the US is one of two countries in the world that forces citizens who do not live in the US to pay taxes on their worldwide income. Even if you hold a Green Card, but spend most of your time abroad, you&#8217;ll still be required to submit to US tax law. For this reasons, some Americans we work with end up choosing to renounce citizenship. When doing business abroad, paying US taxes and dealing with the rusty American bureaucratic machine can become a huge waste of time and money. Many entrepreneurs would rather not deal with the stress, paperwork, or pay US income tax at all. </p>\n<p>But what happens if you still run businesses in the US or plan to open a business there in the future? Usually, a treaty trader visa or a treaty investor visa, like E-1 or E-2, is one of the best options. Rather than delving into the treaty trader visa option, we&#8217;re going to focus on the E-2 visa right now because it is open to a wider variety of entrepreneurs. </p>\n<p>The E-2 visa is a non-immigrant visa, which means you&#8217;ll never get a passport or Green Card, but only your US income will be taxed. However, in some cases you may end up being taxed in the US if you exceed the Substantial Presence Test. More on that here. </p>\n<p>Something to keep in mind is that the E-2 visa is really designed for those who have active business interests in the US which requires their presence. Unlike other investor visa programs, passive investments, like stocks and bonds, will not grant you eligibility for the E-2 visa. That being said, while the E-2 visa does require active effort on your part, you can often get away with making a much smaller initial investment than you might with other programs like the EB-5 immigrant visa, yet another reason the E-2 is often preferred. </p>\n<h3>What Are E-2 Countries?</h3>\n<p>In order to apply for an E-2 visa, you must hold citizenship to a country that has signed an E-2 Treaty with the US, or in layman&#8217;s terms, a commerce and navigation treaty. Plenty of these countries have citizenship by investment programs (CBI), but when it comes to the E-2 visa, not all CBI programs are created equal. </p>\n<p><a href=\"https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/fees/treaty.html\">Each of these countries</a> has signed different agreements with the US, so the amount of time you can stay on an E-2 visa varies by country. Whether or not you can renew your visa and how many times you can do so will also differ. </p>\n<p>For example, one of the strongest options is a <a href=\"https://www.youtube.com/watch?v=v--ZMRw3O1o\" rel=\"noopener\" target=\"_blank\">Grenada passport</a>, which would allow you to stay in the US for 5 years under the E-2 visa. It would also grant you the opportunity to renew as many times as you&#8217;d like. Theoretically, as an American, you could renounce citizenship to the US and get citizenship to Grenada within a few months. This would still allow you to conduct your business interests in the US indefinitely, while avoiding paying US income tax on your worldwide income. </p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/us-e2-visa-grenada.jpg\" alt=\"US E-2 Visa with Grenada citizenship\" width=\"700\" height=\"467\" class=\"size-full wp-image-26337\"><p>Many Americans who <a href=\"http://nomadcapitalist.com/2018/03/26/why-and-how-i-renounced-my-us-citizenship/\">renounce citizenship</a> like to go down to countries in the Caribbean for citizenship. As we said, not all citizenship by investment programs are going to be worth the effort. Of the Caribbean countries with CBI programs, only Grenada has an E-2 visa agreement with the US.</p>\n<p>Citizenship to Grenada will cost you a $150,000 donation; not the most expensive option out there, but also not the cheapest. On the other hand, citizenship from a country like Armenia or Bangladesh will only grant you three months in the US and two renewals, so as far as this discussion goes, they may not be the best option. </p>\n<h3>Don&#8217;t Forget Citizenship By Descent</h3>\n<p>If you decide to work with a company that basically sells passports, they&#8217;re going to get you to shell out tens of thousands of dollars for citizenship to one of the E-2 countries. At Nomad Capitalist, we try to be a little bit more strategic than that. Once we delve into your family background, we might find that you&#8217;re actually already entitled to citizenship by descent to one of the E-2 countries &#8211; such as <a href=\"http://nomadcapitalist.com/2016/07/11/irish-citizenship-by-descent/\">Ireland</a> or <a href=\"http://nomadcapitalist.com/2016/11/02/get-italian-citizenship-by-descent/\">Italy</a> &#8211; through one of your parents or grandparents. </p>\n<p>The process for obtaining citizenship by descent is not only a fraction of the cost, but the wait time is usually significantly shorter with much less paperwork. In some cases, you might have your second passport in a few months or even a few weeks, which will open up the pathway to an E-2 visa quite quickly. Same goes for if you&#8217;re married to or in a common law partnership with a citizen of a different country or someone who is eligible for citizenship by descent to an E-2 country. </p>\n<h2>E-2 Investor Visa: Pros and Cons</h2>\n<p>The E-2 Investors visa is a really solid option for those who want to do business in the US, especially for those with no interest in US citizenship and its tax burdens, but let&#8217;s take a look at some of the more specific pros and cons. </p>\n<h3>The Pros</h3>\n<p>One of the biggest pros of the E-2 investor visa is the processing times. You might imagine applying for anything in the US takes years to process, but that&#8217;s not always the case. While the popular EB-5 Immigrant visa for investors can take a few years to process, the E-2 visa only takes a few months. </p>\n<p>The E-2 visa does require a lot more work on your part as far as business goes, but it gives you much greater control over your investment. For Canada&#8217;s federal investor visa program and the American EB-5 immigrant visa, you must release your funds to be invested by a third party. Not only are you not guaranteed that you&#8217;ll ever see that money again, but you may be required to invest upwards of $1 million USD. The E-2 investor visa usually requires a much smaller investment and you are fully in control of your funds; it&#8217;s up to you to determine whether you&#8217;ll see a return on your investment. </p>\n<p>For nomad capitalists with families, the E-2 visa will also cover your family. Your spouse and any unmarried children under the age of 21 will be permitted to join you when you relocate to the US. Your spouse may then apply for work authorization. If granted, there will be no restrictions on where your spouse can work. Your children will also be able to attend school in the US. If they go to a state college, they&#8217;ll be eligible for in-state tuition. </p>\n<p>One of the biggest benefits of the E-2 visa over the EB-5 visa is the travel flexibility. For nomad capitalists, the need to travel internationally for pleasure or to follow up on other business interests makes many investment visa programs impractical. Since the E-2 is a non-immigrant visa and you will never be applying for citizenship, you don&#8217;t have to meet stringent presence requirements. In fact, in order to avoid being taxed on your worldwide income, you&#8217;ll need to be out of the US for 243 days of the year. </p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/us-e2-visa-employees.jpg\" alt=\"US E-2 Business Visa Employees\" width=\"700\" height=\"467\" class=\"size-full wp-image-26338\"><h3>The Cons</h3>\n<p>As mentioned, some visa programs allow you to make a passive investment or even donation to a non-profit in exchange for the right to live in your country of choice. The E-2 investment visa is going to require you to actually work in the US and prove that you are doing so, so this might not be the right option if you&#8217;re looking for a beach vacation. </p>\n<p>As we mentioned before, this visa does not present a clear path to citizenship. If your intention is to eventually become a US citizen, you&#8217;re going to want to look into other options, like the EB-5 immigrant visa. The E-2 visa is best for those who travel often, have business interests elsewhere, and want to avoid pesky US income tax law. </p>\n<p>While the legal fees for the E-2 visa tend to be lower than for the EB-5 visa, you have to consider that you will have to renew the E-2 visa every few years, depending on which E-2 country you hold citizenship to. </p>\n<p>The E-2 visa is geared more towards domestic businesses. If you&#8217;re looking to undertake an imports/exports enterprise, you should check out the E1 Treaty Trader visa instead. </p>\n<h2>How to Get an E-2 Treaty Investor Visa</h2>\n<p>One of the best and worst things about the E-2 visa application is that not all of the requirements are set in stone. That means that there&#8217;s a lot more flexibility in the kind of entrepreneurs who can apply, but also a lot of guesswork. Luckily, we&#8217;ve been helping entrepreneurs apply for this visa for years, so we have plenty of insights that should provide you with more clarity. Let&#8217;s delve into some of the requirements for this visa. </p>\n<h3>General Requirements</h3>\n<p>The main requirement for this visa is, of course, a passport from an E-2 Treaty country. </p>\n<p>The second requirement is investing &#8220;a substantial amount of capital&#8221; in a business enterprise in the US. Third, your reason for entering the US must be to &#8220;develop and direct the investment enterprise.&#8221; To establish your commitment to your investment you must prove that you hold at least a 50% ownership stake in the business or demonstrate that you have significant operational control of the business. </p>\n<p>While some investment visa programs allow you to make a philanthropic investment into an NPO or NGO, that is not the case with the E-2 visa. Your investment must be made with the intention of generating a profit and with the possibility of financial loss for the investor should the enterprise fail. </p>\n<p>Another important factor to note from the requirements in the &#8220;substantial amount of capital&#8221; requirement. United States Citizenship and Immigration Services (USCIS) isn&#8217;t exactly clear about the exact dollar amount they require. They do give a few guidelines to help you determine how much you should invest. </p>\n<p>USCIS recommends that the amount should be enough to demonstrate your financial commitment to the business endeavor. Basically, your investment should show that if the business fails, you&#8217;re going to feel the sting and therefore have the incentive to make this enterprise financially viable. The invested amount must also be enough to show that you will &#8220;successfully develop and direct the enterprise.&#8221;</p>\n<p>While there&#8217;s not technically a minimum investment, through working with investors at Nomad Capitalist, $200,000 seems to be the magic number for this visa. But ultimately, it depends on what kind of business you&#8217;re starting. If you&#8217;re launching a startup, you need to have enough to cover the cost of launching a new enterprise. In addition, the business you&#8217;re launching should ideally provide employment for US citizens as well. </p>\n<p>The investment itself must also demonstrate the ability to provide a minimal living for the investor and his or her family. The enterprise doesn&#8217;t necessarily have to generate that income at the time of investment, but it should be able to generate enough income within five years time. </p>\n<p>While the enterprise should be able to provide a basic living for you and your family, this is not sufficient in and of itself. Your business should be able to boast a profit margin beyond just covering your living expenses. USCIS wants to be able to see that your enterprise can pose an economic benefit to the US. </p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/us-e2-visa-main-street.jpg\" alt=\"US E-2 Visa Business Locations\" width=\"700\" height=\"467\" class=\"size-full wp-image-26339\"><h3>E-2 For Employees</h3>\n<p>If you want to bring employees with you to the US to work in your enterprise, the E-2 visa process can cover them as well. Here&#8217;s the catch: any employees who want to simultaneously apply for an E-2 visa, must be of the same nationality as you, the investor. An employee you bring with you on an E-2 visa must serve in a supervisory or executive role within the company, or hold special qualifications that make the employee essential to the operation. In essence, you should be able to prove that there is valid reason to bring said employee with you and that he or she possesses skills not readily available among American workers. </p>\n<h3>Other Business Interests</h3>\n<p>Basically, no. Under an E-2 visa you are only able to work within your approved enterprise. The situation is slightly different for employees who are potentially permitted to work for subsidiaries or the parent company of the original enterprise. </p>\n<p>If you&#8217;re an American entrepreneur considering renouncing your US citizenship, but already have a successful business venture in the US, your standing business venture may already qualify you for an E-2 visa, so this is something to keep in mind. </p>\n<p>How to Apply\n<p>The first step to apply for the E-2 visa is filling out the <a href=\"https://ceac.state.gov/GenNIV/Default.aspx\">non-immigrant visa form</a>, also known as DS-160, online and uploading a passport photo. The application must be filled out entirely in English. You will also be asked to pay the application fee and print the receipt. </p>\n<p>When you are finished with the online application, you will receive a digital confirmation. Print this page out and bring it with you to your visa interview at the American embassy or consulate. The confirmation page should have a barcode on it, which the immigration official will use to locate your application. </p>\n<p>The next step is to contact your nearest <a href=\"https://www.usembassy.gov/\">US consulate or embassy</a> to schedule an interview. Each particular embassy/consulate may have additional application requirements, so check with them for a more detailed understanding of which documents to bring with you. </p>\n<p>In some cases you will also need to print and fill out the <a href=\"https://eforms.state.gov/Forms/ds156_e.pdf\">Non-immigrant Treaty Trader/Treaty Investor Application</a>, which allows you to explain your investment and business plan, before your interview. </p>\n<h3>Gather Your Documents</h3>\n<p>When filling out the DS-160 you will need to have number of documents and information nearby, including your passport, travel itierary, dates of your five previous trips to the US, previous US visa applications, and a copy of your latest resume or CV.</p>\n<p>If you&#8217;re a <a href=\"http://nomadcapitalist.com/2018/01/17/renounce-us-citizenship-ultimate-guide/\">former US citizen</a>, gathering the dates of your previous five trips to the United States may be difficult, be a professional can help you determine how to handle it.</p>\n<p>Which documents you need for your visa interview will vary depending on the consulate you are applying from and your nationality. The immigration official also reserves the right to request any additional documents they may deem necessary. </p>\n<p>The general documents everyone needs at the interview are a passport, non-immigrant visa application form confirmation, nonimmigrant Treaty Trader/Treaty Investor Application, and application fee receipt.</p>\n<p>You should anticipate that you&#8217;ll need to present not only proof of funds, but also of where your funds originated. This is pretty commonplace for most investment visa programs since no country wants to welcome criminals. Some countries do not permit investors to use funds that were inherited, towards their investment. Instead, they want to see proof that you can turn a profit on your own. For the E-2 visa, your funds can come from inheritance, lottery winning, gifts, basically anywhere so long as the funds weren&#8217;t obtained in an illicit fashion. </p>\n<p>It&#8217;s likely that you&#8217;ll be asked to submit your resume or CV proving your business experience, proof that you own at least a 50% share in the business venture, and a business plan as well. </p>\n<p>You may also be asked to submit documents proving your intent to leave the US once your visa has expired and your ability to cover the cost of the trip. </p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/us-e2-visa-consulting.jpg\" alt=\"US E-2 Visas for consulting businesses\" width=\"700\" height=\"466\" class=\"size-full wp-image-26340\"><h3>Attend the Visa Interview</h3>\n<p>At the interview, the immigration official will determine whether you are a good fit for an E-2 visa. He or she may request more documents from you or indicate that your application needs additional administrative processing. If this is the case, any issues will usually be resolved within 60 days. </p>\n<p>Be sure to triple check your application before submitting it and making your appointment for an interview. If you&#8217;ve made any errors filling out your application, you may be asked to leave, try again, and schedule another appointment, an enormous frustration and waste of time. Trust us, you do not want to go through security at an American consulate or embassy more than you absolutely have to. </p>\n<p>While there&#8217;s no saying how long the American bureaucrats will keep you waiting, if all goes well the interview itself should only take a few minutes. If your spouse and children over the age of 14 are applying as well, they will also need to come with you to the consulate or embassy for an interview at the same time. Your embassy/consulate may require them to sit for an interview as well, which can cause abundant scheduling problems with the embassy/consulate. </p>\n<h3>Being Approved for an E-2 Visa</h3>\n<p>If your application is approved on the spot, you&#8217;ll be fingerprinted and asked to leave your passport at the consulate/embassy, as will your spouse and children. You&#8217;ll also have to pay an additional fee to cover the visa. The immigration official will let you know whether you will be expected to pick up your passport and visa in person or whether it will be couriered to you. </p>\n<p>If you thought being approved for the visa was the end of your worries, sorry to tell you that is not the case. Your visa does not technically guarantee that you&#8217;ll actually be admitted to the US. Once you arrive, your can still be rejected at the the port of entry by a U.S. Customs and Border Protection (CBP) official. The vast majority of the time, you won&#8217;t have too much to worry about through so long as you don&#8217;t bring with you any agricultural goods or any other banned or illegal items. </p>\n<p>If you are allowed entry, your passport will be stamped which means your visa period has begun. Unless you apply to extend your stay, staying in the US beyond your vise period can result in serious consequences, including ineligibility for future visas. </p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/us-e2-visa-utah.jpg\" alt=\"E-2 Visa for Utah\" width=\"700\" height=\"467\" class=\"size-full wp-image-26341\"><h2>Getting a E-2 Visa: a Summary</h2>\n<p>While dealing with US immigration bureaucracy is rarely a pleasant experience, you can probably tell that the E-2 visa process is generally more simple than some other options out there. That&#8217;s largely because the E-2 visa is a non-immigrant visa. For those who do dream of US citizenship, this probably isn&#8217;t the visa option for you, but if you&#8217;re an American who decided to renounce citizenship or you already hold a stronger passport, E-2 could be a good option. </p>\n<p>To summarize, the process for an E-2 visa is as follows:</p>\n<li> Obtain citizenship to one of the E-2 countries through descent, <a href=\"http://nomadcapitalist.com/2014/09/12/second-citizenships-can-get-marrying-a-foreigner/\">marriage</a>, or investment (if you don&#8217;t already have it)</li>\n<li> Apply for an E-2 visa online and pay the fee</li>\n<li> Check out the <a href=\"https://en.wikipedia.org/wiki/List_of_diplomatic_missions_of_the_United_States\" rel=\"noopener\" target=\"_blank\">US Embassy</a> website to make an appointment at a nearby consulate</li>\n<li> Inquire about the specific documents they will require for your case</li>\n<li> Show up for your interview with all required documents and hope they don&#8217;t ask you to come back</li>\n<li> Get fingerprinted and pay the issuance fee</li>\n<li> Wait a few weeks for your passport to be returned with the E-2 visa inside</li>\n<li> Enter the United States</li>\n<li> Launch your business enterprise and live the American dream, but for no more than 120 days per year to avoid the full brunt of US income tax law</li>\n<p>From our perspective, the E-2 visa application is not the most rigorous or costly, but is does require careful planning. There may be other options that allow you access to the United States without undergoing a business investment or employment. If your goal is tax minimization in the long-run, options like <a href=\"http://nomadcapitalist.com/2018/07/19/how-to-get-canadian-citizenship/\" rel=\"noopener\" target=\"_blank\">Canadian citizenship</a> or <a href=\"http://nomadcapitalist.com/2018/08/29/how-to-get-new-zealand-citizenship/\">New Zealand citizenship</a> may prove better.</p>\n<p>Rest assured that at Nomad Capitalist, we&#8217;ve helped plenty of entrepreneurs through this process. Actually, some of us have even been through similar processes ourselves. If you&#8217;re trying to determine the <a href=\"http://www.nomadcapitalist.com/second-passport/\">best second passport</a> for you or how to get an E-2 visa, <a href=\"https://nomads.lpages.co/apply/\" rel=\"noopener\" target=\"_blank\">we may be able to help</a>.</p>\n<ul class=\"abh_tabs\"> <li class=\"abh_about abh_active\"><a href=\"#abh_about\">About</a></li> <li class=\"abh_posts\"><a href=\"#abh_posts\">Latest Posts</a></li></ul><a href=\"http://nomadcapitalist.com/author/andrea-pockovic/\" class=\"url\" title=\"Andrea Pockovic\"><img src=\"http://nomadcapitalist.com/wp-content/uploads/gravatar/nomad-capitalist-author-andrea.jpg\" class=\"photo\" width=\"80\" alt=\"Andrea Pockovic\"></a><p class=\"abh_social\"> </p><h4>Latest posts by Andrea Pockovic (<a href=\"http://nomadcapitalist.com/author/andrea-pockovic/\">see all</a>)</h4><ul> <li> <a href=\"http://nomadcapitalist.com/2018/08/30/how-to-get-a-us-e-2-visa/\">How to Get a US E-2 Visa: the Ultimate Guide</a> - August 30, 2018 </li> <li> <a href=\"http://nomadcapitalist.com/2018/08/29/how-to-get-new-zealand-citizenship/\">How to Get New Zealand Citizenship: the Ultimate Guide</a> - August 29, 2018 </li> <li> <a href=\"http://nomadcapitalist.com/2018/07/19/how-to-get-canadian-citizenship/\">How to Get Canadian Citizenship: The Ultimate Guide</a> - July 19, 2018 </li></ul></p></div>","title":"How to Get a US E-2 Visa: the Ultimate Guide"}},"pageContext":{"id":"5b92396a87be0583cfde67fc"}}