{"data":{"mongodbDatabaseArticles":{"id":"5b921d1a87be0571ac1b04f6","content":"<div><h2></h2>\n<h2></h2>\n<h2>The fastest ways to become a citizen and get your second passport</h2>\n<p></p><img class=\"wp-image-24370 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/07/Passport4.jpg\" alt=\"become a citizen\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Before we review a few specific countries, let&#8217;s discuss each of the fastest ways to obtain citizenship&#8230;</p>\n<p><strong>1. Citizenship by descent</strong><br>\nIf you have ancestors from Europe, you may be able to obtain a second passport very inexpensively. The process is called <a href=\"http://nomadcapitalist.com/2013/05/19/top-5-second-citizenship-by-descent/\">citizenship by descent</a> and usually takes anywhere from six months &#8212; if you&#8217;re really lucky &#8212; to 1-2 years (seeing as most countries that offer it have substantial bureaucracy).</p>\n<p><strong>2. Make an investment</strong><br>\nIt goes without saying that if you have significant cash to invest, the passport process can be sped up. We won&#8217;t be discussing the process of citizenship by investment in this article, but you can <a href=\"http://nomadcapitalist.com/2016/06/20/best-citizenship-by-investment-programs/\" target=\"_blank\" rel=\"noopener\">read this article </a>that we update on regular basis to learn about the various citizenship by investment programs, which start at $45,000 per person, or $100,000 per person for a halfway decent passport.</p>\n<p>Most decent economic citizenship programs can be found in either the Caribbean&#160;or in Europe (<a href=\"http://nomadcapitalist.com/2015/02/10/citizenship-malta-freedom-price-tag/\">Malta</a> runs closer to $1 million).</p>\n<p><strong>3. Marry a foreign national</strong><br>\nIf you are lucky enough to fall in love with someone with a great passport, it&#8217;s possible you could be a naturalized citizen of their home country. Foreign spouses <a href=\"http://www.nolo.com/legal-encyclopedia/how-naturalizing-helps-your-foreign-spouse-immigrate.html\" target=\"_blank\" rel=\"noopener\">often qualify</a> for a shortened waiting period for naturalization, although language requirements sometimes exist. Few countries still offer instant citizenship for foreign spouses, but there are still <a href=\"http://nomadcapitalist.com/2014/12/24/get-brazil-citizenship-investment-marriage/\">a few attractive options</a>. Read more <a href=\"http://nomadcapitalist.com/2014/12/24/get-brazil-citizenship-investment-marriage/\">here</a>.</p>\n<p><strong>4. Receive special treatment</strong><br>\nIf you are an exceptional artistic or athletic talent, or if you invest enough money, some countries allow the President to waive naturalization requirements (including language requirements) and make anyone a citizen. Examples include Albania, Qatar, and Singapore; Poland&#8217;s former president used to do this, but the current party does not.</p>\n<p>Special treatment is also the basis for Austria&#8217;s <a href=\"http://nomadcapitalist.com/2014/05/15/economic-second-citizenship-in-austria/\" target=\"_blank\" rel=\"noopener\">alleged economic citizenship program</a>, but it is rarely used and most people who would want an Austrian passport wouldn&#8217;t qualify on the basis of &#8220;not seeming Austrian only&#8221;.</p>\n<p>Now, let&#8217;s review citizenship options that don&#8217;t require a lucky genealogy line or a lot of cash. The following is a list of the countries where it is the easiest to become a citizen.</p>\n<p>&#160;</p>\n<h2>The fastest countries to become a citizen through residency</h2>\n<p>Back when I actively chased as many frequent flier miles as possible, I would sometimes take flights solely for the purpose of getting miles. More miles meant higher status with the airline. We called these &#8220;butt-in-seat miles&#8221; because you had to actually fly to get them.</p>\n<p>Similarly, the fastest way to get a second passport for most people is to spend &#8220;butt-in-country time&#8221;. Becoming a resident of a foreign country and starting the clock ticking on naturalization is the easiest way to go if you don&#8217;t have the benefit of luck or substantial wealth.</p>\n<p>&#160;</p>\n<h3>Macedonia (1 year)</h3>\n<p></p><img class=\"wp-image-24368 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/07/macedonia.jpg\" alt=\"become a citizen\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Macedonia offers the best of both worlds: the benefits of Europe and visa-free access to the Schengen Area, but none of the nonsense associated with being a part of the European Union. Located south of Serbia in the Balkans, Macedonia is one of the many business-friendly countries in eastern Europe. Tax rates for both companies and individuals are a flat 10%, and the government is efficient.</p>\n<p>If you&#8217;re willing to start a business and hire local workers, you can become a Macedonian citizen in less than one year. In fact, Macedonia has the least talked about <a href=\"http://nomadcapitalist.com/2016/06/20/best-citizenship-by-investment-programs/\">economic citizenship program</a> in the world, targeted specifically at entrepreneurs who can invest at least 400,000 euros into a real business.</p>\n<p>Similar to Portugal&#8217;s Golden Visa program <a href=\"http://nomadcapitalist.com/2016/06/22/portugals-golden-visa-entrepreneurs/\">for entrepreneurs</a>, Macedonia requires you to tie up your capital but gives you citizenship in as little as 6-12 months. There is no straightforward way to start the process unlike in other European countries, although I have excellent contacts in the region who can help. Macedonia also no longer requires you to live there for six months in most cases.</p>\n<p>&#160;</p>\n<h3>Dominican Republic (2 years)</h3>\n<p></p><img class=\"wp-image-24367 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/07/dominican-republic.jpg\" alt=\"become a citizen\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Not to be confused with the island nation of Dominica (which allows for nearly instant citizenship in exchange for a six-figure donation), the Dominican Republic claims to offer second citizenship to foreigners with cash in as little as two years. This doesn&#8217;t always work in practice, but rather in theory.</p>\n<p>While the Dominican Republic passport is of rather poor quality, it does offer access to some highly livable &#8220;usual suspect countries&#8221; that <a href=\"http://nomadcapitalist.com/2015/03/23/easiest-countries-for-perpetual-travelers/\">let practically anyone in as a tourist</a>.</p>\n<p>One way to speed up the naturalization timeline is to invest $200,000 in real estate or a business; (<a href=\"http://nomadcapitalist.com/2014/10/17/colombia-second-passport-program-real-estate-investors/\">Colombia similarly offers a faster citizenship</a> route for investors with this amount of cash.) However, those who can prove they have a steady income and are willing to spend some time in the DR can waive the investment requirement.</p>\n<p>Nevertheless, I know people who qualified for citizenship in the Dominican Republic in two years but have waited far longer to get it. So, as with any country, the letter of the law may not always prevail.</p>\n<p>&#160;</p>\n<h3>Paraguay (3 years)</h3>\n<p></p><img class=\"wp-image-24369 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/07/paraguay.jpg\" alt=\"\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>One of the easiest countries to get citizenship in has been Paraguay. While many would be hard-pressed to locate it on a map, the country has a rather good travel document that offers visa-free travel to Europe and all of South America. But, I can argue that in some cases fastest is not always the best.</p>\n<p>In theory, you could become a naturalized citizen of Paraguay in just three years. However, there are challenges that in my opinion make this option not so appealing anymore. <a href=\"http://nomadcapitalist.com/2017/01/30/paraguay-citizenship-residency-2017/\">You can read more about it here.</a></p>\n<h3></h3>\n<h3>Uruguay (3 years*)</h3>\n<p></p><img class=\"wp-image-24372 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/07/uruguay.jpg\" alt=\"become a citizen\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>If you are part of a family unit actually living on the ground in Uruguay, you can apply for citizenship after three years, so long as you can show substantial ties to the country. That&#8217;s what the asterisk means; if you&#8217;re single and your family stays at home, the wait is extended to five years. However, &#8220;family unit&#8221; does not only refer to a spouse; for instance, a single child can live with a parent, and still qualify.</p>\n<p>Owning real estate, renting a real apartment, being a member of social clubs, and having a local doctor all count. Claiming Uruguayan citizenship has become extremely difficult in recent years for this reason. I generally recommend against Uruguay partially because of this difficulty, but also because of the opportunity cost. There are simply better options unless you really intend to become Uruguayan.</p>\n<p>&#160;</p>\n<h3>Russia (3 years)</h3>\n<p></p><img class=\"wp-image-24371 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/07/russia.jpg\" alt=\"become a citizen\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>If you are willing to start a business or move your existing business to Russia, you may be able to obtain Russian citizenship within three years by merely paying taxes you would have had to pay anyway. While we often talk about <a href=\"http://nomadcapitalist.com/2015/04/24/important-tax-strategies-digital-nomads/\">low or no-tax offshore strategies for entrepreneurs</a>, paying 13-19% in Russia may be worthwhile if you would have purchased economic citizenship from another country instead.</p>\n<p>You can learn more about <a href=\"http://nomadcapitalist.com/2015/03/11/how-to-get-russian-citizenship-by-investment/\">Russian citizenship for entrepreneurs here</a>. Russia&#8217;s passport does not offer access to Europe, but many successful Russians have long-term Schengen visas or merely obtain European residency from countries like <a href=\"http://nomadcapitalist.com/2016/04/20/spanish-entrepreneur-visa-may-be-bad-idea/\" target=\"_blank\" rel=\"noopener\">Spain</a>, Portugal, Italy, <a href=\"http://nomadcapitalist.com/2014/03/19/buy-real-estate-latvia-get-second-residency-passport/\">Latvia</a>, and others.</p>\n<p>&#160;</p>\n<h3>Options that No Longer Exist</h3>\n<p>It&#8217;s important to note that Argentina does NOT offer citizenship in two years, despite what some might say. The Argentina citizenship process requires you to live there for two years to obtain permanent residency, and then three more to become a citizen.</p>\n<p>Similarly, I occasionally still see someone suggest that Belgium citizenship can be had after three years. As of 2013, however, Belgium extended their naturalization timeline to a minimum of five years.</p>\n</div>","title":"The fastest countries in the world to become a citizen"}},"pageContext":{"id":"5b921d1a87be0571ac1b04f6"}}