{"data":{"mongodbDatabaseArticles":{"id":"5b9248db87be056953db7c03","content":"<div><p>I'm not ready to write about this myself, so here's some words by another blogger that sum up the most complex set of feelings I've had since <a href=\"/reset-your-life/\">I returned home</a>:</p> <blockquote><p> The experience of living abroad was a huge, adrenaline-pumping high. And coming home, a floor-shattering free fall. </p></blockquote> <blockquote><p> So upon coming home, surrounded by familiar faces and places, I began to find comfort again in those old familiar things. Simultaneously, since I myself was no longer the most familiar thing, <strong>I began losing touch with my Self. And so starts a downward spiral off a euphoric high. This is the most shocking part of coming home.</strong></p> <p>I felt flat. Anxious. Insecure. Lost. A general uneasiness and sense that something was missing. I was uncharacteristically apathetic toward everything. It feels like the worst hangover ever. </p></blockquote> <blockquote><p> <strong>Upon coming home, I noticed how quickly I began to compare myself to others.</strong> There&#8217;s an uneasy heaviness in this. (..) just being in the presence of people who know me back at home, I feel more influenced.</p> <p>While traveling, I felt zero need to impress anyone but myself. And with no set agenda, I was able to do whatever the hell I wanted to do. </p></blockquote> <blockquote><p> This is why travel is sometimes referred to as a drug. Similar to drugs or alcohol, travel has the power to temporarily remove all inhibitions and superficial worries, heighten the senses, and if only for a moment, allow one to ignore ego and feel a sense of oneness with the world. For me, <strong>travel evokes a sense of aliveness that is unparalleled to anything I&#8217;ve ever experienced.</strong> </p></blockquote> <blockquote><p> Surrounded by people who know nothing about me, I had the opportunity to be whoever or whatever I wanted with each new country, city, or hostel. But instead of creating some false persona, I just acted like myself. With no inhibitions. no reservations, and no superficial bullshit there&#8217;s only one thing left: the purest feeling of being alive.</p> <p>Something funny happens when you accept who are and are free to do whatever you want. First, you feel at peace because by doing only things you want to do, you&#8217;re being true to yourself. Second, like-minded people enter your life as if they&#8217;ve miraculously dropped out of the sky and placed purposefully front of you. </p></blockquote> <blockquote><p> And what if, within the prisons of routine and familiarity, I have a hard time remembering that? Well, maybe it&#8217;s time to pack a bag and hit the road again. </p></blockquote> <p>&#8212; Matthew Trinetti on <a href=\"http://www.giveliveexplore.com/2013/01/19/thoughts-on-coming-home-part-2-reverse-culture-shock/\">Thoughts On Coming Home</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"The free fall that is coming home after traveling the world"}},"pageContext":{"id":"5b9248db87be056953db7c03"}}