{"data":{"mongodbDatabaseArticles":{"id":"5b93833987be056953db7e3e","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"5ba1\" id=\"5ba1\" class=\"graf graf--h3 graf--leading graf--title\">Creating a strong &#8216;office&#8217; culture for remote&#160;workers</h1><h2 name=\"d805\" id=\"d805\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">How the dispersed team at Student Loan Hero prioritizes communication and connection</h2></p><p name=\"1060\" id=\"1060\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--figure\">A<strong class=\"markup--strong markup--p-strong\">ndy Josuweit</strong> is the Austin, TX-based CEO you&#8217;re more likely to catch in a coffee shop than a corner office. The founder of <a href=\"https://studentloanhero.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Student Loan Hero</a>, a solution for managing and repaying student loans, works remotely. And so do the 70 employees of his six-year-old company.</p><p name=\"b3c7\" id=\"b3c7\" class=\"graf graf--p graf-after--p\">Josuweit graduated from college in 2009 during the recession and was unable to find work. Instead of heading down the classic cubicle-bound 9-to-5 career path, he found himself off to an internship in Africa, then Asia, to chase his entrepreneurial pursuits on a budget, followed by South America for an accelerator. &#8220;[Remote work] is all I know,&#8221; says Josuweit.</p><blockquote name=\"ac6e\" id=\"ac6e\" class=\"graf graf--pullquote graf-after--p\">To keep everyone on the same page, Josuweit advises, &#8220;You really have to overemphasize the importance of communication. You need to figure out how you can create a safe environment to communicate and how you can allow for constructive confrontation and have healthy debates.&#8221;</blockquote><p name=\"e624\" id=\"e624\" class=\"graf graf--p graf-after--pullquote\">He feels like this needs to be a priority because remote work diminishes access to nonverbal communication and provides limited opportunities to build rapport and trust with colleagues. &#8220;You don&#8217;t have the opportunities to sit down to lunch together or go out for happy hour with people.&#8221;</p><p name=\"f289\" id=\"f289\" class=\"graf graf--p graf-after--p\">While Student Loan Hero does do two annual retreats to get their employees face-to-face, they&#8217;ve found an easy daily workaround for body language by using emojis and gifs &#8220;to share how we&#8217;re feeling on a deeper level.&#8221;</p><p name=\"5aae\" id=\"5aae\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Jacy Cruz</strong>, who joined the company four months ago as their Customer Experience Manager, says sometimes she feels like she doesn&#8217;t use enough emojis. Cruz, who&#8217;d lobbied hard at her last company for more flexibility around working from home, did have some concern about going fully remote, &#8220;Because I&#8217;m shy and I thought that it was going to be even more difficult for people to get to know me.&#8221;</p><p name=\"91be\" id=\"91be\" class=\"graf graf--p graf-after--p\">Fortunately, Student Loan Hero has several initiatives in place to foster connectedness. They have two all-company meetings each week. The Monday meeting is more business focused, but the Friday afternoon meeting is more laidback and functions as a &#8220;happy hour.&#8221; Colleagues can chat about their wins from the week and their plans for the weekend, just like they would on a Friday afternoon in the office.</p><p name=\"ee03\" id=\"ee03\" class=\"graf graf--p graf-after--mixtapeEmbed\">Cruz also has her first Slack <a href=\"https://slack.com/apps/A11MJ51SR-donut?cvosrc=referral.slackhq.six-ways-that-channels-can-transform-your-work&amp;utm_source=slackhq&amp;utm_medium=referral&amp;utm_content=six-ways-that-channels-can-transform-your-work&amp;utm_campaign=slackhq\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Donut</a> bot chat coming up. The bot will do the work of pairing her with someone at random within her company for a 15 to 20-minute chat. Cruz likes this setup because she&#8217;s &#8220;not naturally inclined to reach out to people&#8221; she&#8217;s not working with directly.</p><p name=\"335f\" id=\"335f\" class=\"graf graf--p graf-after--p\">But her favorite community building effort is the &#8220;Learning Rewards&#8221; program. The company has a pre-approved list of books they recommend employees read. Employees are encouraged to block out at least one hour on their calendar during the workweek to read and are rewarded with $15 for each hour they spend reading. &#8220;I love it because they recognize it&#8217;s a small amount of money for them to pay for their employees to do two things: One is to immediately begin applying whatever they&#8217;re learning to their jobs, but the second thing, that I think is actually more important, is to develop this habit, this thirst for learning.&#8221; Cruz continues, &#8220;And so many people are burnt out at work, what&#8217;s their incentive to go out and learn things unless it&#8217;s about trying to find a new job and get paid more.&#8221;</p><p name=\"982e\" id=\"982e\" class=\"graf graf--p graf-after--p\">And what Student Loan Hero is doing is working. <strong class=\"markup--strong markup--p-strong\">Shaun Moten</strong>, the HR Coordinator at Student Loan Hero who helps develop and manage employee culture, says, &#8220;Up until December of last year, we had a non-existent turnover rate. Then present day, we&#8217;ve had three employees to leave the company, so it&#8217;s still ridiculously low to have been around since 2012.&#8221;</p><p name=\"c11f\" id=\"c11f\" class=\"graf graf--p graf-after--p\">Moten assists new hires in establishing a daily routine and conducts &#8220;stay interviews&#8221; to unearth and address any employee grievances early. For her, Student Loan Hero is &#8220;HR heaven.&#8221;</p><p name=\"ce53\" id=\"ce53\" class=\"graf graf--p graf-after--p\">Josuweit, the CEO, predicts a more remote workforce will become the norm. &#8220;We&#8217;re going to see this demand in the workplace to create more work-life balance, or work-life integration. And I think remote work is somewhat inevitable. I think it&#8217;s kind of like fighting gravity.&#8221; But that doesn&#8217;t mean the future of work is without issue, says Josuweit. &#8220;It comes with its own unique challenges.&#8221; But for him and the entire team at Student Loan Hero, the extra effort is worth the reward.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*gKknc-h3F0rFUvzzmbxROQ.png\"><a href=\"https://www.twitter.com/mindahoney\" class=\"markup--anchor markup--figure-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Minda Honey</a> hasn&#8217;t worked in a cubicle in a decade and consequently never worries her favorite stapler is going to go&#160;missing.<h4 name=\"770a\" id=\"770a\" class=\"graf graf--h4 graf-after--figure\">Got another minute? Check&#160;out:</h4></div>","title":"Creating a strong ‘office’ culture for remote workers"}},"pageContext":{"id":"5b93833987be056953db7e3e"}}