{"data":{"mongodbDatabaseArticles":{"id":"5b95eaff87be05832748ffec","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/lolaakerstrom.jpg\" alt=\"travel photographer and writer Lola A. Akerstrom\"><br> Back in 2006, during my first trip around the world, I met a Swedish girl. We traveled together for a bit and the following year I went to visit her in Sweden. Though that relationship didn&#8217;t last, my love for Sweden did and, in subsequent years, I learned Swedish and <a href=\"https://www.nomadicmatt.com/travel-blogs/moving-to-sweden/\" rel=\"noopener\" target=\"_blank\">even tried to move to Sweden</a>. I love everything Swedish. And so does my friend Lola. Lola and I met back in 2008 when travel blogging was in its infancy. Unlike me, she&#8217;s had success in making a life in Sweden, where she now lives with her husband and son. She&#8217;s one of the favorite people in the industry and I love the imagery in her writing and the beauty in her photography.</p><p>In her new book, <a href=\"https://www.amazon.com/Lagom-Swedish-Secret-Living-Well/dp/147224933X/ref=tmm_hrd_swatch_0?_encoding=UTF8&amp;qid=&amp;sr=\" rel=\"noopener\" target=\"_blank\">Lagom</a>, she discusses life in Sweden and Swedish culture. Today, I jealously interview her about life there.</p><p><strong>Nomadic Matt: Tell everyone a bit about yourself.</strong><br> <strong>Lola:</strong> I&#8217;m a Nigerian-born, US-educated, Sweden-based writer and photographer focusing mostly on exploring culture through food, tradition, and lifestyles. My photography is represented by National Geographic Creative, and I was recently awarded the prestigious 2018 Travel Photographer of the Year Bill Muster Award from the Society of American Travel Writers (SATW).</p><p>I actually took a nontraditional path to this new life, as I worked as a web programmer and GIS system architect for 12+ years before the full career shift into the travel media industry.</p><p>I&#8217;ve always been fascinated by the nuances of culture: what makes us different and what our similarities are. And so this curiosity and acknowledgement really underpins pretty much all my work as a travel writer and photographer.</p><p><img src=\"https://media.nomadicmatt.com/lolaakerstrom8.jpg\" alt=\"Lola Akerstrom and a snowy winter scene in Sweden\"></p><p><strong>How did you end up in Sweden?</strong><br> I met my husband in 2006 while living in the US. After logging thousands upon thousands of air miles, as well as temporary stints in <a href=\"https://www.nomadicmatt.com/travel-guides/sweden-travel-tips/stockholm/\" rel=\"noopener\" target=\"_blank\">Stockholm</a>, I officially moved over in 2009. It really was an intercultural, interracial, and intercontinental union in many ways. We now have two kids, so Sweden will be home for a while for many reasons, the prime one being that it&#8217;s pretty darn perfect for families.</p><p><strong>How do you find life in Sweden? Good? Bad?</strong><br> Life in <a href=\"https://www.nomadicmatt.com/travel-guides/sweden-travel-tips/\" rel=\"noopener\" target=\"_blank\">Sweden</a> is what you make of it, and that&#8217;s why I also wrote this book &#8212; as a handy cultural guide that can help you integrate and deeply understand Swedish culture and its nuances. Having lived in both Nigeria and the US for extended periods of time, I appreciate living here with a young family. Overall, the quality of life is fantastic in terms of stress levels. There is enough time to dedicate to the family, as well as generous benefits, which we all contribute to through our taxes.</p><p><strong>What&#8217;s your least favorite part about living in Sweden?</strong><br> I often say Sweden is the most open society run by the most private people, and I explain why in the book. Sweden does have its dark sides, and I always say the main difference is this: I can be like Oprah Winfrey if I want to as a black woman in the US, despite all the racial tensions. In Sweden, while you&#8217;ll be left in a small corner to live your happy life, trying to be a CEO or magnate like Oprah is a gargantuan task. There are people who still don&#8217;t get called for job interviews because of the names on their r&#233;sum&#233;s. So overall, while I love living here, no society is perfect, and Sweden has a lot of integration issues it needs to work out.</p><p><strong>Why did you write this book?</strong><br> So, the Swedish word lagom has recently emerged as the lifestyle trend of 2017 and of course, publishers are jumping on it with different lifestyle books &#8212; from recipes to interior decor.</p><p><img src=\"https://media.nomadicmatt.com/lolaakerstrom4.jpg\" alt=\"People hanging out near blossoming trees in Stockholm\"></p><p>But I needed to put a book out there that was beyond cinnamon bun recipes, because lagom is not a word that is warmly embraced or even liked by many Swedes themselves for various reasons, including the fact the ethos has over time morphed to denote average, boring, and middle-of-the-road. I detail all this in the book, as well as explain why lagom itself is inherently a good ideal as opposed to jante, which is the negative parasitic ethos that attaches itself to lagom and brings the negativity. But it is the key to understanding the Swedish mindset.</p><p>I have been living in Sweden for eight years, and <a href=\"https://www.slowtravelstockholm.com/\" rel=\"noopener\" target=\"_blank\">writing about the country</a> and its culture for even longer. I am also married to a Swede and have a unique vantage point of observing the culture both objectively and subjectively. So I explain lagom in a way that a foreigner fully gets it, as well as holding up a mirror to Swedes so they see how lagom is expressed in interactions with other people. It can be very difficult to write about something that&#8217;s very intrinsic to you in a way that others can fully understand without coming off as patronizing and condescending.</p><p>It really governs the Swedish psyche, and individual bubbles of lagom are definitely changing and morphing with each passing generation.</p><p>I needed to write a well-balanced cultural book that could still stand once the Scandi-trends wave washed over.</p><p><strong>What does lagom mean and why is it important?</strong><br> On the surface, lagom is often described as &#8220;not too little, not too much, just right,&#8221; but it&#8217;s a lot more nuanced than that and lies closer to &#8220;optimal.&#8221; It is the key to unlocking the Swedish psyche and governs almost all aspects of life and culture in the country.</p><p>It also transforms its meaning in different contexts &#8212; from &#8220;less is more&#8221; in terms of d&#233;cor and &#8220;moderation&#8221; in terms of food to &#8220;harmony and balance&#8221; in terms of society and &#8220;mindfulness&#8221; in terms of well-being.</p><p>If one were to boil down the true essence of lagom to its very core, it means striving for the ultimate balance in life that, when applied to all aspects of one&#8217;s existence, can help guide you toward operating at your most natural, effortless state.</p><p>The state and measurement of lagom mean different things to different folks. My satisfaction may vary from yours, but we can both be satisfied. Lagom represents the ultimate sweet spot or golden mean in your own life, and more importantly, it encourages you to fully operate within that sweet spot that&#8217;s just right for you.</p><p><img src=\"https://media.nomadicmatt.com/lolaakerstrom3.jpg\" alt=\"a typical Swedish cottage with a Swedish flag\"></p><p><strong>For travelers to Sweden, how can they detect lagom at work or play?</strong><br> Many people often describe Swedes (in Sweden, not outside of Sweden) as reserved, inaccessible, and maybe even cold and flippant, but it&#8217;s often just lagom&#8217;s mindfulness at play. Locals will give you your space and ensure you&#8217;re not inconvenienced by their presence. So, Swedes naturally keep their distance from a place of mindfulness, not because they don&#8217;t want to be around you. (Outside of Sweden, they are quick to ditch lagom in social settings.)</p><p>At work, lagom is always looking for the best solution, so there&#8217;s a lot of planning, lots of meetings, lots of consensus, lots of teamwork, you get the gist&#8230; to make sure they arrive at the optimal, lagom solution to all problems.</p><p>For example: Many foreigners working or doing business in Sweden often lament the amount of time Swedes put into upfront planning and preparation. Agendas are triple-checked, and several meetings are called to plan every single item on said agendas. Plans can take months to put in place before moving to the next step of implementing each item on those plans.</p><p>For a culture that prides itself on efficiency, it could seem these inherent acts of zealous planning are counterproductive, and they can be seen as wasting time and resources. However, because lagom craves balance by trimming excess around its edges, it requires adequate planning. &#8220;Adequate&#8221; is measured by whatever it takes to prune irrelevance, regardless of how long it takes.</p><p>To be efficient means to perform and function in the most optimal manner possible with the least waste of time, resources, and energy. This very definition of efficiency mirrors the core of lagom.</p><p>So lagom says it is perfectly OK to spend as much time as needed to prepare ourselves and strongly develop our plans, because that&#8217;s the only way we can guarantee efficiency.</p><p><img src=\"https://media.nomadicmatt.com/lolaakerstrom5.jpg\" alt=\"an aerial view over stockholm\"></p><p><strong>For travelers who would like to date a Swede, how can understanding lagom help them?</strong><br> Swedes don&#8217;t naturally divulge information or overshare, so sometimes it can be hard to even gauge or assess what&#8217;s going on in a relationship. And it&#8217;s not a culture that overly gesticulates with hands or uses flattering words, so knowing if a Swede is interested in you can be denoted by their unusually prolonged eye contact.</p><p>So, when out on a date, always have follow-up questions to keep the conversation going and to avoid your date awkwardly ending at &#8220;yes or no&#8221; answers. Because they will do so, in an effort not to overshare without being asked.</p><p>For someone going on a date expecting to be lavishly wined and dined, Swedes are generally conditioned to split their bills, to always repay favors, and to not be duty-bound to anyone, especially financially, by keeping that scale balanced. So this can come as a nasty surprise at the end of the night if you haven&#8217;t discussed it before the waiter brings out the menu.</p><p>And if you&#8217;re in relationship with a Swede and have issues or questions, just ask straight out because Swedes are very direct. And be prepared for those direct answers!</p><p><strong>Why are people so fascinated with Sweden?</strong><br> I think a lot of the fascination comes from the quality of life and just how progressive the society is. Another more superficial angle has to do with physicality &#8212; from people and landscapes to interior d&#233;cor and architecture. I mean, the city of Stockholm itself is absolutely stunning, and it spreads across 14 islands, which you can view from some <a href=\"https://www.slowtravelstockholm.com/photography/photographers-best-views-of-stockholm-photos/\" rel=\"noopener\" target=\"_blank\">nice vantage points</a> in town. Sweden consistently ranks in the top 10 happiest countries, so there are clearly things Sweden is getting right.</p><p><strong>What&#8217;s the one thing you want people to take away from your book?</strong><br> Lagom is a mindset that fundamentally battles stress. Having too much or too little causes stress, so lagom tries to find its balance between both with the optimal solution by reducing excess. Not perfection, but the best solution.</p><p>Think of it as a scale that always needs to be balanced. Too much or too little tips the scale sharply to one side or the other, so lagom balances itself (&#8220;just right&#8221;) by trimming excess and getting rid of all sources of stress within our control &#8212; from material things to relationships that drain us.</p><p>Lola A. &#197;kerstr&#246;m is an award-winning writer, speaker, and photographer with National Geographic Creative. She regularly contributes to high profile publications such as AFAR, the BBC, The Guardian, Lonely Planet, Travel + Leisure, and National Geographic Traveler. Lola is also the editor of Slow Travel Stockholm, an online magazine dedicated to exploring Sweden&#8217;s capital city in depth. She lives in Stockholm and blogs at <a href=\"https://www.lolaakinmade.com/\" rel=\"noopener\" target=\"_blank\">Geotraveler&#8217;s Niche</a>.<br> <strong><br> <a href=\"https://www.amazon.com/Lagom-Swedish-Secret-Living-Well/dp/147224933X/ref=tmm_hrd_swatch_0?_encoding=UTF8&amp;qid=&amp;sr=\" rel=\"noopener\" target=\"_blank\">You can pick up a copy of her book on Amazon</a>.</strong> (It&#8217;s really interesting and I highly recommend it!)</p></div>","title":"Living Lagom in Sweden: An Interview With Lola Akerstrom"}},"pageContext":{"id":"5b95eaff87be05832748ffec"}}