{"data":{"mongodbDatabaseArticles":{"id":"5b937b0387be056953db7d04","content":"<div><h1 name=\"fb09\" id=\"fb09\" class=\"graf graf--h3 graf--leading graf--title\">I&#8217;ve given up my home to become a digital&#160;nomad</h1><p name=\"ed3e\" id=\"ed3e\" class=\"graf graf--p graf-after--h3\">Since two weeks I don&#8217;t have a home city, or a permanent address, and I&#8217;m not looking for one. And it feels great!</p><p name=\"4c87\" id=\"4c87\" class=\"graf graf--p graf-after--p\">In January I started a new life, building <a href=\"http://fragmentic.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">my second startup</a> and challenging myself to become a digital nomad. <a href=\"https://medium.com/@uldis/i-m-joining-pirate-summit-to-scale-it-globally-a58fba87ab58#.uycp3vsgv\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Joining Pirate Summit</a> also meant heavy travelling, I&#8217;ve been on over 100 flights this year. My friends used to joke I&#8217;m probably homeless. Now I actually am.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Ss77jp9HChkD3ewCXDQ_OA.jpeg\">Most things I now own fits into a cabin-luggage size Muji bag. Photo by Kristaps Berzinskis<p name=\"4666\" id=\"4666\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Living on a plane, huh?&#160;<br></strong>I was spending increasingly little time in my &#8216;home&#8217; in Riga, with 3 days per month in May and June. It became a place to repack my bags. But it still had a sentimental value. A lot of it. It was my home. A place to return. I drew a line from Riga to anywhere I go and back.</p><p name=\"de1c\" id=\"de1c\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;I live on a plane&#8221; is an overused phrase. But what if that could actually work? I decided to challenge myself to become a full time digital nomad.</p><p name=\"d317\" id=\"d317\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Making the jump&#160;<br></strong>Getting rid of things was the hardest. First of all I never realised how many things I own. Mostly clothes, some books (and I almost don&#8217;t read). Took me a whole day to systematically throw out most of my belongings. Some did have a sentimental value too, and frankly I didn&#8217;t feel right about throwing out things that could be useful for others. I tried to give away as much as I could.</p><p name=\"6a87\" id=\"6a87\" class=\"graf graf--p graf-after--p\">If you travel for a month, you may pack a dozen of things to last for all your trip. If you travel indefinitely you don&#8217;t really need that many things. The more you bring with you the more likely you won&#8217;t actually need them.</p><p name=\"c37b\" id=\"c37b\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Then there&#8217;s a social aspect.</strong> Our society expect you to have a house, probably a car, and a well-payed job. I&#8217;m technically unemployed (as my new startup cannot afford to pay me any salary), now I&#8217;m also homeless, never had a car either. <strong class=\"markup--strong markup--p-strong\">I think I may have removed a few things from equation.</strong> And yes, a bit scary it is.</p><p name=\"1df2\" id=\"1df2\" class=\"graf graf--p graf-after--p\">If I could only be a little more mobile and hey &#8211; now I can live in Riga, Berlin, Tehran or San Francisco.</p><p name=\"a052\" id=\"a052\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">A nomadic lifestyle</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*7AZoj0ROrjWYnLPs-kcpbg.jpeg\">Resting on a mountain slope, Damavand, Iran. Photo by&#160;<a href=\"https://medium.com/@uldis\" class=\"markup--user markup--figure-user\" target=\"_blank\">Uldis</a><p name=\"21d4\" id=\"21d4\" class=\"graf graf--p graf-after--figure\">I&#8217;m not an immigrant, as there is no country of destination for me, I am also not a tourist as I don&#8217;t really &#8216;visit&#8217; places, I live there. Just not too long. My passport lets me live in most countries for a few months a year. That&#8217;s more than enough, I don&#8217;t need a residency permit in any of them. It&#8217;s sort of a way to hack the immigration policies.</p><p name=\"ec90\" id=\"ec90\" class=\"graf graf--p graf-after--p\">I rely on sharing economy, Airbnb, friends and Couchsurfing. Wherever I am I call home. What made us so attached to locations is our friends and family. But what if my closest friends are across many cities and states?</p><p name=\"6c1d\" id=\"6c1d\" class=\"graf graf--p graf-after--p\">I can work in an office, a co-workig or coffee shop. Or &#8211; anywhere where&#8217;s internet. Every day I go to work and every day I go home to rest, just every other day it is in a different city. Nontheless, I&#8217;m curious if this could work for me. Most digital nomads I know are freelancers, their professional lives are travel-centric. I&#8217;m a CEO of an ambitious startup, I have long working hours, my job is to run a team, build a fast growing company and do fundraising. Can I run a company remotely and can it actually work? It is up to my co-founders, board and customers to judge, I guess. One thing I can do is being very open.</p><p name=\"9d65\" id=\"9d65\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Lifestyle with a few perks&#160;<br></strong>I&#8217;ve lived in the busy Shibuya ward by the famous mega-crossing, or a small and slightly abandoned village of Kiyosato, or a two floor loft in an old Nokia factory in Helsinki. Had a dinner in a restaurant in a dusty side street in Zamalek, Cairo. Or spent a day in parks with a good friend in an emerging and exciting suburb of Neukolln in Berlin. I&#8217;ve walk the narrow streets of Darabad in Tehran and lived on a private island in Bahrain. I played old computer games with kids in a refugee camp in south of Beirut. Now I&#8217;m in Chinatown of San Francisco. I&#8217;ve met some of most exciting people I wouldn&#8217;t meet if I had stayed in my home town. I made connections that will last, friendships that means so much to me, and gathered stories to be told. Can your home do it?</p><p name=\"cc3d\" id=\"cc3d\" class=\"graf graf--p graf-after--p\">Property is actually virtual. Let&#8217;s say you&#8217;d like to live in a house with a swimming pool and 5 bedrooms. How often would you need it all. You can get any house in Airbnb, whenever you need it. Boom, I have a loft with an ocean view for a party with my friends. Or a small room in a suburb when I just want to sleep and be antisocial. I don&#8217;t need to own things to enjoy them.</p><p name=\"b750\" id=\"b750\" class=\"graf graf--p graf-after--p\">So far I&#8217;ve given up basic status symbols of our society. And I feel really good. I probably don&#8217;t realise the full consequences of my decision and I will update you over the next months.</p><p name=\"946d\" id=\"946d\" class=\"graf graf--p graf-after--p\">So, where did I go? First stop was Tehran. Now I am in San Francisco. Where next? Let&#8217;s meet somewhere in the world!</p><h4 name=\"c34c\" id=\"c34c\" class=\"graf graf--h4 graf-after--h2\">helps you make beautiful guidebooks you can send to your&#160;guests</h4></div>","title":"I’ve given up my home to become a digital nomad – Hostfully"}},"pageContext":{"id":"5b937b0387be056953db7d04"}}