{"data":{"mongodbDatabaseArticles":{"id":"5b95eade87be05832748ffdb","content":"<div><p> </p><p><img title=\"Doing what makes me happy\" src=\"https://media.nomadicmatt.com/2018/dothisforme.jpg\" alt=\"Matt Kepnes, aka Nomadic Matt, hanging out with Icelandic horses\">Posted: 10/20/2011 | October 20th, 2011</p><p>Recently, a commenter <a href=\"https://nomadicmatt.com/travel-blogs/18-lessons-from-5-years-around-the-world/#comment-144901\" target=\"_blank\" rel=\"noopener\">remarked on a post</a>:</p><blockquote><p>I do wonder after so many years of travel [that] you don&#8217;t seem to have been to that many places, and I would have to say also that many of your destinations are pretty &#8220;safe,&#8221; well-trod places.</p></blockquote><p>I told him we all go where we most desire to go, and my destinations are based on that. This turned into a debate about giving travel advice, what makes an authentic traveler, and a few other subjects. In one of his last comments, he said:</p><blockquote><p>I&#8217;m not saying you aren&#8217;t a traveler, but you are a boring traveler&#8230; and I do wonder why you make all this fuss about yourself. And yes, there is more authentic travel, and then there is safe, boring, gap-year circuit travel. Do you think Marco Polo would have been as revered a traveler, if instead of crossing the silk route into China, he instead hung out in backpacker hostels for years, hitting on young, impressionable girls and drinking beer in the sun?</p></blockquote><p>I&#8217;ve met a lot of travelers who disparage the route others take, and I can&#8217;t stand it. Yes, I&#8217;ll give you my suggestions and tips on <a href=\"https://nomadicmatt.com/travel-blogs/how-to-conquer-the-city-of-berlin/\" target=\"_blank\" rel=\"noopener\">what to see and do in Berlin</a>. I&#8217;ll give you tips about <a href=\"https://nomadicmatt.com/guide-to-travel-hacking/\" target=\"_blank\" rel=\"noopener\">how you can travel cheaply</a> based on my experience. I&#8217;ll think out loud about the nature of travel and my <a href=\"https://nomadicmatt.com/travel-blogs/category/random-musings/\" target=\"_blank\" rel=\"noopener\">personal thoughts on it</a> as a way to help me&#160;hash out my feelings. If you want to read along and comment, all the better.</p><p>But I&#8217;ll never make accusations about where you decide to go. That&#8217;s your own personal choice. I find it extremely condescending when travelers talk down to others because of their destination choices. I see this all the time on the backpacker trail. <a href=\"https://nomadicmatt.com/travel-blogs/there-is-no-such-thing-as-must-see/\" target=\"_blank\" rel=\"noopener\">I don&#8217;t believe there&#8217;s any such thing as must-see or must-do when you travel</a>.</p><p>Because you travel for you and I travel for me.</p><p>I go to destinations based on the order in which I want to see them.</p><p>I skip some towns and countries because it makes me happy.</p><p>I hang out in hostels with other travelers because I enjoy it.</p><p><a href=\"https://nomadicmatt.com/travel-blogs/the-best-sushi-around-the-world/\" target=\"_blank\" rel=\"noopener\">I eat sushi around the world</a> because it brightens my day.</p><p>I don&#8217;t go to some countries because I don&#8217;t feel like it.</p><p><a href=\"https://nomadicmatt.com/travel-blogs/the-personal-meaning-of-travel/\" target=\"_blank\" rel=\"noopener\">Travel is a highly personal experience.</a></p><p>I don&#8217;t care where you go or what you choose to see or skip.</p><p>I don&#8217;t care if you went away for a year but never got past your first destination because you simply fell in love with it or someone there.</p><p>I couldn&#8217;t care less if you boozed it up all through <a href=\"https://nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\" target=\"_blank\" rel=\"noopener\">Southeast Asia</a> and the closest you got to seeing a local was the guy serving you beer.</p><p>It&#8217;s not what I would do, and I may write a post about why I think you shouldn&#8217;t either. But that&#8217;s my opinion and if you decide to do it anyways, good for you.</p><p>Why?</p><p>Because the only thing about travel that matters is that it makes <strong>YOU</strong> happy and brings <strong>YOU</strong> joy.</p><p>As Mark Twain said, &#8220;Twenty years from now you will be more disappointed by the things you didn&#8217;t do than by the ones you did do. So throw off the bowlines. Sail away from the safe harbor. Catch the trade winds in your sails. Explore. Dream. Discover.&#8221;</p><p>Your journey is your own.</p><p>Enjoy it however you want.</p><p>Even if that just means spending a week drinking at a resort in <a href=\"https://nomadicmatt.com/travel-guides/mexico-travel-tips/cancun/\" target=\"_blank\" rel=\"noopener\">Canc&#250;n</a>.</p><h3>How to Travel the World on $50 a Day</h3><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\"><img class=\"\" src=\"https://media.nomadicmatt.com/bookimages/howtotraveltheworld_v3cover.jpg\" alt=\"how to travel the world on $50 a day\" width=\"200\" height=\"273\"></a>My New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences.</p><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"Don't Listen to the Naysayers. I Travel for Myself (And So Should You)"}},"pageContext":{"id":"5b95eade87be05832748ffdb"}}