{"data":{"mongodbDatabaseArticles":{"id":"5b937b3187be056953db7d36","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"132c\" id=\"132c\" class=\"graf graf--h3 graf--leading graf--title\">Learning to code and becoming a software engineer.</h1></p><p name=\"5a89\" id=\"5a89\" class=\"graf graf--p graf-after--figure\">One of my goals for this blog is to start offering real skills of how to become a software engineer and learn to code. Over the past few years, I have seen so many resources for how to learn to code on the internet. There is <a href=\"https://www.codecademy.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Code Academy</a>, <a href=\"https://www.codeschool.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Code School</a>, <a href=\"https://generalassemb.ly/education\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">General Assembly</a>, etc that have all popped up as great ways to learn how to code.</p><p name=\"fb05\" id=\"fb05\" class=\"graf graf--p graf-after--p\">They are all great resources, but I find they don&#8217;t address the entire process. They teach you how to code, but they don&#8217;t teach you all of the steps and the mentality to become a software engineer and troubleshoot all the little problems. I think General Assembly has tackled this problem very well with their courses, but they are less an online resource and more of a intense in-person bootcamp experience.</p><p name=\"4a05\" id=\"4a05\" class=\"graf graf--p graf-after--p\">So far, I haven&#8217;t seen is a great online resource that starts from the beginning. Coding and being a software engineer is so much more than just understanding the logic. There are many steps required, from installing and using the right tools to understanding what to do when you run into trouble, and that&#8217;s what I want this series to become; the full process from start to app store.</p><p name=\"6499\" id=\"6499\" class=\"graf graf--p graf-after--p\">Since my company is called <a href=\"http://www.creativecollisionsgroup.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Creative Collisions Group</a>, I&#8217;m going to call this Creative Collisions Software School, but I&#8217;m open to a better name; please add suggestions in the comments.</p><p name=\"c316\" id=\"c316\" class=\"graf graf--p graf-after--p\">How do I know you can succeed with this and even get your own app on the Apple App store or Google Play? Because I&#8217;ve seen it happen before, it just takes hard work and discipline. One example is my friend and fellow Virginia Tech alumni <a href=\"https://www.instagram.com/melissa_inc/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Melissa Molare</a>.</p><p name=\"2116\" id=\"2116\" class=\"graf graf--p graf-after--p\">Melissa has been hard at work for the past couple of years learning how to code, and at this point, she is actually far ahead of me, already releasing her third app on the iOS app store. Her first couple of apps were a great start and confidence building, but it&#8217;s this third app, called <a href=\"http://www.thelinksapp.io/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Links</a>, that she is extremely proud and excited about.</p><p name=\"eeb6\" id=\"eeb6\" class=\"graf graf--p graf-after--p\">The app gives iPhone users the a way of sharing their contact information easily to other users. It goes beyond the traditional sharing mechanisms because you can selectively choose which contact information you want to share with another user and even include all your social media accounts.</p><p name=\"6a34\" id=\"6a34\" class=\"graf graf--p graf-after--p\">I&#8217;ve been super impressed to see Melissa learn to code from scratch to now having 3 apps on the app store; she is way ahead of me and I have been writing software for over 15 years!</p><p name=\"62cd\" id=\"62cd\" class=\"graf graf--p graf-after--p graf--trailing\">I just wanted to make this post as an introduction, in the next post we will start talking about version control, which I think is a critical step to learning how to write software. I find that it is difficult to collaborate with others without using version control and it will save you so much headache in the future, so that is where we will start. Check out the first blog post to learn git <a href=\"https://codeburst.io/step-1-to-becoming-a-software-engineer-lets-introduce-version-control-part-1-c274c76015ca\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">here</a>.</p></div>","title":"Learning to code and becoming a software engineer. – codeburst"}},"pageContext":{"id":"5b937b3187be056953db7d36"}}