{"data":{"mongodbDatabaseArticles":{"id":"5b96249287be058327490eb5","content":"<div><p><img src=\"http://photos.foxnomad.com/Asia/Bahrain/Manama/i-fJ69gsK/0/M/CIMG0879-M.jpg\" alt=\"\" width=\"171\" height=\"257\" align=\"right\">Politics aside, there are many travelers who are curious on how to travel to the reclusive communist nation. Preparing for a trip to North Korea is not like booking any normal vacation and there are some important things you should know.</p>\n<ul>\n<li><strong>Independent Travel Is Not Allowed</strong> &#8211; Tourist visas are only granted to people who take part of a guided tour. Tours are generally booked by Chinese travel agents who will attempt to obtain a visa and submit a detailed itinerary to the North Korean authorities. <ul> <li>The <a href=\"http://www.koryogroup.com/\">Koroyo Group</a>, <a href=\"http://www.newkoreatours.com/\">New Korea Tours</a>, and <a href=\"http://english.tour2korea.com/03Sightseeing/NorthKoreaTours/main_list.asp?konum=subm1_1&amp;kosm=m3_6\">Tour2Korea</a> are good places to begin.</li>\n</ul>\n</li>\n</ul>\n<p></p>\n<ul>\n<li><strong>Your Movement And Behavior Will Be Closely Monitored</strong> &#8211; Expect to have government personnel assigned to watch the behavior and movement of your group. <ul> <li>Here are <a href=\"http://newsweek.washingtonpost.com/postglobal/america/2008/01/too_sexy_for_the_dmz.html\">4 things not to do</a>.</li>\n</ul>\n</li>\n<li><strong>All Flights Will Originate From China </strong>&#8211; There are no direct flights to North Korea, except from China on North Korea&#8217;s only airline, Air Koryo (which does not have a website). You may also take a train during specific times of the year.</li>\n<li><strong>Travel Is Permitted Only On Specific Days</strong> -Depending on whether you&#8217;re planning on train, bus, or air travel you&#8217;ll have to check with your travel agent for the various dates where entry is permitted.</li>\n<li><strong>3 Cities Are &#8220;Visa-Free&#8221;</strong> &#8211; Travel to Kaesong, Kumgangsan, and Panmunjom are <a href=\"http://wikitravel.org/en/North_Korea\">visa-free</a> on specific dates. <ul> <li>Visits to Kumgangsan and Kaesong are not actually &#8220;visa-free&#8221;. They do require a special group visa that Hyundai Asan generates for the participants. These visas are only for cross-border travel to these two sites and for specific dates. Visitors to Panmunjom do not require a visa to cross into the DPRK in one of the buildings built right across the military demarcation line, but they do have to have their passports with them at all times. All three locations are accessible to Americans, South Koreans, and most other nationalities, although a different list of restricted nationalities applies for <a title=\"Panmunjom\" href=\"http://wikitravel.org/en/Panmunjom\">Panmunjom</a>.</li>\n</ul>\n</li>\n<li><strong>All Tourism Money Goes Directly To The Government </strong>&#8211; All tourist income goes directly to the North Korean government. If you have qualms with the regime keep in mind that 100% of your expenditures including at shops, restaurants, or otherwise will finance it.</li>\n<li><strong>You Won&#8217;t Go Hungry </strong>&#8211; Tourist restaurants are stocked with food and although the locals are constantly experiencing food shortages, you likely won&#8217;t. Vegetarians, or those with food allergies should let the tour agency know while you book the trip. <ul> <li>Remind them each time you contact them also.</li>\n</ul>\n</li>\n<li><strong>Bring Hard Currency </strong>&#8211; Your credit card will be virtually useless, make sure to convert it into North Korean Won before you get there (either in China or South Korea). Make sure you have enough to last the entire trip.</li>\n<li><strong>Take Pictures, But Quickly</strong> &#8211; Any perceived threat by locals or local authorities can result in your being arrested. Ask your tour operator before you snap any picture and don&#8217;t get too artsy when you do. Snap and then put the camera out of sight.<img src=\"https://foxnomad.com/wp-content/uploads/2008/02/north-korea1.jpg\" alt=\"north korea travel\" width=\"306\" height=\"229\"></li>\n<li><strong>Keep Your Mouth Shut</strong> &#8211; The best policy is to be silent while out with your group. Anything might be considered an insult to the government which will be bad news for you. Silence is golden.</li>\n<li><strong>Contact Your Embassy </strong>&#8211; Either in North Korea or before you leave, in case you need their assistance. Make sure to leave a copy of your itinerary with them and family prior to your trip.</li>\n<li><strong>Beware Of Customs/Immigration When You Return </strong>&#8211; Many countries (especially the US) don&#8217;t have diplomatic relations with North Korea. Be prepared for some tough questions when you return. Keep all of your tour guide information and papers handy. Explain throughly why you went.</li>\n<li><strong>Regulations Change Regularly</strong> &#8211; All of the rules, laws, and regulations that you will encounter during any point of the trip (including getting a visa) may change without notice. North Korea frequently modifies travel regulations, although rules making it relatively easy to ensure you get a visa seem to float around.</li>\n</ul>\n<p>Just like the <a href=\"http://www.foxnomad.com/2008/02/08/the-disadvantages-of-traveling-to-america/\">disadvantages of traveling to the US</a> or anywhere else, you should plan for any trip you&#8217;re willing to make. North Korea seems a fascinating destination that has (very, very) slowly been opening up to the <a href=\"http://www.foxnomad.com/2007/12/18/despite-the-travel-boom-the-american-bust/\">global tourism industry</a>. I predicted it would be an <a href=\"http://www.foxnomad.com/2007/03/19/4-unlikely-travel-destinations-in-10-years/\">unlikely tourist hotspot in the next 10 years</a>, would you be willing to make a trip there?</p>\n<p>[photos by: <a href=\"https://www.flickr.com/photos/mfi/\">Fi&#8217;s Space</a> and <a href=\"https://www.flickr.com/photos/kalleboo/\">kalleboo</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"The Quick Guide To Visiting North Korea"}},"pageContext":{"id":"5b96249287be058327490eb5"}}