{"data":{"mongodbDatabaseArticles":{"id":"5b937aeb87be056953db7cee","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"197f\" id=\"197f\" class=\"graf graf--h3 graf--leading graf--title\">Why I Quit My Job, Sold All My Stuff, Moved Out of My NYC Apartment, and Became a Digital&#160;Nomad</h1></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*rXWvvxkdw874G-Ps1yqgMA.jpeg\"><p name=\"2ed6\" id=\"2ed6\" class=\"graf graf--p graf-after--figure\">More than a year ago, I began seriously considering changing my life and becoming a digital nomad. At the time I had a cool full-time job and lived in the highly sought-out neighborhood of Williamsburg Brooklyn.</p><p name=\"1707\" id=\"1707\" class=\"graf graf--p graf-after--p\">From the outside, I had it all and my life was great. But on the inside, I wanted more; I wanted something else. I felt stagnant and lost. Settling was never and will never keep me engaged and content. I couldn&#8217;t move forward with a life that was predictable and on autopilot. That&#8217;s just not the kind of person I am. Plus, having lived in NYC for four years, it was starting to grow stale for me. Noisy, smelly, crowded, expensive? No thanks.</p><p name=\"ada6\" id=\"ada6\" class=\"graf graf--p graf-after--p\">At the time, <a href=\"https://en.wikipedia.org/wiki/Digital_nomad\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">digital nomadism</a> was on the rise and becoming more and more feasible. I knew some <a href=\"https://www.instagram.com/timcophoto/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">friends who</a> <a href=\"https://www.instagram.com/kmsyes/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">traveled constantly</a> and who <a href=\"https://lengstorf.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">had already made</a> <a href=\"https://twitter.com/reustle\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the jump into the</a> nomad lifestyle. So in late 2015 and early 2016 I began seriously planning for my own jump.</p><p name=\"9773\" id=\"9773\" class=\"graf graf--p graf-after--p\">If you&#8217;re not sure what &#8220;digital nomad&#8221; means; it&#8217;s a person who works and earns a living remotely from their laptop via the internet, and uses that opportunity to live abroad/traveling/on the road. People make this feasible by getting rid of expenses and things that tie them down to a specific place, like full-time jobs and mortgages.</p><p name=\"a0f6\" id=\"a0f6\" class=\"graf graf--p graf-after--p\">I was able to consider this lifestyle as a viable option because I&#8217;m young&#8202;&#8212;&#8202;22&#8202;&#8212;&#8202;and these next few years are probably the only years I&#8217;ll have uncommitted to a spouse, kids, or mortgage. I was financially stable and romantically unattached. It was the perfect combination to be able to take advantage of this rare opportunity to explore the world and create a more enjoyable meaningful life.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*46H0xIk6gWXhxbJQd9xm6w.jpeg\">Coworking spaces, coffee shops, restaurants<p name=\"a53a\" id=\"a53a\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">The Job</strong></p><p name=\"f33f\" id=\"f33f\" class=\"graf graf--p graf-after--p\">The digital nomad lifestyle stood out for me mainly because I knew it wasn&#8217;t so far out of reach. Most questions I see online about the lifestyle pertain to work and how to find jobs that allow for a remote lifestyle. My job at the time was very pro-remote work. I got to practice working remotely from coffee shops, my apartment and other countries.</p><p name=\"b27e\" id=\"b27e\" class=\"graf graf--p graf-after--p\">I ultimately decided that the best move for me would be to go out on my own and be an independent freelancer (front-end developer and product designer) instead of having a full-time job. Freelancing was not new to me; I had done it off and on in the 7 or so years prior, so the transition into freelancing and remote work wasn&#8217;t that difficult.</p><p name=\"b9f2\" id=\"b9f2\" class=\"graf graf--p graf-after--p\">Granted, being a successful freelancer and remote worker is an entire ballgame of its own and requires a lot of planning ahead and networking to get new work. Being able to manage your time, cash flow, legal and financial matters is a part-time job within itself.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*RCv9HP5B_AdkOI9OhIUvgg.jpeg\">My neighborhood, what was left of all my stuff, my&#160;room<p name=\"136c\" id=\"136c\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">The Apartment and Stuff</strong></p><p name=\"4563\" id=\"4563\" class=\"graf graf--p graf-after--p\">The 18-month lease at my apartment ended August 2016, and I would not be renewing it. In the months prior, I didn&#8217;t buy any new furniture, decorations, or clothes. In the summer I began selling off whatever I could, mostly new clothes and shoes that I had never worn.</p><p name=\"b72c\" id=\"b72c\" class=\"graf graf--p graf-after--p\">The last few weeks before my move out date were brutal. Posting furniture and electronics on craigslist, coordinating pick ups, donating or throwing away whatever I could. Trust me, this is harder than you think! I had way too much stuff, and it was both emotionally and physically exhausting to sort through everything, deciding what should go and how it should go. I ended up donating many bags and bins to Goodwill and to The Bowery Mission.</p><p name=\"1dc2\" id=\"1dc2\" class=\"graf graf--p graf-after--p\">In everything I did that year, getting rid of my stuff had to be the toughest. In the last few days and hours, I ended up throwing away so many boxes, worth hundreds of dollars worth of stuff that was left unsold. I just wish more of it ended up in the hands of people who would appreciate things like a brand new set of Netrunner and nerdy Photoshop magazines!</p><p name=\"af84\" id=\"af84\" class=\"graf graf--p graf-after--p\">Once everything was said and done, I ended up with a few bags and a box&#8202;&#8212;&#8202;currently stored at my moms house. Even though it was tough, I look back and am really happy I got rid of most of my possessions. I didn&#8217;t realize that the stuff was weighing on me, and now I feel so free to just get up and go wherever without worrying so much. I am now more mindful of what I purchase&#8202;&#8212;&#8202;mostly because it has to be carried with me when I travel and I&#8217;ve got nowhere to store useless stuff.</p><p name=\"cedf\" id=\"cedf\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\"><strong class=\"markup--strong markup--p-strong\">&#8220;Moving&#8221;</strong></p><p name=\"f971\" id=\"f971\" class=\"graf graf--p graf-after--p\">After moving out in August, I brought <a href=\"https://twitter.com/sodevious/status/763753509762236417\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">my belongings</a> to Florida. It&#8217;s where I&#8217;m from and my new &#8220;home base&#8221;, so I spent a few weeks there&#8202;&#8212;&#8202;establishing residency, registering to vote again, getting a new ID, setting up a PO box, registering a Florida LLC, and getting new health insurance. Some digital nomads really do become homeless, but it seemed so drastic. I am lucky to be able to have a place to send my mail, to come back and rest for a few weeks before leaving again, and to spend time with family.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*25PBNmvvxOos0BXfy-v1OQ.jpeg\"><p name=\"6812\" id=\"6812\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Being a Nomad</strong></p><p name=\"0df3\" id=\"0df3\" class=\"graf graf--p graf-after--p\">As a nomad, I live out of carry-on luggage and Airbnb&#8217;s. In the months since I left New York, I have spent most of my time in Mexico and doing <a href=\"https://twitter.com/sodevious/status/787295451133440000\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the conference circuit</a> in the states. This nomadic lifestyle is isolating; no more weekly meetups in the city, no <a href=\"https://twitter.com/sodevious/status/730602521325113344\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">dinners with friends</a>, no running into twitter nerds at events. So because I am not necessarily getting as much face time on a day to day basis, I make an <a href=\"https://twitter.com/sodevious/status/790592132100653056\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">extra effort</a> to <a href=\"https://twitter.com/sodevious/status/788198009976737793\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">attend tech conferences</a>.</p><p name=\"37ac\" id=\"37ac\" class=\"graf graf--p graf-after--p\">I could talk about Mexico all day and still have more to say. It&#8217;s such a beautiful and culturally rich country, that I think most Americans take for granted. From the beautiful and warm sandy beaches of Tulum, to the bustling majestic Mexico City, I find new things to love about Mexico every day that I am there. For instance, in Mexico you are constantly surrounded by passion, empathy and respect for the arts, human beings, animals and the earth. It&#8217;s nothing short of inspiring.</p><p name=\"991b\" id=\"991b\" class=\"graf graf--p graf-after--p\">Part of what makes it so enjoyable is that when I come to Mexico, my <a href=\"https://twitter.com/sodevious/status/785931273353048064\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">mom usually comes with me</a>! She is an independent graphic designer / illustrator and does a similarly nomadic lifestyle part time. We spend half of our time working and the other half exploring Mexico, and it&#8217;s really fun.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*ie_pW01hYdPsZO6yMSJqsQ.jpeg\">Mexico is beautiful in case you were wondering<p name=\"d5f1\" id=\"d5f1\" class=\"graf graf--p graf-after--figure\">Honestly, looking back I am so happy that I made the decision to change my life and go after what I really wanted. The stress and anxiety <a href=\"https://twitter.com/sodevious/status/811034199520112640\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">I used to have</a> is now drastically reduced, and I am more happy generally. Travel is opening my mind in ways I didn&#8217;t realize were possible, and I feel more free to pursue my goals, live my life with authenticity and enjoy my time with more passion and energy.</p><p name=\"5619\" id=\"5619\" class=\"graf graf--p graf-after--p graf--trailing\">In 2017 I will continue on traveling until I can&#8217;t anymore! I&#8217;m still freelancing independently, eating tacos, and looking for nerds wherever I go. If you&#8217;re into the digital nomad and freelancing lifestyle, I&#8217;d be happy to <a href=\"https://twitter.com/sodevious\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">connect online</a> or IRL if our paths cross. This summer I&#8217;ll be doing to conference circuit again, and this time I&#8217;m hoping I&#8217;ll end up in Berlin/Europe.</p></div>","title":"Why I Quit My Job, Sold All My Stuff, Moved Out of My NYC Apartment, and Became a Digital Nomad"}},"pageContext":{"id":"5b937aeb87be056953db7cee"}}