{"data":{"mongodbDatabaseArticles":{"id":"5b92397587be0583cfde6807","content":"<div><p></p><img class=\"wp-image-20581 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/04/How-to-choose-the-best-second-passport-.png\" alt=\"Best second passport in the world?\" width=\"700\" height=\"468\"><p>Dateline: Hong Kong</p>\n<p>I want to talk about second passports and why &#8212; when it comes to evaluating which citizenship is best &#8212; I believe there&#8217;s a lack of information and a lack of depth in the information that&#8217;s out there. More specifically, I want to look at evaluating what a citizenship or a passport is actually worth.</p>\n<p>Obviously, there is a distinction between these two things, and often this can be blurred in the media. So, for the sake of clarity:</p>\n<ul>\n<li>Citizenship is something that you have by virtue of being a citizen of a country.</li>\n<li>A passport is a travel document that you get as one of the privileges of being a citizen of that country.</li>\n</ul>\n<p>What you need to understand is that to have a passport you need to be a citizen of the country.</p>\n<p>When you look at it this way, there is obviously a difference in the value of citizenship versus the value of a passport, and that&#8217;s what I want to explain. Every year, a number of people in the passport sales industry come out with their own index, along the lines of &#8220;Best passports in the world.&#8221; Maybe Germany heads their list because you can travel to 177 different countries visa-free, but whichever country it is, the media runs with the story, and suddenly Germany is the best citizenship to have.</p>\n<p>Now I think that&#8217;s a little misleading, and let me tell you why.</p>\n<h2>Visa-free travel</h2>\n<p>These rankings are built on the most basic of indices, which rank countries using the highest number of visa-free travel options. Naturally, Germany will come out on top, then you end up with 25 different countries tied for the top eight or nine spots, all basically allowing you access to more or less the same places.</p>\n<p>When you compare the European Union, Canada, Australia, the U.S., and Singapore, with the exception of some very minor details, there&#8217;s not a lot of difference in where you can go using each passport. Truly, how much difference is there between the travel options with a Swedish or Polish passport? Does the German passport offer so much more than a Canadian one?</p>\n<p>When you&#8217;re looking at getting a passport, especially when you&#8217;re looking at getting a second passport (which is what we talk about here at Nomad Capitalist) you need to be looking at more than just where you can go with the passport for visa-free travel.</p>\n<h2>What else can you get?</h2>\n<p>Personally, I think it&#8217;s important to figure out which citizenship is actually best for you, especially when it comes to a second citizenship.</p>\n<p>I get a lot of people coming to me who are U.S. citizens. They say, &#8220;Andrew I don&#8217;t plan on <a href=\"http://nomadcapitalist.com/2016/07/01/case-studies-renouncing-us-citizenship/\">renouncing my U.S. passport</a>, but I&#8217;d like a backup; I&#8217;d I like a plan B.&#8221; For these people, the number of visa-free countries they can go to probably doesn&#8217;t matter, because you can&#8217;t do much better than the U.S. passport there.</p>\n<p>On the other hand, U.S. citizenship isn&#8217;t necessarily the best citizenship out there. Being a U.S. citizen means that you have to pay tax on your worldwide income, <a href=\"https://www.irs.gov/businesses/small-businesses-self-employed/report-of-foreign-bank-and-financial-accounts-fbar\">you&#8217;ve got to file FBARs</a>, and you&#8217;re subject to the FCPA and other regulations on U.S. citizens abroad.</p>\n<p>Being a U.S. citizen isn&#8217;t all it&#8217;s cracked up to be. Quite frankly, I&#8217;d much rather be a citizen of a country with a B+ passport without all those restrictions than be a citizen of the United States, which has an A passport but comes with a lot of baggage.</p>\n<p>What else can your second passport offer you?</p>\n<p>If you&#8217;re looking to get a second passport, the most important thing (if you&#8217;re already a U.S., Canadian, or Australian citizen) isn&#8217;t where you can go but what else that passport has to offer. So what I look at when I&#8217;m considering different passports is not only where I can go with it but where can I go with it in relation to the passports that I already have.</p>\n<p>So if you&#8217;re a U.S. citizen, having a passport that also gets you into the European Union may not be that important; you may want to add other countries you don&#8217;t already have, like Brazil. I&#8217;m going to Brazil this year, and I won&#8217;t have to bother getting a visa because I won&#8217;t be using my U.S. passport to go.</p>\n</div>","title":"How to choose the best second passport"}},"pageContext":{"id":"5b92397587be0583cfde6807"}}