{"data":{"mongodbDatabaseArticles":{"id":"5b921d2087be0571ac1b04fc","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">Still the easiest place in the world to open an offshore bank account</h1>\n \n</p><img class=\"size-full wp-image-14046\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/12/georgia-easiest-country-open-bank-account.jpg\" alt=\"The easiest country to open an offshore bank account\" width=\"700\" height=\"467\"><p>Dateline: Tbilisi, Georgia</p>\n<p>I spent much of the flight from Kuala Lumpur to Istanbul reading a personal development a friend recommended to me. While I&#8217;m typically rather impatient when it comes to long tomes, I found this one fascinating.</p>\n<p>It&#8217;s the kind of book that you immediately want to recommend to everyone you know. That&#8217;s how powerful it was.</p>\n<p>And for quite some time now, I&#8217;ve been talking about the same effect for <a href=\"http://www.nomadcapitalist.com/flag-theory/\">planting flags</a> in Georgia. I&#8217;ve apparently even gotten a reputation for being &#8220;the Georgia guy&#8221;; a friend of mine who is moving here told his friends, only to be told &#8220;you must follow that Andrew Henderson guy&#8221;.</p>\n<p>I won&#8217;t re-hash how Georgia has quickly become highly capitalist and one of the <a href=\"http://nomadcapitalist.com/2014/12/03/georgia-one-capitalist-countries-world/\">most free economies in the world</a>. Or how it&#8217;s one of my <a href=\"http://nomadcapitalist.com/2015/12/03/5-best-countries-for-doing-business/\">best countries in the world for business</a>.</p>\n<p>Nor will I re-hash how I went from not buying real estate here, to buying a property of my own, which is currently under construction.</p>\n<p>Today, I want to talk about banking in Georgia.</p>\n<p>While offshore banking around the world &#8212; from the Caribbean to Asia &#8212; has become more and more difficult (especially for US persons), Georgia is hands down the easiest place in the world to open an offshore bank account today.</p>\n<h2>How easy is it to open an offshore bank account?</h2>\n<p>A lot of offshore banks around the world are facing big challenges right now. As high-tax jurisdictions continue their rampage against capital flight, countries like Belize have seen their international banking hubs severely impacted.</p>\n<p>One bank there has already gone under.</p>\n<p>It&#8217;s not that the banks themselves are always a problem &#8212; although some are &#8212; rather, the problem is that they are tax havens in the backyard of the United States.</p>\n<p>Occasionally, one of the less than professional bankers on some island allows a suspected terrorist to open an account there, and all hell breaks loose.</p>\n<p>Meanwhile, jurisdictions like Hong Kong are <a href=\"http://nomadcapitalist.com/2013/07/11/hong-kong-banks-dont-need-your-money/\">burying many foreign depositors</a> in paperwork as they strive to join the tax lovers at the OECD, and most banks have increased their standards. (My clients and I use one bank that is still easy to deal with, but it&#8217;s a small bank and hard to get in without an introduction.)</p>\n<p>A jurisdiction like Georgia hasn&#8217;t seen such problems precisely because it&#8217;s not a tax haven, nor is it a large offshore financial center. It&#8217;s not even on the radar of the vast majority of people.</p>\n<p>So, what is the easiest way to open an offshore bank account here?</p>\n<h2>Why Georgia is a &#8220;new safe haven&#8221;</h2>\n<p>Several of my in-the-know clients have told me that they agree with my position on Georgia. I know several wealthy individuals who bank here and get top-notch service by depositing as little as $50,000.</p>\n<p>Service here reminds them of the &#8220;good old days&#8221; of <a href=\"http://nomadcapitalist.com/2015/06/03/what-is-a-private-bank-account-and-how-to-get-one/\">private banking</a> in countries like Hong Kong, where banks like <a href=\"http://nomadcapitalist.com/2015/05/22/banking-with-hsbc-premier/\" target=\"_blank\" rel=\"noopener\">HSBC</a> are now impossible to deal with.</p>\n<p>In fact, as I have written before, it&#8217;s possible to open a bank account in Georgia with as little as $7 (actually, $8.38 at today&#8217;s exchange rates).</p>\n<p>The process at my favorite banks takes as little as ten minutes. If you&#8217;re a US citizen or have US indicia, you&#8217;ll be asked to fill out a few <a href=\"http://nomadcapitalist.com/2013/09/25/fbar-and-other-offshore-bank-account-reporting-requirements/\">forms for the IRS</a>, but that&#8217;s about it.</p>\n<p>You don&#8217;t need piles of paperwork or anything like that. You basically just show up with the cash in your wallet, make a minimal deposit, and get started.</p>\n<p>Once you&#8217;re in the door with a particular bank, opening additional bank accounts is quite easy. Georgian banks don&#8217;t offer remote account opening, but service, once you&#8217;ve opened at least one account, is good, and you can handle most account functions from home after you get set up.</p>\n<p>In fact, online banking for the Georgian banks I deal with is refreshingly simple. Almost stupidly simple. For as much as I love <a href=\"http://nomadcapitalist.com/2015/05/05/hong-kong-and-singapore-010/\">banking in Singapore</a>, banks there sure do give you a lot of codes, PINs, and access numbers to remember.</p>\n<p>In Georgia, it&#8217;s simple. You can move money between Georgian lari, US dollars, and Euros in a single click. Exchange rate spreads at the bank are extremely small; if you&#8217;re making a really large deposit, you can get one-way spreads as little as 0.13% on the street.</p>\n<p>That means it costs $1.30 to change $1,000 from USD to GEL. Dirt cheap.</p>\n<h2>How to open a bank account in Georgia</h2>\n<p>You don&#8217;t need a lot to get started banking in Georgia. Far and away the biggest challenge will be flying to Georgia to appear in person.</p>\n<p>Once you&#8217;re there, however, the process is easy. There are so many banks here, but it&#8217;s the country&#8217;s business-friendly laws, rather than the specific policy of one bank, that makes the account opening process so easy.</p>\n<p>That said, there are some banks I&#8217;d suggest avoiding. On the one hand, I have a friend who is on the board of directors of a mid-sized bank and he told me that he&#8217;d feel comfortable depositing up to $10 million in his favorite two banks.</p>\n<p>On the other hand, he would be more careful in the smaller banks and avoid a few of them entirely. He and I are both fully confident in the best banks to manage our cash wisely; you just need to do your homework and choose the best bank for you.</p>\n<p>In addition to ease of opening, Georgian banks offer both ATM and debit Visa Electron cards that can be used anywhere in the world Visa is accepted. It&#8217;s also a great tool to have for booking travel online in Europe, as Electron cards incur lower transaction fees from cheap airlines.</p>\n<p>While bank fees here are rather low, interest rates are quite high. We&#8217;ve discussed how <a href=\"https://www.nbg.gov.ge/uploads/konference/pre/the_hedging__missing_market.ppt\" target=\"_blank\" rel=\"noopener\">5% interest rates</a> on short-term US dollar term deposits aren&#8217;t out of the norm; and if you&#8217;re willing to bet on the Georgian lari, you can earn even higher yields. (Be aware that the currency has <a href=\"http://www.xe.com/currency/gel-georgian-lari\" target=\"_blank\" rel=\"noopener\">dropped 25%</a> since I was here last December.)</p>\n<p>Opening an offshore bank account is an easy way to diversify your finances, and if you&#8217;re willing to get on a plane, I&#8217;d strongly consider Georgia for its ease of account opening and maintenance.</p>\n<p>I might even be so bold to say that it&#8217;s the best place to go right now if you&#8217;re looking to deposit a mid-sized sum.</p>\n<p>Banking, however, is just one of several flags I am planting in Georgia and recommend to you. Due to increased interest in bank accounts, companies, real estate, and investments in Georgia, I&#8217;m considering hosting a small mastermind event here next Spring to help clients who are interested in taking advantage of what I believe could be <a href=\"http://nomadcapitalist.com/2015/09/21/country-the-next-america/\">&#8220;the next America&#8221;</a> or <a href=\"http://nomadcapitalist.com/2014/01/08/next-singapore-find-next-boom-market/\">&#8220;the next Singapore&#8221;</a>.</p>\n<p>If you&#8217;d be interested in working with me to plant flags and look at investments here,&#160;<a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\" target=\"_blank\" rel=\"noopener\">apply for a Strategy Call</a> so we can determine your best options as part of a personalized and completely legal offshore plan.</p>\n<p class=\"et_social_bottom_trigger\"></p> </div>","title":"Still the easiest place in the world to open an offshore bank account"}},"pageContext":{"id":"5b921d2087be0571ac1b04fc"}}