{"data":{"mongodbDatabaseArticles":{"id":"5b937b1787be056953db7d18","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"21d8\" id=\"21d8\" class=\"graf graf--h3 graf--leading graf--title\">Digital nomad? Nope. I chose the freelance life so I can stay at&#160;home.</h1><h2 name=\"cffe\" id=\"cffe\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">Your true motivation for going solo may be closer than you&#160;think.</h2></p><p name=\"f85b\" id=\"f85b\" class=\"graf graf--p graf-after--figure\">No doubt you&#8217;ve seen more than enough articles explaining the magic freedoms of freelancing. The stories of those who travel from one exotic beach location to the next, squeezing in enough short freelance contracts to pay their bills for their lavish Instagram lifestyles.</p><p name=\"965f\" id=\"965f\" class=\"graf graf--p graf-after--p\">That may be the reason some people freelance, and if they do, more power to them. That&#8217;s nowhere near why I chose to start my own indie design business. I did it so I can stay home more.</p><p name=\"3fd7\" id=\"3fd7\" class=\"graf graf--p graf-after--p\">Sure, I dream to travel. I wish a did a bit more of it in my younger days before I had kids and a mortgage. But when I travel I like to enjoy that holiday. I&#8217;m not a fan of mixing travel with work&#8202;&#8212;&#8202;they both distract so much from each other that you end up doing neither of them well.</p><p name=\"1e0a\" id=\"1e0a\" class=\"graf graf--p graf-after--p\">Instead, here are my personal most valuable reasons to continue being freelance.</p><p name=\"3f62\" id=\"3f62\" class=\"graf graf--p graf-after--p\">What&#8217;s one of the main productivity killers across the globe? <strong class=\"markup--strong markup--p-strong\">Commuting</strong>. Who likes commuting? Nobody.</p><h3 name=\"95b8\" id=\"95b8\" class=\"graf graf--h3 graf-after--p\">Stop commuting</h3><p name=\"8570\" id=\"8570\" class=\"graf graf--p graf-after--h3\">If you can put yourself in a position to work remotely from home for your own business, the benefit of eliminating your daily commute alone is more than enough to justify going freelance.</p><p name=\"94fe\" id=\"94fe\" class=\"graf graf--p graf-after--p\">You now have two more hours to play Fortnite&#185; (er, I mean &#8220;do productive things)&#8221;) each day, and you can work in your pyjamas if you want.</p><p name=\"5aed\" id=\"5aed\" class=\"graf graf--p graf-after--p\">Plus you spend less on gas, or on public transport, or personal helicopter rides&#178;&#8202;&#8212;&#8202;however you used to get to work is a thing of the past. Your commute is now measures in steps and seconds, rather than agonising hours in traffic.</p><h3 name=\"e28a\" id=\"e28a\" class=\"graf graf--h3 graf-after--p\">See your family&#160;more</h3><p name=\"ce27\" id=\"ce27\" class=\"graf graf--p graf-after--h3\">Do you have a husband, wife, partner, kids? Any or all of the above? Good&#179;.</p><p name=\"f567\" id=\"f567\" class=\"graf graf--p graf-after--p\">You want to see them right? You enjoy their company? If not, this is the wrong article for you. You meant to click on that relationship self-help guide you accidentally scrolled past.</p><p name=\"bff8\" id=\"bff8\" class=\"graf graf--p graf-after--p\">If yes, then freelancing is a great way to facilitate that. I still work about the same amount of hours that most people do, but when I&#8217;m not working, I&#8217;m with them. I can skip downstairs for lunch with the fam any time I want. In fact, I do most of the cooking around here. When I&#8217;m done working at 5, I&#8217;m home by 5:01. Those two hours I gained by not commuting, are two more hours with my loved ones.</p><p name=\"4653\" id=\"4653\" class=\"graf graf--p graf-after--p\">My wife and family love the fact that I freelance from home. The lifestyle changes we would have to make if I worked elsewhere would be almost inconceivable.</p><h3 name=\"7610\" id=\"7610\" class=\"graf graf--h3 graf-after--p\">Be in control of your&#160;schedule</h3><p name=\"ea63\" id=\"ea63\" class=\"graf graf--p graf-after--h3\">If you have the self-discipline to handle it, being in complete control of your schedule is a huge win. If you&#8217;re the type of person that does their best work in a pub at midnight, you can&#8308;.</p><p name=\"9cba\" id=\"9cba\" class=\"graf graf--p graf-after--p\">Ironically, I work a fairly normal 9&#8211;5 schedule, because that&#8217;s when I&#8217;m most productive, I can most easily communicate with my client, and it&#8217;s the time that works best for my family. But I chose that. And if I want to deviate from it for any reason, I do. Take an hour off to go to the doctor? No problem. Surf&#8217;s up and you just can&#8217;t pass up a good swell? Sure, give yourself half a day. You can make up the time later if your clients need it.</p><p name=\"8b10\" id=\"8b10\" class=\"graf graf--p graf-after--p\">Turns out I actually like the 9&#8211;5. My 9&#8211;5. In my home office. On my terms.</p><h3 name=\"0b4a\" id=\"0b4a\" class=\"graf graf--h3 graf-after--p\">Be choosy about your creative&#160;work</h3><p name=\"5ef7\" id=\"5ef7\" class=\"graf graf--p graf-after--h3\">Everyone has their own interests, values, passions, ethics, and skills. If you run your own business, you choose your clients. And if you can build your business to the point that you have the luxury of <a href=\"https://medium.com/swlh/how-to-land-your-dream-clients-e4d715013758\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">being choosy</a>, you really start to see your enjoyment in work soar&#8202;&#8212;&#8202;as you align the choices you make about clients and projects with the interests and ideals most important to you.</p><p name=\"d172\" id=\"d172\" class=\"graf graf--p graf-after--mixtapeEmbed\">If any childish, orange politicians&#8309; come along with a job, you can say no and be happier for it.</p><p name=\"50a6\" id=\"50a6\" class=\"graf graf--p graf-after--p\">It&#8217;s not just saying no, it&#8217;s also saying better &#8220;yes&#8221;s. Have a favourite charity organisation or community business you want to support? You have the freedom to say yes to that too.</p><p name=\"2f43\" id=\"2f43\" class=\"graf graf--p graf-after--p\">There&#8217;s also the variety factor. Every design project is different because every business has different history and different goals, but you can still get burnt out doing too much of the same kind of work. There are only so many complex web apps you can design before you start craving a really visual brochure site, for example.</p><p name=\"6d1e\" id=\"6d1e\" class=\"graf graf--p graf-after--p\">When you run your own freelance business, you can build variety into your workload to keep your creative juices happy. No other working lifestyle allows you that much control over optimising your creative process.</p><h3 name=\"dfdd\" id=\"dfdd\" class=\"graf graf--h3 graf-after--p\">Build your business, not&#160;theirs</h3><p name=\"8e2d\" id=\"8e2d\" class=\"graf graf--p graf-after--h3\">When you run your own indie design business, your successes and failures are all yours. That can be bad if you&#8217;re in the habit of failing, but let&#8217;s assume for now that we succeed more than we fail. Each little success supports the last one, to grow your reputation and your future.</p><p name=\"249b\" id=\"249b\" class=\"graf graf--p graf-after--p\">It can be a subtle difference in daily practice and mindset. However the rewards of running your own business are far more fulfilling than just earning a pay check. Even if you love where you work and the the type of work you do, working there is always helping someone else build their business. Why not spend your effort building you own?</p><p name=\"7b8e\" id=\"7b8e\" class=\"graf graf--p graf-after--p\">If you fail, you can always go work for someone else. If you succeed, you&#8217;ll wonder why everyone doesn&#8217;t do this&#8310;.</p><h3 name=\"de47\" id=\"de47\" class=\"graf graf--h3 graf-after--mixtapeEmbed\">Get closer to your&#160;clients</h3><p name=\"11b1\" id=\"11b1\" class=\"graf graf--p graf-after--h3\">There&#8217;s an intimacy&#8311; you have with freelance clients that you never quite get if you&#8217;re working for a larger company. It&#8217;s a very direct, one-to-one relationship that is appealing to clients because they know exactly who they are dealing with, and who&#8217;s doing the work&#8202;&#8212;&#8202;they feel confident that you&#8217;re invested in their project, because you have to be! There&#8217;s nobody else to pick up the slack. Nothing can get lost in translation because there&#8217;s never a middle-man. This is a major selling point, and a reason why freelancers can deliver better and more cost effective solutions. Embrace that close client relationship. It leads to more satisfaction when you deliver a great result.</p><h3 name=\"6c78\" id=\"6c78\" class=\"graf graf--h3 graf-after--p\">Get better, work smarter, earn&#160;more.</h3><p name=\"c689\" id=\"c689\" class=\"graf graf--p graf-after--h3\">When you freelance, if you get better, you and your clients alone reap the rewards. You benefit directly from your increases in efficiency or skills. If you find a way to work smarter, you earn more. Your effort, and the value you create for your clients, is directly tied to your success. That&#8217;s a very fulfilling position to be in. You get out exactly what you put in, so you&#8217;re only limited by your own commitment. Every minute of time you spend improving yourself is time invested directly into the success of your business. Who else can say that everything they do at work is that meaningful?</p><h3 name=\"5d88\" id=\"5d88\" class=\"graf graf--h3 graf-after--mixtapeEmbed\">To summarise&#8230;</h3><p name=\"46fd\" id=\"46fd\" class=\"graf graf--p graf-after--h3\">Despite what some self-help listicles may say, the freelance life is rarely glamorous or globe-trotting. Do it because it works better for you.</p><p name=\"d2fe\" id=\"d2fe\" class=\"graf graf--p graf-after--p\">Find a way to do design work you love, from the convenient location of your choosing. Stop commuting and convert that saved time into time spent with people you care about. Build your own business from your own successes, and never look back. That&#8217;s the kind of freedom freelancing is all about.</p><p name=\"33e9\" id=\"33e9\" class=\"graf graf--p graf-after--p\">&#185; I don&#8217;t even play Fornite.</p><p name=\"7c81\" id=\"7c81\" class=\"graf graf--p graf-after--p\">&#178; Riding a helicopter to work may make you look like a dick. Walking down the hallway to work has no risk of dickishness.</p><p name=\"32c9\" id=\"32c9\" class=\"graf graf--p graf-after--p\">&#179; It&#8217;s all good if you don&#8217;t have one of these. You&#8217;ll have some other kind of friends or loved ones to spend time with.</p><p name=\"70a7\" id=\"70a7\" class=\"graf graf--p graf-after--p\">&#8308; I don&#8217;t recommend this. Coffee shop? Maybe, but they won&#8217;t be open.</p><p name=\"b703\" id=\"b703\" class=\"graf graf--p graf-after--p\">&#8309; I&#8217;m clearly talking about Trump. I would definitely say no to Trump.</p><p name=\"92a4\" id=\"92a4\" class=\"graf graf--p graf-after--p\">&#8310; Seriously, why don&#8217;t more people run their own freelance businesses?</p><p name=\"cb8b\" id=\"cb8b\" class=\"graf graf--p graf-after--p graf--trailing\">&#8311; I don&#8217;t recommend actually getting intimate with your clients. This is a figure of speech.</p></div>","title":"Digital nomad? Nope. I chose the freelance life so I can stay at home."}},"pageContext":{"id":"5b937b1787be056953db7d18"}}