{"data":{"mongodbDatabaseArticles":{"id":"5b92396f87be0583cfde6801","content":"<div><p></p><img class=\"size-full wp-image-18510\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/10/Global-FATCA.png\" alt=\"Global FATCA\" width=\"700\" height=\"467\"><p>Dateline: Tbilisi, Georgia</p>\n<p>Ever since 2010 when Barack Obama signed the Foreign Account Tax Compliance Act &#8212; or FATCA &#8212; banking offshore has gotten more complicated.</p>\n<p>Somehow, the government that runs everything else inefficiently is incredibly effective when it comes to getting to all your personal financial information. Reporting requirements and forms like FBAR that were already in place simply weren&#8217;t enough.</p>\n<p>Through FATCA, the US government has begun to extract information and demand retribution from <a href=\"https://www.irs.gov/businesses/corporations/foreign-account-tax-compliance-act-fatca\" target=\"_blank\" rel=\"noopener\">individuals, institutions, and governments</a> all across the globe. In a word, if sovereign governments and foreign banks refuse to be <a href=\"http://nomadcapitalist.com/2013/04/29/just-how-bad-is-fatca/\" target=\"_blank\" rel=\"noopener\">unpaid tattletales to the IRS</a>, they get slapped with a 30% &#8220;withholding tax&#8221;. This tax applies to any assets of any foreign financial institution &#8212; offshore banks, brokerage houses, etc. &#8212; that refuses to turn over all financial details on US persons to the IRS.</p>\n<p>Individuals have been hit with fines big enough to <a href=\"http://nomadcapitalist.com/2014/06/10/fatca-new-irs-penalties-offshore-accounts/\" target=\"_blank\" rel=\"noopener\">swallow their entire offshore bank account</a>, while FATCA policies essentially blackmailed Swiss banks into compliance and put several of them out of business.</p>\n<p>Other banks simply shut out Americans entirely to avoid paying the mind-numbing costs of becoming FATCA compliant. Those who didn&#8217;t reported <a href=\"http://nomadcapitalist.com/2014/05/26/anti-fatca-countries-giving-us-middle-finger/\" target=\"_blank\" rel=\"noopener\">costs as high as $100 million</a> simply to align their banking systems with FATCA&#8217;s demands.</p>\n<p>For a time, many governments and financial institutions resisted. Now, however, not only has resistance all but disappeared, but a new global FATCA is on its way. Many countries liked the idea of FATCA simply because they hoped it meant they could get reciprocal information on their own citizens. While FATCA wasn&#8217;t designed to dish out such information, it did inspire new international initiatives such as AEOI, CRS and BEPS &#8212; which will eventually all achieve the same thing.</p>\n<h1>Global contagion and the &#8220;Why&#8221; of FATCA</h1>\n<p>I&#8217;ve said from the beginning that FATCA is just the start. Broke governments (which, unfortunately, means most governments) can&#8217;t resist the chance to get their hands on more money. No one wants to be the next Argentina or Greece &#8212; increased capital control is their way of avoiding such a fate.</p>\n<p>Sure, they&#8217;ll argue that it&#8217;s all in an effort to curb tax evasion, but the truth is that they&#8217;ll do anything they have to to keep your money within their borders. Government is getting bigger and the people in power or at the <a href=\"http://nomadcapitalist.com/2016/05/04/fatca-law-repealed-or-intensified/\" target=\"_blank\" rel=\"noopener\">top of the political polls</a> are the ones to make it even bigger.</p>\n<p>Such promises come with a cost. In this case, that cost is FATCA.</p>\n<p>And, since the Unites States is not the only <a href=\"http://nomadcapitalist.com/2016/09/14/global-debt/\" target=\"_blank\" rel=\"noopener\">indebted country</a> in the world, desperate for more information on their wealthy, global citizens, new global FATCA is at our doorstep. In the face of unpopular austerity measures, curbing tax evasion is the logical choice for most governments &#8212; 104 of them to be exact.</p>\n<p>The Organisation for Economic Co-operation and Development (OECD) &#8212; which claims to pursue &#8220;Better Policies for Better Lives&#8221; &#8212; is behind the crusade for the increased exchange of tax information.</p>\n<p>Of course, the term &#8220;better lives&#8221; doesn&#8217;t apply to anyone they don&#8217;t like. And, unfortunately, they don&#8217;t particularly like people with money. The wealth of the rich is their&#8217;s to grab through taxes and to waste on wars and overpriced &#8220;charity&#8221;.</p>\n<p>So, we know their intentions, but how exactly will this new global FATCA work?</p>\n</div>","title":"Global FATCA: How automatic information sharing affects your bank account"}},"pageContext":{"id":"5b92396f87be0583cfde6801"}}