{"data":{"mongodbDatabaseArticles":{"id":"5b937ae087be056953db7ce4","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*u8GVCA0XL9PQsDfwEfSc8w.jpeg\"><h1 name=\"2f41\" id=\"2f41\" class=\"graf graf--h3 graf-after--figure graf--title\">What I learned about coworking camps and digital nomad retreats when organizing my&#160;own.</h1><h2 name=\"6934\" id=\"6934\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">During my sabbatical, I decided to set up a <a href=\"http://camp.betahaus.com\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener\" target=\"_blank\">coworking camp for betahaus</a> in collaboration with our lovely friends from <a href=\"http://dnxhub.com\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener\" target=\"_blank\">DNX</a> and <a href=\"http://www.copass.org\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Copass</a>. I was super surprised to learn that this is a huge trend and new providers are popping up everywhere. Here is what I learned about the format and its growing&#160;market.</h2><p name=\"4114\" id=\"4114\" class=\"graf graf--p graf-after--h4\">In November, we started to work on a <a href=\"http://camp.betahaus.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">10-day getaway to a Greek island </a>set to take place this summer. In a collaborative effort, we wanted to bring together different communities of coworkers, digital nomads, and startups to connect, exchange ideas, and have a nice time in a holiday paradise.</p><p name=\"9eca\" id=\"9eca\" class=\"graf graf--p graf-after--p\">This idea seemed to resonate with many coworkers at <a href=\"http://www.betahaus.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">betahaus</a> and beyond. We were able to quickly sell many seats after setting up the landing page.</p><p name=\"ab21\" id=\"ab21\" class=\"graf graf--p graf-after--p\">But what I realized on the way was that it is not only our camp that is selling well. These kinds of camps and retreats are, in general, absolutely on the rise. In every corner of the planet, people seem to set up a retreat location or a temporary camp directed at digital entrepreneurs, nomads, and startups. The combination of coworking, living, and holiday seems to hit a sweet spot among digital natives.</p><p name=\"e23a\" id=\"e23a\" class=\"graf graf--p graf-after--p\">There are <a href=\"http://www.coboat.org\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">digital nomad sailing boats </a>and <a href=\"http://www.nomadcruise.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">cruise ships</a> that are sailing around the world. There are <a href=\"http://png.tribewanted.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">whole islands</a> waiting to be populated and there are even <a href=\"https://refuga.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">travel agencies</a> built around this new type of traveler.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*mSTj1pP80KOYZD1ZRW9Dig.jpeg\"><p name=\"2899\" id=\"2899\" class=\"graf graf--p graf-after--figure\">There are generally three different types of camps:</p><ol class=\"postList\"><li name=\"16a5\" id=\"16a5\" class=\"graf graf--li graf-after--p\">A temporary getaway with a group of up to 10&#8211;30 people, mostly around 7&#8211;14 days duration.</li><li name=\"8116\" id=\"8116\" class=\"graf graf--li graf-after--li\">All-year programs where you can hop on and off more or less when you want while the actual group is moving around the planet.</li><li name=\"423f\" id=\"423f\" class=\"graf graf--li graf-after--li\">Fixed locations very close to coworking spaces, with the additional offer to accommodate people and take over most of the organizational work for setting up retreats if you want go there with a group.</li></ol><p name=\"da82\" id=\"da82\" class=\"graf graf--p graf-after--li\">(Have a look at the overview spreadsheet I used <a href=\"http://bit.ly/coworkingcamps\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">over here</a>.)</p><p name=\"e23e\" id=\"e23e\" class=\"graf graf--p graf-after--p\">Just for fun and to be a little bit scientific, I also had a quick look at the &#8220;hooks&#8221; and taglines of these organizations and how they are selling their camps/retreats on their websites. The keywords were circling around: bringing a super <strong class=\"markup--strong markup--p-strong\">interesting community</strong> to an <strong class=\"markup--strong markup--p-strong\">inspiring</strong> and <strong class=\"markup--strong markup--p-strong\">beautiful environment. </strong>This seems to be the common sense selling argument of camp organizers. Not a surprise, because that&#8217;s exactly what we want to do with our camp, too.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*1luWFnVJxKxEFbYM7hSEzg.jpeg\">Landingpage of southwestcollective.co<p name=\"70b9\" id=\"70b9\" class=\"graf graf--p graf-after--figure\">I think what happens is that even when having a flexible agenda as an entrepreneur, there is rarely enough time and mindspace in our daily lives. It is really hard to make profound connections or deeply think about something in this dense environment. The solution is to escape the routines and make some space at a coworking camp outside your regular day-to-day activity. Booking a trip to a remote island and making sure there are enough like-minded and interesting people seems to do the trick for many people.</p><p name=\"b061\" id=\"b061\" class=\"graf graf--p graf-after--p\">For digital nomads, the picture looks slightly different: Nomads are working all year from the <a href=\"http://kohub.org\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">beaches of kolanta</a> or <a href=\"http://www.hubud.org\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">the jungle of ubud.</a> They are in beautiful destinations all the time. For them it is super relevant to meet the right people with the the right content and make meaningful connections on those occasions. You could say camps and retreats are specialized gathering points for these &#8220;tribes.&#8221;</p><p name=\"997b\" id=\"997b\" class=\"graf graf--p graf-after--p\">The funny thing is that outside this bubble most people think we are crazy. Those who are not involved in coworking or digital nomadism wonder why we invest time and money to travel to a beautiful holiday destination and then, when we&#8217;re there, we try to get work done instead of chilling out. I get their point and it is really weird in a way. But there are good reasons to start transforming your holiday into something more meaningful than &#8220;just&#8221; hanging out at the beach, right?</p><p name=\"d3b5\" id=\"d3b5\" class=\"graf graf--p graf-after--p\">Having said all of the above, it is absolutely clear that if work changes and so does <a href=\"https://medium.com/p/c0aedeceabf0\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">the way we live</a>, the role of &#8220;the holiday&#8221; also goes through a fundamental change. We can see it happening right now by the example of retreats, sabbaticals and coworking camps. There will probably be more to come.</p><p name=\"aec9\" id=\"aec9\" class=\"graf graf--p graf-after--p\">If you want to experience it firsthand, I suggest joining us or one of the other camps in the near future. I definitely will write a travel report from the inside of our camp after I am back from Greece at the end of June to share some firsthand experience.</p><p name=\"4613\" id=\"4613\" class=\"graf graf--p graf-after--p\">Until then, follow me on Medium or DM me on Facebook if you have questions.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*X_sktp3yjjAChgjFhb-31A.jpeg\">POC 21 Camp Paris 2016 &#8211; Photo by Stephano&#160;Borghi</div>","title":"What I learned about coworking camps and digital nomad retreats when organizing my own."}},"pageContext":{"id":"5b937ae087be056953db7ce4"}}