{"data":{"mongodbDatabaseArticles":{"id":"5b9629eb87be0583274911bf","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Sydney</h1><p><strong>Tell us a little about&#160; yourself and tell us why you&#8217;re an expert on luxury travel in Sydney.</strong></p><p>My name is Laura. I&#8217;m originally from New York, but after graduating from college, I decided to move to New Zealand where I spent a year discovering my love for craft beer and meat pies. After leaving New Zealand I moved to Sydney. For two years I explored new restaurants, new bars and everything else this cosmopolitan city has to offer.</p><p><strong>What makes Sydney a perfect destination for travelers seeking a glamorous trip?</strong></p><p>Sydney is by far the most glamorous place to go in Australia. It&#8217;s a city of laid back, beautiful people who spend most of their time either at the beach or working on looking good at the beach. It is a haven for budding new chefs to open restaurants of all cuisines. There are boutique hotels, small themed bars, big night clubs, rooftop party places and stunning beaches to recover on.</p><p><img class=\"aligncenter size-full wp-image-6636\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/SAM_0364.jpg?resize=560%2C421&amp;ssl=1\" alt=\"Luxury Guide to Sydney\" width=\"560\" height=\"421\"><strong>What 5 star hotel is the best in your town?</strong></p><p>The <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Park_Hyatt_Sydney.htm\"><strong>Park Hyatt on the Sydney Harbour</strong></a> has to be the best spot. It has the best view in the city. It sits under the Harbour bridge and looks out over the Sydney Opera House. You can enjoy your breakfast as you watch the city wake up in front of you. Head up to the rooftop for comfortable chase lounges and poolside views of the entire harbour. There&#8217;s a fitness center and a spa to make sure you look all the bit a glamorous Sydney-sider before you head out the door.</p><p><strong>What about boutique hotels, of them all, which would you send your friends or family to stay at?</strong></p><p>I would definitely send my family and friends to <strong>QT Boutique Hotel</strong> in the center of Sydney. It&#8217;s housed in the historic Gowings and State old theater building. They have worked to retain the theater vibe from the moment you step inside. It feels luxurious while also being fun. All of the furniture is oversized and plush, there are antique pieces of luggage and re-upolstured cloth mannequins awaiting their next costume design. <strong>It not only has one of the best spas in Sydney, it was even voted as one of the best new spas in the world by Conde Nast in 2013.</strong></p><p><strong>Are there any fun activities for the adventurous traveler?</strong></p><p>If you&#8217;re looking to do something totally lavish in Sydney, <strong>you should hire <a href=\"http://sydneyharbourexclusive.com/vessels/island/\" target=\"_blank\" rel=\"noopener\">the Island</a>.</strong>&#160; Choose any spot in the harbor to lay atop this luxury barge with 200 of your closest friends. If the price tag is too steep, consider buying a ticket to their weekend parties or hiring a smaller boat to cruise around the harbour. &#160;<strong>&#160;</strong></p><p>If you&#8217;re a bit more of a thrill seeker, you can always <strong>hook yourself to the <a href=\"http://www.bridgeclimb.com/\" target=\"_blank\" rel=\"noopener\">Harbour Bridge for a clim</a><a href=\"http://www.bridgeclimb.com/\" target=\"_blank\" rel=\"noopener\">b</a></strong>. Opt for the sunrise or the sunset walks and watch the colors change across the water.</p><p><img class=\"aligncenter size-full wp-image-6638\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/SAM_3235.jpg?resize=560%2C421&amp;ssl=1\" alt=\"Luxury Guide to Sydney\" width=\"560\" height=\"421\"><strong>Where are the best hang outs during the day?</strong></p><p>There isn&#8217;t a bad place to hang out in Sydney if you&#8217;re by the water. My absolute favorite has to be <strong>Cremorne point</strong>. Just over the Harbour Bridge to the north sits a grassy hill overlooking the Opera House and the Harbour Bridge. Get there early on the weekend to get a good, shady spot.</p><p>You can&#8217;t come to Sydney and not go to the beach for the day. Skip the crowded surf beaches of Bondi and Manly and head for the more <strong>secluded Balmoral Beach to the north or Milk Beach</strong> to the east. Both are better for swimming and sunning.</p><p>You could easily while away an entire afternoon sitting in a cafe. There is one on almost every corner of every street in the entire metro area. Coffee is a religion here and people are very devout. The best collection of cafes is on <strong>Crown Street in Surry Hills</strong> where al fresco dining is always on the menu. That and good cappuccino.</p><p><img class=\"aligncenter size-full wp-image-6640\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/SAM_7482.jpg?resize=560%2C421&amp;ssl=1\" alt=\"Luxury Guide to Sydney\" width=\"560\" height=\"421\"><strong>If you have a big date night, what are the most delicious restaurants in Sydney&#160; and what are their best dishes?</strong></p><p>Sydney is constantly opening new restaurants. One of my favorite chefs in the city is <strong>Colin Fassnidge</strong>. I saw him butcher a pig at a food festival before showing the audience how to confit it. He believes nothing should be wasted, especially a good piece of pork. Originally from Ireland, he has made Sydney his home, opening two of the best (in my opinion) restaurants in the city. <strong>Four in Hand</strong>, his first restaurant in Paddington, is full of simple, comforting food done incredibly well. His menu changes monthly in order to source local, fresh produce, but you can never go wrong with anything from a pig.</p><p>Location: 105 Sutherland St Paddington NSW 2021</p><p>His second restaurant, <strong>4Fourteen</strong>, is located in Surry Hills. This place is all about sharing. The menu is broken up into &#8220;Nibbles&#8221;, &#8220;Small Plates&#8221; and &#8220;Large Plates&#8221;. The wine list is extensive and all of the wait staff have excellent knowledge of what will go best with your food choice. Again, the menu changes seasonally, but luckily with all of the small plates, you can sample pretty much everything on the menu if you bring enough people.</p><p>Location: 414 Bourke St. Surry Hills NSW 2010 Entrance via: 72c Fitzroy St. Surry Hills</p><p><strong>Let&#8217;s talk desserts- what place makes the best?</strong></p><p><strong>Messina Ice Cream</strong> is the best ice cream I&#8217;ve had outside of Italy. The dark chocolate sorbet was my first love until I tried the creamier versions. The tiramisu is heavenly. They are constantly adding new ones or doing seasonal flavors of the month. They now have several branches around Sydney &#8211; Surry Hills, Darlinghurst and the Star Casino.</p><p>When it comes to dessert in Sydney, <strong>Adriano Zumbo</strong> is a household name. He&#8217;s a regular on Masterchef Australia, famous for challenging the contestants to complete his towering pastry creations. His location at the Star Casino is set up like a sushi train restaurant. Choose wisely.<strong>&#160;</strong></p><p><img class=\"aligncenter size-full wp-image-6639\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/SAM_5829.jpg?resize=560%2C421&amp;ssl=1\" alt=\"Luxury Guide to Sydney\" width=\"560\" height=\"421\"><strong>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers?</strong></p><p>The main shopping district of central Sydney is at <strong>Pitt Street Mall</strong>. This pedestrian only street is surrounded by a large Westfield that forms the base of one of Sydney&#8217;s more iconic buildings, the <strong>Westfield Tower</strong>. It&#8217;s also home to all of your big name brands. But if you&#8217;re looking for local, Australian based designers, head across the street to <strong>the Strand</strong>. It&#8217;s an old arcade style building from the Victorian era and it has kept much of it&#8217;s charm. Start at the bottom with a coffee at Strand Espresso to fuel your shopping.</p><p><strong>Dinasaur Designs</strong> make stunningly unique clay jewelry as well as quirky and colorful homeware pieces.&#160; <strong>Manning Cartel</strong> has quickly become one of Australia&#8217;s hottest design houses. Their fabrics are glorious and their designs and patterns can&#8217;t be found on the high street. <strong>Go to Lover</strong> for romantic dresses and gowns and anything lace. If you&#8217;re interested in meeting some of the designers in person be sure to shop during one of the year&#8217;s many <strong>&#8220;Evening with the Designers&#8221;</strong>, generally held at the start of every design season.</p><p><strong>Time for a great sunset view&#8230; where would you go?</strong></p><p>My absolute favorite spot to head for a sunset is <strong>Camp Cove</strong>, a beach on the South Head of the harbour. It&#8217;s really easy to get to by bus and requires only a little bit of walking to reach; trust me, it&#8217;s worth it.&#160; You can walk around to a lighthouse and stare out into the Pacific Ocean or look back at the city in the distance. To do it in true Sydney style, pack some snacks and a bottle of wine to enjoy as the sun goes down. If you come at the right time of year and you get lucky, you might even spot some migrating whales.<strong>&#160;</strong></p><p><strong>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks.</strong></p><p>There are so many amazing little bars popping up all over Sydney. A few years ago the city center wasn&#8217;t the best spot to start a night out, but as licensing laws have begun to slacken, the night life has livened up. If you want somewhere with a view, head to the <strong>Glenmore in the rocks</strong>. It&#8217;s a great alternative to the busier, <strong>tourist bars around the Opera House</strong> and the view from the rooftop isn&#8217;t too bad either. Some of my favorite small bars around the city include <strong>Lobo Plantation,</strong> a rum bar styled to look like an old American sugar plantation and<strong> Since I left You</strong>, a tiny little bar with a stone walled courtyard and a long cocktail list.</p><p><img class=\"aligncenter size-full wp-image-6641\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/SAM_8156.jpg?resize=560%2C421&amp;ssl=1\" alt=\"Luxury Guide to Sydney\" width=\"560\" height=\"421\"><strong>If you end the night at a fancy club, which one do you head towards?</strong></p><p><strong>The place to see and be seen is definitely the Ivy</strong> in the city center. It&#8217;s tucked down a side alley, but all you have to do is follow the music (and the line) and you&#8217;ll know you&#8217;ve arrived. The Ivy is a chic spot for cocktails and dancing. Head down early to sip cocktails by the rooftop pool in summer. If you&#8217;re more interested in dancing than looking cute by the bar, head to <strong>Marquee in the Star Casino</strong>. Popular DJ&#8217;s are constantly being featured there. Different nights of the weekend generally play different types of music, so be sure to check up on what&#8217;s happening on their website before you head out.</p><p>[Book a room | Book a flight]</p><p>&#160;</p><p><img class=\"alignleft size-thumbnail wp-image-6635\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/Gravatar-Photo-150x150.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury Guide to Sydney\" width=\"150\" height=\"150\">Laura Bronner is blogger and serial expat originally from the United States. After graduating from college she set off on what was meant to be a year of travel. That was four years ago. Since then she has lived in New Zealand and Australia and currently calls South Korea home. She blogs at <a href=\"http://www.an-american-abroad.com\" target=\"_blank\" rel=\"noopener\">An American Abroad</a> and you can follow along with her on <a href=\"http://www.twitter.com/usaabroad\" target=\"_blank\" rel=\"noopener\">Twitter</a>, <a href=\"http://www.facebook.com/AnAmericanAbroad\" target=\"_blank\" rel=\"noopener\">Facebook</a>, and <a href=\"http://www.instagram.com/usaabroad\" target=\"_blank\" rel=\"noopener\">Instagram</a>.</p><p>&#160;</p><p>&#160;</p><p class=\"fusion-clearfix\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Sydney"}},"pageContext":{"id":"5b9629eb87be0583274911bf"}}