{"data":{"mongodbDatabaseArticles":{"id":"5b95ea5087be05832748ff98","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/knowplace001.jpg\" alt=\"Beautiful Stockholm Sweden\">Posted: 10/12/2009 | October 12th, 2009</p><p>People always like to debate the supposed <a href=\"https://nomadicmatt.com/travel-blogs/of-backpackers-and-tourists/\" rel=\"noopener\" target=\"_blank\">difference between travelers and tourists</a>. Tourists are in and out of cities quickly, taking a few pictures, and following their guidebook to overpriced restaurants. Travelers, on the other hand, tend to move slower. We see many of the same sights as tourists but get off the beaten path, linger in cities longer, and make more of an effort to learn about the place. Or so we like to try. And then we leave saying &#8220;we&#8217;ve seen a place,&#8221; happy in our efforts not to be a tourist.</p><p>But have we really seen anything? At what point can you leave a place and say &#8220;I saw and know something about life in city X.&#8221; I don&#8217;t think we ever really can. No matter how long we linger, little markets we explore, or non-touristy things we do, as travelers, we&#8217;ll never fully know a place- only someone who has lived there can claim that.</p><p>I&#8217;m currently in Stockholm, where the weather is much colder than I like. <a href=\"https://nomadicmatt.com/travel-guides/sweden-travel-tips/stockholm/\" rel=\"noopener\" target=\"_blank\">Stockholm</a> itself is small and beautiful. It&#8217;s been years since I&#8217;ve seen fall colors and the beautiful changing of the leaves makes for a nice compliment to Stockholm&#8217;s beautiful buildings. The little islands connected by bridges and ringed by little boats reminds me of Venice&#8230;if someone put Venice in the middle of Maine. If they found a way to get rid of winter, I&#8217;d live here.</p><p>But because of the weather and cost here, I haven&#8217;t done many touristy things. I&#8217;ve just walked around. I saw two bad museums. I walked around some more. I people watched. I found a cool little supermarket. But I haven&#8217;t seen the Royal Palace yet or the Noble Museum. I haven&#8217;t taken a boat tour. I haven&#8217;t been to the Vasa museum yet. In short, there is still much left to see.</p><p>But does that mean I still haven&#8217;t seen or experienced Stockholm? Or did I really see Stockholm when I went out food shopping with my friends, sat and relaxed with a few movies, went to a few bars and clubs, got taught naughty Swedish words, was explained Stockholm&#8217;s vibe, and taken to a few local restaurants?</p><p>Long term travelers look for a deeper understanding of the places they visit. They have come to get to know a place through more than just a few pictures. Yet we often do the same things the three day tourists that often are the butt of many travel jokes do. We walk, we shop, we visit museums. And while we may visit a few off the beaten path places, at best we walk away only being able to say that this place is nice, or ugly, this or that. I&#8217;ve been to Melbourne. I can give advice on what to see and do and what I liked but short visits only give you a superficial feel for a place.</p><p>But despite my short stay here and lack of any &#8220;real&#8221; sightseeing, I feel like I know Stockholm a bit more than I normally would have otherwise. Because the heart of any place isn&#8217;t found in walking or sightseeing, it&#8217;s found in the locals. To have any understanding of a place requires you, as clich&#233; as this sounds, to live like a local. And for my brief time here, I lived like the locals did. I shadowed a few groups of friends and did what they did. I got to experience places where I was the only foreigner. I got to see daily life (and some good nightlife!). And I&#8217;m not sure, just armed with a guidebook, I could have done any of that.</p><p>It&#8217;s not until we begin to live like a local that we can truly get an appreciation for the rhythm of life there. That is why Couchsurfing is such a great thing. You can stay with locals, see where they go, go out with them, and put yourself into the local rhythm. After all, don&#8217;t we all just want to &#8220;hang out with locals&#8221;? One of the biggest ironies of travel is that we go to explore cities and meet locals but we usually just end up staying around other backpackers or travelers we&#8217;ve met.</p><p>So despite my lack of &#8220;sightseeing&#8221;, I&#8217;m happy with my time in Stockholm. I still would never say I know Stockholm but, through my friends, I got to see how the locals live and, at the end of the day, that is what traveling is all about.</p><h3>Get My COMPLETE Budget Guidebook for Stockholm!</h3><p><a href=\"https://nomadicmatt.com/books/stockholm-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/stockholmcover2.jpg\" alt=\"Nomadic Matt's Guide to Stockholm\" width=\"180\" height=\"240\"></a>For more in-depth coverage of Stockholm, my 80 page guidebook is perfect for budget travelers like you! It cuts out the fluff found in other guides and gets straight to the practical information you need to travel and save money in one of the most beautiful cities in the world. You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/stockholm-guide/\">Click here to learn more and purchase the book.</a></p><h4>Book Your Trip to Stockholm: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Stockholm by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://nomadicmatt.momondo.com/?utm_source=private&amp;utm_medium=affiliate&amp;utm_campaign=nomadicmatt\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Acommodation</strong><br> You can book your hostel in Stockholm with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" rel=\"noopener\" target=\"_blank\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Stockholm?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/travel-guides/sweden-travel-tips/stockholm/\" rel=\"noopener\" target=\"_blank\">destination guide on Stockholm</a> for even more planning tips!</p></div>","title":"When Can You Say You Know a Place?"}},"pageContext":{"id":"5b95ea5087be05832748ff98"}}