{"data":{"mongodbDatabaseArticles":{"id":"5b95eab687be05832748ffc9","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/donandalison2.jpg\" alt=\"don and alison, a happy senior couple traveling the world\"><br> When I saw him in the hostel, I couldn&#8217;t help but smile. There he was, a man who could have been my grandfather, hanging out with college-aged backpackers and having the time of his life. The younger travelers were enamored with his stories of past travels and his ability to drink them under the table. No one cared he was in his 70s. Age mattered not one bit.</p><p>I believe that most of my advice on this website is universal. Maybe as an older couple or family <a href=\"https://www.nomadicmatt.com/travel-blogs/cheap-accommodation/\">you&#8217;ll skip hostels or avoid Couchsurfing</a>, but when we land in Paris, we all face the same costs and list of potential activities, regardless of age. But I think, especially here in the <a href=\"https://www.nomadicmatt.com/travel-guides/united-states-travel-guide/\">United States</a>, there is a belief that you just can&#8217;t travel when you&#8217;re 70 or have medical problems. And while there are a few things to be more mindful of as you get older, I disagree that there is a special category called &#8220;senior travel.&#8221; The differences between how I travel and how a 70-year-old travels are really minimal.</p><p>So when Don and Alison approached me about their story, I had to share it. Because here is a &#8220;senior&#8221; couple, limited by some medical issues, engaging in adventures I only dream about. I think their story can teach and inspire a lot of us.</p><p><strong>Nomadic Matt: Hi guys! Tell everyone about yourselves. </strong><br> <strong>Don:</strong> I&#8217;m a 70-year-old retired neuropsychologist. Two years ago, I made a decision to retire, because I&#8217;d developed a number of medical problems due to stress from work. I was working myself into sickness. Alison (my wife, who is 63) and I didn&#8217;t have enough savings to be able to keep our home and do the kind of world travel we wanted to do. We agonized over what to do for a long time until it became clear that it came down to the question of &#8220;Do we want to have a home or do we want to have a life?&#8221; So we made the decision to sell our home. We&#8217;ve now been on the road, with occasional trips back to our hometown to restock our basic supplies and see our friends, for two years, and plan to continue living a nomadic life for the foreseeable future.<br> <img src=\"https://media.nomadicmatt.com/donandalison1.jpg\" alt=\"don and alison, a happy senior couple traveling the world\"><br> <strong>What inspired you to become nomadic?</strong><br> <strong>Don:</strong> Initially it was the desire to see the places that were at the top of our bucket list, and after that to see as much of the world as we could before we got too old to travel.</p><p><strong>Alison:</strong> Inspiration came first from Don writing daily &#8220;morning pages&#8221; (from Julia Cameron&#8217;s <a href=\"http://www.amazon.com/gp/product/1585421464/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1585421464&amp;linkCode=as2&amp;tag=nommatstrasit-20&amp;linkId=4SVVJW2722POFBS3\" rel=\"nofollow\">The Artist&#8217;s Way</a>) in search of some answers to the retirement/income dilemma. One day out of the blue, he suggested to me that we could sell the condo and go traveling. I didn&#8217;t immediately say yes to this, but it was a seed that grew of its own accord until one day, we realized this is what we&#8217;d do. I had a nice life at home, but Don was done with work and struggling to keep going. Something had to give.</p><p><strong>Where have your travels taken you so far?</strong><br> <strong>Don: </strong>After selling our home, we went to <a href=\"https://www.nomadicmatt.com/travel-guides/europe-travel-tips/\">Europe</a>. Following that we went to Tiruvannamalai in Tamil Nadu, India, where we stayed for 10 weeks in order to spend time meditating at the ashram of Ramana Maharshi. From there we went to <a href=\"https://www.nomadicmatt.com/travel-guides/indonesia-travel-tips/bali/\">Bali</a>, then to <a href=\"https://www.nomadicmatt.com/travel-blogs/ten-reasons-to-visit-australia/\">Australia</a> to spend time with some of Alison&#8217;s family and friends. We&#8217;ve also been back to India, all over <a href=\"https://www.nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\">Southeast Asia</a>, and most recently, <a href=\"https://www.nomadicmatt.com/travel-guides/mexico-travel-tips/\">Mexico</a>.</p><p><strong>Did your friends and family think you were crazy for doing this?</strong><br> <strong>Don: </strong>Probably, although no one said that to our faces. Everyone was surprised, some of them seemed perhaps a bit shocked, and many of them told us that we had a lot of courage for taking this step and encouraged us to go for it.</p><p><strong>Do you feel that your age was in any way a problem or limiting?</strong><br> <strong>Don: </strong>When we first began traveling, I was concerned about my health and whether I&#8217;d be able to stay healthy, particularly when traveling in Third World countries. However, as we&#8217;ve traveled, I realized I can get sick overseas, take appropriate medications, and get well again. It&#8217;s not as hard as I thought to get the necessary care when you travel.</p><p><strong>Alison:</strong> It never occurred to me that age has anything to do with anything. I&#8217;m young, fit, and healthy, and mostly do what I need to do to stay that way. At the same time, I&#8217;m aware that Don has some manageable health issues that we need to pay attention to, but nothing that really prevents us from doing what we want to do. <a href=\"https://www.nomadicmatt.com/travel-blogs/why-travel-makes-you-awesome/\">He&#8217;s so much healthier and happier than when he was working.</a></p><p>Having said that, we&#8217;re not cavalier about our bodies. We know that things sometimes take longer to heal than when we were younger. For this reason, we draw the line at things like white-water rafting. Apart from the fact that neither of us are experienced at it, we know that one good jolt could result in whiplash that could take weeks to heal. Still, we&#8217;ve hiked in fairly difficult terrain, been swimming with elephants, gone kayaking, ridden camels at dawn in the desert, and climbed volcanoes in the dark.</p><p><img src=\"https://media.nomadicmatt.com/donandalison4.jpg\" alt=\"don and alison, a happy senior couple traveling the world\"><strong>How did you save money for your travels?</strong><br> <strong>Don:</strong> I had been putting money into a Canadian Registered Retirement Savings Plan for many years. These savings and any interest earned on them are tax-free until such time as I begin to withdraw them. We sold our home at what appears now to have been the peak of the Vancouver housing market in August 2011 and put the money to work in investments. We also receive a monthly pension from a Canadian federal government plan that I contributed to from the time I was in my early 20s until I retired.</p><p><strong>How do you manage your money on the road?</strong><br> <strong>Don: </strong><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\">We budget about $50 per day</a> for our accommodation, plus another $50 for meals and entertainment. Recently, we&#8217;ve started staying in places for longer periods of time and have begun <a href=\"https://www.nomadicmatt.com/travel-blogs/sharing-economy-travel-cheap/\">renting apartments</a> instead of staying in hotels. The price per night is often about the same as a hotel room, but we save money by making our own meals. We regularly splurge on guided tours or treks, or big events like the Guelaguetza Festival in Oaxaca.</p><p><strong>A lot of older couples and individuals feel that round-the-world trips are for young people. What would you say to them?</strong><br> <strong>Don</strong>: Do it anyway while you still have the health and strength to do it. We&#8217;re more flashpackers than backpackers: we usually stay in three-star hotels because we can do that on our budget, and the rooms we rent must have Wi-Fi and an en-suite bathroom. We <a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\">book hotel rooms</a> or apartments online using <a href=\"https://www.agoda.com/partners/partnersearch.aspx?pcs=1&amp;cid=1560988&amp;hl=en\" rel=\"nofollow\"></a>Agoda.com, <a href=\"http://booking.com\">Booking.com</a>, <a href=\"http://Wimdu.com\">Wimdu.com</a>, or <a href=\"http://www.homeaway.com/\">Homeaway.com</a>.</p><p><strong>Alison:</strong> I think there are a lot of myths about &#8220;old age&#8221; that people live into. I don&#8217;t understand the idea that adventure and a love of life are only for &#8220;the young.&#8221; We&#8217;ve met a full-of-life 92-year-old who learnt to play the fiddle in his seventies and regularly jams with a group of buddies, a 78-year-old woman who says when she&#8217;s 80&#160;she&#8217;ll be ready to sell her house and go traveling, and an eighty-something woman who was traveling alone in Myanmar. We love role models like this. Life&#8217;s what you make it, <a href=\"https://www.nomadicmatt.com/travel-blogs/there-is-no-tomorrow-in-travel/\">and you only get one chance to live this life.</a></p><p><strong>Do you stay in hostels? When you meet young backpackers on your trip, how do they react? I usually find that they tend to get excited about senior travelers. It&#8217;s a &#8220;cool&#8221; thing. </strong><br> <strong>Don:</strong> We haven&#8217;t stayed in hostels for two main reasons: the first being because of my concerns about the security of our belongings, and the second being that we like the luxury of a private bathroom. That being said, the young backpackers we&#8217;ve met on the road have been very positive about us doing what we&#8217;re doing at our age.</p><p><img src=\"https://media.nomadicmatt.com/donandalison3.jpg\" alt=\"don and alison, a happy senior couple traveling the world\"></p><p><strong>Did you have any fears about traveling before you started?</strong><br> <strong>Don:</strong> Alison has always been much more adventurous than me, so when we first began traveling I had a lot of fears about getting sick in Third World countries. Now that we&#8217;ve been traveling for almost two years, a lot of those fears are gone because we&#8217;ve been sick and recovered without having to be sent back to Canada.</p><p><strong>Alison:</strong> I don&#8217;t like flying. It&#8217;s one of my biggest fears. As long as things are going smoothly and I can immerse myself in a <a href=\"https://www.nomadicmatt.com/travel-blogs/the-ultimate-list-of-travel-movies/\">movie</a> I&#8217;m fine. But any turbulence and I&#8217;m a white-knuckle mess. [Matt says: me too!] Apart from that I don&#8217;t think I was ever really afraid, because I&#8217;d done so much traveling when I was younger.</p><p><strong>What was the biggest thing you&#8217;ve learned from your travels so far?</strong><br> <strong>Don:</strong> That traveling really does broaden the mind. We&#8217;ve discovered that people are people wherever we go and that the great majority of them are friendly and helpful. If you approach people in a friendly and open-hearted way, that is what you are most likely to get back. We do our best to come with a sense of respect for the people we meet on our travels, regardless of their circumstances. We&#8217;ve also found that making the effort to <a href=\"https://www.nomadicmatt.com/travel-blogs/four-step-language-learning/\">learn a few basic words and phrases of the local language</a> does wonders for connecting with the people of a country!</p><p>I&#8217;m much happier and healthier than I was two years ago. I now know from personal experience <a href=\"https://www.nomadicmatt.com/travel-blogs/everyone-say-im-running-away/\">why people love to travel</a>. The world and its peoples are much more friendly and much less scary than various government websites would have us believe.</p><p><strong>Alison</strong>: Everything Don said, and always learn how to say &#8220;I&#8217;m sorry&#8221; in the local language. And presence. There&#8217;s no past, no future. Only now. The longer we travel the more this truth is actually lived. Whenever I feel vulnerable I return to the present because it is here that life is lived.</p><p><strong>What advice would you give to people looking to do something similar? </strong><br> <strong>Alison:</strong> Don&#8217;t go blind. <a href=\"https://www.nomadicmatt.com/travel-guides/\">Do your research.</a> The more information you gather before you go, the better you&#8217;ll <a href=\"https://www.nomadicmatt.com/getting-started-new/\">be prepared</a>, and the less vulnerable you&#8217;ll feel. At the same time, don&#8217;t organize yourself into a tight schedule. Leave room for spontaneity. Trust yourself, and go for it. Until you do it you cannot even begin to imagine the rewards that come from such a life. The world is an <a href=\"https://www.nomadicmatt.com/travel-blogs/27-more-africa-photos/\">astonishing place</a>, and people are more open-hearted than you&#8217;d ever believe from watching the nightly news. Oh, that&#8217;s another thing &#8212;&#160;stop watching the news: it gives you a very negative view of the word!</p><p>Don and Alison are a real inspiration. They found a way to make travel work for them, and it even made Don a healthier and happier person! I really do love their story as well as what they had to say about their experience. The couple have set up a blog about their travels that <a href=\"http://alisonanddon.wordpress.com/about/\">you can read here</a>.</p><h3>Become the Next Success Story</h3><p>One of my favorite parts about this job is hearing people&#8217;s travel stories. They inspire me, but more importantly, they also inspire you. I travel a certain way but there are many ways to fund your trips and travel the world. I hope these stories show you that there is more than one way to travel, and that it is within your grasp to reach your travel goals. Here&#8217;s another example of people who made traveling the world a priority a little later in life:</p><p>We all come from different places, but we all have one thing in common:&#160;we all want to travel more.</p><p>Make today the day you take one step closer to traveling &#8212;&#160;whether it is buying a guidebook, booking a hostel, creating an itinerary, or going all the way and buying a plane ticket.</p><p>Remember, tomorrow may never come, so don&#8217;t wait.</p></div>","title":"How This 70 Year Old Couple Traveled the World"}},"pageContext":{"id":"5b95eab687be05832748ffc9"}}