{"data":{"mongodbDatabaseArticles":{"id":"5b921d1e87be0571ac1b04f9","content":"<div><p></p><img class=\"wp-image-24685 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-1.png\" alt=\"renounce us citizenship ultimate guide\" width=\"700\" height=\"467\"><p>Dateline: Kuala Lumpur, Malaysia</p>\n<p>These days, I have been helping a record number of people plan to either renounce their US citizenship or determine that they do not need to renounce because they can create a different plan to <a href=\"http://nomadcapitalist.com/tax-reduction/\">reduce their tax bill.</a></p>\n<p>And I&#8217;m not alone; giving up US citizenship has become quite a trend in light of FATCA, FBARs, new CFC rules under Trump, and a whole host of alphabet soup laws, agencies, and forms.</p>\n<p>Just a few years ago, Facebook co-founder Eduardo Saverin chose to <a href=\"https://www.forbes.com/sites/briansolomon/2012/05/11/eduardo-saverin-renounces-u-s-citizenship-ahead-of-mega-facebook-ipo/#60cee8f31ff6\">renounce his US citizenship</a> and become a citizen of Singapore instead. Politicians like Senator Charles Schumer of New York said Saverin was an &#8220;American success story gone horribly wrong&#8221; and declared that he had turned his back on the country that had given him his success.</p>\n<p>They were not going to allow him to get away with it.</p>\n<p>But he did get away with it&#8230; because the ability to renounce your citizenship is an inherent right available to everyone.</p>\n<p>Thousands of Americans have been &#8220;getting away with it&#8221; for a long time. In fact, in the past few years, Americans have been renouncing their US citizenship <a href=\"https://www.independent.co.uk/news/world/americas/american-citzenship-renounced-record-rate-treasury-department-a8040311.html\">at record-breaking rates</a>.</p>\n<p>&#160;</p>\n<h2><strong>The Increasing Number of Renunciations</strong></h2>\n<p></p><img class=\"wp-image-24686 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-2.jpg\" alt=\"renounce us citizenship ultimate guide\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Prior to 2009, renunciation levels had stayed under roughly 750 people per year or much, much less. The high came in 2005 with 762 renunciations, followed by a low of 268 in 2006. However, just a few years down the road, the renunciation rate more than doubled from the 742 renunciations in 2009 to over 1,500 in 2010.</p>\n<p>And the number of people choosing to renounce has only continued to go up since then. By 2013, the rate had doubled once again with almost 3000 people choosing to give up their US citizenship. Then, just from 2015 to 2016, there was a 26% increase in renunciations with 4,279 cases jumping to 5,409 in just one year.</p>\n<p>The list of those who have renounced in the past includes everyone from T.S. Eliot to Princess Elizabeth of Yugoslavia. There are many <a href=\"http://nomadcapitalist.com/2013/12/08/top-5-famous-people-renounce-us-citizenship/\">famous faces</a> in the ranks of former US citizens, including historical figures like W.E.B. Du Bois, actors like Jet Lee, athletes like Quincy Adams, scientists like Robert Brout, politicians like Boris Johnson, and even the best chess mind to ever live, Bobby Fischer.</p>\n<p>Famous or not, those who have chosen to renounce still compose a very small group of the overall population of the United States. And, with more than a million people immigrating to the United States each year, it&#8217;s not like those who renounce are making a considerable dent in the US taxpayer basis. Renunciation may have gone from 268 people in 2006 to 5,409 in 2016, but that&#8217;s still just 5,409 people in a country of over 300 million.</p>\n<p>But it&#8217;s not about the size of the group or their impact on US population statistics.</p>\n<p>The number of people who buy Ferraris every year is small, yet everybody knows what a Ferrari is. The limited numbers do not change their value.</p>\n<p>It is the same for Nomad Capitalists, whether renunciation is a part of their plans or not. If you are reading this, you are already part of a small group of open-minded people who are willing to <a href=\"http://nomadcapitalist.com/2017/05/15/how-to-go-where-youre-treated-best/\">go where they&#8217;re treated best</a> in order to receive more benefits and a better life.</p>\n<p>The group may be small, but its size says nothing about the value of adopting the mindset and lifestyle.</p>\n<p>That said, giving up US citizenship is not for everyone, and I&#8217;m not here to tell you to do it.</p>\n<p>There are plenty of rich folks in Malibu and New York who are happy to stay where they are at until they die, even if it costs them half their money. They content themselves with the idea that they are trying to change the system. Nomad Capitalists, on the other hand, are a smaller group of folks who prefer to go where the systems <strong>already </strong>work.</p>\n<p>And, for a smaller number of Nomad Capitalists, going where they&#8217;re treated best also means leaving behind the systems that are holding them back by choosing to <a href=\"http://nomadcapitalist.com/expatriation/\">renounce US citizenship</a>.</p>\n<p>For the millions of immigrants who come to the United States each year, it may be difficult to understand why someone would want to renounce a citizenship that they envy. The US is their end goal. But for a small group of individuals, that same citizenship has become a burden, stumbling block, or even a liability.</p>\n<p>The remarkable thing about the past few years, then, is not that the numbers are small but that these numbers have been growing. Something obviously changed between 2009 and 2010 to send renunciation rates sky-high with no indication of slowing down.</p>\n<p>So, as more citizens jump ship, the question we have to ask is &#8220;why?&#8221;</p>\n<p>&#160;</p>\n<h2><strong>Why Do People Renounce?</strong></h2>\n<p></p><img class=\"wp-image-24687 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-3.jpg\" alt=\"renounce us citizenship ultimate guide\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>The first component of the renunciation trend we have to understand is what it actually means to renounce citizenship. Put simply, renunciation is the voluntary act of giving up your citizenship.</p>\n<p>Citizenship comes with both <a href=\"https://www.uscis.gov/citizenship/learners/citizenship-rights-and-responsibilities\">rights and responsibilities</a>. Most people who wish to renounce US citizenship do not agree with the &#8220;responsibilities&#8221; that were forced upon them automatically at their birth &#8211; like the requirement to hand over a larger and larger percentage of their money the more they earn.</p>\n<p>If they choose to renounce their citizenship to free themselves of these obligations, it follows that they also relinquish their claim to any of the rights that come with their citizenship.</p>\n<p>These rights include everything from the right to vote in US elections to the privilege of receiving government protection and assistance while traveling abroad. Citizenship rights can also include the right to bestow citizenship on any children born overseas, access to the US job market and federal jobs, as well as the unrestricted right to live in and travel in and out of the United States.</p>\n<p>Up until 2010, very few people found the responsibilities of US citizenship to be so burdensome as to justify giving up these and other rights of citizenship. For many folks, that all changed in 2010 when the<a href=\"https://www.irs.gov/businesses/corporations/foreign-account-tax-compliance-act-fatca\"> Foreign Account Tax Compliance Act (FATCA)</a> came into effect.</p>\n<p>More than any other factor, FATCA is what has inspired so many people to take drastic action and renounce their US citizenship.</p>\n<p>FATCA impacts American citizens in two significant ways. The first is that the new law has created so many new reporting, filing, and tax obligations that compliance has become beyond burdensome for many individuals with foreign bank accounts and assets located around the world.</p>\n<p>Paying a large tax bill is one thing, but when you have to spend precious time and money completing an endless pile of forms on top of that &#8211; just to tell the government what you owe them &#8211; tax compliance can become a life-consuming, business-killing hardship.</p>\n<p>The second issue FATCA created is that <a href=\"https://www.forbes.com/sites/deborahljacobs/2012/07/31/most-foreign-banks-dont-want-u-s-clients-how-to-find-one-that-does/\">many banks no longer want to</a> <a href=\"https://www.forbes.com/sites/deborahljacobs/2012/07/31/most-foreign-banks-dont-want-u-s-clients-how-to-find-one-that-does/\">work with American citizens</a>. Those piles and piles of paperwork individual Americans have to deal with are nothing in comparison to what banks have to process if they choose to take on US citizens as customers. For some, the business just isn&#8217;t worth the hassle and they have closed their doors to anyone with a US passport, indefinitely.</p>\n<p>It is easy to see that, for anyone who does business overseas, FATCA can be extremely debilitating. Banks can refuse you service, business partners will seek out someone with fewer strings attached, and your business could begin to drown in the endless sea of forms and reporting requirements.</p>\n<p>The only way out in some cases is to simply cut the cord and find a new home.</p>\n<p>And more and more people are deciding that this exit strategy is the best one for them.</p>\n<p>So, while some US citizens are moved to renounce because of double taxation issues, citizenship-based taxation problems, or on moral grounds (e.g., opposition to wars or policies), the foreign reporting requirements of FATCA are the biggest motivator for the growing number of individuals who have decided to throw in the towel on their US citizenship.</p>\n<p>&#160;</p>\n<h2><strong>The Process of Renunciation</strong></h2>\n<p></p><img class=\"wp-image-24688 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-4.jpeg\" alt=\"renounce us citizenship ultimate guide\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>For those who have arrived at the decision that renunciation is the best option for them, the next step is to actually follow through on the goal.</p>\n<p>But knowing how to renounce your citizenship isn&#8217;t common, everyday knowledge. And renouncing requires much more than simply sending notice and then throwing out your passport. It is a legal process that requires your physical presence and involves paperwork, interviews, and money.</p>\n<p>Here&#8217;s what you need to know:</p>\n<p>&#160;</p>\n<h3><strong>Choose Where to Renounce</strong></h3>\n<p>Your renunciation must be done in person before a diplomatic or consular officer located outside of the United States. This means that you will need to present yourself at a US Embassy or Consulate in order to renounce.</p>\n<p>While the legal process is the same no matter where you go, the steps you must take to fulfill that process will vary depending on the diplomatic post you choose.</p>\n<p>For example, the majority of renunciations happen in a small percentage of diplomatic posts including London, Dublin, Bern, Amsterdam, Seoul, Hong Kong, Canada, Australia, and New Zealand. The staff at these locations will be more experienced and have a more formalized process for you to follow; however, because of the higher volume of folks choosing to renounce at these locations, there is often a much longer wait time before you can get an appointment.</p>\n<p>Having a more formalized process isn&#8217;t always a good thing to begin with, anyway. The staff may be more prepared to hold your hand and direct you through each step, but it also means that the process has become more bureaucratic. There are reports of the renunciation process taking up to six months and sometimes longer at these locations.</p>\n<p>Some of the higher-volume embassies and consulates have begun to create additional requirements to renounce at their specific diplomatic post. These are typically the posts closer to the United States that people think of first. The biggest hurdle they have put up is the requirement to be a local resident in order to renounce.<a href=\"http://nomadcapitalist.com/2016/12/12/belize-still-good-offshore-business/\"> Belize</a>, for example, used to be an easy place to renounce, but now they want you to be a Belize resident, which is rather difficult to do if you&#8217;re younger.</p>\n<p>While some embassies are making it more difficult to renounce, if you&#8217;re a Nomad Capitalist, you&#8217;re not going to be going to these embassies. The US Embassy in Canada, for instance, is flooded with dual Canadian-US citizens who moved to Canada 30 years ago and are now tired of filing forms. If those folks flew anywhere else to renounce, they could do it very quickly, but they don&#8217;t think nomadically. Canada is convenient and close, so they don&#8217;t think about their other options.</p>\n<p>If you think like a Nomad Capitalist, as always, you can get much better treatment.</p>\n<p>There are many advantages of going to a less obvious diplomatic post. There are fewer obstacles and the entire process is less formal and more pleasant overall. More importantly, there are usually shorter wait times with many people securing an appointment and successfully renouncing in a matter of days.</p>\n<p>I have helped plenty of people renounce in embassies around the world and I&#8217;ve seen people renounce in as little as a week.</p>\n<p>There was one time when my team called and said that we needed a renunciation appointment for someone and they Embassy staff said, &#8220;Sure! Come in tomorrow!&#8221; Literally. So, there are embassies that make the process much easier.</p>\n<p>This follows my general theory that if it&#8217;s a place that everyone is thinking of going to, it&#8217;s going to be harder to get in. This theory applies to most things offshore: if it&#8217;s what everyone thinks of, it&#8217;s probably going to go away.</p>\n<p><a href=\"http://nomadcapitalist.com/second-passport/panama/\">The Panama residency</a>, for example, has become less attractive over the years. As more and more people do it, it dilutes its value and puts pressure on the system. In regards to renouncing, if you go somewhere like Kazakhstan over Canada, no one will have renounced there for years and they will likely be much nicer and make the process considerably easy.</p>\n<p>If time is an issue, you could appointment shop to find a location that won&#8217;t drag the process out, or you could work with a team like mine that is familiar with the process and already knows the best places to go to quickly renounce US citizenship.</p>\n<p>&#160;</p>\n<h2><strong>Complete the Interview Process</strong></h2>\n<p></p><img class=\"wp-image-24690 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-6.jpg\" alt=\"renounce us citizenship ultimate guide\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>After you choose where you are going to renounce, you will need to set and attend two different appointments to be interviewed. Again, the process is different depending on which embassy you go to but generally, you need to call in to confirm your appointment.</p>\n<p>You can schedule most US citizen services online, but you will need to call after setting it up online to confirm that the appointment is for a US citizenship renunciation. This allows them to properly prepare for your interview. Not all online appointment software at US Embassies and Consulates specify the purpose of the appointment, which is why I always recommend that you call in to let them know.</p>\n<p>There is a bit of a dance involved, which is another reason why it is helpful to work with a team that has figured out how the system operates over the years.</p>\n<p>You will need to go in for two different appointments. There used to be some US Embassies that, at their discretion, would let you come in and complete the whole process all in one day with only a short wait of an hour or so between the two interviews. I don&#8217;t know where that exists anymore, but it used to be available at some locations. These days, you should plan on two separate interviews with at least a few days between each one.</p>\n<p>The first interview is to ensure that you know what you are doing. While it can come across as a last-ditch attempt to talk you out of the decision to renounce, the diplomatic officials are simply trying to determine that you are renouncing of your own free will and not under duress.</p>\n<p>Then, depending on the embassy or consulate, you will have to come back anywhere from a few days to a week or two later for a second interview. If you&#8217;re waiting any longer than that, you&#8217;re probably going to the wrong embassy.</p>\n<p>At the second appointment, you will be required to raise your right hand and read the oath stating that you want to renounce your US citizenship. This will finalize your side of the renunciation process.</p>\n<p>&#160;</p>\n<h3><strong>Await Authorization</strong></h3>\n<p>Throughout the whole process, you will fill out and sign or receive several documents. You will need to fill out the<a href=\"https://eforms.state.gov/Forms/ds4079.pdf\"> DS-4079</a> questionnaire before your appointment. You can review all other documents beforehand &#8211; including the DS-4080, 4081, 4082 and 4083 &#8211; but you will complete these during your appointment. They are simple and only require a few checked boxes, dates and signatures. These forms include your oath of renunciation, a statement of understanding, and the witnesses&#8217; attestation of renunciation.</p>\n<p>Once all of these documents are prepared and you have taken your oath, all the paperwork will be sent to the US State Department in Washington D.C. where they will process, stamp, and seal the renunciation.</p>\n<p>So, even though the day that you take the oath of renunciation is the day that you are officially considered to no longer be a US citizen for tax and other purposes, it will be several months before you receive your <a href=\"https://en.wikipedia.org/wiki/Certificate_of_Loss_of_Nationality\">Certificate of Loss of Nationality (CLN)</a> from the US State Department confirming the fact.</p>\n<p>The last renunciation I saw took five months from the time the oath was taken to when the individual&#8217;s CLN arrived, but the certificate is almost guaranteed. While you do have to factor in the possibility that something wasn&#8217;t done correctly on the technical side of your renunciation, it is very rare for a renunciation to be rejected once the oath is taken and the forms are submitted.</p>\n<p>Either way, the lag between when you actually renounce and when your certificate arrives can create some opportunities and challenges.</p>\n<p>One challenge is that, even though you are no longer considered to be US citizen, some banks will only allow you to open an account with them once they see your Certificate of Loss of Nationality (CLN). You may have taken the oath and no longer have tax and filing obligations, but banks will want to be certain that you do not carry the liability of US citizenship, which they can only be sure of when you present the certificate.</p>\n<p>However, there are also some limited-time opportunities. In some of the smaller embassies, I have seen situations where the officials have told the individual renouncing that they can hang on to their US passport and travel back to the United States if they need to tie up any loose ends. Usually, you hand over your passport after taking the oath of renunciation, but since the CLN is the final nail in the coffin, some diplomatic posts will let you hold on to your passport until the certificate arrives.</p>\n<p>I wouldn&#8217;t necessarily bank on this happening, though. It&#8217;s always good to have your affairs sorted out beforehand.</p>\n<p>However, you should also note that renouncing your US citizenship doesn&#8217;t mean that you need to close everything down in the United States. There are certain assets and accounts that you can keep open.</p>\n<p>People think that they have to make a mad dash either right before or after they renounce to take care of their affairs in the US (especially if they&#8217;ve been living overseas and have left things unattended in the US), but that&#8217;s not necessarily the case.</p>\n<p>It&#8217;s probably easier to be ready than you think. You just have to know what&#8217;s coming. So here&#8217;s what to expect after you renounce:</p>\n<p><strong>&#160;</strong></p>\n<h2><strong>What Happens After You Renounce Your US Citizenship?</strong></h2>\n<p></p><img class=\"wp-image-24689 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-5.jpg\" alt=\"renounce us citizenship ultimate guide\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>If you have planted the right flags before renouncing &#8211; getting the right<a href=\"http://nomadcapitalist.com/second-passport/\"> second passport</a>, setting up <a href=\"http://nomadcapitalist.com/offshore-company/\">your business offshore</a>, establishing a new &#8216;tax home&#8217;, etc. &#8211; &#160;you can avoid becoming stateless and move on to a life of greater freedom and abundance (for a fraction of the price) once you renounce your US citizenship.</p>\n<p>But renouncing does come at a cost &#8211; both financially and otherwise. Here are seven things you should be prepared to deal with following your renunciation:</p>\n<p>&#160;</p>\n<h3><strong>1. Final Taxes and Fees</strong></h3>\n<p>By renouncing US citizenship, an individual can free themselves of most future tax obligations and will be treated as a <a href=\"http://nomadcapitalist.com/2018/01/12/tax-strategies-us-expats-married-non-us-citizens/\">non-resident alien for tax purposes</a>. This means they will no longer have to pay US income taxes and they will be free of all reporting requirements for the remainder of their life unless they choose to invest or do business in the United States.</p>\n<p>However, before you can declare yourself completely free, you will need to file one final US tax return. People have a lot of erroneous beliefs about how this works, from believing they don&#8217;t need to file anything at all to thinking that they will have to file for the next ten years (which used to be true).</p>\n<p>The main reason you have to file a final tax return is that, during the year that you renounce, you will have been a US taxpayer for at least part of that year. That is one reason that, for filing purposes, there is a benefit to renouncing at the end of December. But regardless of when you renounce, you&#8217;ll have to file one last return because any days you are a US citizen, you owe tax.</p>\n<p>That means that if you lived even just one day as a US citizen under <a href=\"http://nomadcapitalist.com/2017/12/29/unforeseen-consequences-trump-tax-reform-us-expats/\">the new Trump tax reform</a>, any money you earn over the Foreign Earned Income Exclusion will be subject to Subpart F tax for the time that you are a US citizen. Your final tax year will be counted from January 1st through the day that you renounce. The good news is that they eliminated the rule that you must file taxes for the ten years following your renunciation.</p>\n<p>All you have to do now is file one final tax return&#8230; and pay the renunciation fee&#8230; and maybe even the exit tax.</p>\n<p>Besides paying your taxes for your last year as a US citizen, there are two ways the US government will try and squeeze more money out of you on your way out the door.</p>\n<p>The first is by charging a &#8220;renunciation fee.&#8221; Before FATCA, the fee was a grand total of $0, but when the government saw that more and more people were jumping ship, they decided to take advantage of the situation and charge people for the right to renounce.</p>\n<p>The fee began at $450 and has since gone up by an astounding 422%. The current fee of $2,350 that the US charges is the highest fee of its kind in the world. The US State Department claims that the increase was due to the surge in demand and paperwork, but the fee is still <a href=\"https://www.forbes.com/sites/robertwood/2015/10/23/u-s-has-worlds-highest-fee-to-renounce-citizenship/#3be2f15747de\">twenty times the average level</a> in other high-income countries.</p>\n<p>The second monetary cost you can expect when you renounce US citizenship is for those who qualify as a &#8216;covered expatriate.&#8217; This fee involves paying taxes on your assets and only applies to folks who meet one of the following tests:</p>\n<ol>\n<li>You have two million dollars or more in assets;</li>\n<li>You have had an average federal tax liability (liability, not salary) over the last five years of $160,000 per year ($800,000 or more combined in the five years prior to renouncing);</li>\n<li>You cannot certify tax compliance.</li>\n</ol>\n<p>If you meet any of these three tests, then you are considered a &#8216;covered expatriate&#8217; and must pay taxes on your assets before the US government will allow you to leave. You will receive a roughly $700,000 exemption, but after that you must pay capital gains tax. You can learn more about each test in our article on the <a href=\"http://nomadcapitalist.com/2017/02/12/tax-problems-renounce-us-citizenship/\">tax problems for those who renounce US citizenship</a>.</p>\n<p>You will need to file separate forms to indicate whether you&#8217;re a <a href=\"http://nomadcapitalist.com/2017/02/12/tax-problems-renounce-us-citizenship/\">covered expatriate</a> and whether or not you owe the exit tax &#8211; if you do owe, you must pay the required amount upon renouncing. This process can become complicated rather quickly because there are some very specific things that you must do. You need proper guidance from someone who has experience with renunciation.</p>\n<p>You really do.</p>\n<p>If you&#8217;ve been living in the US and you&#8217;re just suddenly renouncing and you use your local guy from Kansas, you&#8217;re going to have problems. You need to have someone with experience with the forms and with the process.</p>\n<p>You should also note that renunciation will not shield you from possible prosecution for crimes committed in the US or exempt you from meeting your financial responsibilities such as child support payments.</p>\n<p>Furthermore, if you maintain any property in the US, you will also lose advantages that only US citizens have to shield them from the estate tax. US citizens can shield millions of dollars in property from the estate tax, non-US citizens can only shield $60,000.</p>\n<p>A similar issue exists for those wishing to avoid gift taxes. US citizens can gift unlimited amounts of property to a spouse who is also a US citizen without paying a gift tax. If you were to gift anything to a non-US citizen spouse, you would only be given a small annual exclusion limitation before the gift would be taxed as well.</p>\n<p>&#160;</p>\n<h3><strong>2. US Visa Requirements</strong></h3>\n<p>Another cost of renunciation only becomes an issue if you try to maintain a presence in the United States. If you ever want to return to the US, for example, you will need to obtain a visa. As a tourist, you will only be allowed to visit for up to three months at a time and you will not have the right to work in the country.</p>\n<p>There are some countries that do have easier access to the US. If you are a Canadian citizen, as is the case for one person I recently helped, then you don&#8217;t need to do anything. You can just come back almost as if you&#8217;re an American. They can still technically deny you entrance since you are Canadian and not a US citizen, but there&#8217;s not a lot of that happening. Still, the only people who are absolutely guaranteed entry into the United States are US citizens.</p>\n<p>If you hold one of approximately 40 other country passports that are part of <a href=\"http://nomadcapitalist.com/2015/08/17/second-passports-visit-united-states/\">the visa waiver program</a>, then you will only need to complete ESTA online at least 72 hours before you fly to the United States for the first time and pay $14. More than 99% of the people who apply are approved and, once you are, the visa is good for two years (so you don&#8217;t have to apply online every time you travel to the US).</p>\n<p>However, if you&#8217;ve visited a handful of countries such as Iran, then you&#8217;re not eligible for ESTA, even if you&#8217;re from one of the visa waiver countries. I recently had a UK client who visited Iran and, even though he&#8217;s from the UK and they get ESTA, he had to go to the Embassy to get approved for a visa.</p>\n<p>The bottom line is that you can&#8217;t just get on a plane and go to the United States, you must apply at least 72 hours in advance, even with ESTA. The challenge is that it is very difficult to get a passport from most of the 40 countries that are part of the US visa waiver program.</p>\n<p>Unless you have a parent from one of the countries on the list OR you can get <a href=\"http://nomadcapitalist.com/2013/05/19/top-5-second-citizenship-by-descent/\">citizenship by descent</a> in a place like <a href=\"http://nomadcapitalist.com/2016/07/11/irish-citizenship-by-descent/\">Ireland</a> or <a href=\"http://nomadcapitalist.com/2016/11/02/get-italian-citizenship-by-descent/\">Italy</a> where it&#8217;s available; OR if you just happened to have lived in and become a naturalized citizen of a place like Australia; OR you choose to buy the only citizenship by investment program that gives you US ESTA access for roughly $1 million from Malta, you&#8217;re probably not going to get one of the visa waiver passports.</p>\n<p>Those are really the only ways you&#8217;re going to get in without a visa.</p>\n<p>For everyone else, especially for the folks who don&#8217;t have second passports and have always been citizens of the United States but have always been nomadic and don&#8217;t want to go live somewhere else for five years and pay a bunch of taxes to get another passport, you&#8217;re probably going to be stuck with a passport that requires you to get a US visa.</p>\n<p>This is not the end of the world.</p>\n<p>While the Trump administration has been a bit more difficult than other administrations, the US visa process adheres to technical requirements and if you meet them, you should get a US visa that is good for up to ten years with multiple entry privileges.</p>\n<p>People tend to freak out about getting visas, but that&#8217;s a reality most people in the rest of the world have to deal with if they ever want to travel. You can handle it.</p>\n<p>&#160;</p>\n<h3><strong>3. Foreign Visa Requirements</strong></h3>\n<p>After giving up your US passport, you will also likely need visas for other countries, not just the United States. <a href=\"http://nomadcapitalist.com/2016/11/23/qualify-obtain-thai-visa/\">Thailand</a>, Serbia, and Costa Rica are the most difficult countries to enter in their respective regions. They are almost as strict as the United States. It&#8217;s easier to get into Europe than it is to get into Thailand.</p>\n<p>For example, if you&#8217;re no longer a US citizen and you have to get a visa to go to the US, you&#8217;re probably going to need a visa to go to Thailand. That may, although far less frequently, include <a href=\"http://nomadcapitalist.com/2017/07/21/transit-visa-requirements/\">a visa for transiting</a> through a country.</p>\n<p>Again, this is not the end of the world.</p>\n<p>A lot of Americans look at having to get a visa like it is the kiss of death &#8211; as if it&#8217;s the same as saying, &#8220;You can&#8217;t go there.&#8221; That&#8217;s not the case!</p>\n<p>Take Thailand as an example. If you want to visit Thailand, you can go to the Thai Embassy in Kuala Lumpur, Malaysia and fill out a form saying when you&#8217;re going, what hotel you will be staying in along with your hotel confirmation, then you print out a copy of your flight ticket to and from Thailand and drop off all the documents with your passport any weekday morning. You come back the next afternoon and, 99% of the time, you won&#8217;t have any problem getting a Thai visa.</p>\n<p>It is pretty easy to get a visa in some of these countries, even though they require that you get one. I used my <a href=\"http://nomadcapitalist.com/2017/01/29/visa-free-travel-the-comoros-islands/\">Comoros passport</a> to get a Vietnam visa this past year and I didn&#8217;t even have to walk it in to a Vietnam embassy or consulate. I was in Cambodia and simply took my Comoros passport to a service and gave them $48. I came back the next day and, even though they thought it would be difficult to obtain since the Comoros passport has Arabic on it, I got a visa.</p>\n<p>It&#8217;s really not that difficult.</p>\n<p>I know most Americans are not used to getting visas, but if you&#8217;ve been to Cambodia, Turkey, or Vietnam, you&#8217;ve at least gone through the process to get an e-visa. You&#8217;ve probably gotten a visa before without realizing it.</p>\n<p>There is also the chance that you may have an easier time traveling with your new primary passport. Some passports &#8211; like Grenada, for example &#8211; have visa-free access to Russia and China, and Russia is one country that is particularly difficult for Americans to enter. With your new passport, then, you may have visa-free access to other countries that you had trouble getting into with your old US passport.</p>\n<p>&#160;</p>\n<h3><strong>4. Set Yourself Up for the Future</strong></h3>\n<p>You&#8217;re going to have different needs as a US citizen than you will when you are no longer one. US citizenship comes with a few advantages. One is that you don&#8217;t need the visas, but the second is that when people ask you what your country of residence is, as a US citizen you could always just say the United States. In most cases, you can no longer do this.</p>\n<p>That&#8217;s one thing that US citizens have to their advantage that Canadians, Australians, and others do not: you can tell a bank that you live in the US and give them a US address, even though you do not live there. Doing this as an Australian or Canadian citizen would establish your tax residency in the country, building a case against you and forcing you into the <a href=\"https://www.youtube.com/watch?v=lKKeGpKhODI\">Nomad tax trap</a>.</p>\n<p>One way around this issue so that you can still give banks and other people US addresses is by setting up a mailbox service in the United States, even after you renounce. However, if you&#8217;re not a US citizen and you don&#8217;t have a US visa, they&#8217;re not going to believe that you are really a US resident. So, having a residence permit is a good idea, not only to help you get visas but to help you with the financial system.</p>\n<p>There are other things that you should prepare for as well if you plan to maintain a successful offshore life. Really, being a nomad is increasingly uninteresting for immigration and banking purposes. It&#8217;s possible. And if you&#8217;re a citizen of St. Lucia or somewhere like that then no one is likely to bother you about it, but if you need to go and get a visa somewhere or open a bank account, then they may ask you some questions about your residence and lifestyle and it&#8217;s important to be prepared for that because you will no longer have the US to fall back on.</p>\n<p>It&#8217;s not a big deal, but there are some basic steps and preparation that need to go into it.</p>\n<p>&#160;</p>\n<h3><strong>5. Receive Government Benefits After Renouncing</strong></h3>\n<p>Many people worry that they will lose their right to government benefits if they renounce. They think about all the years they paid into the system and wonder if all their contributions will be lost if they choose to renounce.</p>\n<p>I fully addressed this concern in an article on <a href=\"http://nomadcapitalist.com/2016/10/30/lose-government-benefits-renounce-citizenship/\">government benefits and renunciation</a> where you can get all the details, but the bottom line is that, while you may lose access to some benefits, you will not lose them all.</p>\n<p>Social Security is the main benefit you will maintain access to after your renunciation. You can <a href=\"http://nomadcapitalist.com/2016/09/12/get-social-security-benefits-living-overseas/\">receive your payments overseas</a> and, as long as you have worked at least 40 calendar quarters (10 years) in the United States, you will continue to receive your Social Security benefits even after you renounce your US citizenship.</p>\n<p>You also maintain your right to Medicare benefits; the catch is that most of those benefits are only available in the US. So, while you maintain the right, you do not maintain access. You may have the possibility of using your Medicare benefits during a trip to the US if you can procure a visa, but there is no guarantee.</p>\n<p>The benefits that you will lose all rights to when you renounce are military benefits, municipal pensions, state government pensions, etc. &#8211; basically any income based on previous work done for the US government (at any level).</p>\n<p>&#160;</p>\n<h3><strong>6. No Going Back</strong></h3>\n<p>Though you will maintain your Social Security benefits, it is important to understand that once you renounce your US citizenship you cannot get it back. According to the State Department, the act is &#8220;irrevocable&#8221; and cannot be reversed except under some very select circumstances.</p>\n<p>Will you end up on a list and never be able to visit America if you renounce? No. Depending on where you have citizenship, you could enter the US the very next day, no problem.</p>\n<p>Can you only return to America for a few days a year? No. Most visas will give you 90 days at a time and you can easily renew them by leaving the country and coming back.</p>\n<p>&#160;</p>\n<h3><strong>7. Enjoy Your New Financial Freedom</strong></h3>\n<p>When you are no longer a US citizen, if the day after you renounce you want to declare a dividend from a foreign company or open a new bank account or start a corporation, you no longer have to report any of those things. You do not have to report anything new that you do as a non-US citizen on your final US tax return. There are also other laws that should no longer apply to you such as the <a href=\"http://nomadcapitalist.com/2014/06/23/foreign-corrupt-practices-act-concerned/\">foreign corrupt practices act</a> and US <a href=\"http://nomadcapitalist.com/2015/05/18/can-americans-do-business-with-iranians-on-the-ofac-list/\">foreign sanctions</a>.</p>\n<p>You will need to check with your legal counsel before doing anything in that regard, but you are free from the US once you renounce and you should enjoy the freedom that this brings once you&#8217;ve made the decision to move on.</p>\n<p>As a final note, if you are considering renouncing your US citizenship for any reason, make sure to look at all your options for getting a <a href=\"http://nomadcapitalist.com/second-passport/\">second passport</a> first. This will be one of your most important tools in preserving your freedom if things start to really fall apart at home. Otherwise, you face the risk of becoming stateless upon renouncing your US citizenship.</p>\n<p>This is one reason we discuss the importance of having a Plan B so often here at Nomad Capitalist. Even if you don&#8217;t plan on renouncing, things can change in an instant and it&#8217;s good to know you have the option if the need were ever to arise. If you&#8217;d like to discuss your Plan B and the possibility of renouncing your US citizenship, feel free to <a href=\"http://holanomad.com/\">apply for a strategy session</a> where we can go over your personal situation.</p>\n</div>","title":"How to Renounce Your US Citizenship: the Ultimate Guide"}},"pageContext":{"id":"5b921d1e87be0571ac1b04f9"}}