{"data":{"mongodbDatabaseArticles":{"id":"5b9248e687be056953db7c0d","content":"<div><p>I have been on a PC since I was 6 years old. That's over 20 years now. I was aware of Linux, I even tried Ubuntu every few years for the last decade but it never felt good enough for my applications. And I was always left with a bit of a bad taste when using Macs because it didn't seem as customizable as Windows. Every time I would install Windows, I would spend days customizing it and configurating it to work like I wanted it too. And I loved that about it. And Windows 7 was one of the most stable releases since XP.</p> <p>But for the last year I have been preparing to become a technomad and travel the world while working. And I needed a powerful, well-built laptop. Besides IBM ThinkPad's, MacBook Pro's are one of the most well-built laptops out there. I planned on installing Windows 7 on it and just continue my old workflow. I would go from a dual-screen PC set-up to a single-screen MacBook.</p> <img src=\"https://levels.io/wp-content/uploads/2013/03/IMG_0962.jpg\" width='100%\"' class=\"alignnone size-full wp-image-806 responsively-lazy\"> <p>However, things went different when I received it. Planning to install Windows 7 on it, I quickly installed Adobe CS6 on the clean OSX and to my surprise, except for some different keyboard shortcuts, my workflow was almost exactly the same as before. I tried to install Chrome and synced my bookmarks and settings. Except for the actual look of Chrome being slightly different, my entire web workflow also was exactly the same. My plan of installing Windows 7 on it failed in less than a few hours! </p> <p>When my PC-based mind had come to the realiation I would use OSX from now on, I had presumed (and accepted) it would take me months until I would reach the same speed of workflow and level of producivity I was accustomed to on a PC. However, in a week, I was doing more work and doing it faster than on my PC.</p> <p>Something horrible had happened. I was afraid I had become part of the Mac cult.</p> <p>OSX's interface is intuitive and the entire system just looks more stable and 'relaxed'. On Windows 7, I would always have weird popups, balloons telling me to update stuff and it was messy. OSX looks clean. It just 'is'. OSX's three-finger (or four-finger for some) multitasking of full screens sped up everything I did. I love to work on multiple projects at the same time. One of my friends jokes about how I am always making music while building a website while editing a video at the same time. Now I can do even more of that. Instead of working with 2 screens on my PC, I now work with 4 screens next to each other. This doesn't work for some, but it does for me.</p> <p>There was one challenge in switching left though. I had to transfer my files from my PC to my MacBook. I had a partitioned drive set up with all my different types of projects (music, videos, web dev) on different drives like D:, E:, F: and G:. I asked some friends who had Macs where you're supposed to put your files. Well, you're supposed to put them in the /Users/username/ folder. That sounded horrible to me. That's like putting all your files on a PC in My Documents. So I decided to be stubborn and just emulate the system I had on my PC. I created folders on the root like /D, /E, /F and /G. I know this goes completely against the Unix way of dealing with data (and I think it's risky security-wise too), but it's essential to my workflow to be able to move to these folders rapidly. I use Cmd+Shift+G in the Finder and enter the path quickly to go (e.g. /F) to jump to the folders while working.</p> <p>I built up a <a href=\"/osx-for-pc-users\">list of tips to optimise OSX for PC users</a> that can help you transition too. Also check out my <a href=\"/osx-terminal-tricks\">list of tricks to work faster in OSX by using the terminal</a>.</p> <p>That I switched means anyone can switch. The time has come. You don't really know what you're missing on a PC, if you don't try a Mac for at least a week. You'll work faster, I promise.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I switched from PC to Mac in less than 7 days"}},"pageContext":{"id":"5b9248e687be056953db7c0d"}}