{"data":{"mongodbDatabaseArticles":{"id":"5b962b0d87be0583274911db","content":"<div><p>Summer is at its peak and the <a href=\"https://hippie-inheels.com/about-me/travel-bucket-list/\">travel bug</a> has definitely kicked in. You&#8217;ve been saving up your vacation days all year so you can kick back and relax for a full week of nothing but sunshine and sightseeing. Amongst all the excitement, you can&#8217;t help my dread the inevitable time you have to spend at the airport fighting to get through TSA and praying the airline doesn&#8217;t lose your luggage, for the third time. Follow these tips and plan ahead by packing light and efficiently so you can get to your final destination as quickly and painlessly as possible!</p><h2>1. Travel with <a href=\"https://hippie-inheels.com/luggage-review-carry-on-packing-list/\">just a carry on</a></h2><p>There&#8217;s nothing more annoying than <a href=\"https://hippie-inheels.com/lost-luggage/\">lost luggage</a>, especially when you want to get off the plane, slip on your bathing suit and hit the beach! Skip the check in line and eliminate the risk of your bag not arriving when you do by only packing a carry-on. You&#8217;re going for a whole week, how could you possibly get everything in one bag? Wear your heaviest and bulkiest items on the plane. So, you decided to pack a comfy sweater to throw on when it cools down at night but you know it&#8217;s going to take up half your suitcase? The truth is you&#8217;ll probably end up wanting that sweater for the plane, anyways, when the guy next to you refuses to close his above-head air vent. Wear the sweater and tennis shoes, that are hard to squeeze in, and you&#8217;ll notice the extra space you&#8217;ll have for souvenirs! Additionally, pack clothes with wrinkle resistant fabrics so that you can roll them up and fit more in. You&#8217;ll be surprised how many outfits you can take when you use this helpful technique.</p><p><img class=\"aligncenter size-full wp-image-17063\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/06/packing-for-florida-IT-luggage23.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Packing list for Orlando &amp; Palm Beach Area\" width=\"560\" height=\"420\"></p><h2>2. Get enough rest and hydrate</h2><p>Prepare your body for the journey and you wont feel as jet lagged when you finally make it to your vacation spot! It&#8217;s easy to get worn down waiting around and standing in lines but if you rest well the night before and<a href=\"https://hippie-inheels.com/11-ways-stay-healthy-traveling-without-sacrificing-experience/\"> drink plenty of water</a> you will notice a huge difference in your energy level when you step off the plane! Bring along your <a href=\"https://www.gourmesso.com/nespresso-compatible-coffee-capsules\">coffee capsules from Gourmesso</a> for an extra boost. They are light, easy to pack, and will keep you moving all day long. You wont regret throwing a few in your luggage when you take a sip of one of their Fairtrade blends. Staying energized throughout your travels will allow you to get the most out of your trip.</p><p><img class=\"aligncenter size-full wp-image-10532\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/06/stay-healthy-while-traveling4.jpg?resize=560%2C387&amp;ssl=1\" alt=\"11 Ways To Stay Healthy While Traveling Without Sacrificing Experience\" width=\"560\" height=\"387\"></p><h2>3. Keep all important documents together and easily accessible</h2><p>You have two things on your mind, which book you should check off your <a href=\"https://hippie-inheels.com/best-travel-books-inducing-wanderlust/\">summer </a>reads list for by the pool and how may fruity drinks you can consume in a week. The last thing you want to deal with is the un-amused airport security when your passport isn&#8217;t with your ticket like you thought it was. Keep all the <a href=\"https://hippie-inheels.com/documents-to-take-while-traveling/\">documents</a> you know you&#8217;ll need together and in a safe, but convenient location. Make their job and your life easier, not to mention the eager people in line behind you, by avoiding the last-minute rummage through your bag, looking for where you placed your boarding pass. Invest in a wallet that has a special place for your passport and plane ticket, so you will only have one spot to check.</p><p><img class=\"aligncenter size-full wp-image-3121\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2013-11-12-at-3.15.20-PM1.jpg?resize=800%2C386&amp;ssl=1\" alt=\"travel paperwork documents\" width=\"800\" height=\"386\"></p><p>Leave the unnecessary baggage behind and get the most out of your summer trip! By following these 3 simple tricks you can give yourself the no hassle stress-free vacation you&#8217;ve been hoping for!</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"3 Packing Tips that will Ensure you get the Most out of Your Vacation Time"}},"pageContext":{"id":"5b962b0d87be0583274911db"}}