{"data":{"mongodbDatabaseArticles":{"id":"5b95eaf587be05832748ffe7","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/beginningoftheend.jpg\" alt=\"the end is near\">Posted: 04/18/2011 | April 18th, 2011</p><p>I&#8217;ve thought about this post for some time now. In my head, I&#8217;ve written and rewritten this post many times. I&#8217;ve gone to publish it only to back out at the last minute. I&#8217;ve been hesitating, not because I didn&#8217;t know what to say but because deep down I knew I wasn&#8217;t ready to say it. But now, as I finally type this post, I know it&#8217;s time to hit publish.</p><p>In July, I&#8217;ll celebrate five years on the road. One fateful day in 2006, I hugged my parents goodbye and started on a journey that has taken me around the world two and a half times and allowed me to teach in two different countries, play poker professionally in Amsterdam, live in New York City, create this great site, and meet some of the world&#8217;s most amazing people.</p><p>But I have often wondered <a href=\"https://www.nomadicmatt.com/travel-blogs/can-you-travel-for-too-long/\">if a person can travel for too long</a>. Is there a time when being on the road becomes too much of a good thing? My overall answer is that you can never get too much travel in your life. This is especially true if you&#8217;re with friends or have someone to share those special moments with. However, if you are traveling alone, then I believe the answer is yes, at a certain point, too much time on the road can take its toll.</p><p>Five years after I began, travel is still wonderful and amazing, but it isn&#8217;t the same. Some of the luster is gone. Yes, I meet amazing people every day, but how many times can you have the same &#8220;where are you from and what do you do&#8221; conversation with other travelers? How many times can you reinvent the wheel? How often can you start from scratch? It&#8217;s one thing to be traveling with friends, a girlfriend, or a spouse, but it&#8217;s another to be constantly surrounded by strangers every day of your life.</p><p>Solo travel is a wonderful thing, and I still firmly believe everyone should do it at least once in their life, because it fosters great personal growth. I&#8217;ve learned so much about myself by traveling alone. But after so many years, it&#8217;s finally worn on me. I&#8217;ve reached the point where solo travel has become a lonely existence that I am no longer suited for.</p><p>Last year, I wrote about how I had <a href=\"https://www.nomadicmatt.com/travel-blogs/losing-the-wonder-of-travel/\">lost my sense of wonder</a> for travel and I needed a break. Living in New York City last summer gave me a much-needed break but it also made me realize that I am missing out on a lot when it comes to leading a settled lifestyle. I missed having a gym, a kitchen, local watering holes, favorite restaurants, and a group of good friends to spend time with. I missed the act of simply living somewhere. But whenever I thought about stopping, I started to think about all the trips I could take and the road inevitably ended up calling me back.</p><p>However, when I was leaving Central America, I realized that my days were numbered when at the end of the trip, I was excited &#8212; not to go someplace new but to go home to New York City. It&#8217;s a feeling I haven&#8217;t had in a long time, and, as I thought of a place as home for the first time in many years, I realized my time had finally come.</p><p><img src=\"https://media.nomadicmatt.com/beginningofend1.jpg\" alt=\"end of the day sunset\">My one motto in life is to live with no regrets, and despite the pull of a new life calling me, I know I&#8217;ll always have regrets unless I do two last things: travel Southeast Asia one last time and do one last grand tour of Europe that finally includes the Eastern Bloc. In my mind, these trips need to be done as a whole, not as small trips to this or that country.</p><p>So today I leave home for my final trip around the world that will take me to Europe, East Asia, and Southeast Asia before heading back sometime around March or April 2012. Will I settle in New York then? I don&#8217;t know. Paris also sounds nice. Who can say what the future holds?</p><p>But I do know today marks the beginning of the end. This will be my last long-term trip. When this is done, I&#8217;ll have been on the road for close to six years. That&#8217;s six years of constant movement. Six years of fresh starts. I regret nothing, but I&#8217;m ready to move on to something new. I&#8217;m ready to become semi-nomadic. I&#8217;m ready to make a place home.</p><p>I don&#8217;t know what next year holds but I do know it now holds more possibility than the last few years ever did. One thing I envy about many gap year travelers is that with a set &#8220;end date&#8221; to their trip, they have an excitement about them I&#8217;ve recently lacked. They need to &#8220;get it all in&#8221; there before it&#8217;s too late. Me? I do this every day. Travel is my day-to-day life. And just like my friends in Boston who never walked the Freedom Trail, or my friends in NYC who have never visited the Statue of Liberty, I&#8217;ve put things off because &#8220;I can always do it later.&#8221; Hence, I don&#8217;t pack my days with as much stuff as I used to. I&#8217;ve gotten a bit lazier. But now there&#8217;s no real &#8220;later&#8221; for me. This is it.</p><p>Now, I have a new sense of urgency in my travels. It&#8217;s like I&#8217;m retaking my first trip all over again. Because with the end in sight, I have to get it all in before it&#8217;s too late. There&#8217;s no more time to waste, no days to spend behind the computer, no more &#8220;I&#8217;ll get back to it.&#8221; Nope, these nomadic ways are ending. Travel will always be a part of my life, but life&#8217;s desires change and I must change with it. It&#8217;s a brave new world all over again.</p></div>","title":"The Beginning of the End"}},"pageContext":{"id":"5b95eaf587be05832748ffe7"}}