{"data":{"mongodbDatabaseArticles":{"id":"5b93831b87be056953db7e2b","content":"<div><h1 name=\"4f94\" id=\"4f94\" class=\"graf graf--h3 graf--leading graf--title\">How remote pair programming works and why it can change your&#160;life</h1><h4 name=\"e5af\" id=\"e5af\" class=\"graf graf--h4 graf-after--figure\">The silver bullet to deal with loneliness and distractions while learning to&#160;code</h4><p name=\"28fe\" id=\"28fe\" class=\"graf graf--p graf-after--h4\">Whether you are working or learning remotely, chances are that loneliness and distractions are your main daily struggles to staying happy and productive.</p><p name=\"3ea2\" id=\"3ea2\" class=\"graf graf--p graf-after--p\">What if you had a buddy to code and learn together with every day? What if you could face the challenges of learning to code with the help of someone who is as invested as you are? And what if you did that by working on the same software project, discussing all the steps and possible solutions as you go?</p><p name=\"7675\" id=\"7675\" class=\"graf graf--p graf-after--p\">Take a moment to think about this Swedish proverb and how it affects your learning journey:</p><blockquote name=\"dcd4\" id=\"dcd4\" class=\"graf graf--pullquote graf-after--p\">Shared joy is a double joy; shared sorrow is half&#160;sorrow.</blockquote><p name=\"3e4c\" id=\"3e4c\" class=\"graf graf--p graf-after--pullquote\">The good news is that all those ideas can apply to you even if your coding buddy is somewhere else in the world. That&#8217;s what remote pair programming can offer to you. Here is how it works and why it can change your life.</p><h3 name=\"9a20\" id=\"9a20\" class=\"graf graf--h3 graf-after--p\">How Remote Pair Programming Works</h3><p name=\"d0ac\" id=\"d0ac\" class=\"graf graf--p graf-after--h3\">Remote pair programming is not very different from traditional pair programming.</p><p name=\"f1a9\" id=\"f1a9\" class=\"graf graf--p graf-after--p\">In pair programming, you and another software developer (or aspiring software developer) sit together in front of a computer and take turns writing code using just one keyboard.</p><p name=\"5a4c\" id=\"5a4c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">The person typing on the keyboard is called the Driver</strong>. They will be responsible for thinking about the classes, variables, functions, and algorithms that they need to code in order to make the program accomplish its goal. This person will try to verbalize their thinking process as much as possible as they code.</p><p name=\"36a4\" id=\"36a4\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">The other person is called the Navigator</strong>. They will be sitting next to the Driver but won&#8217;t be writing any code. Instead, the Navigator will be paying close attention to the code the Driver is writing, and will offer guidance and suggestions whenever possible. The Navigator will suggest alternatives, find answers to upcoming questions and challenges, and act as a sounding board for the ideas the Driver is coming up with.</p><p name=\"cc9c\" id=\"cc9c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Regularly, the Driver and Navigator will switch roles</strong>, so now the Navigator will become the Driver and they will now be the one writing the code. You can switch roles every 30&#8211;40 minutes, or every time you finish implementing a given feature or function.</p><p name=\"14ad\" id=\"14ad\" class=\"graf graf--p graf-after--p\">If you and your coding partner are not in the same room and working on the same computer, you can still do pair programming. But we will call it remote pair programming.</p><p name=\"2192\" id=\"2192\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">In remote pair programming, each developer will be working from a different computer</strong>. You will be using some kind of software that allows you to talk to each other and share your screen. For example, you can use a video conference tool such as Google Hangouts, Skype, or Zoom.us. Using one of those tools, the Driver will start by sharing their screen so the Navigator can see what they are typing.</p><p name=\"8e28\" id=\"8e28\" class=\"graf graf--p graf-after--p\">There are also <a href=\"http://blog.atom.io/2017/11/15/code-together-in-real-time-with-teletype-for-atom.html\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">plugins for Atom</a>, Sublime, VS Code and almost any other code editor that allow you to share your IDE with the other developer and modify the code at the same time. You can also allow the other developer remote access to your computer.</p><p name=\"bca4\" id=\"bca4\" class=\"graf graf--p graf-after--p\">However, my recommendation is that you just stick to a video conference tool for two simple reasons:</p><ol class=\"postList\"><li name=\"c712\" id=\"c712\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Only the Driver should be typing code</strong>. If you have access to the code editor of the Driver through a plugin or remote access, you will sometimes feel tempted to help the Driver by typing something. This is not necessarily against the rules, but it requires certain maturity and it&#8217;s something you can introduce later on in the process.</li><li name=\"7acc\" id=\"7acc\" class=\"graf graf--li graf-after--li\">By working on two separate computers, you will force yourself to make proper <strong class=\"markup--strong markup--li-strong\">use of version control in order to keep track of changes and share the code with each other</strong> every time you switch roles.</li></ol><p name=\"1c86\" id=\"1c86\" class=\"graf graf--p graf-after--li\">To give you an example of that last point, let&#8217;s see what happens once you decide to switch roles:</p><p name=\"0495\" id=\"0495\" class=\"graf graf--p graf-after--p\">First, the current Driver will commit their latest changes (for example, git commit) providing a descriptive comment. After that, they will push those changes to the remote repository, making the latest version of the code available for the Navigator.</p><p name=\"eaa1\" id=\"eaa1\" class=\"graf graf--p graf-after--p\">Now, the Navigator will become the Driver by pulling the latest changes to their computer and opening the corresponding file. They will now start sharing their screen and writing code.</p><h3 name=\"e5f0\" id=\"e5f0\" class=\"graf graf--h3 graf-after--p\">The Benefits of Remote Pair Programming</h3><ol class=\"postList\"><li name=\"3db6\" id=\"3db6\" class=\"graf graf--li graf-after--h3\"><strong class=\"markup--strong markup--li-strong\">Constant feedback</strong>: when you are writing code as the Driver, the Navigator will be providing feedback about the quality of your code. They will also offer different perspectives that will help you improve.</li><li name=\"2f0f\" id=\"2f0f\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Reduced frustration</strong>: they say two heads think better than one, and that shared sorrow is half sorrow. If you get stuck with a problem, the other person will be there to help you in real time.</li><li name=\"c102\" id=\"c102\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Increased focus</strong>: since you are sharing your screen and microphone, you will find it really hard to get distracted by social media. Also, the people who are physically around you (for example, your family) will have a harder time interrupting you.</li><li name=\"9de0\" id=\"9de0\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Social interaction</strong>: The <a href=\"https://open.buffer.com/state-remote-work-2018\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">State of Remote Work report for 2018</a> concluded that loneliness is the main struggle for people working/learning remotely. Your coding partner will, most likely, become a good friend and a daily source of support that goes way beyond coding.</li><li name=\"5c1a\" id=\"5c1a\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Accountability</strong>: you should have a pre-arranged, recurring schedule with your coding partner. That way, you will hold each other accountable and make sure that you show up every time.</li><li name=\"4a68\" id=\"4a68\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Collaborative skills</strong>: technical skills are important when searching for a job (and once you&#8217;ve found one). But collaboration and communication are the most important skills in any modern knowledge-based and complex job such as software development.</li><li name=\"6a95\" id=\"6a95\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Real-world experience</strong>: remote pair programming will help you learn how to build software as part of a team, and will force you to use version control and <a href=\"https://guides.github.com/introduction/flow/\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">gitflow</a>. That will give you a competitive edge when looking for your first job.</li><li name=\"54e6\" id=\"54e6\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Mentorship</strong>: your coding partner and you will most likely bring different skills and levels of proficiency to the table. By doing remote pair programming, you will have the chance to learn from each other while also mentoring each other.</li></ol><p name=\"8bb7\" id=\"8bb7\" class=\"graf graf--p graf-after--li\">Does all of that sound too good? That&#8217;s because pair programming has the potential to make you a much better developer and help you learn at a much faster pace. Let&#8217;s talk about how to find a coding partner.</p><h3 name=\"4b2f\" id=\"4b2f\" class=\"graf graf--h3 graf-after--p\">How to find a Remote Coding&#160;Partner</h3><p name=\"5e7c\" id=\"5e7c\" class=\"graf graf--p graf-after--h3\">Finding other people learning to code is not difficult. However, in order for remote pair programming to help you in your learning journey, it&#8217;s extremely important that you find someone willing to commit to a recurring schedule.</p><p name=\"52f3\" id=\"52f3\" class=\"graf graf--p graf-after--p\">As we mentioned before, in order to make pair programming part of your daily habits, and in order to use it as an accountability mechanism, <strong class=\"markup--strong markup--p-strong\">it&#8217;s very important that you and your coding partner meet on the same days, at the same time every week</strong>. It&#8217;s like having a gym or running buddy, but for coding.</p><p name=\"ed4f\" id=\"ed4f\" class=\"graf graf--p graf-after--p\">I run a <a href=\"https://www.microverse.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">school for remote software developers</a> where students from all around the world learn by pair programming full-time with each other. We do the hard job of selecting people with a high level of motivation who are willing to commit to their coding partners full-time. However, there are several other places where you can find people as motivated as you are:</p><p name=\"938a\" id=\"938a\" class=\"graf graf--p graf-after--li\">However, no matter where you look for remote pair programming partners, just remember: make sure that you communicate the amount of time you want to dedicate per day/week and that you agree to a recurring schedule.</p><p name=\"2d20\" id=\"2d20\" class=\"graf graf--p graf-after--p\">And if you are ready to jump into learning to code with a remote pair programming partner full-time, go ahead and apply to join <a href=\"https://www.microverse.org/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Microverse</a>. We accept students from any country in the world and we don&#8217;t charge you anything until you get a job.</p></div>","title":"How remote pair programming works and why it can change your life"}},"pageContext":{"id":"5b93831b87be056953db7e2b"}}