{"data":{"mongodbDatabaseArticles":{"id":"5b96297b87be058327491191","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><p>&#160;</p><h2><strong>Did you know anything is possible in India?</strong></h2><p>Sometimes when you think the objective is impossible, especially in the chaos of India, you get a big surprise.</p><p>I spent a lot of time in airports which sucks because they are my least favorite place. I don&#8217;t even like airplanes. Trains, buses, and cars are better. Yaks, camels, and elephants are better.</p><p>What&#8217;s worse than the aiports in India are the long-ass lines at customs. Now, I should explain that Indian customs officials are very thourough&#8230;</p><p>It was a crowded day in the old Bombay international airport. The customs line was longer than usual; way out into the main walkways.</p><p><img class=\"aligncenter size-full wp-image-5047\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-19-at-11.14.33-AM.jpg?resize=560%2C419&amp;ssl=1\" alt=\"this is india\" width=\"560\" height=\"419\"></p><p>There were at least 10 booths open and it seemed to be going pretty fast, until&#8230;</p><p>One guy didn&#8217;t have the right paperwork. He was in the fast line for business people/rich people (someone tell me how to get in this line!). The customs official was all, &#8220;you shall not pass!&#8221; He was right, of course, if the guy didn&#8217;t have what he needed.</p><p>The problem that arises is &#8220;rubber-necking&#8221;. When someone has a car crash, lots of people want to not just STOP, but pull over, get involved, and argue over who&#8217;s fault it was while causing a huge traffic jam. All in a days work.</p><p><img class=\"aligncenter size-full wp-image-5046\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-06-19-at-11.14.24-AM.jpg?resize=413%2C296&amp;ssl=1\" alt=\"this is india\" width=\"413\" height=\"296\"></p><p>Because of the angry passenger yelling, which is more typical than you&#8217;d think&#160;in an Indian customs line, the official in the booth Ben and I were in line for stepped over to see what the problem was.</p><p>That made the guy 3 booths down curious. He then left his position to see what the fuss was.</p><p>Booths 4 and 5 started feeling left out so those officials skipped on over to add their two cents.</p><p>The further away booths were like, &#8220;you guys are ridiculous, we can fix the problem.&#8221; So they do left their positions to finally fix the problem.</p><p>Now, there are 10 officials in 1 booth which is held up because the man doesn&#8217;t have his paperwork. 1,000 people are just standing there watching, not moving.</p><p>An Indian man in the initial line starts to yell, &#8220;You embarrass India! This is why people say India is bad! Look how dumb you are all standing here so NO ONE can get through!&#8221;</p><p>Well the Indian people in line started to yell at him for being so anti-Indian. Then they start yelling really freakin&#8217; loud. There were at least 30 men trying to yell louder than the others.</p><p>I cannot explain in words the chaos that ensued. I&#8217;m pretty sure in the U.S. someone would be tasered (okay, not tasered, but something!).</p><p>Ben and I just stood there, staying quiet, but sort of laughing to ourselves until finally the customs officials all determined the man didn&#8217;t have his paperwork. They sent him away and all went back to their booths.</p><h1>This is India!</h1><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on <a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>, <a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>, <a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a> &amp; <a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p>feature image photo&#160;<a href=\"https://www.flickr.com/photos/araswami/541424920\" target=\"_blank\">source</a></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! (six)"}},"pageContext":{"id":"5b96297b87be058327491191"}}