{"data":{"mongodbDatabaseArticles":{"id":"5b95ea4f87be05832748ff97","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/toolongtravel001.jpg\" alt=\"Nomadic Matt\">Posted: 04/06/2009 | April 6th, 2009</p><p>I was talking to my friend Nicole from <a href=\"https://www.nicoleantoinette.com/\">More is Better</a> a few days ago about life plans. I was pushing her to travel the world like I push everyone to travel the world. While talking to her, I realized that I didn&#8217;t know what I would do if I stopped traveling. What is life without travel? How else would I exist? I&#8217;ve been moving so long that I can&#8217;t picture life any other way.</p><p>Travel has become a lifestyle for me.</p><p>Always moving, always on the road, always somewhere different.</p><p>I have so many different destinations I want to visit <a href=\"https://nomadicmatt.com/travel-blogs/the-beginning-of-the-end/\">before I become &#8220;Semi-Nomadic Matt&#8221;</a> that I think I&#8217;d be 50 before that actually happened! Eventually, I&#8217;ll slow down. It&#8217;s inevitable. Nothing last forever. Gravity and age eventually take hold. But that scares me. I&#8217;ve forgotten what it&#8217;s like to live in one place for more than 6 months.</p><p>All of which makes me wonder &#8212; can you travel for too long? When travel becomes a lifestyle, are you really better off? Most travelers who take a long-term trip do it as a career break or take the infamous gap year that lasts for a year to a year and a half. Then it&#8217;s back home and to the real world. (Not fully, of course, because most people come back from trips like this with a new set of work/life priorities. But they still go back.) There are the digital nomads out there who work from the road and move from place to place slowly. Then there are the <a href=\"https://nomadicmatt.com/travel-blogs/secret-to-long-term-traveling/\">real long-term travelers</a> like myself who have been going for many years, with no end in sight.</p><p>That&#8217;s when travel becomes a lifestyle. And, like any lifestyle, it&#8217;s hard and scary to give up.</p><p>As much courage as it takes to&#160;<a href=\"https://nomadicmatt.com/travel-blogs/the-day-i-quit/\">step away from the cubicle</a> and head out on the road, it takes just as much courage to step away from the road and go back to a more routine lifestyle. Travel eventually becomes all you know. It&#8217;s all I know. After about 4-5 months in one spot, I get anxious and antsy and I need to move again. I think of all the destinations worth seeing and think about how I should get there soon. I formulate plans with friends and plan holidays to far-off places. I am constantly changing where I am going and making new plans. This summer, I&#8217;m off to Europe, then Australia and New Zealand. I want to see Africa and South America. All of that means I still have years on the road ahead of me, and that I&#8217;ll be even more entrenched in this lifestyle of constant motion.</p><p>But eventually, we all need a fixed address. We can take multi-month trips to far-flung destinations, but everyone needs a place to call home. You can&#8217;t spend your whole life moving from one place to the next &#8212; it&#8217;s unrealistic. It becomes a lonely lifestyle always saying goodbye to friends, never being in one place long enough to form a real relationship, never getting to know a place. Everyone needs roots at some point. Even the long, long-term travelers I know eventually get a home base.</p><p>Our conversation made me wistful and melancholy and made ask: can you travel for too long?</p><p>The answer for me? Yes, yes, I think you can.</p><p>When travel becomes a lifestyle, I think it&#8217;s a sign you have been on the road too long. At that point, travel is your life &#8212; it&#8217;s what you do, and there is nothing else. You have no home or fixed location, and friendships are always ephemeral because, in about 5 months, you&#8217;ll be gone again. It&#8217;s a great way to live but not a great way to live forever. It&#8217;s fun to do for a period of time but you can&#8217;t be peter pan forever.</p><p>Trees only grow because they have roots not because they are blowing in the wind.</p><p>Sometimes I think I&#8217;ve been on the road too long. That, after three years, I&#8217;ve become too old a hand at this. But am I ready to give up this lifestyle yet? No. Not all. I&#8217;m still young. I&#8217;ve only had this blog for a year. I still haven&#8217;t climbed Kilimanjaro, dived in the South Pacific, or sailed down the Amazon yet, and then I realize that I still have a bit more to go with this life I lead right now.</p><p>And so, while I may be wistful and might look towards the future, there&#8217;s still miles to go&#8230;..and I&#8217;m ok with that (for now).</p><p><strong>Related articles:</strong></p><p>&#160;</p><h4>Book Your Trip: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://nomadicmatt.momondo.com/?utm_source=private&amp;utm_medium=affiliate&amp;utm_campaign=nomadicmatt\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Acommodation</strong><br> You can book your hostel with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p></div>","title":"Thoughts on Long Term Travel: Can you Travel For too Long?"}},"pageContext":{"id":"5b95ea4f87be05832748ff97"}}