{"data":{"mongodbDatabaseArticles":{"id":"5b9248d287be056953db7bf9","content":"<div><p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/Singapore_Panorama_v2-1024x440.jpg\"> <p>Ever since I visited Singapore for the first time three years ago, I've been obsessed by it. In 2010, like so many kids during college, I was back-packing through South-East Asia and when I ended up moving south, I ended up in Singapore. I was supposed to stay a few days and move on to Indonesia, but I ended up staying 2 weeks. After the total chaos, dirt and noise I had been through on my back-packing trip, clean Singapore was a breath of fresh air.</p> <p>I returned this week and was picked up by the lovely Xiufen, a Singaporean local who works as a photographer here, and who showed me around and told me about Singapore and her life here. She made me realize again why I like Singapore so much.</p> <h2>The chaos of developing countries</h2> <p>Ever since <a href=\"/reset-your-life/\">I hit the road in April</a>, I've been enjoying <a href=\"/the-100-thing-challenge\">living minimalist</a> out of a backpack and moving to a new city every few months. I've now lived in places like <a href=\"/bootstrapping-startup-thailand/\">Bangkok</a>, <a href=\"/moving-to-chiang-mai/\">Chiang Mai</a> and Ho Chi Minh on a budget of less than EUR 1000/m. My income is higher than that but I'm trying to save most of my money. While this lifestyle is great for awhile, it's not sustainable for me at least, for the rest of my life. On the long-term, as a foreigner it's hard to fit into developing countries like Thailand or Vietnam and the chaos of life there becomes an ordeal.</p> <h2>So then, why not live in Europe?</h2> <p>As a European, I'm <a href=\"/the-wests-unemployment-problem-is-permanent/%C3%A2%E2%82%AC%C5%BD\">bearish for Europe's future</a>. Obviously, its economic prosperity is decreasing relative to emerging markets but there's other things. Its education system is not embracing technology. Its labor force is risk-averse and entrepreneurship is frowned upon. And there's the decreasing feeling of safety in its cities like London, Amsterdam and Paris. My ex-roommate walked his girlfriend to and from the bus stop every time, since if he didn't, she'd get harassed by immigrant street gangs. He was in denial about that being an issue though and saw it as normal. Europe is in denial and has Stockholm Syndrome about its problems with immigration. It's only talked about behind closed doors since nobody wants to be seen as extreme-right. So everybody has started considering the current situation as normal. But feeling unsafe at night should not be normal. And I don't want to live in a place like that.</p> <h2>And then there's Singapore</h2> <p>Singapore is different. By its founding nature it's international. Anyone can fit in. There's Chinese, Malay, Indians, British and Europeans living here together (which makes for a great kitchen too). It's highly developed and incredibly safe and clean. You can sit here with a laptop outside at 4AM and you won't get robbed (try doing that in Amsterdam these days). It has a wealthy, highly educated populace with an education system that unlike any other country is incredibly technology-focused. The whole country is actually very modern and technology-minded, with the government automating a lot of their services and making them accessible online. It just feels like a real 21st century city from the future.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/Yale-NUS-Groundbreaking-4.jpg\"> <p>It just seems like a very well-run society that has intellectuals at the top governing the country. And it actually feels a lot like a modern version of the Netherlands, as it's the same kind of harbor-based economy (might have to do with <a href=\"http://en.wikipedia.org/wiki/Albert_Winsemius\">Albert Winsemius</a> hand in Singapore's economy). Finally, it's smack-dab in the middle of the bustling and booming Asian markets I want to be a part of. And if I do want to take some trips, it's just an hour flight from Thailand, two hours from Vietnam and three hours from China.</p> <h2>I love Singaporeans</h2> <p>The people of Singapore are the ones I most identify with too. It's three wholly different cultures (Chinese, Malay and Indians) that peacefully co-exist. Nobody wants to cause trouble. There's no violence in the streets. There's no crazy alcohol abuse due to the high alcohol taxes. People call it boring, and I can see where they're coming from. But like I said it's just one-hour $50 flight to Bangkok, if you need to entertain your vices.</p> <p>The amazingly smart and humble entrepreneur/musician <a href=\"http://sivers.org/singapore\">Derek Sivers</a>, who I interviewed for <a href=\"http://www.scribd.com/doc/56382024/Hooghoudt-P-J-T-M-2010-Firm-Size-Innovation-The-Advantages-of-a-Small-vs-Large-Firm-Size-for-Innovation-Amsterdam-Center-for-Entrepreneurshi\">my bachelor's thesis</a> and like a lot, also <a href=\"http://sivers.org/singapore\">moved to Singapore</a> recently and seems to enjoy his life.</p> <h2>Just one thing</h2> <p>There's one thing that stops me from moving there right now though. Singapore is crazy expensive. Food and drinks are <a href=\"http://www.numbeo.com/cost-of-living/compare_cities.jsp?country1=Netherlands&amp;city1=Amsterdam&amp;country2=Singapore&amp;city2=Singapore\">more expensive than Amsterdam</a>. Which is crazy since Amsterdam is expensive and regular SE Asian prices are usually about 10x cheaper. Singapore rent is even higher than Amsterdam. A regular apartment here goes for SGD 3500 or EUR 2000 per month. That's double what I'd pay in Amsterdam.</p> <p>There's a solution to that though, I'm just going to have to make more money. Since I want to keep saving 50% of my monthly income, like I do now, if I can generate about EUR 10,000 per month, I'll be able to live here comfortably and I'll move here.</p> <p>Singapore, here I come.</p> <p><a href=\"/spending-night-singapore-migrant-workers/\">This perfect image was slightly shattered when I spent the night with Singapore's migrant workers &#187;</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Why I want to live in Singapore"}},"pageContext":{"id":"5b9248d287be056953db7bf9"}}