{"data":{"mongodbDatabaseArticles":{"id":"5b95ea6987be05832748ffa4","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/songkrannye.jpg\" alt=\"Songkran Thai New Year\">Posted: 04/22/2017 | April 22nd, 2017</p><p>Songkran is a three day water fight that celebrates the Thai New Year. It occurs between April 13th to 15th (which coincidentally is the hottest month of the year). Songkran stands to be the most popular festival of Thailand that marks the beginning of a new solar year and is a time of renewal and rebirth. All over the country, from big cities to tiny villages, Thais celebrate the new year by dumping buckets of cold water on each other. Bangkok sees the largest of Songkran parties. The busiest streets are Silom road, Khao San road, and RCA. The holiday is meant to wash away the old year and bring in the new year.&#160; It&#8217;s awesome to see little kids, seniors, and even police get involved. It&#8217;s a very high spirited holiday and everyone is just out to have a great time.</p><p>The word&#160;<i>Songkran</i>&#160;is from the Sanskrit language and means the passage of the sun from one sign of the Zodiac to another. The date was originally set by astrological calculations, but it is now fixed on 13 April.&#160; The only way to really understand the craziness that is Songkran is to see it so here&#8217;s my video:</p><p></p><p><strong>Tips for Songkran</strong></p><ul><li>Chiang Mai and Bangkok have the biggest celebrations but you&#8217;ll find little celebrations all over the country.</li><li>In Bangkok, Khao San Rd and Silom hold the two biggest celebrations.</li><li>Plan to get wet- all the time. Even if you have a backpack or bag, people will still spray you with water. There&#8217;s no escape unless you are inside.</li><li>The only way to avoid being wet is to have a camera or cigarette. If people see you with one, they won&#8217;t spray you with water.</li><li>Just have fun. There&#8217;s no malice involved here so if you get wet and you didn&#8217;t want to, just go with it. It&#8217;s the holiday and you just have to accept it. They even pour water on people driving motorcycles.</li><li>One of the most fun things to do is get in a Tuk Tuk or truck and ride around the city spraying people with water. You get into some of the most amazing water fights and meet a lot of people. I highly recommend this during at least one day.</li></ul><p>Songkran takes place all over the country and, if you are in Thailand during this time, you WILL experience it. You can&#8217;t miss it. It&#8217;s like the one thing that brings everyone together here. Prepare to get wet. Prepare to have to fun!</p><h3>Get the In-Depth Budget Guide to Thailand!</h3><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Thailand_Flat.jpg\" alt=\"Nomadic Matt Thailand guide\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p><h4>Book Your Trip to Thailand: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Thailand by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Thailand with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Thailand?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/?s=Thailand\" target=\"_blank\" rel=\"noopener\">destination guide on Thailand</a> for even more planning tips!</p><p>&#160;</p><p>Photo credit: <a href=\"https://www.flickr.com/photos/madeleine_h/8645456054/\">1</a></p></div>","title":"A Visitor's Guide to Songkran (Thai New Year)"}},"pageContext":{"id":"5b95ea6987be05832748ffa4"}}