{"data":{"mongodbDatabaseArticles":{"id":"5b937b1f87be056953db7d23","content":"<div><h1 name=\"0d36\" id=\"0d36\" class=\"graf graf--h3 graf--leading graf--title\">The Swashbuckling Adventures of a Digital Hermit (Not&#160;Nomad)</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*cqPov-QsG9FBLgFB\">Photo by <a href=\"https://unsplash.com/@yarelush?utm_source=medium&amp;utm_medium=referral\" class=\"markup--anchor markup--figure-anchor\" rel=\"photo-creator nofollow noopener\" target=\"_blank\">Yareli Urzua</a> on&#160;<a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\" class=\"markup--anchor markup--figure-anchor\" rel=\"photo-source nofollow noopener\" target=\"_blank\">Unsplash</a><p name=\"6e10\" id=\"6e10\" class=\"graf graf--p graf-after--figure\">I know you are in Bali. Or the Cayman Islands. Or criss-crossing the country and writing at every diner and ratty motel on the open road. Because you are a digital nomad. And your life is about the journey.</p><p name=\"ebac\" id=\"ebac\" class=\"graf graf--p graf-after--p\">Me? Nah. I am a digital hermit. I criss-cross my house to eat lunch and work out. I do laundry to procrastinate. I don&#8217;t have an island hammock, but I have a backyard. I sleep on my own pillow that I know is clean. I know, boring AF.</p><p name=\"ceef\" id=\"ceef\" class=\"graf graf--p graf-after--p\">But maybe everyone in the world, including Tim Ferriss, is wrong. And you only think you like the digital nomad lifestyle because you are running away from something. Boom. Truth bomb.</p><p name=\"eb2b\" id=\"eb2b\" class=\"graf graf--p graf-after--p\">And maybe all the work-from-homers have it right. Not needing exotic locales for a quarter of their mortgage payment. Having no interest in other nomads happy to have a 3 p.m. beer on a Wednesday just because. Maybe we are just happy as hermits.</p><p name=\"13b5\" id=\"13b5\" class=\"graf graf--p graf-after--p\">Or maybe, just maybe, this is a personality thing. I am alerting Myers-Briggs now that they should have a MBTI contest between digital nomads and digital hermits. But I think we all know how those results would go.</p><p name=\"94cf\" id=\"94cf\" class=\"graf graf--p graf-after--p\">I am grabbing my INTJ plaque right now to put on my desk. In my home office. While you have your feet dipped in lukewarm water off the end of a pier in some exotic location while you are imbibing a cocktail with an umbrella in it.</p><p name=\"c6fe\" id=\"c6fe\" class=\"graf graf--p graf-after--p\">So forget your adventures off in the world because mine are way more exciting.</p><h3 name=\"630e\" id=\"630e\" class=\"graf graf--h3 graf-after--p\">How I Swashbuckle</h3><p name=\"13e6\" id=\"13e6\" class=\"graf graf--p graf-after--h3\">I understand that your digital nomad lifestyle affords you a certain swagger. In that f*ck the man type of way. I can&#8217;t even lie. I&#8217;ve been impressed by it. When I see your Insta-post from a tiki hut with free WiFi, overlooking a crystal clear lagoon with dolphins that bring you pi&#241;a coladas. Jealous.</p><p name=\"624d\" id=\"624d\" class=\"graf graf--p graf-after--p\">But then I pontificate about how my digital hermit lifestyle matches up and I start to feel good about myself again. Kind of. Sure, there&#8217;s no attractive bartender/IT person in my house, but my dog is here. He can&#8217;t make a pi&#241;a colada for sh*t, but he&#8217;s cute.</p><p name=\"2dd4\" id=\"2dd4\" class=\"graf graf--p graf-after--p\">I swashbuckle by rolling out of bed whenever I feel like it (or when my kids need to get to school) and showering sometime later in the day. I&#8217;m not sure how this nomad thing works, but in my head you are sharing a shower with six other 20-somethings and it&#8217;s cool. Everyone shares the soap. No biggie.</p><p name=\"2e21\" id=\"2e21\" class=\"graf graf--p graf-after--p\">But I like my privacy. That&#8217;s why I am a digital hermit. And you get bored AF at home in two seconds. Because you need the chatter&#8230;I mean clicks of patrons at a digital hotspot in a foreign city. Let&#8217;s just call it a personality type.</p><p name=\"fc17\" id=\"fc17\" class=\"graf graf--p graf-after--p\">Your idea of swashbuckling is taking a break at 2 p.m. to go hang gliding off the side of a volcano. Me? I don&#8217;t know. Showering before noon. Not eating leftovers. Sometimes I just watch Sharp Objects at 9 a.m. Swashbuckler for life.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*lbzfJyiN75Ddosm2\">Photo by <a href=\"https://unsplash.com/@sjois71?utm_source=medium&amp;utm_medium=referral\" class=\"markup--anchor markup--figure-anchor\" rel=\"photo-creator nofollow noopener\" target=\"_blank\">joyce huis</a> on&#160;<a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\" class=\"markup--anchor markup--figure-anchor\" rel=\"photo-source nofollow noopener\" target=\"_blank\">Unsplash</a><h3 name=\"10cc\" id=\"10cc\" class=\"graf graf--h3 graf-after--figure\">My Adventures</h3><p name=\"8900\" id=\"8900\" class=\"graf graf--p graf-after--h3\">Your adventures include tropical weather and picking the best WiFi spot for the day. Preferably one with laundry. And drinks. Because this is the digital nomad life (in my head). You sitting on top of a commercial grade washing machine, typing a story on your laptop with a frozen drink.</p><p name=\"9f26\" id=\"9f26\" class=\"graf graf--p graf-after--p\">Me? Adventure, huh? I got my dog a new dog food the other day. He didn&#8217;t give even one sh*t. He will eat anything. I went to Starbucks for my daughter and got myself a trenta iced tea and then nursed it at my computer screen in my home office for an hour, listening to Spotify. I did not do laundry.</p><p name=\"015f\" id=\"015f\" class=\"graf graf--p graf-after--p\">So maybe you have the upper hand on the adventure portion of the digital lifestyle. But I have the comfort in droves. Sometimes in order to get ready to work I &#8220;relax&#8221; (nap) on the couch while the new season of OITNB plays in the background (eyes glued&#8202;&#8212;&#8202;BTW getting tired of Piper&#8217;s attitude).</p><p name=\"50df\" id=\"50df\" class=\"graf graf--p graf-after--p\">You are probably conversing with other digital nomads at a hip co-working space (I&#8217;m talking to you <a href=\"https://medium.com/@whatsarahlikes\" class=\"markup--user markup--p-user\" target=\"_blank\">Sarah Aboulhosn</a> &#128516;) with glass windows, bottomless coffee and pristine bathrooms. I have two teenagers so pristine bathrooms are not an option, but I have windows (that I stare out while I am procrastinating). And there&#8217;s my adventure. Sorry you can&#8217;t get down like this.</p><h3 name=\"b2e2\" id=\"b2e2\" class=\"graf graf--h3 graf-after--p\">The Life of a Digital&#160;Hermit</h3><p name=\"711d\" id=\"711d\" class=\"graf graf--p graf-after--h3\">I know there aren&#8217;t a lot of stories about digital hermits. Because most consider that working from home. But digital hermits are different. We revel in the nature of our daily introversion. We don&#8217;t need to stay in a different hostel every night. Or the pool house of an Airbnb. Actually, that sounds pretty good. Like The O.C.</p><p name=\"565b\" id=\"565b\" class=\"graf graf--p graf-after--p\">We just grind it out at home. Away from the smooth interaction with other hip, cool and trendy millennials who want to get drinks on Thursday right at 5 p.m. We go to the dog park in the middle of the day in our pajamas. With our without our dog. And it rules.</p><p name=\"935c\" id=\"935c\" class=\"graf graf--p graf-after--p\">You are out shaking hands and talking about synergy at your Internet caf&#233;. We are engaged in riotous political discourse on Twitter, with bedhead, from the comfort of our own cave. You punched out 476 words, but also got a dope tan. We wrote 785 words and then made a snack. And then we deleted 400 of those words while you were surfing.</p><p name=\"88eb\" id=\"88eb\" class=\"graf graf--p graf-after--p\">I&#8217;m sorry your life is so boring.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*v3BulJTLv2_uKzaq\">Photo by <a href=\"https://unsplash.com/@johnschno?utm_source=medium&amp;utm_medium=referral\" class=\"markup--anchor markup--figure-anchor\" rel=\"photo-creator nofollow noopener\" target=\"_blank\">John Schnobrich</a> on&#160;<a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\" class=\"markup--anchor markup--figure-anchor\" rel=\"photo-source nofollow noopener\" target=\"_blank\">Unsplash</a></div>","title":"The Swashbuckling Adventures of a Digital Hermit (Not Nomad)"}},"pageContext":{"id":"5b937b1f87be056953db7d23"}}