{"data":{"mongodbDatabaseArticles":{"id":"5b92488f87be056953db7bb6","content":"<div><p>I can't count the amount of times people have told me to add unit tests to my code. <a href=\"//en.wikipedia.org/wiki/Unit_testing\">Wikipedia</a> describes unit tests as:</p> <blockquote><p>In computer programming, unit testing is a software testing method by which individual units of source code, sets of one or more computer program modules together with associated control data, usage procedures, and operating procedures, are tested to determine whether they are fit for use.</p></blockquote> <p>Basically, you test part of your code, app or site with a certain input and you know what it should respond with if everything is working properly. Before I would do this manually by simply using my websites and apps. For example I'd add a trip to my <a href=\"//nomadlist.com/@levelsio\">Nomad List profile</a> every week any way, and sometimes it'd bug and I'd have to fix it. More often actually I get <a href=\"//twitter.com/search?f=tweets&amp;vertical=default&amp;q=levelsio%20bug&amp;src=typd\">tweets telling me something is broken</a>:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\"><a href=\"//twitter.com/levelsio\">@levelsio</a> Bug: searching for \"city, state\" should show results -- right now only \"city\" does. <a href=\"//t.co/BdcX40Or3T\">pic.twitter.com/BdcX40Or3T</a></p> <p>&#8212; Phil Freo (@philfreo) <a href=\"//twitter.com/philfreo/status/859180706639081472\">May 1, 2017</a></p></blockquote> <p></p> <p>I get them all day:</p>   <p></p> <p>And it's amazing:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\"><a href=\"//twitter.com/levelsio\">@levelsio</a> Hey, in case you haven't noticed yet. Icecream chat is behaving bit wonkily when creating a new channel. <a href=\"//t.co/DSKABuqpXn\">https://t.co/DSKABuqpXn</a></p> <p>&#8212; Kuldar (@kkuldar) <a href=\"//twitter.com/kkuldar/status/867022715890397184\">May 23, 2017</a></p></blockquote> <p></p> <h2>We need....robots!</h2> <p>But having a robot do this for you EVERY single minute helps. It makes it faster. A robot won't cover every problem yet, but it gets pretty close.</p> <p>I tried all these unit testing suites, and like always, it's all just too complicated and convoluted for me. So I thought, why not try something simpler. I was already using an app called <a href=\"http://uptimerobot.com/\">Uptime Robot</a> which pings my servers every few minutes to check if they're up. But they also had a feature called \"Keyword\" which opens a page every minute, checks if a keyword that you specify exists. And if it doesn't alerts you.</p> <h2>Enter UptimeRobot</h2> <p>What keyword do we use though? For most cases I decided on simply &lt;/html&gt;. Why? Because if a page doesn't show the closing HTML tag anymore, it probably means it fatally error'ed somewhere in the middle, or it didn't load at all. That means the alert will hit and it will signal me.</p> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-23-19.05.55.png\" alt=\"\" width=\"986\" height=\"830\" class=\"alignnone size-full wp-image-7743 responsively-lazy\"> <p>I also added a few more specific ones.</p> <p>The Taipei city card page should obviously show the keyword \"Taipei\":</p> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-23-19.07.33.png\" alt=\"\" width=\"1614\" height=\"998\" class=\"alignnone size-full wp-image-7748 responsively-lazy\"> <p>The Bangkok chat should have \"Bangkok\":<br> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-23-19.07.42.png\" alt=\"\" width=\"1614\" height=\"996\" class=\"alignnone size-full wp-image-7747 responsively-lazy\"></p> <p>If you search for \"Welling\", the city Wellington should show up:</p> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-23-19.09.00.png\" alt=\"\" width=\"1620\" height=\"996\" class=\"alignnone size-full wp-image-7745 responsively-lazy\"> <p>If you post a job on Remote OK to preview it, the JSON should reply with success:</p> <img src=\"/wp-content/uploads/2017/05/Screenshot-2017-05-23-19.09.10.png\" alt=\"\" width=\"1612\" height=\"1004\" class=\"alignnone size-full wp-image-7744 responsively-lazy\"> <p>I have about 40 test cases now and will add more when I can think of more. The cool thing about Uptime Robot is that it has a wide array of alert outputs. It can send you an email, a Twitter DM, a Pushover notification, a push notification through its iOS app. But most importantly SMS. Wherever I am in the world I always have a backup phone with my main SIM card in it. That means if I'm in sub-Saharan Africa or Los Angeles or Bali, I'll know when my sites are not working properly and I'll be alerted WITHIN 60 seconds! How cool is that? Pretty cool I think :D</p> <p>I made two videos on Twitter to show how the system works:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">&#10024;I've built 37 test cases that check if my sites are working properly w/ <a href=\"//twitter.com/uptimerobot\">@uptimerobot</a> and SMS me if they're not, here's how it works (pt 1) <a href=\"//t.co/nB90v7ws5c\">pic.twitter.com/nB90v7ws5c</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/867053278399533056\">May 23, 2017</a></p></blockquote> <p></p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">&#10024;I've built 37 test cases that check if my sites are working properly w/ <a href=\"//twitter.com/uptimerobot\">@uptimerobot</a> and SMS me if they're not, here's how it works (pt 2) <a href=\"//t.co/YKfeiozrXj\">pic.twitter.com/YKfeiozrXj</a></p> <p>&#8212; Pieter Levels @ (@levelsio) <a href=\"//twitter.com/levelsio/status/867054062759555073\">May 23, 2017</a></p></blockquote> <p></p> <p>It's not the \"proper\" solution but it works for me. I know it's limited, for example it doesn't let you test entire sequential flows of user patterns (like a user clicking Join, then entering their username, then paying etc), but it's good for basic testing. And it generally saves me time instead of using convoluted testing suites. Also, the best thing is, unlike test suites, it has email, push and SMS alerts built-in.</p> <p>And I'm not the only one who gets alerted. My server and sys admin person also gets an email, DM and SMS and can go and fix things if I'm not available, like when I'm dancing to bad music dancing on a beach in Bali! At least now I'll know, while I'm drinking fake whiskey, my server is down too! Haha.</p> <p>This ties into my pursuit of automating every last part of my sites. I'm pretty close. Remote OK is 100% automated now, and Nomad List is at about 90%.</p> <p>Let me know your feedback on Twitter :)</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Using Uptime Robot to build unit tests for the web"}},"pageContext":{"id":"5b92488f87be056953db7bb6"}}