{"data":{"mongodbDatabaseArticles":{"id":"5b92396d87be0583cfde67ff","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">10 ways to use the Law of Abundance with Flag Theory</h1>\n \n</p><img class=\"size-full wp-image-14132\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/01/law-of-abundance-flag-theory.jpg\" alt=\"Law of Abundance and Flag Theory\" width=\"700\" height=\"467\"><p>Dateline: Barcelona, Spain</p>\n<p>My new year&#8217;s resolution last year was to focus more on action, and I invited readers like you to share in that with me. That&#8217;s why I announced a goal to help fellow Nomad Capitalists plant 5,000 flags and diversify with offshore <a href=\"http://www.nomadcapitalist.com/offshore-banking/\">bank accounts</a>, <a href=\"http://www.nomadcapitalist.com/second-passport/\">passports</a>, and more.</p>\n<p>This year, I&#8217;m resolving to focus even more on what I believe is a crucial element to taking action and achieving success in life. I&#8217;m focusing on abundance.</p>\n<p>A number of years ago, I spent time with a group of people who practiced something totally new to me. They called it the &#8220;Law of Abundance&#8221; and it was all about the idea that investing in yourself was the key to happiness and success in life.</p>\n<p>I realized that I had grown up focusing on the opposite of abundance, which they called the &#8220;Law of Scarcity&#8221;. As opposed to abundance, scarcity causes one to focus on saving money in fears that there won&#8217;t be any later.</p>\n<p>For example, even as I grew four different businesses, I felt that next month would be the month my earning ability would come to a screeching halt. As a result, I didn&#8217;t invest enough in myself, and often operated from a position of fear. I look back and realize that what were successful businesses could have been even more successful had I operated from a position of abundance.</p>\n<p>I should have believed more in myself and that investing in myself would pay off.</p>\n<p>Over the years, I&#8217;ve realized that the &#8220;secrets of the universe&#8221; types I once scoffed at were right: focusing on what you have and where you&#8217;re going is a lot more beneficial to your success and wealth than focusing on the negatives.</p>\n<p>When it comes to <a href=\"http://nomadcapitalist.com/flag-theory/\">flag theory</a>, this principle is highly important. We frequently discuss stuff like <a href=\"http://nomadcapitalist.com/2014/04/20/top-5-worst-cases-hyperinflation-history/\">hyperinflation</a> or <a href=\"http://nomadcapitalist.com/2014/09/29/investing-in-high-yield-real-estate-overseas/\">weak real estate markets</a> or government wealth grabs that can make you think that clinging to every penny is of utmost importance.</p>\n<p>With so many negative headlines in the Western world these days, I can understand why you might focus on scarcity. However, I&#8217;ve come to realize that flag theory and internationalization can actually help you bypass the negativity and <a href=\"http://nomadcapitalist.com/five-magic-words/\">&#8220;go where you&#8217;re treated best&#8221;</a>.</p>\n<p>If you want to be rich in prosperity, love, and happiness, practicing an abundance mindset can help. This isn&#8217;t a motivational blog per se, but I do see the ideas we talk about as a means to motivational ends.</p>\n<p>An international lifestyle can create greater wealth, personal freedom, and happiness than you would have if you just stayed at home and did everything in one country.</p>\n<p>There are many small steps you can take toward creating a mindset of abundance. I started by taking small steps and saw that I was able to enjoy traveling as well as money a lot more when I realized that I wouldn&#8217;t go broke if I invested in myself.</p>\n<p>That&#8217;s when the network and knowledge I&#8217;ve built here at Nomad Capitalist really started to flourish. Here are some ideas for investing in yourself:</p>\n<h2>1. Pay lawyers for advice</h2>\n<p>One time when I was first starting my business at 19, I needed help with a legal matter for a corporate issue. Rather than just buying an hour or two of a lawyer&#8217;s time, I spent hours searching for lawyers offering free consultations and pieced together the advice of a few of them to get what I thought was solid legal opinion. In the end, the time I spent meant neglecting a $35,000 deal that pulled out, costing me much more than the cost of any legal help.</p>\n<p>Today, I always make it a habit to pay for legal advice in almost any situation. For instance, I&#8217;m currently looking for an apartment to spend a few months per year here in Barcelona. In order to make sure that signing a lease didn&#8217;t suck me into some crazy Spanish tax net, I called a lawyer I met here last year and paid her 600 euros to give me an opinion. Money well spent.</p>\n<p>In almost every situation like this, I find that paying someone to help me is a lot more affordable than doing it myself. (That&#8217;s one reason having a network of high-level people is so important.)</p>\n<h2>2. Know how to value your time</h2>\n<p>Valuing your time is easy; simply take your annual salary and divide by 2,000 hours to see how much each hour of your time is worth. If you run your own business, allow me to offer a twist:</p>\n<p>Take how much you WANT to earn, then divide by 2,000. If you want to earn $500,000 a year, your time should be valued at $250 per hour. Any time you can outsource part of your life to someone for less than $250 per hour, you should do it and allow yourself to focus on increasing your income.</p>\n<p>I often meet fellow entrepreneurs and nomads who don&#8217;t value their own time at all. I&#8217;ve found this is a sure path to stagnation in business, and especially in your offshore endeavors. Many people I know tried to do things the cheap way only to find unresponsive vendors.</p>\n<h2>3. Invest in an offshore company from day one</h2>\n<p>If you&#8217;re starting a business, chances are you should be incorporating for both liability and organization purposes. If you plan to do business internationally, or you plan to live overseas as a <a href=\"http://nomadcapitalist.com/2015/04/24/important-tax-strategies-digital-nomads/\">digital nomad</a>, it&#8217;s very possible you would benefit from an offshore company.</p>\n<p>If you can afford to do so, I recommend starting your offshore company early on. Why waste time migrating assets, changing bank accounts, and enduring general misery when you can get started the right way up front? Many people choose not to do this, not only to save money, but also because they don&#8217;t plan to enjoy all of the benefits right away.</p>\n<p>If you value time over money, <a href=\"http://www.nomadcapitalist.com/offshore-company/\">setting up an offshore company</a> early is the best strategy in many cases.</p>\n<h2>4. Travel to open a bank account</h2>\n<p>Remote openings for offshore bank accounts are great. It really is possible to open a bank account from the comfort of your home. However, you can often open an even better account by traveling overseas.</p>\n<p>I recently had a client with $5 million to deposit in one bank account. With this much money, you can often have a banker come to you, or at least meet you in a convenient location in your home country. If you have less money to deposit, the choice of banks becomes smaller if you&#8217;re not willing to travel.</p>\n<p>Getting on a plane can actually save you money in the long run. A Caribbean bank with remote account opening is great if you can&#8217;t travel, but might charge you enough in fees to make your flight to a higher quality jurisdiction pay for itself in just a few years.</p>\n<h2>5. Don&#8217;t skimp on tax advice</h2>\n<p>If you&#8217;re a citizen of some flyspeck country, you might be able to ignore this advice. If you&#8217;re American, British, Australian, Canadian, or European, you definitely need high quality tax advice.</p>\n<p>In fact, this is where I see a lot of people with otherwise great plans fail. It&#8217;s easy to put off tax filings or ignore a <a href=\"http://nomadcapitalist.com/2013/09/25/fbar-and-other-offshore-bank-account-reporting-requirements/\">reporting requirement</a> because you&#8217;re spending time overseas, or don&#8217;t think the tax man will find your hidden bank account.</p>\n<p>Staying legal is the most important thing you can do when it comes to going offshore. Pay for the best tax advice you can afford and &#8230;</p>\n<h2>6. Pay bills when you get them</h2>\n<p>A good friend of mine has a seven figure location independent business, but found himself ignoring credit card bills when they came in. He has such good credit, but he always waited until the due date to pay the bill. Then, he&#8217;d spend an entire month agonizing over having to pay the bill and how much it would hurt.</p>\n<p>I see the same thing with readers who know they need a second residency or an offshore company, but are delaying moving forward because they don&#8217;t want to pay the bill. It&#8217;s only natural for us to delay the &#8220;pain&#8221; of paying a bill in order to keep our own money. However, a scarcity-minded attitude is also what holds most of us back.</p>\n<p>My friend who used to wait to pay his bills now pays the bill the day it comes in and then moves on with his life. The bill is financially insignificant, so he made it emotionally insignificant and now devotes his energy to investing in his business rather than worrying about money going out the door.</p>\n<p>The same is true of delaying decisions you know you need to make, but don&#8217;t want to for fear of paying the bill. I&#8217;ve found that the bill isn&#8217;t really the issue, and if you open up, you&#8217;ll feel better having paid the bill and moved on.</p>\n<h2>7. Stay in better hotels</h2>\n<p>This doesn&#8217;t mean stay in five-star palaces wherever you go. But it does mean that you should stay in a hotel or <a href=\"http://nomadcapitalist.com/2014/06/27/seven-reasons-to-avoid-airbnb/\">apartment</a> that offers you enough convenience and comfort to get work done as a perpetual traveler.</p>\n<p>Sometimes this doesn&#8217;t even involve spending more money. I stayed in a $900-a-night room in London&#8217;s West End last year that required me to step over my luggage just to get out the door. If I hadn&#8217;t have been celebrating my birthday, I wouldn&#8217;t have gotten any work done in that tiny room.</p>\n<h2>8. Get a home overseas&#8230; even if you don&#8217;t use it</h2>\n<p>Some better second residency programs require you to maintain an apartment in their country, but not necessarily to live there. These programs can lead to <a href=\"http://www.nomadcapitalist.com/second-passport/\">high-quality second passports</a>, but many people I&#8217;ve spoken with dismiss them because of the ongoing cost of maintaining an apartment.</p>\n<p>The idea of &#8220;wasting money&#8221; on an apartment you rarely live in can seem like a bad idea, but it can be a great investment if it leads to a great second passport. If you can get citizenship in the European Union in five years by slowly spending the same amount as you would for a <a href=\"http://nomadcapitalist.com/second-passport/dominica/\">Caribbean passport</a> now, it might be worth overlooking the emotional aspect of &#8220;wasting money&#8221;.</p>\n<h2>9. Upgrade your luggage</h2>\n<p>If you plan to travel a lot (or even a little), the luggage you use is very important. Many people will tell you that buying a $1,000 Tumi suitcase is a waste, and that some $40 knock-off at a Bangkok street market is just as good.</p>\n<p>They are wrong.</p>\n<p>I know people who have gone through a dozen of cheap tourist stall umbrellas since I invested in a high-quality umbrella. Where I live in Southeast Asia, a cheap umbrella just won&#8217;t cut it. The same applies to the rest of the gear you travel with, and investing in quality is worth it in the long haul.</p>\n<h2>10. Have a great network of people</h2>\n<p>You&#8217;ve heard the saying that your salary (or net worth) is the average of your five closest friends. If you associate with winners, chances are you&#8217;re a winner. And vice versa.</p>\n<p>Much of my time when traveling is spent seeking out new trusted contacts precisely because I want a high-value network. In many cases, this involves meeting lawyers, investment advisors, bankers, and even government officials in the &#8220;who&#8217;s who&#8221;. And in many cases, this involves paying those advisors just to sit down with them. Just as I suggested paying lawyers above, the long-term value gained from meeting these people almost always pays off.</p>\n<p>Surrounding yourself with people who challenge you is a key to abundance. My entrepreneur friends who are constantly striving for more push me to be better much more than my entrepreneur friends who get to $100,000 a year and call it a day.</p>\n<p>That&#8217;s why I&#8217;ve stopped accepting new members to our private club, The Nomad Society. We&#8217;re making improvements to The Society to make sure that everyone in the club pushes each other to achieve more and earn more and, in this way, more fully live according to the Law of Abundance.</p>\n<p>Nevertheless, if you are ready to take action, I am still giving consultations to a handful of serious investors each month. Just fill out the <a href=\"http://www.holanomad.com\" target=\"_blank\">application</a> today.</p>\n<p class=\"et_social_bottom_trigger\"></p> </div>","title":"10 ways to use the Law of Abundance with Flag Theory"}},"pageContext":{"id":"5b92396d87be0583cfde67ff"}}