{"data":{"mongodbDatabaseArticles":{"id":"5b95ea2a87be05832748ff87","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/catacombsparis2.jpg\" alt=\"Skulls in the Paris Catacombs\">Updated: 04/05/2018 | April 5th, 2018</p><p>Underneath the <a href=\"https://nomadicmatt.com/travel-blogs/ways-save-money-paris/\" target=\"_blank\" rel=\"noopener\">city of Paris</a>, you&#8217;ll find a honeycomb of tunnels. The tunnel system is a giant maze and no one knows quite how many tunnels or chambers there are out there (that&#8217;s how big it is). Paris is, after all, a very old city that has been built and rebuilt many times.</p><p>The Catacombs are what is left of rock quarries built and expanded over the center of the city. The French resistance used these tunnels during World War II, and rave parties flourished there during the 1990s. Victor Hugo used his knowledge about the tunnel system when he wrote Les Mis&#233;rables. In 1871, communards killed a group of monarchists in one chamber. People go try to explore it on their own and end up dying in there.</p><p>Yet, in this maze of tunnels, one part open to the public &#8211; the famous &#8220;Catacombs&#8221; of Paris. The Catacombs of Paris were created at the end of the 18th century. Situated twenty meters below ground, this ossuary contains the remains of millions of Parisians transferred gradually between the late eighteenth and mid-nineteenth centuries as graveyards were being closed and moved outside the city center. The bones were always moved at night to a ceremony made up of a procession of priests who sang along the way to the Catacombs.</p><p><img src=\"https://media.nomadicmatt.com/catacombsparis.jpg\" alt=\"the Paris catacombs\"></p><p>Since the first day they were complete, the Catacombs have been an object of curiosity, even for royalty. In 1787, Lord of d&#8217;Artois, who became King Charles 10, went down there with the ladies from the Court. In 1814, Fran&#231;ois 1st, Emperor of Austria, went to visit and explore them while he was in Paris. In 1860, Napoleon III went there with his son. The catacomb walls are also covered in graffiti dating from the eighteenth century. Everyone has left their mark on this place. Towards the end of the 18th century, the catacombs became a tourist attraction and have been open to the public on a regular basis from 1867.</p><p>In the dark galleries and narrow passages, you&#8217;ll see bones arranged in a macabre display. Catacombs are eerie. They are quiet, dark, damp, and a bit downright depressing. There are lots of bones around and most of them are just stacked up on each other. You&#8217;ll never know who is who &#8211; that skull you are looking at could be someone who died from the plague or be a wealthy aristocrat. You never know.</p><p>I&#8217;ve visited this site multiple times and I always find it super creepy yet super interesting. The history here is incredible and you can see markings on the walls from the centuries of visitors here. it is one of the best things to see and do in Paris and should not be missed!</p><p>Some interesting facts and figures:</p><ul><li>The depth of the Catacombs is equivalent to a five-story building.</li><li>The area is 2 kilometers long.</li><li>It takes 45 minutes to see it.</li><li>The constant temperature in the Catacombs is 14 Celsius.</li><li>The surface area of the ossuary is&#160;11,000 square meters.</li></ul><p><img src=\"https://media.nomadicmatt.com/catacombs.jpg\" alt=\"the Paris catacombs\"></p><p>To get to the Catacombs of Paris, you can take the subway and the RER to Denfert-Rochereau or use Bus 38 and 68. The museum is open from 10 a.m. to 8:30 p.m. every day except Monday. Visitors are limited to 200 at a time so the ling can get really long as people get backed up. I highly recommend reserving your space in advance to avoid the line. (Seriously, the line gets to be hours long!) Tickets cost 13 Euros. There are audio guides available in English, French, German and Spanish for an extra 5 Euros. They are worth the money.</p><p>Visiting the Paris Catacombs is one of my favorite activities in the city and something I highly recommend you don&#8217;t skip. It takes about an hour to wander through completely.</p><h3>Get the In-Depth Budget Guide to Paris!</h3><p><a href=\"https://nomadicmatt.com/books/paris-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Paris_Flat.jpg\" alt=\"Nomadic Matt's Guide to Paris\" width=\"180\" height=\"240\"></a>For more in-depth information, check out my guidebook to Paris written for budget travelers like yourself! It cuts out the fluff found in other guides and gets straight to the practical information you need to travel and save money in one of the most beautiful and romantic cities in the world. You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/paris-guide/\">Click here to learn more and get started.</a></p><p></p><p id=\"om-brq027uh9rh6olkusuwr-holder\"></p><h4>Book Your Trip to Paris: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Paris by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Paris with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Paris?</strong><br> Be sure to visit our robust <a href=\"https://nomadicmatt.com/product/nomadic-matts-guide-to-paris-discount/\" target=\"_blank\" rel=\"noopener\">destination guide on Paris</a> for even more planning tips!</p></div>","title":"The Catacombs of Paris: What It's Like to Experience Paris' Dark Side"}},"pageContext":{"id":"5b95ea2a87be05832748ff87"}}