{"data":{"mongodbDatabaseArticles":{"id":"5b9248e187be056953db7c0a","content":"<div><p>I am a massive fan of <a href=\"http://telegram.org/\">Telegram Mesenger</a>. When Facebook announced it acquired WhatsApp, I immediately switched for privacy reasons. Miraculously I managed to convince 95% of my friends to install Telegram and switch too. But this week I found out it's trivially easy to get access to someone's message history.</p> <p>Telegram stores users' message history on its servers. Unless you delete that history, it's accessible perpetually. That's a bit scary, but as long as nobody can access your messages, that's fine. Right?</p> <p>Well, yeah, but then getting access to anyone's Telegram account is trivially easy.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screenshot 2014-06-22 21.32.46\"><img src=\"/wp-content/uploads/2014/06/Screenshot-2014-06-22-21.32.46-1024x481.png\" alt=\"Screenshot 2014-06-22 21.32.46\"> <p>Using <a href=\"http://zhukov.github.io/webogram\">Webogram</a>, an awesome open-source web client for Telegram, you can sign in to any account you have the phone number of, by simply authenticating via SMS.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/06/Screenshot-2014-06-22-21.32.54-1024x488.png\"> <p>iPhone and Android phones show new text messages by default as a notification on the lock screen. So, without unlocking the phone you can read the code and sign in to Telegram.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/06/foto-e1403466404824-1024x768.jpg\"> <p>...</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/06/Screenshot-2014-06-22-21.33.11-1024x483.png\"> <p>And ta da! We're inside!</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/06/17875_1.jpg\"> <p>If you have physical access to someone's phone, you can read the code and get access to their messages. Now physical access sounds quite a feat, but it's not. It can mean sitting next to a co-worker, peeking over someone's phone in the train, or even watching someone's idle phone from a HD security camera.</p> <p>I'd suggest Telegram adds some sort of extra authentication, e.g. adding an (optional) password to every phone's account to make it more difficult to do this.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How to access anyone’s Telegram messages without unlocking their phone"}},"pageContext":{"id":"5b9248e187be056953db7c0a"}}