{"data":{"mongodbDatabaseArticles":{"id":"5b93831287be056953db7e24","content":"<div><p name=\"0723\" id=\"0723\" class=\"graf graf--p graf--leading\">I, like many others, work remotely from home. I&#8217;ve personally always preferred it as office lights give me a headache and I like the freedom of being able to walk around more without disrupting other people or looking like a maniac.</p><p name=\"a099\" id=\"a099\" class=\"graf graf--p graf-after--p\">I&#8217;ve learnt a few things whilst doing so that have helped me be more productive and effective in my work. Because if you&#8217;ve ever worked from home you know how easy it can be to distract yourself without the pressure of being surrounded by bosses or your clients.</p><h3 name=\"e173\" id=\"e173\" class=\"graf graf--h3 graf-after--p\">Have a Separate&#160;Space</h3><p name=\"7d98\" id=\"7d98\" class=\"graf graf--p graf-after--h3\">Just as sleep experts have recommended keeping your bedroom a sanctuary reserved only for sleep, you should also have a place dedicated solely to work. I&#8217;ve personally found that having a place I can go and just be in &#8220;work mode&#8221; has really helped. Sure it&#8217;s great working on the couch, but it&#8217;s a place your head associates with relaxing and there are too many distractions. Find a room, or space that you can put a desk and a comfortable chair (this is really important, you&#8217;ll be sat in it a lot. It&#8217;s worth the investment) and set up an area just for work. It&#8217;ll make a world of difference.</p><h3 name=\"7181\" id=\"7181\" class=\"graf graf--h3 graf-after--p\">Have Time Away From the Office and Don&#8217;t Isolate&#160;Yourself</h3><p name=\"41b9\" id=\"41b9\" class=\"graf graf--p graf-after--h3\">While it&#8217;s great to have a place to work, it&#8217;s also incredibly powerful to spend time away from it. If you spend days or even weeks isolated from people, working away, you&#8217;ll find you can go a bit insane. Going to the gym, for dinner with a friend or finding somewhere else to work for the day can have a huge effect on you and your ability to work. Look into local co-working spaces or meet ups to find people in a similar field and you will find some great people who could maybe one day help you through a problem or even pass a client project your way.</p><h3 name=\"ac4a\" id=\"ac4a\" class=\"graf graf--h3 graf-after--p\">Keep Food in the&#160;House</h3><p name=\"55e0\" id=\"55e0\" class=\"graf graf--p graf-after--h3\">I saw this last year in <a href=\"https://medium.com/@JoelleSteiniger/work-from-home-do-it-better-f33dd0e150d1\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Joelle Steiniger&#8217;s article</a> and found it to be very useful for me personally. Having food available in the house saves on distractions for times where you need to get work done and could distract yourself going to the store or out for lunch. I found I was doing it more than I had thought and have since saved a lot of time and money by always having groceries in the house. Also remember to drink loads of water as it will help you function better and never to eat at your desk (keep that as a place for work!).</p><h3 name=\"55a6\" id=\"55a6\" class=\"graf graf--h3 graf-after--p\">Have a Schedule That Works For&#160;You</h3><p name=\"48f5\" id=\"48f5\" class=\"graf graf--p graf-after--h3\">Some people aren&#8217;t morning people. I personally work better if I&#8217;m allowed to wake up around 10AM and work my day&#8217;s time from there. No matter what time works best for you personally, make sure you stick to it consistently and hold to your schedule (I&#8217;ll talk about this more in the next point). Don&#8217;t let distractions take a hold of you and allow you to procrastinate. That housework or other tasks you&#8217;ll try and distract yourself with will still be there when you&#8217;ve finished your work for the day.</p><h3 name=\"2868\" id=\"2868\" class=\"graf graf--h3 graf-after--p\">Schedule Your&#160;Time</h3><p name=\"e0c1\" id=\"e0c1\" class=\"graf graf--p graf-after--h3\">This is likely the most important point for me personally, structuring my time has allowed me to build a routine. I use a calendar (<a href=\"https://flexibits.com/fantastical\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Fantastical 2</a>) to schedule all of my time and breaks for the day and set them to be repeating events. I can then just edit those events with the tasks I need to do at the start of the week and then stick to my calendar. I&#8217;m specific with these tasks so that they aren&#8217;t open ended and are things I can complete in those blocks. For example, instead of &#8220;Client Name&#8202;&#8212;&#8202;Project&#8221;, I&#8217;ll have something more like &#8220;Client Name&#8202;&#8212;&#8202;Project&#8202;&#8212;&#8202;Task + Detail of Task&#8221; that way the time has a focus to it and something to complete.</p><p name=\"4916\" id=\"4916\" class=\"graf graf--p graf-after--p\">I&#8217;ve found that working in this manner allows me to complete goals, rather than flying around doing tiny bits on every project, I work to an end point and complete that before moving on to the next. There&#8217;s never a need to multitask and during these work blocks I never check email or Twitter. I&#8217;ll occasionally reply to my team on Slack but other than that I&#8217;ll focus fully on work. Twitter and email will still be there when I&#8217;m done working.</p><p name=\"aa79\" id=\"aa79\" class=\"graf graf--p graf-after--p\">I always have the most important task first in the day, I&#8217;ve found this is where I am most focused and get things done most effectively. Make sure to tailor your schedule so your most important tasks are when you can be most effective.</p><p name=\"93d3\" id=\"93d3\" class=\"graf graf--p graf-after--p\">Any meetings, client calls or appointments I try to keep on one day so I don&#8217;t fragment days and have to stop and start work. I also have a set end time every day as I know that if I continue to work past this I&#8217;ll grow less and less effective and not be happy with the work I produce. There&#8217;s always tomorrow to finish something and if you manage your time effectively (and have the right clients), you&#8217;ll never have those crazy deadlines that <strong class=\"markup--strong markup--p-strong\">have</strong> to be done before tomorrow.</p><h3 name=\"6590\" id=\"6590\" class=\"graf graf--h3 graf-after--p\">Get Dressed, Wear&#160;Shoes</h3><p name=\"2c8b\" id=\"2c8b\" class=\"graf graf--p graf-after--h3\">I&#8217;ve always found this a really simple thing that has really helped me. Getting dressed as if I was going to an office before getting to my work area allows me to feel like I&#8217;m going to work, rather than just lounging around my apartment as I would on my day off. I&#8217;m going to work, I may not be leaving the house, but I wouldn&#8217;t go to work without getting dressed.</p><h3 name=\"41ac\" id=\"41ac\" class=\"graf graf--h3 graf-after--p\">Manage your Distractions</h3><p name=\"05bb\" id=\"05bb\" class=\"graf graf--p graf-after--h3\">There are so many distractions around when you work from home. TV, gaming consoles, Twitter, emails, articles (like you are reading right now. Go back to work and read this later!). As I&#8217;ve mentioned, all of these things will still be there when you&#8217;re done with work and you must remember that. Save articles for later, put your Xbox in the attic (a <a href=\"https://twitter.com/darylginn\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">friend of mine</a> has done this), turn off your phone and notifications.</p><p name=\"aa6a\" id=\"aa6a\" class=\"graf graf--p graf-after--p\">Get your work done and then reward yourself with these things, rather than letting them creep into your work cycle. For example, every time you spend 2 hours working, have a short time doing something you enjoy. This will help to set up a positive loop wherein you associate completing your goals with getting to do these things you want to do, while also making it so they don&#8217;t distract you when you should be hitting those goals.</p><p name=\"7d8d\" id=\"7d8d\" class=\"graf graf--p graf-after--p\">Be accountable for yourself, your team and your clients. You know that there are people waiting on you and your work. That the work needs to be done and that you can&#8217;t let the distractions get in the way of that.</p><h3 name=\"af78\" id=\"af78\" class=\"graf graf--h3 graf-after--p\">Sometimes It Won&#8217;t Be&#160;Fun</h3><p name=\"581a\" id=\"581a\" class=\"graf graf--p graf-after--h3\">I&#8217;ve had days where I&#8217;ve had to shout at myself to &#8220;get in the office and do some fucking work&#8221;. Sometimes you need to be tough on yourself. There are no bosses in your home other than yourself and you need to be able to self motivate, learn what it is that motivates you and use it to get you in that work space and hit the goals.</p><p name=\"2772\" id=\"2772\" class=\"graf graf--p graf-after--p\">You can&#8217;t become too comfortable either. Just because you&#8217;ve had a great week, booked new clients and have the next few months sorted financially, doesn&#8217;t mean you can take half days or slack off. Work hard, even when things are difficult and all of these things will become a habit and you will see the rewards. Sometimes that&#8217;s going to be hard and it won&#8217;t be fun. But stick to your end goals and work towards them, make sure you keep a hold of your schedule and use that to make you a more free person outside of work and you&#8217;ll never have to worry about deadlines, as you already know they&#8217;ve been hit. The structure and routine you will build is the key to this.</p><p name=\"3739\" id=\"3739\" class=\"graf graf--p graf-after--p graf--trailing\">You should be positive about your work and affirm yourself and others. When you or someone else does something positive, tell them or reward yourself. Set up that positive loop I mentioned earlier and it will help you and others to remain motivated and continue to do great things.</p></div>","title":"How I’ve Been More Productive Working Remotely From Home"}},"pageContext":{"id":"5b93831287be056953db7e24"}}