{"data":{"mongodbDatabaseArticles":{"id":"5b92397487be0583cfde6806","content":"<div><p></p><img class=\"size-full wp-image-21014\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/05/serbia-fastest-growing-passport.jpg\" alt=\"Serbia has the world's most improved passport\" width=\"700\" height=\"467\"><p>Dateline: Belgrade, Serbia</p>\n<p>For those of us born with western, developed country passports, visa-free travel has never been much of an issue.</p>\n<p>That fact alone is why most US or western citizens would ask &#8220;<a href=\"http://www.nomadcapitalist.com/second-passport/\">why do you need a second passport?</a>&#8220;, ignoring the options that having dual citizenship offers.</p>\n<p>Sure, getting a visa as a US citizen looking to visit Brazil is a bureaucratic pain. Ditto for most of us who want to visit Russia. And while there are other random countries that make it challenging to get a visa or e-visa in order to visit, having a US or Canadian or Australian or European passport has been a ticket to a life of easy travel.</p>\n<p>However, I often compare countries with seemingly everything going on with an advanced location on a Bell Curve. Sure, a US passport offers a lot of travel opportunities, but it also offers a lot of hassles, from citizenship-based taxation to <a href=\"http://nomadcapitalist.com/2014/06/10/fatca-new-irs-penalties-offshore-accounts/\">FATCA</a> to <a href=\"http://nomadcapitalist.com/2014/06/23/foreign-corrupt-practices-act-concerned/\">FCPA</a> to OFAC.</p>\n<p>Also, because they are so good for visa-free travel now, most western passports have nowhere to go but down. The US passport in particular may decrease in value in coming years, with the European Union <a href=\"http://www.foxnews.com/travel/2017/03/17/do-us-citizens-really-need-visa-to-travel-through-europe-this-summer.html\" target=\"_blank\" rel=\"noopener\">threatening</a> to require Americans to apply for tourist visas, and now even Mexico suggesting that US citizens should pay to visit if <a href=\"http://nomadcapitalist.com/2016/02/19/trumps-border-wall-why-americans-never-threaten-to-move-to-mexico/\">Trump continues this talk</a> of building a wall.</p>\n<p>For example, the EU Parliament warned five countries &#8211; the US, Australia, Canada, Japan, and Brunei &#8211; to issue full reciprocity for visa-free travel. By that, they meant that if citizens of those countries could visit the European Union, then all European Union citizens should be able to visit those countries.</p>\n<p>The United States is one of three countries (one a dictatorship) to thumb their nose at that demand, and is now in violation of the EU&#8217;s reciprocity policy and has been recommended to be removed from visa-free travel.</p>\n<p>&#160;</p>\n<h2>Your visa-free travel at risk</h2>\n<p>&#160;</p>\n<p>Now, I seriously doubt that Europe will require Americans to get visas, it does go to show that if your country negotiates in bad faith, you could suffer the consequences through your passport.</p>\n<p>Recently, I was speaking to one of my closest contacts about why more small countries don&#8217;t offer visa-free travel to each other. What would be the harm, I suggested, of Armenia and <a href=\"https://www.cia.gov/library/publications/the-world-factbook/geos/es.html\" target=\"_blank\" rel=\"noopener\">El Salvador</a> allowing each other free travel. Any Armenian with enough money to fly halfway around the world probably isn&#8217;t going to choose El Salvador to <a href=\"http://nomadcapitalist.com/2013/06/03/the-best-non-extradition-countries-to-be-invisible/\">illegally immigrate to</a>.</p>\n<p>Her answer was interesting: visa-free travel is a bargaining chip, and not one countries want to give away. And I think she is right.</p>\n<p>The United States, for all of its negotiating might, does a terrible job at negotiating visa-free travel for its citizens. Of the top ten countries that receive <a href=\"https://en.wikipedia.org/wiki/United_States_foreign_aid\" target=\"_blank\" rel=\"noopener\">US foreign aid</a>, four of them require that US citizens obtain a visa or e-visa in advance, or pay a fee upon arrival.</p>\n<p>You would think it could be a pretty standard condition of any foreign aid negotiation to say &#8220;anyone who gets money from US has to let our citizens visit&#8221;, but I suppose the US is too busy negotiating military bases or other stuff. Ironically, what they are negotiating for (ie: the military) is the costly stuff that results in the need for citizenship-based taxation. It&#8217;s a vicious cycle.</p>\n<p>Countries like South Africa are using their citizens&#8217; need to obtain visas for most countries as a bargaining chip as well, recently <a href=\"https://www.immigration.govt.nz/about-us/media-centre/news-notifications/visa-changes-for-south-african-nationals\" target=\"_blank\" rel=\"noopener\">firing a warning shot</a> by ending visa-free travel for New Zealanders and threatening to do so to Americans and Europeans as well.</p>\n<p>&#160;</p>\n<h2>The world&#8217;s fastest-growing passport</h2>\n<p>&#160;</p>\n<p>The reality is that the United States, nor any other western country, is not the fastest growing passport. That&#8217;s no surprise, as there is plenty of room for restrictions to be added, but not much room for growth.</p>\n<p>However, the world&#8217;s fastest-growing passport is from a country you likely wouldn&#8217;t expect: <strong>Serbia</strong>.</p>\n<p>The government here in Serbia has done an excellent job negotiating increased visa-free travel over the last decade. We learned this when studying various passport indexes to create our own <a href=\"http://www.nomadcapitalist.com/nomad-passport-index/\">Nomad Passport Index</a> earlier this year.</p>\n<p>In general, visa-free travel across countries is increasing. Europe&#8217;s Schengen Area has added 19 so-called &#8220;Annex Level II&#8221; countries to its visa-free travel list in just the last two years alone, and a good chunk of the 61 countries that can visit Europe without a visa was added after 2000.</p>\n<p>That&#8217;s the reason that citizens of countries from Peru to Georgia to Timor-Leste can visit Europe with the same visa-free privileges as US, Canadian, and Australian citizens. You can learn more about Schengen visa-free travel by <a href=\"https://www.youtube.com/watch?v=sdp4uEHrsWU\" target=\"_blank\" rel=\"noopener\">watching this video</a>.</p>\n<p>&#160;</p>\n<h2>What makes a Serbian passport good?</h2>\n<p>&#160;</p>\n<p>Serbia obtained visa-free travel to Europe back in 2009, alongside Montenegro and Macedonia. However, the Serbian passport has taken off substantially since then.</p>\n<p>For one thing, Serbia is one of only <a href=\"https://en.wikipedia.org/wiki/Visa_requirements_for_Serbian_citizens\" target=\"_blank\" rel=\"noopener\">three countries</a> on Earth whose citizens can visit Europe, Russia, and China without a visa. (The other two are <a href=\"http://nomadcapitalist.com/2016/03/11/10-powerful-passports-africa/\">Mauritius and Seychelles</a>.)</p>\n<p>Consider that getting a Russian visa can be a major pain and that getting a Chinese visa is a minor pain and you have two great benefits right away. No developed western country that I know of can skip the visa queue for Russia, and only San Marinese citizens can do so for China.</p>\n<p>Around the same time that Serbia was negotiating its visa policies with Russia and the EU, they were also getting free access to Israel.</p>\n<p>Next came Turkey, a country which requires US, and some EU citizens, to get an extremely easy e-visa in advance, at a cost of $20.</p>\n<p>Next came Ukraine, Kazakhstan, Brazil, and Moldova. Then came Japan, a notoriously hard country for <a href=\"http://nomadcapitalist.com/2017/01/22/tier-b-passport-travel-benefits/\">Tier B and Tier C</a> passport countries to visit. Last year, Serbians also gained access to Indonesia, which recently opened up its doors to practically everyone, including even Comorians.</p>\n<p>In addition, the former Yugoslavia visa treaties that allow visa-free travel to hard-to-come-by places like Cuba and Tunisia are still in force.</p>\n<p>And, according to various news articles and Wikipedia, Serbia is finalizing deals with Azerbaijan, Colombia, Guatemala, Jamaica, Panama, Paraguay, Qatar, Kuwait, Oman, Bahrain and Venezuela. Most of those countries are rather difficult even for some western citizens, so adding travel to those countries will be a real boon for the Serbian passport.</p>\n<p>So&#8230;</p>\n<p>&#160;</p>\n<h2>Where can&#8217;t you go as a Serbian?</h2>\n<p>&#160;</p>\n<p>Basically, the same places very few citizens can go: the United States, Canada, the UK, Ireland, and New Zealand. These English-speaking countries are off-limits to most economic citizens as well as almost any Tier B or Tier C passport. Sadly, these countries also have the most burdensome visa requirements, which often include writing letters and sending blood samples.</p>\n<p>(Just kidding on the second part.)</p>\n<p>While Serbia&#8217;s western European neighbors such as the UK have hinted at visa liberalization in the past, it hasn&#8217;t happened. However, if the Anglophone countries aren&#8217;t your thing, you&#8217;ll do just fine with a Serbian passport, and I expect things to get even better.</p>\n<p>The reason is simple: not only has Serbia had lots of room to rise after the break-up of Yugoslavia, but their approach to foreign affairs has been a positive one. They want to repair their tarnished image and have taken a proactive approach few other countries have.</p>\n<p>While countries like the US are resting on their laurels and their ambassadors are sipping tea at the Four Seasons, Serbia&#8217;s government has been negotiating deals for its citizens to travel all over the world.</p>\n<p>You have to respect that.</p>\n<p>Once all proposed deals are ratified, Serbian citizenship will be an excellent asset to have.</p>\n<p>&#160;</p>\n<h2>Here&#8217;s the Problem&#8230;</h2>\n<p>&#160;</p>\n<p>You can&#8217;t easily get a Serbian passport. I recently came across a few websites promising &#8220;economic citizenship in Serbia&#8221; for a measly 100,000 euros.</p>\n<p>While there is no formal citizenship by investment program in Serbia, I figured it was possibly a &#8220;gray market&#8221; passport program whereby someone had an inside track with the President. The President here can naturalize anyone he wants, as evidenced by his granting of Serbian citizenship <a href=\"https://www.theguardian.com/culture/2016/jan/11/steven-seagal-serbian-citizenship-martial-arts-school\" target=\"_blank\" rel=\"noopener\">to Steven Seagal</a> awhile back.</p>\n<p>My lawyers here have confirmed that there is no legitimate path to become a citizen here quickly, short of personally convincing the President that you&#8217;re worth it.</p>\n<p>Otherwise, you would need to follow the typical path of obtaining residency, spending some time here, and working toward naturalization. The process takes anywhere from five to ten years depending on your &#8220;reason for immigration&#8221;, although you can <a href=\"http://nomadcapitalist.com/2014/09/12/second-citizenships-can-get-marrying-a-foreigner/\">marry a Serbian</a> and become a citizen in as little as three years.</p>\n<p>&#160;</p>\n<h2>The Bottom Line</h2>\n<p>&#160;</p>\n<p>Some of the world&#8217;s &#8220;Tier B&#8221; passports are improving in a big way. As you know from reading this blog, the world is changing. No longer is the United States the be-all and end-all admired by all.</p>\n<p>Today, countries like Serbia are middle-income countries that don&#8217;t want to rely on western sympathy and are building their economies and with it, their passports.</p>\n<p>Serbia is just another example of why getting a good Tier B second passport is a better option in my opinion than many EU citizenships. The potential tax consequences in big western countries are only going to become more draconian in coming years, and their passports can&#8217;t get any better.</p>\n</div>","title":"This is the fastest improving passport in the world"}},"pageContext":{"id":"5b92397487be0583cfde6806"}}