{"data":{"mongodbDatabaseArticles":{"id":"5b92488787be056953db7baf","content":"<div><p>Instead of paying $150 getting Apple TV to watch Netflix on your TV, there's a cheaper and better way. Especially if you're moving around a lot and are a minimalist that doesn't want to buy and carry more stuff. How? Use your iPhone!</p> <p>Not many people know this but your iPhone is able to feed its screen to any TV or display with an HDMI port. This feature was primarily built for developers to demo apps on big screens, but it's super useful for watching films, series and even gaming. You always have your iPhone on you, so that's another reason to just use it for that too.</p> <p>You need some extra accessories to do it though. If you go with official Apple stuff, you'll pay $70. If you get the cheap non-Apple stuff, you'll pay $12.50.</p> <img src=\"/wp-content/uploads/2016/01/Untitled-1.png\" alt=\"Untitled-1\" width=\"2048\" height=\"1024\" class=\"alignnone size-full wp-image-5339 responsively-lazy\"> <p>Get an <a href=\"http://www.apple.com/shop/product/MD826AM/A/lightning-digital-av-adapter\">Apple HDMI dongle</a> for your iPhone for $50 (or get a cheap Chinese one for less than $10):</p> <img src=\"/wp-content/uploads/2016/01/Screenshot-2016-01-11-17.50.43.png\" alt=\"Screenshot 2016-01-11 17.50.43\" width=\"2042\" height=\"1202\" class=\"alignnone size-full wp-image-5338 responsively-lazy\"> <p>Get a 2 meter or longer <a href=\"http://www.apple.com/shop/product/MC838LL/B/apple-hdmi-to-hdmi-cable-18-m\">HDMI cable</a> for $19.00 at Apple (honestly any HDMI cable will work, so you can also get a $2.50 one):</p> <img src=\"/wp-content/uploads/2016/01/Screenshot-2016-01-11-18.02.34.png\" alt=\"Screenshot 2016-01-11 18.02.34\" width=\"1962\" height=\"1152\" class=\"alignnone size-full wp-image-5344 responsively-lazy\"> <p>You've now got something awesome. Here's my set up.</p> <img src=\"/wp-content/uploads/2016/01/IMG_2016-01-11-214945.jpg\" alt=\"IMG_2016-01-11 21:49:45\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-5354 responsively-lazy\"> <p>You can connect your iPhone's screen to any TV with an HDMI port. Buying a long cable (2m+) is useful because it means you'll be able to chill out on the bed or couch while controlling your iPhone (and what's on the screen). Also, you can charge it while it's playing as the dongle has an extra Lightning port.</p> <img src=\"/wp-content/uploads/2016/01/IMG_2016-01-11-214940.jpg\" alt=\"IMG_2016-01-11 21:49:40\" width=\"960\" height=\"1280\" class=\"alignnone size-full wp-image-5353 responsively-lazy\"> <p>How about sound? Well, the sound goes THROUGH the HDMI cable TOO! WOW SO 2016! FUCK SCART CABLES!</p> <p>Now, if you have everything ready, install Netflix on your iPhone. And go watch something. I think <a href=\"//www.netflix.com/title/80000770\">Making a Murderer</a> is hot now. Oh and Narcos, doh! :P</p> <img src=\"/wp-content/uploads/2016/01/IMG_2016-01-11-214908.jpg\" alt=\"IMG_2016-01-11 21:49:08\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-5350 responsively-lazy\"> <p>How about the quality? Well it looks terrific. No idea how they do it. But it actually looks better than connecting my MacBook Pro to a TV. I think the iPhone auto selects the right resolution for the TV and that makes everything looks very clear and sharp. How about performance? Also super smooth, just as smooth as you'd watch on your iPhone.</p> <img src=\"/wp-content/uploads/2016/01/IMG_2016-01-11-214921.jpg\" alt=\"IMG_2016-01-11 21:49:21\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-5351 responsively-lazy\"> <p>Now here's the BEST part and why it's superior to Apple TV. If you're not blessed to be born in the US where Netflix's content offering is biggest, or you're moving around the world a lot, you'll want to use a VPN to access Netflix US from anywhere. Apple TV doesn't support VPN services. You'll have to hack your router. Too much hassle. So, use your iPhone's built-in VPN capabilities. I use <a href=\"//www.tunnelbear.com/\">Tunnelbear VPN</a> for iOS which works flawlessly and is just $5/m.</p> <img src=\"/wp-content/uploads/2016/01/IMG_2016-01-11-214951.jpg\" alt=\"IMG_2016-01-11 21:49:51\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-5349 responsively-lazy\"> <p>It's not limited to Netflix though (obviously). Most streaming services that have apps for Apple TV (like Amazon Prime), have apps for iPhone too. Most apps on Apple TV in general are also available for iPhone:</p> <img src=\"/wp-content/uploads/2016/01/0828_appletv_1200.jpg\" alt=\"0828_appletv_1200\" width=\"1200\" height=\"800\" class=\"alignnone size-full wp-image-5361 responsively-lazy\"> <p>Admittedly the controls on iPhone might be slightly inferior, but then again you can hold your iPhone in your hand.</p> <p>This is awesome for me as whenever I want to watch something, I simply connect the cable to whatever device I see that has HDMI, whether it's in a hostel, hotel or apartment. It makes the sometimes lonely nights of travel somewhat more bearable.</p> <p>What's the next iteration of this? Probably get a cheap Chinese HDMI stick you can plug into any TV that connects to WiFi and lets you AirPlay your iPhone to it directly. But then it'd have to be as cheap as $12.50 to be as affordable as this solution :)</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How to use your iPhone as a better Apple TV alternative (with VPN)"}},"pageContext":{"id":"5b92488787be056953db7baf"}}