{"data":{"mongodbDatabaseArticles":{"id":"5b9382e887be056953db7e08","content":"<div><h1 name=\"592e\" id=\"592e\" class=\"graf graf--h3 graf--leading graf--title\">Book Review: &#8220;Remote: Office Not Required&#8221;</h1><p name=\"d87d\" id=\"d87d\" class=\"graf graf--p graf-after--h3\">I recently read <a href=\"https://www.amazon.com/gp/product/0804137501/ref=oh_aui_detailpage_o02_s01?ie=UTF8&amp;psc=1\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Remote: Office Not Required</a> by Jason Fried and David Heinemeier Hansson. I thought it&#8217;d be great to see if I was working remotely the right way and pick up tips to improve if I wasn&#8217;t. I&#8217;ll be sharing a few thoughts from the book in this article. The two most important things which stood out to me and constantly reoccurred throughout all the chapters, sometimes indirectly, were trust and communication. Our entire software team is structured around these as we don&#8217;t have constant remote surveillance. Everyone trusts the other to show up everyday and pick up the phone.</p><h4 name=\"78e8\" id=\"78e8\" class=\"graf graf--h4 graf-after--p\">First chapter: The time is right for remote&#160;work</h4><p name=\"54dc\" id=\"54dc\" class=\"graf graf--p graf-after--h4\">All the benefits of remote work were listed here e.g. The time and money saved from no/less commute, the opportunity for employees to live and work from anywhere while living their dreams, companies&#8217; access to talent from any part of the world while saving money at the same time.</p><p name=\"ed7d\" id=\"ed7d\" class=\"graf graf--p graf-after--p\">I already knew what came with the package so there were no surprises here. All the points I listed above were the good parts though. A few aspects of remote work are not so rosy. It&#8217;s not quite easy getting used to not seeing coworkers in person, a lot of personal discipline is required and a dedicated room for work is recommended. I&#8217;m sure I have more challenges with a good internet connection and stable power supply than a remote worker from another part of the world because, Nigeria. &#128542;</p><h4 name=\"da8b\" id=\"da8b\" class=\"graf graf--h4 graf-after--p\">Second chapter: Dealing with&#160;excuses</h4><p name=\"566f\" id=\"566f\" class=\"graf graf--p graf-after--h4\">Although very relevant, this chapter didn&#8217;t speak to me. It lists all the excuses companies might have against remote work. I felt there was no need to sell remote work to me/my company since they already practice it heavily.</p><p name=\"c5df\" id=\"c5df\" class=\"graf graf--p graf-after--p\">They know that magic doesn&#8217;t need to happen only when people are in the same room. They know the value of flying people in together at least once a year. We have a lot of different tools for communication and they know talent isn&#8217;t bound by hubs.</p><h4 name=\"b696\" id=\"b696\" class=\"graf graf--h4 graf-after--p\">Third chapter: How to collaborate remotely</h4><p name=\"cc27\" id=\"cc27\" class=\"graf graf--p graf-after--h4\">Annyce and I are the only Android developers and we have a five-hour time difference between us. To be able to achieve overlap hours, I sometimes start work by 10 AM or 11 AM my time. All my meetings happen in the late afternoon and evening so I usually leave the mornings for focus work.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*jrjT3tkGXjRYRimKqIx9Wg.jpeg\">Work from home, they said&#160;:)<p name=\"ad5b\" id=\"ad5b\" class=\"graf graf--p graf-after--figure\">Some of our collaboration tools include <a href=\"https://github.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Github</a>, <a href=\"https://www.atlassian.com/software/jira\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Jira</a>, <a href=\"https://slack.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Slack</a>, <a href=\"https://gsuite.google.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Google Calendar and Drive</a>, <a href=\"https://www.dropbox.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Dropbox</a>, <a href=\"https://zeplin.io/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Zeplin</a>, <a href=\"https://marvelapp.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Marvel</a> and <a href=\"https://zoom.us/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Zoom</a>.</p><p name=\"129b\" id=\"129b\" class=\"graf graf--p graf-after--p\">My typical workday starts by checking my calendar for any meetings. I note the times if there are any and start preparing or start thinking about items I might need. I also check Slack for any conversations from the previous day and respond to all that need my attention. Next, I check Github for any pending PRs. I usually take my time with this, but I always aim to review them before Annyce starts her own day so that I&#8217;m not a blocker. I then do a <a href=\"https://tech.offgrid-electric.com/geekbot-distributed-daily-standup-done-right-439b7b8cd9d6\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Standup with Geekbot on Slack</a> and start work.</p><h4 name=\"e268\" id=\"e268\" class=\"graf graf--h4 graf-after--p\">Fourth chapter: Beware the&#160;dragons</h4><p name=\"969c\" id=\"969c\" class=\"graf graf--p graf-after--h4\">Cabin fever is real. My longest streak for being cooped up indoors is seven days. To combat this, I sometimes join a local running group. I also change my location and work from a coffee shop instead.</p><p name=\"a09c\" id=\"a09c\" class=\"graf graf--p graf-after--p\">There are a lot of chances of overworking especially when no commute is required. When this happens, they think it&#8217;s best for me to decide if I have achieved a good day&#8217;s work and stop at that point.</p><h4 name=\"1124\" id=\"1124\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Fifth chapter: Hiring and keeping the&#160;best</strong></h4><p name=\"35b5\" id=\"35b5\" class=\"graf graf--p graf-after--h4\">I used to have a lot of anxiety about my work when I first joined and some things took longer than necessary. Even a one-liner change required knowing which exact file to change, understanding what code structure already exists and following that with every PR submitted. I became more familiar with the codebase as time went on.</p><p name=\"7b97\" id=\"7b97\" class=\"graf graf--p graf-after--p\">The tone of messages, <a href=\"https://mtlynch.io/human-code-reviews-1/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">especially in code reviews</a> is very important here and I think Annyce should win a medal for this. Don&#8217;t you think comments would come off as non-accusatory when we rephrase them as questions?</p><h4 name=\"3f17\" id=\"3f17\" class=\"graf graf--h4 graf-after--p\">Sixth chapter: Managing remote&#160;workers</h4><p name=\"24b8\" id=\"24b8\" class=\"graf graf--p graf-after--h4\">OGE knows the value of bringing all the team members together and I was really bummed that I missed the opportunity to meet all the members of my team at a company conference recently. It&#8217;s definitely great that I meet up with Annyce at conferences now. &#128513;</p><p name=\"8ca1\" id=\"8ca1\" class=\"graf graf--p graf-after--p\">It also helps that I follow some of my colleagues on social media. It exposes a bit of their personality outside of Slack. One-on-ones also help. Mine is a chance for my manager to catch up with what&#8217;s happening with me.</p><h4 name=\"5d00\" id=\"5d00\" class=\"graf graf--h4 graf-after--p\">Seventh chapter: Life as a remote&#160;worker</h4><p name=\"1e84\" id=\"1e84\" class=\"graf graf--p graf-after--h4\">I actually don&#8217;t feel like working on some days. I usually change my environment and work from somewhere different instead. Or, I just start and trust that I&#8217;ll get into the flow soon enough. On other days, I can&#8217;t stop thinking of work and can&#8217;t wait to get back to it. That&#8217;s where the danger of overworking lies.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*t62p59MFzwCia8qhJuLkhQ.jpeg\"><p name=\"5bf7\" id=\"5bf7\" class=\"graf graf--p graf-after--figure\">The authors wrote about having a daily routine but I don&#8217;t have that. I only have a different room for work although I work from my bed on days I decide not to adult. &#129335;&#127997;&#8205;</p><h4 name=\"7830\" id=\"7830\" class=\"graf graf--h4 graf-after--p\">Conclusion</h4><p name=\"c200\" id=\"c200\" class=\"graf graf--p graf-after--h4 graf--trailing\">I think this book was a good read and it did a great job of highlighting all the things to know about remote work. Have you read Remote? Do you work remotely from Nigeria or some other part of the world? I&#8217;d love to hear your thoughts in the comments below.</p></div>","title":"Book Review: “Remote: Office Not Required” – Power the People"}},"pageContext":{"id":"5b9382e887be056953db7e08"}}