{"data":{"mongodbDatabaseArticles":{"id":"5b95eafb87be05832748ffea","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/nontravelbooks3.jpg\" alt=\"A spacious library full of books\"><br> I read many different kinds of books. It&#8217;s not all travel. Last month, <a href=\"https://www.nomadicmatt.com/travel-blogs/best-travel-books-2017/\" target=\"_blank\" rel=\"noopener\">I shared some of my recent favorite travel books</a>. This month, I wanted to share the non-travel books that have had the most impact on my life and feel have made me a better person. These created paradigm shifts in my thinking. They just made me go &#8220;Ohh damn!&#8221; They got to interested in new ideas, literature, personal development, and so much more.</p><p>If you&#8217;re looking to improve your life, change a habit, expand your mind, or just want something interesting to read, here are twelve of the most influential books in my life:</p><h3><a href=\"http://amzn.to/2ssYhc3\" target=\"_blank\" rel=\"noopener\">7 Habits of Highly Effective People</a>, by Stephen R. Covey</h3><p><a href=\"http://amzn.to/2ssYhc3\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624952/content_7habitsofhighlyeffectivepeople.jpg\" alt=\"book cover of the 7 Habits of Highly Effective People by Stephen R. Covey\" width=\"180\"></a>One of the most famous books in the world, this book taught me habits to create a better lifestyle including planning out your week, sleeping more, being proactive in life, the importance of creating win-win situations, and the importance of continuous improvement. It articulated the small things I forget to do to make me a more organized and thoughtful person. If you haven&#8217;t read it, you really must! This book will help you become less mindless in your actions and more thoughtful overall. Even if you pick up just one tip to better organize your life in this chaotic world, it will be worth it.<br> &#160;</p><h3><a href=\"http://amzn.to/2tw2BWC\" target=\"_blank\" rel=\"noopener\">The Power of Habit</a>, by Charles Duhigg</h3><p><a href=\"http://amzn.to/2tw2BWC\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624953/content_thepowerofhabit.jpg\" alt=\"cover for The Power of Habit by Charles Duhigg\" width=\"180\"></a>Why do we do what we do? Are we hard-wired to repeat habits, even when they are bad? How do we break them and form good ones? This bestselling book discusses how we form habits and gives specific strategies about how to break the bad ones and start good ones. It really made me think about the negative habits in my life, why I keep doing them, and how I can change that. I started thinking of all the excuses I tell myself that keep negative habits in my life. Because of this book, I started sleeping at a more regular time, reading again, drinking less, and being more productive. I can&#8217;t recommend it enough.<br> &#160;</p><h3><a href=\"http://amzn.to/2ssC8ux\" target=\"_blank\" rel=\"noopener\">Titan</a>, by Ron Chernow</h3><p><a href=\"http://amzn.to/2ssC8ux\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624954/content_titan.jpg\" alt=\"image of the non-travel book called Titan by Ron Chernow\" width=\"180\"></a>The biography of J.D. Rockefeller and his rise to power is long, dense, and worth every second. Rockefeller was a fascinating man &#8211; ruthless in business yet a devout Christian who founded some the biggest universities and health institutions the world has even seen. While I have no desire to be as ruthless as him, this biography was a good lesson in how frugality, slowness, and thoughtfulness can lead to success in life and business. J.D. never moved quickly, was financially conservative, and always reinvested in his company business. His methodical thinking made me rethink how I made business decisions.<br> &#160;</p><h3><a href=\"http://amzn.to/2sW8dwi\" target=\"_blank\" rel=\"noopener\">Losing My Virginity</a>, by Richard Branson</h3><p><a href=\"http://amzn.to/2sW8dwi\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624956/content_losingmyvirginity.jpg\" alt=\"book called Losing My Virginity by Richard Branson\" width=\"180\"></a>Richard Branson&#8217;s autobiography was super interesting (this guy does a lot of insane things) and it inspired me to create my non-profit (<a href=\"http://www.takeflyte.org\" target=\"_blank\" rel=\"noopener\">FLYTE</a>). I&#8217;d been thinking about it for years but reading how Branson just went for things he believed in and worked out the details later inspired me. It&#8217;s in stark contrast to Rockefeller, but Branson&#8217;s &#8220;why wait?&#8221; philosophy on starting projects makes a lot of sense. There&#8217;s never going to be a perfect time to start something so why wait? Just like there&#8217;s no perfect moment to travel, there&#8217;s no perfect moment to do something great. Just take the leap!<br> &#160;</p><h3><a href=\"http://amzn.to/2ssQISQ\" target=\"_blank\" rel=\"noopener\">How to Win Friends and Influence People</a>, by Dale Carnegie</h3><p><a href=\"http://amzn.to/2ssQISQ\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624958/content_howtowinfriends.jpg\" alt=\"book image for How to Win Friends and Influence People by Dale Carnegie\" width=\"180\"></a>Dale Carnegie&#8217;s multi-decade old, but still relevant, book was instrumental in helping me shut my mouth. Ignoring the sensational title, this book ties heavily into what the <a href=\"http://amzn.to/2ssYhc3\">7 Habits of Highly Successful People</a> says about listening to when people talk, not being a know it all, and empathizing with others as a way to connect and then influence them. As an introverted person (see <a href=\"http://amzn.to/2rXFIsT\">Quiet</a> below), this book helped me learn to talk to people better&#8230;not in a Machiavellian way but in a way that made me better at handling social situations.<br> &#160;</p><h3><a href=\"http://amzn.to/2rXFIsT\" target=\"_blank\" rel=\"noopener\">Quiet</a>, by Susan Cain</h3><p><a href=\"http://amzn.to/2rXFIsT\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624960/content_quiet.jpg\" alt=\"favorite book is Quiet: The Power of Introverts in a World That Can't Stop Talking by Susan Cain\" width=\"180\"></a>I&#8217;m an introvert in an extroverted world. I would rather read books and sit by myself than be at a big party filled with strangers. I know that sounds weird since I travel all the time and meet people but when I&#8217;m with my friends, I get social anxiety about meeting strangers. This renowned book looks at why the world is so extroverted, how that affects us, and lessons for dealing with both introverts and extroverts. As I read through it, I saw myself in the author&#8217;s examples and her author&#8217;s lessons on balancing your inner and outer space helped me deal with my social anxiety.<br> &#160;</p><h3><a href=\"http://amzn.to/2rXCTIf\" target=\"_blank\" rel=\"noopener\">What Got You&#160;Here Won&#8217;t Get You There</a>, by Marshall Goldsmith</h3><p><a href=\"http://amzn.to/2rXCTIf\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624961/content_whatgotyouhere.jpg\" alt=\"yellow cover for What Got You&#160;Here Won&#8217;t Get You There: How Successful People Become Even More Successful by Marshall Goldsmith\" width=\"180\"></a>Written by a management consultant, this book is a guide for executives to become better managers. However, it&#8217;s much more than that. It&#8217;s a book on how to listen, behave, and think better. Its premise is that if you want to jump up to the next station in life, you&#8217;ll need a different set of skills &#8211; not educational skills &#8211; but interpersonal skills. Successful people interact well with others and this book talks about the small things, like looking at your phone during lunch or multitasking at a meeting, that send signals to people you&#8217;re not really there. This book got me to focus on my relationships more.<br> &#160;</p><h3><a href=\"http://amzn.to/2sswZCC\" target=\"_blank\" rel=\"noopener\">Mindless Eating</a>, by Brian Wansink, Ph.D.</h3><p><a href=\"http://amzn.to/2sswZCC\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624962/content_mindlesseating.jpg\" alt=\"book cover for Mindless Eating: Why We Eat More Than We Think by Brian Wansink\" width=\"180\"></a>Every day we consume food but how aware are we when it comes to what we eat? This book illuminates the insidious ways society creeps in larger portions and mindless eating habits on us that make us gain weight and develop bad skills. This isn&#8217;t a book that&#8217;s going to just tell you to eat healthier, it shows all the ways society and commercials indoctrinate us to subconsciously eat more food, from growing plate sizes to bulk shopping to &#8220;super sizing it.&#8221; This book changed how I think about food, consume food, and guard against the insidious nature of calorie creep! I&#8217;ve stopped my mindless eating and have been a lot healthier since.<br> &#160;</p><h3><a href=\"http://amzn.to/2sXUftj\" target=\"_blank\" rel=\"noopener\">The 48 Laws of Power</a>, by Robert Greene</h3><p><a href=\"http://amzn.to/2sXUftj\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624963/content_the48lawsofpower.jpg\" alt=\"image of The 48 Laws of Power by Robert Greene\" width=\"180\"></a>Written by legendary writer Robert Greene, this book features 48 rules for living a masterful, powerful life. It features historical examples that reinforce the rules and what happens to those who break them. Slightly Machiavellian, I&#8217;ve found these &#8220;laws&#8221; helpful in dealing with my business, strangers, and situations where it is good to have the upper hand (like when you want to argue a bill with Comcast). I find these tips to be more helpful in a workplace environment than in everyday life (mostly because I have no desire to &#8220;rule&#8221; people or manipulate my friends). It&#8217;s oddly very stoic in parts. This book made me think more strategically in my life.<br> &#160;</p><h3><a href=\"http://amzn.to/2tQbtWb\" target=\"_blank\" rel=\"noopener\">Fast Food Nation</a>, by Eric Schlosser</h3><p><a href=\"http://amzn.to/2tQbtWb\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624964/content_fastfoodnation.jpg\" alt=\"cover for Fast Food Nation: The Dark Side of the All-American Meal by Eric Schlosser\" width=\"180\"></a>When I was in college, a friend handed me this book and, after reading it, I became a vegetarian. Actually, I tried going organic but, in 2002, organic was even more expensive than it is now. This book opened up my eyes to the crap we put in food, the horrible conditions animals live in, and how poorly we treat food workers. Organic, locally grown, and sustainable are all buzzwords these days, and while people are definitely more conscious of what they eat, I still feel like we are too far removed from the farm. Understanding where our food comes from is essential in changing how we eat and this book did just that&#8230;and still does thirteen years later. Making better food choices leads to a happy, healthier life.<br> &#160;</p><h3><a href=\"http://amzn.to/2sWtztt\" target=\"_blank\" rel=\"noopener\">The Ecology of Commerce</a>, by Paul Hawken</h3><p><a href=\"http://amzn.to/2sWtztt\" target=\"_blank\" rel=\"noopener\"><img src=\"https://convertkit.s3.amazonaws.com/assets/pictures/4134/624965/content_theecologyofcommerce.jpg\" alt=\"book titled The Ecology of Commerce: A Declaration of Sustainability by Paul Hawken\" width=\"180\"></a>When I was still working in a cubicle, I did a lot of volunteer work with the environmental organization, The Sierra Club. I wanted to meld my desire for success with my passion for the environment but I didn&#8217;t think the two were compatible until I read this seminal book on sustainable development. It opened my eyes to the possibility that you could create a business and be environmentally-friendly at the same. More that, it changed my consumer habits, helped me make more environmentally-friendly purchases,&#160;and showed me how I could be less wasteful. It was one of the most influential books I read in my 20s and was the reason I decided to do something that changed the world. I never went into sustainable development, but I like to think this website makes a positive impact in the world.<br> &#160;</p><h3><a href=\"http://amzn.to/2vQNP0L\" target=\"_blank\" rel=\"noopener\">The ONE Thing</a>, by Gary Keller</h3><p><a href=\"http://amzn.to/2vQNP0L\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/theonething.jpg\" alt=\"popular book, The ONE Thing: The Surprisingly Simple Truth Behind Extraordinary Results by Gary Keller\" width=\"180\"></a>You can&#8217;t walk into any bookstore these days without seeing this book prominently displayed. Short a book for a flight, I finally picked it up &#8211; and devoured it. It was excellent, and a really quick and easy read. I loved how he framed everything around asking yourself what is the one thing you can do to make your life better &#8211; daily, weekly, yearly. He hits so many negative aspects of our lives spot on &#8211; multi-tasking, the psychology of switching, to the power of planning and systems. This book reminded me of the things I knew to do but wasn&#8217;t and it was the wake up call I needed to finally do them.<br> &#160;</p><h3><a href=\"http://amzn.to/2uImE38\" target=\"_blank\" rel=\"noopener\">The Checklist Manifesto</a>, by Atul Gawande</h3><p><a href=\"http://amzn.to/2uImE38\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/thechecklistmanifesto.jpg\" alt=\"amazing book titled The Checklist Manifesto: How to Get Things Right by Atul Gawande\" width=\"180\"></a>While this book talks a lot about the systems hospitals and doctors used to reduce medical errors, there is a lot to be extrapolated. There&#8217;s power in checklists; they ensure nothing is missed and help you verify the work that has been done. He even quotes my old boss from when I was working in healthcare (who helped pioneer surgical team processes). Reading this book changed how I view procedures and how this website operates (my team actually has procedure documents for everything we do) but it also gave me the idea to create lists and structures in my own personal life.<br> &#160;</p><h3><a href=\"http://amzn.to/2vlm0MH\" target=\"_blank\" rel=\"noopener\">Les Miserables</a>, by Victor Hugo</h3><p><a href=\"http://amzn.to/2vlm0MH\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/lesmiserables.jpg\" alt=\"classic Les Miserables by Victor Hugo\" width=\"180\"></a>I read this book when I was 14 years old. At the end of class, when we would get five minutes to chat to friends, I&#8217;d take out the unabridged version of this book and get lost in Hugo&#8217;s world. This book made me love reading. It turned me on to the power of the classics. From there it was on to Dumas, Dickens, Austen, and so many other 18th and 19th century writers. I&#8217;d blow through their tomes in school, captivated by their vivid imagery and detailed writing. And, in turn, these books improved my writing, vocabulary, and love of literature.<br> &#160;</p><h3><a href=\"http://amzn.to/2vorMLO\" target=\"_blank\" rel=\"noopener\">When Breath Becomes Air</a>, by Paul Kalanithi</h3><p><a href=\"http://amzn.to/2vorMLO\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/whenbreathbecomesair.jpg\" alt=\"When Breath Becomes Air by Paul Kalanithi\" width=\"180\"></a>At the age of 36, Paul Kalanithi was diagnosed with Stage IV lung cancer. In this beautifully written book, Kalanithi tells his story up until the end (his wife writes the post-script as he did not finish the book before his death). This powerful book (I dare you not to cry) ruminates on what makes life worth living in the face of death. What do you do when you know you don&#8217;t have much time left? We all die but I think most of us never really think about it. It&#8217;s just something that happens far into the future. This book will make you think profoundly about your life and what you prioritize.<br> &#160;</p><h3><a href=\"http://amzn.to/2gLtVet\" target=\"_blank\" rel=\"noopener\">A Farewell to Arms</a>, by Ernest Hemingway</h3><p><a href=\"http://amzn.to/2gLtVet\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/farewelltoarms.jpg\" alt=\"A Farewell to Arms by Ernest Hemingway\" width=\"180\"></a>Ernest Hemingway is my favorite author of all time. Apparently, he was a huge jerk, but he wrote like few others and his writing always moves me. When I was in high school, I read this book and it made me want to be a writer. When I finished it, I said, &#8220;I want to write like that.&#8221; In fact, in tenth grade, I tried to write a novel that was very much like this book simply because I wanted to be like Hemingway and copying him was the best way I could think of to become a successful writer. I had visions of being a young writing prodigy (spoiler: I was not), however, I kept that loving of writing and a few years ago my dream of being author came to fruition. Somewhere a 16-year-old me is smiling. Even if you don&#8217;t want to be a writer, read this book. It&#8217;s one of the best books ever written.</p><p></p>***************So there you have it. These books made me reshape my life &#8211; often in drastic ways &#8211; and I&#8217;ve never once regretted reading them. They are thought-provoking and I encourage you to read them,&#160;if not to at least to see a different perspective on things.<p>So there you have it. These books made me reshape my life &#8211; often in drastic ways &#8211; and I&#8217;ve never once regretted reading them. They are thought-provoking and I encourage you to read them, if not to at least to see a different perspective on things.</p><p><strong>Love to read?</strong> If you&#8217;re a book junkie like I am, <a href=\"https://www.nomadicmatt.com/book-club/\" target=\"_blank\" rel=\"noopener\">join our monthly book club</a> where I send you a list of the best books I&#8217;ve recently read. You&#8217;ll get a list of 3-5 suggested books sent once a month! It&#8217;s free to join! Just enter your name and email below to sign up:</p><p>[ck_form_book_club]</p><p>Find some of my other book recommendations <a href=\"https://www.nomadicmatt.com/travel-blogs/best-books-2016/\" target=\"_blank\" rel=\"noopener\">here</a>, <a href=\"https://www.nomadicmatt.com/travel-blogs/best-books-2015/\" target=\"_blank\" rel=\"noopener\">here</a>, <a href=\"https://www.nomadicmatt.com/travel-blogs/recommended-books-2015/\" target=\"_blank\" rel=\"noopener\">here</a>, or <a href=\"https://www.nomadicmatt.com/travel-blogs/thirteen-travel-books/\" target=\"_blank\" rel=\"noopener\">here</a>! Or, you can sign up for my monthly book club<a href=\"https://www.nomadicmatt.com/book-club/\" target=\"_blank\" rel=\"noopener\"> here</a>.</p></div>","title":"13 Non-Travel Books That Changed My Life"}},"pageContext":{"id":"5b95eafb87be05832748ffea"}}