{"data":{"mongodbDatabaseArticles":{"id":"5b95eae587be05832748ffdf","content":"<div><p> </p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/lgbttravelchoice1.jpg\" alt=\"LGBT protests in russia\" width=\"675\" height=\"395\"><br> I&#8217;ve added&#160;an LGBT column for the website to make the site more inclusive and talk about issues that affect some&#160;members of our community. In this column, we will hear from voices in the LGBT community about their experiences on the road, safety tips, events, and overall advice for other LGBT travelers to get the most out of their time on the road! Back again this month is our column leader Adam from&#160;<a href=\"http://www.travelsofadam.com/\">travelsofadam.com</a>.&#160;</p><p><b></b>At last count, there are 77 countries where homosexuality is illegal, with death sentences possible in at least 12 of those. As a traveler, it&#8217;s rare (but not totally unlikely) for LGBT tourists to get caught up in local antigay laws when traveling. But there are such stories out there: a gay British tourist <a href=\"https://www.theguardian.com/world/2014/oct/06/british-man-ray-cole-70-jailed-four-months-morocco-gay\">jailed in Morocco</a>, a gay Swedish tourist <a href=\"http://www.pinknews.co.uk/2015/02/08/tunisia-swedish-man-jailed-for-homosexual-acts/\">jailed in Tunisia</a>, a couple facing <a href=\"http://www.dailyxtra.com/canada/news-and-ideas/news/nightmare-in-dubai-toronto-gay-couple-52426\">harassment in Dubai</a>, <a href=\"http://www.independent.co.uk/news/world/africa/egypts-police-using-social-media-and-apps-like-grindr-to-trap-gay-people-9738515.html\">entrapment in Egypt</a>&#8230;the list goes on. It&#8217;s not always safe or easy for gay travelers (and certainly even harder for LGBT locals living under those laws and customs).</p><p>There are ethical and moral issues in play, as well as safety issues. Out Now Consulting&#8217;s LGBT research shows that a key factor for LGBT travelers is determining how welcome they will feel in the places that they visit, and that many of those travelers are choosing purposefully not&#160;to visit places with anti-LGBT laws.</p><p>But as someone who believes in creating fewer borders, should my sexuality also control my travel plans?</p><p>For me, it&#8217;s a gray area. There&#8217;s no clear-cut answer for how or where I travel. There are some anti-gay destinations that I have zero interest in visiting to begin with, and their anti-gay laws just make the destination that much less attractive &#8212; for example: Dubai. But countless friends (gay and straight) have been there and go often. And I don&#8217;t judge them for it. My travel preferences are my own.</p><p>But then there are also some anti-gay destinations which I <i>do </i>have an interest in visiting. I may not make plans to travel there now, but I won&#8217;t cross them off my list either.</p><p>At the very least, I believe travelers need to learn about and understand a destination&#8217;s political restrictions before traveling &#8212; even when those laws don&#8217;t apply to you. Once you&#8217;re fully informed about the political and security situation, attendant risks, and necessary precautions, the decision whether to visit an anti-gay destination is yours to make.</p><p><b>But, by visiting anti-gay destinations, can we actually make a difference?&#160;</b></p><p>A 2012 UN World Tourism Organization report estimates that the economic impact of LGBT travelers in the <a href=\"http://www.e-unwto.org/doi/pdf/10.18111/9789284414581\">USA alone is over $65 billion per year</a>, and another <a href=\"http://www.gaymarketnews.com/2016/05/why-anti-lgbt-laws-make-bad-business.html\">source cites potentially over $200 billion</a> for LGBT leisure spending globally.</p><p>So first, let&#8217;s address the issue of <i>not </i>traveling to a given destination. <a href=\"https://www.nomadicmatt.com/travel-blogs/travel-boycotts-waste-time/\">Travel boycotts are a contentious issue</a>, and one that brings up as many questions as answers. Do you boycott an entire country for its anti-gay laws, or just a specific region or state? What if the people there aren&#8217;t universally anti-gay? For example, in the US, North Carolina and Mississippi recently passed anti-LGBT legislation. Do you then boycott the entirety of the USA, or just those states?</p><p>And there are always going to be LGBT individuals in every city, state, and country, many still closeted. By boycotting anti-gay destinations, are you hurting or helping those LGBT locals?</p><p>Ashton Giese, Outreach Director for <a href=\"https://www.outrightinternational.org/\">OutRight Action International</a>&#160;and editor of the <a href=\"http://www.gaytlas.com/brief/\">weekly <i>GAYography </i>news brief</a>, suggests that &#8220;boycotts don&#8217;t really work against dictators or authoritarian regimes. Democratic institutions have to exist, where people and businesses could actually have a voice to make change.&#8221;</p><p>By boycotting anti-gay destinations, however, you also miss out on the opportunity to support LGBT businesses that may exist there. Ashton recommends: &#8220;See if there&#8217;s some type of LGBT tour guide or safe space to assist. I visited Egypt in February. It was incredible to see the sights and interact with the gay community there.&#8221;</p><p>If you do want to visit a destination with anti-LGBT laws on the books, it&#8217;s still important to consider safety. Do you have to hide your sexuality, or can you just be mindful if and when to come out? You might want to book with travel agencies that specialize in LGBT tourism, as they&#8217;ll be more familiar with LGBT-friendly hotels, tours, guides, and specific activities. Independent <a href=\"http://travelsofadam.com/2016/06/gay-group-tour/\">gay group tour operators</a> often have the most recent information regarding a country&#8217;s LGBT safety for tourists.</p><p>But it&#8217;s not just your own safety you need to keep in mind. Visiting an anti-gay destination to specifically seek out LGBT venues or groups can backfire. Sometimes giving a secret LGBT venue extra visibility can actually harm the small business, making it a potential target for hate crimes after you, the tourist, are long gone. As travelers, we&#8217;re often in a bubble with our &#8220;<a href=\"https://www.nomadicmatt.com/travel-blogs/travel-privilege/\">tourist privilege</a>,&#8221; so it&#8217;s important to be mindful of privacy issues, not just for yourself but for the people you interact with when traveling.</p><p><b>Do you always have to be an activist?&#160;</b></p><p>If it&#8217;s possible to visit safely as an LGBT traveler, should we deny ourselves travel experiences because of who we are? Most LGBT travelers I&#8217;ve spoken to about this issue are conflicted. There&#8217;s a sense that you shouldn&#8217;t give your tourism money to notoriously anti-gay destinations, but where people draw those lines seems to vary. For example, Uganda may have horrible anti-gay legislation, but there are still LGBT people living there &#8212; and still LGBT tourists traveling there. Not to mention a thriving tourism industry.</p><p><a href=\"http://thegaytraveler.com/\">Troy Petenbrink, a journalist and blogger</a>, wrote, &#8220;In general, I think we do more to help change anti-gay destinations&#8217; attitudes and behaviors by rewarding destinations that openly welcome us. I believe destinations seeing the power of the LGBT travel dollar benefiting their competition can bring about change. Those who argue that gays and lesbians vacationing in a horrible anti-LGBT destination such as Jamaica will somehow bring about change are foolish &#8212; and potentially dangerous.&#8221;</p><p>****</p><p>In the end, travel is often political. And choosing to specifically <i>not</i> visit a destination is a political statement, hopefully formed out of a belief system and ideas based on reality. My best holidays have been ones where I&#8217;ve both had fun <i>and</i> learned something and I&#8217;ve found travel to be an amazing way to discover the many differences in our world.</p><p>When visiting homophobic places, it&#8217;s important to make yourself aware of the local customs and laws, while still being mindful of both your safety and that of the locals. Trust your instincts and make informed decisions.</p><p>For me, I don&#8217;t rule out visiting anti-LGBT destinations. Governments change and people&#8217;s attitudes don&#8217;t often reflect their government&#8217;s. While I think it&#8217;s important to be extremely cautious &#8212; and some countries aren&#8217;t on my bucket list because of their policies&#160;&#8212;&#160;I believe it&#8217;s just as important to take each country on a case-by-case basis and look at the&#160;overall situation.</p><p>The best we can do is be as informed as we can, but also remember that, while it is important to be cautious, if we believe travel can break down barriers, a blanket boycott of all anti-LGBT destinations won&#8217;t do that.</p><p>Adam Groffman is a former graphic designer who left a publishing job in Boston to travel around the world before settling in Berlin, Germany. He&#8217;s a gay travel expert, writer, and blogger and publishes a series of LGBT-friendly&#160;<a href=\"http://travelsofadam.com/city-guides/\">Hipster City Guides</a>&#160;from around the world on his gay travel blog,&#160;<a href=\"http://travelsofadam.com/\">Travels of Adam</a>. When he&#8217;s not out exploring the coolest bars and clubs, he&#8217;s usually enjoying the local arts and culture scene. Find more of his travel tips (and embarrassing stories) on Twitter @<a href=\"http://twitter.com/travelsofadam/\">travelsofadam</a>.</p></div>","title":"Should LGBT Travelers Visit Anti-LGBT Countries?"}},"pageContext":{"id":"5b95eae587be05832748ffdf"}}