{"data":{"mongodbDatabaseArticles":{"id":"5b95efa387be05832749011a","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Experiencing an Authentic Chiang Mai Hill Tribe Tour and Homestay</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-21026\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Karen-hill-tribe-tour-in-Chiang-Mai.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Karen hill tribe tour in Chiang Mai\" width=\"1000\" height=\"550\"></p>\n<p>Even after five years of living in Chiang Mai, this comparatively small Thai city and its surrounding countryside continue to amaze me. Take, for example, the two-day Chiang Mai hill tribe tour and homestay experience I happily crossed off my bucket list. It was like nothing I&#8217;ve ever done before and I&#8217;ve been fortunate enough to travel to many different places in this country. It opened my eyes to an unspoiled world and unique people in the beautiful hillsides of northern Thailand.</p>\n<h2><p id=\"A_little_background_about_Chiang_Mai8217s_hill_tribes\">A little background about Chiang Mai&#8217;s hill tribes</p></h2>\n<p>When most people hear the words Thai hill tribes they conjure images of the tribeswomen who wear brass coils around their elongated necks. These hill tribe people are equivalent to the postcard-famous Zulu in South Africa or the Yanomami in the Amazon.</p>\n<p>However, there are far more hill tribes throughout northern Thailand, each with their own distinct culture. In fact, the northern Thai provinces of Chiang Mai, Mae Hong Son, and Chiang Rai are home to hundreds of small villages of people who left China, Myanmar (Burma), Tibet, and other countries. Some came to Thailand as refugees while others came in search of a better life.</p>\n<p>These people migrated and settled in the hillsides of northern Thailand hundreds of years ago and many lived off the land by growing crops such as vegetables and rice. Although many are Thai citizens nowadays (aside from a few minority groups mainly found along the Thai border), their legacy has cast a shadow over what could have been a prosperous future.</p>\n<p>Fast forward to the present and they are an underprivileged group. Factors such as limited higher education and employment discrimination have played a part in keeping them stuck in the farming poverty cycle for generations.</p>\n<h2><p id=\"Pat_the_man_behind_the_Chiang_Mai_hill_tribe_tours\">Pat, the man behind the Chiang Mai hill tribe tours</p></h2>\n<p>Shoulder length hair, scruffy beard, and wearing a handwoven Karieng (&#3585;&#3632;&#3648;&#3627;&#3619;&#3637;&#3656;&#3618;&#3591; pronounced g&#224;h-r&#232;e-ung) hill tribe shirt, Pat is incredibly passionate about helping hill tribe people get out of the cycle of poverty. He and his wife founded <a href=\"http://www.thailandhilltribeholidays.com/\">Thailand Hilltribe Holidays</a>, which is a company that connects travelers with hill tribe locals in a mutually beneficial &#8211; and therefore responsible &#8211; way.</p>\n<p><img class=\"aligncenter size-full wp-image-21061\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Hill-Tribe-Tour-and-Homestay-Guide-Pat.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Chiang Mai Hill Tribe Tour and Homestay Guide - Pat\" width=\"1000\" height=\"550\"><br>\nAdventurous travelers have the incredible opportunity to&#160;experience a beautiful, rarely-explored side of Thailand. At the same time, the local hill tribe people earn money by cooking meals, offering their homes as a place to sleep, and selling handicrafts or farm produce to travelers like myself.</p>\n<p>Locals also earn money because Thailand Hilltribe Holidays employs hill tribe people as their drivers. This company also helps in a variety of other sustainable ways such as assisting with finding English volunteers for the hill tribe school or connecting the villagers with markets where they can sell their produce and handicrafts. From time to time, this company donates its time or money to building or repairing parts of the village. This is what makes Pat and his team so different from other Chiang Mai hill tribe tour and homestay companies!</p>\n<p>Pat was brainstorming on and off during the entire trip, sharing his ideas about homestays, afternoons of jungle cooking classes, and riding water buffalos. There was, without a doubt, a passion that will trickle down and help this hill tribe get back on its feet.</p>\n<h2><p id=\"Wildlife_Natural_Scenery\">Wildlife + Natural Scenery</p></h2>\n<p>&#8220;We follow village life rather than village life following us.&#8221; In other words, I went along a similar route as travelers before me have, visiting the hill tribe village and the surrounding countryside, but there&#8217;s no telling what I&#8217;d see or experience because every trip is unique.</p>\n<p><img class=\"aligncenter size-full wp-image-21015\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-rice-fields.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Exploring terrace rice fields in Chiang Mai\" width=\"1000\" height=\"550\"></p>\n<p>My tour began with Pat, his assistant guide Dtohn, and his driver pulling up to my house at 9 am and greeting me while I hopped in the backseat of his 4-wheel SUV. We rode into the countryside west of Chiang Mai City, along the scenic Samoeng Loop, and toward a Karen village in the forested hills northwest of Doi Suthep.</p>\n<p>Once we got off the main road and onto a smaller, significantly bumpier country road, we stopped to see a herd of water buffalo (my favorite Southeast Asian animal!), colorfully dressed farmers planting rice, and a small waterfall. It was picture perfect! We even took a half an hour to walk through a rice field and then relaxed under an open-air hut as a brief rain shower came and went.</p>\n<p><img class=\"aligncenter size-full wp-image-21016\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-water-buffalos.jpg?resize=1000%2C529&amp;ssl=1\" alt=\"Water buffaloes relaxing during a Chiang Mai hill tribe tour\" width=\"1000\" height=\"529\"></p>\n<p>If you&#8217;ve never had the chance to drive out of Chiang Mai more than a few kilometers, the scenery is breathtaking. I always look forward to gazing out at the scenic rice fields and rolling mountains along the way.</p>\n\n\n\n<strong><p>Note:</p></strong> If you go during the rainy season (June to October) like I did, you can expect 1-3 hours of rain on most days. Be sure to pack waterproof shoes, a change of clothes, and a lightweight poncho.\n\n\n\n<h2><p id=\"Lan_Kam_Village\">Lan Kam Village</p></h2>\n<p>Ban Lan Kam (&#3610;&#3657;&#3634;&#3609;&#3621;&#3634;&#3609;&#3588;&#3635; pronounced b&#226;hn lahn kahm) is the heart of it all. It&#8217;s a small Karen village with stilted wooden homes, piglets, chickens, and dogs running around, dirt paths snaking through the hills, and people going about their daily lives.</p>\n<p><img class=\"aligncenter size-full wp-image-21017\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-village-life-2.jpg?resize=1000%2C600&amp;ssl=1\" alt=\"Bungalows in a village during a Chiang Mai hill tribe tour\" width=\"1000\" height=\"600\"></p>\n<p>The single or double room homes are crudely made from wood, corrugated metal, and woven bamboo. Underneath each house are the family&#8217;s pig, dog, chickens, motorbikes, and firewood.</p>\n<p><img class=\"aligncenter size-full wp-image-21060\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-and-homestay-experience-with-villagers.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Hill tribe women socializing in the Ban Lam Kam village\" width=\"1000\" height=\"550\"></p>\n<p>The cooking is done by fire and the bathrooms are western style toilets that you have to flush with a bucket of water. However, there is electricity and wifi if you have the right SIM card.&#160;TrueMove&#160;is best followed by&#160;AIS. You won&#8217;t have a connection if you have a&#160;dtac&#160;SIM card like I did.</p>\n<h2><p id=\"Local_Thai_food_and_hill_tribe_food\">Local Thai food and hill tribe food</p></h2>\n<p>Throughout the trip, I had many opportunities to eat local food. On the first day, we stopped at a Thai restaurant for lunch. Every meal after that was provided by the Karen people.</p>\n<p>I visited during a time of year when mangos are plentiful, so I sampled a variation of a classic Thai dish: mango with coconut sticky rice. The Karen version had a drizzle of locally sourced honey and a sprinkling of black sesame seeds. During other times of the year, mango is swapped with avocado or steamed pumpkin.</p>\n<p><img class=\"aligncenter size-full wp-image-21059\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-and-homestay.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Morning coffee at a Chiang Mai hill tribe tour and homestay\" width=\"1000\" height=\"550\"></p>\n<p>After waking up to the rooster alarm clock early the following morning, I graciously accepted a cup of local coffee. The roasted beans (grown in a coffee farm not far away) were manually ground, tipped into a stovetop Moka coffee maker, and placed on the open fire &#8230; inside my thatched-roof bungalow!</p>\n<p>I also ended up buying 100% authentic honey (re-packed in a Hong Tong &#8220;whiskey&#8221; bottle to my delight) and a kilo of some of the prettiest lychee fruit I&#8217;ve ever seen.</p>\n<p><img class=\"aligncenter size-full wp-image-21058\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-and-homestay-food.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Chiang Mai hill tribe tour and homestay food\" width=\"1000\" height=\"550\"></p>\n<p>The hill tribe food I ate was pungent and a little spicy. It reminded me a lot of <a href=\"https://www.tielandtothailand.com/isaan-thai-food-6-dishes-you-should-try/\">food from Thailand&#8217;s northeastern region, Isaan</a>. I visited on a special day so all the meals were brimming with various cuts of pork and buffalo. However, I was told this was unusual since meat is a luxury. Under normal circumstances, the meals are typically vegetarian.</p>\n<h2><p id=\"Karen_wedding\">Karen wedding</p></h2>\n<p>I was extremely fortunate to have witnessed a Karen wedding during my hill tribe tour in Chiang Mai. This was something truly special. Even Pat, my guide, said this was only the second one he&#8217;s ever seen in all his years.</p>\n<p><img class=\"aligncenter size-full wp-image-21020\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-Karen-Wedding-bride.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Karen hill tribe wedding bride\" width=\"1000\" height=\"550\"></p>\n<p>It was a two-day affair with a special ceremony. There were offerings to ancestors, and lots of smiles, food, and rice whiskey shots.</p>\n<p>This was a traditional Karen style wedding, which shares some components of Lanna-style (northern Thai) weddings. For example, both tie a white cotton string on the wrists of the newlyweds. Pat told me that this was different from a traditional central Thai wedding&#160;in which water is poured over the hands of the bride and groom.&#160;There are many aspects of the ceremony, some parts that I didn&#8217;t see and others I witnessed but didn&#8217;t understand.</p>\n<p><img class=\"aligncenter size-full wp-image-21021\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-Karen-wedding-sai-mongkhon.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Karen wedding sai mongkhon - tying of the white cotton thread\" width=\"1000\" height=\"550\"></p>\n<p>One of the most distinguishable moments during the wedding was the sai mongkhon or the &#8220;joining by thread.&#8221; The bride and groom sit beside each other. After saying prayers, the village&#8217;s shaman encircled their heads with individual loops of pure white cotton string, which symbolizes unity but individually. Then, all the wedding guests (myself included) tie short strings of white cotton around their wrists and wish them good luck!</p>\n<h2><p id=\"Ban_Mae_Lan_Kam_School\">Ban Mae Lan Kam School</p></h2>\n<p>Part of the tour includes a visit to the hill tribe village school. This small government school is less than a 10-minute drive from Ban Lan Kam. Here, kids ages 6 to roughly 14 years old go to school, Monday through Friday. They wear uniforms, smile and show off for visitors, and goof off in class.</p>\n<p><img class=\"aligncenter size-full wp-image-21022\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Chiang-Mai-hill-tribe-tour-Ban-Mae-Lam-Kam-School.jpg?resize=1000%2C531&amp;ssl=1\" alt=\"Chiang Mai hill tribe tour - Ban Mae Lam Kam School\" width=\"1000\" height=\"531\"></p>\n<p>The school was simple but tidy and had several classrooms for the various age groups and large outdoor play area. They study a regular Thai curriculum that includes a few hours of English each week.</p>\n<p>As with many schools deep in the Thai countryside, resources and teacher quality are lacking. Standards cannot be compared to schools in the cities. However, international visitors can help this particular school by volunteering to teach English. During my hill tribe tour, I spoke with the current English teacher (a woman from Australia) as well as a Thai teacher who helps arrange volunteers. If you are interested in volunteering, please contact Khun Jina (aka Kruu Maew) directly at:</p>\n<p><strong>Phone:</strong> (098) 492-2831<br>\n<strong>Facebook/Line:</strong> Jina Jinakien<br>\n<strong>Email:</strong> <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a></p>\n<h2><p id=\"Hill_Tribe_Eco-Agricultural_Village_Baan_Tong_Luang\">Hill Tribe Eco-Agricultural Village (Baan Tong Luang)</p></h2>\n<p>I wanted to see for myself what the Baan Tong Luang (&#3610;&#3657;&#3634;&#3609;&#3650;&#3605;&#3633;&#3591;&#3627;&#3621;&#3623;&#3591; pronounced b&#226;hn dt&#244;hng loo-ahng) Eco-Agricultural Village was like. This is better known by the name &#8220;The Long Neck Village.&#8221;</p>\n<p><img class=\"aligncenter size-full wp-image-21023\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Long-Neck-Village-Chiang-Mai-girl-weaving.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Girl weaving at the Long Neck Village in Chiang Mai\" width=\"1000\" height=\"550\"></p>\n<p>In all my years living in Chiang Mai, it was my first time visiting the village. I&#8217;ve been hesitant to go because I&#8217;ve heard mixed reviews about it online. The worst it&#8217;s been called is a human zoo. The best say it&#8217;s an educational experience and an opportunity to directly support several hill tribe people in the area.</p>\n<p>The eco-village represents the following tribes in northern Thailand:</p>\n<ul>\n<li>Lisu Shi Bala</li>\n<li>Lahu</li>\n<li>Hmong</li>\n<li>Kayan / White Karen</li>\n</ul>\n\t\t\t\t<ul>\n<li>Sgaw</li>\n<li>Dara-ang</li>\n<li>Ahka</li>\n</ul>\n\t\t\t\t<p class=\"clear\"></p>\n<p>When I visited, there only a handful of tourists walking among the wooden buildings. There were far more villagers going about their daily routine. This included weaving, selling handicraft items, and (surprisingly) going to the village church or the temple.</p>\n<p><img class=\"aligncenter size-full wp-image-21024\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Long-Neck-Village-Chiang-Mai-with-child.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Mother and daughter at the Baan Tong Luang Village in Chiang Mai, Thailand\" width=\"1000\" height=\"550\"></p>\n<p>I walked around and read the information placards for each tribe and talked to some of the villagers. Some were shy. Others were happy to say hello and talk about their handicrafts and what they liked to do in their free time.</p>\n<p>The village has colorful displays of handicrafts and sounds of local music in the background. The atmosphere is peaceful and not bleak as some people have painted it. In fact, <strong>I think going to the &#8220;Long Neck&#8221; Baan Tong Luang Eco-Agricultural Village with a private guide, rather than on your own or in large tour groups, is best. </strong>Being able to take your time and interact with the villagers is more personal. Otherwise, it feels rather voyeuristic taking photos in a large group.</p>\n<p>Although I am not sure what portion of the entrance fee goes directly to the villages, they get the full benefit of selling their handicrafts. I ended up buying an intricately embroidered purse and my guide purchased a brass bracelet.</p>\n<p><strong>Opening Hours:</strong> Daily from 8:30 am to 4 pm<br>\n<strong>Admission Fee:</strong> 500 baht per person</p>\n<h2><p id=\"A_Chiang_Mai_hill_tribe_tour_and_homestay_with_Thailand_Hilltribe_Holidays\">A Chiang Mai hill tribe tour and homestay with Thailand Hilltribe Holidays</p></h2>\n<p><strong>Visiting the northern Thai hill tribes are still considered an off-the-beaten-path experience.</strong> So, the opportunities to go to a village or to interact with the various tribes in a non-intrusive and ethical way are incredibly limited.&#160;It&#8217;s possible if you&#8217;ve married into a hill tribe family (I know several people who have) or have a hill tribe friend who can take you to their village. Otherwise, the chances of seeing this side of Thailand is slim to none.</p>\n<p><img class=\"aligncenter size-full wp-image-21039\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Planting-rice-in-a-hill-tribe-village.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Planting rice in a hill tribe village\" width=\"1000\" height=\"550\"></p>\n<p><strong>However, for those who really want to experience an &#8220;untouched&#8221; Thailand, I recommend taking a private tour with Thailand Hilltribe Holidays. </strong>I had my eyes on them for two years before finally making the trip and I&#8217;m so glad I finally went! My guide, Pat, and his assistant, Dtohn, took care of everything for me. Pat was full of stories about the villagers. Both men were excellent photographers, pointing out shots here and there to help me capture the essence of the trip.</p>\n<p>There are plenty of other things you can do on this private tour. Some other things you can do that I didn&#8217;t experience on my particular trip are:</p>\n<ul>\n<li>Smoking a hand-rolled cigar or drinking rice whiskey</li>\n<li>Playing with elephants</li>\n<li>Visiting water buffalo</li>\n<li>Planting or harvesting rice</li>\n<li>Learning how to do handicrafts like weaving or textile printing</li>\n</ul>\n<p><strong>Unlike other trekking or hill tribe tours in Chiang Mai, Thailand Hilltribe Holidays only offers private tours. This guarantees that the experience is authentic and personalized. Their non-inclusive pricing ensures travelers pay villagers directly for their services.</strong>&#160;Prices begin at 2,750 baht per adult for a one-day tour. This excludes the cost of meals, entrance fees, gas, and personal expenses. Granted, these are quite inexpensive. Meals are roughly 50 baht, homestays are 300 baht per night, gas is roughly 800 baht&#160;day. In fact, when you book with them, they will provide you with an&#160;itemized list of expenses and an estimate of the total trip price so that there are no surprises.</p>\n<p><img class=\"aligncenter size-full wp-image-21055\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Pat-of-Thailand-Hilltribe-Holidays.png?resize=1000%2C666&amp;ssl=1\" alt=\"\" width=\"1000\" height=\"666\"><a href=\"https://500px.com/ratchanon99\">500px.com/ratchanon99</a></p>\n<p>Thailand Hilltribe Holidays is a company with the heart and soul dedicated to uplifting the hill tribe community. They offer several variations of private tours, from full-day tours to tours lasting more than a week. There is also an incredible photography tour if that&#8217;s your thing. For more information and to read about their different tours, check out their site:</p>\n<p><strong>Website:</strong> <a href=\"http://www.thailandhilltribeholidays.com\">ThailandHilltribeHolidays.com</a><br>\n<strong>Email:</strong> <a href=\"/cdn-cgi/l/email-protection#6a03040c052a1e020b03060b040e020306061e1803080f020506030e0b131944090507\">[email&#160;protected]</a><br>\n<strong>Facebook:</strong> <a href=\"https://www.facebook.com/ThailandHilltribeHolidays/\">Thailand Hilltribe Holidays</a><br>\n<strong>Phone</strong>: (085) 548-0884</p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"pinit aligncenter wp-image-21067 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/07/Experiencing-an-Authentic-Chiang-Mai-Hill-Tribe-Tour-Homestay.png?resize=540%2C960&amp;ssl=1\" alt=\"Adventurous travelers looking for an unspoiled world in the beautiful hillside of northern Thailand should experience this one-of-a-kind Chiang Mai hill tribe tour and homestay with Thailand Hilltribe Holidays.  | Tieland to Thailand\" width=\"540\" height=\"960\"></p>\n<p>Disclosure: My Chiang Mai hill tribe tour and homestay experience with Thailand Hilltribe Holidays was sponsored. However, all of my opinions are my own. I shared an honest recap of my adventure so that you can make an informed decision as to whether or not to include this tour in your upcoming trip to Thailand.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Experiencing an Authentic Chiang Mai Hill Tribe Tour and Homestay"}},"pageContext":{"id":"5b95efa387be05832749011a"}}