{"data":{"mongodbDatabaseArticles":{"id":"5b95ee7a87be0583274900dd","content":"<div><p><img class=\"aligncenter size-full wp-image-20211\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Top-10-Cities-iStock-929432184.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Where to Celebrate Songkran Top 10 Cities\" width=\"1000\" height=\"667\">iStock.com/panom</p>\n<p>Thailand has several holidays that capture the attention of travelers from around the world. Perhaps the most famous of them all is Songkran or the Water Festival. For several days, the country practically grinds to a halt as people everywhere take part in the countrywide festivities. In this post, we&#8217;ll tell you exactly where to celebrate Songkran &#8211; from the best traditional ceremonies to the craziest, most colorful parties. Sawatdee Bpee Mai (Happy New Year)!</p>\n<p><strong>Songkran (pronounced sohng-grahn) is an official public holiday from April 13th to 15th every year. </strong>Some towns celebrate it with parades and beauty contents on Songkran Day (April 13th) while others celebrate it across all three days. Water enthusiasts will also be happy to learn that there are a few towns that celebrate a separate but similar holiday called the Wan Lai Festival, so the festivities can last even longer!</p>\n<p><strong>Water is an important aspect of Songkran because it symbolizes the cleansing of past sins to start anew.</strong> Traditional celebrations across Thailand include the ritual of washing Buddha statues with scented water, blessing village elders by dribbling water on their arms and hands, gently smearing scented talc powder on faces for happiness, making offerings to monks, and returning sand to temples.</p>\n<p>In some cities, this holiday has transformed into something much more lively. <strong>Nowadays there are high-powered squirt guns, buckets of freezing cold water, foam parties, and water dye.</strong> Essentially, Songkran is the world&#8217;s wildest water fight!</p>\n<p>Below, you&#8217;ll find out top ten cities list of where to celebrate Songkran (map included). Some are best known for their traditional water cleansing ceremonies while others are famous for their full-powered water wars.</p>\n<h2><p id=\"Bangkok_April_13_to_15_2018\"><p>Bangkok: April 13 to 15, 2018</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-20213\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Top-10-Cities-Bangkok-iStock-628537392.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Bangkok | Where to Celebrate Songkran Top 10 Cities\" width=\"1000\" height=\"667\">iStock.com/drpnncpp</p>\n<p>Although many Thais flock to the countryside to celebrate the Songkran Festival with their families, Bangkok still has thousands of parties to reign in the Thai New Year. You&#8217;ll find Thai kids of all ages (mostly teenagers) and adults as well as tourists participating in the wet and wild fun.</p>\n<p>Some of the most notable celebrations can be found at:</p>\n<h3><p id=\"Khao_San_Road\">Khao San Road</p></h3>\n<p>Khao San Road and the&#160;neighboring Soi Rambutree are backpackers&#8217; favorite places to celebrate Songkran. Roadside bars, thumping music, and a constant bombardment of cold water sprays and white paste smears make this a high-energy day from morning until late at night. You may get lucky and see painted elephants walking along the street, too.</p>\n<p>If you&#8217;re headed to this area of Bangkok to celebrate Songkran, staying at a hotel along those streets would be the icing on the cake. The <a href=\"https://www.agoda.com/ibis-styles-bangkok-khaosan-viengtai/hotel/bangkok-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">ibis Styles Bangkok Khaosan Viengtai</a>&#160;caught our eye and looks like the perfect place to be in the middle of the action.</p>\n<h3><p id=\"Silom_Road\">Silom Road</p></h3>\n<p>The entire 5-kilometer length of Silom Road (best known for Patpong Market) is closed off to through traffic to make way for Bangkok largest&#160;water fight. On the street level, you&#8217;ll find people using anything to hurl, spray, and pour water on nearby partiers. Or, you can stay relatively dry on the BTS Skywalk and watch the colorful antics unfurl below. Since it&#8217;s so large,&#160;there are a lot of options to choose from as far as hotels. We&#8217;ve had friends stay at the <a href=\"https://www.agoda.com/pullman-bangkok-hotel-g/hotel/bangkok-th.html?cid=1608701\" target=\"_blank\" rel=\"noopener\">Pullman Bangkok Hotel G</a> and they absolutely adored it.</p>\n<h3><p id=\"CentralWorld_Shopping_Complex\">CentralWorld Shopping Complex</p></h3>\n<p>Enjoy a safe, family-friendly, alcohol-free area in front of Central World Shopping Complex on Rama I Road. There you&#8217;ll find several different zones that feature carnival games, music stages, water fights, and foam parties. After you&#8217;re done playing, retreat to the&#160;<a href=\"https://www.agoda.com/renaissance-bangkok-ratchaprasong-hotel/hotel/bangkok-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">Renaissance Bangkok Ratchaprasong Hotel</a>, which is a little more than a 5-minute walk away.</p>\n<h2><p id=\"Baeng_Saen_April_15_to_17_2018\"><p>Baeng Saen: April 15 to 17, 2018</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-20214\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Top-10-Cities-Baeng-Saen-Sand-Pagodas-iStock-486936233.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Baeng Saen Sand Pagodas | Where to Celebrate Songkran Top 10 Cities\" width=\"1000\" height=\"667\">iStock.com/Toa55</p>\n<p>Chonburi Province is best known for its Wan Lai Festival celebrated just a few days after Songkran. There are&#160;traditional activities such as almsgiving to monks and the ritual of blessing elders. However, the main tradition is returning sand to temples (the symbolic sand that Thais unknowingly removed from the temple grounds with their feet) and building small pagodas and chedis out of the sand.</p>\n<p><strong>One of the biggest Wan Lai Festival celebrations in Thailand takes place on Bang Saen Beach in Chonburi.</strong>&#160;There you&#8217;ll find vendors selling <a href=\"https://www.tielandtothailand.com/25-tasty-thai-street-snacks-finger-food-guide/\">Thai street food</a> and performers putting on traditional dances and playing music. There are also hilarious greased pole boxing competitions called muay talay held over the water. Thousands of people come to enjoy the main attraction on April 17th: stunning sand pagodas sculpted by talented artists on display along Bang Saen Beach. Stay at <a href=\"https://www.agoda.com/kalm-bangsaen-hotel/hotel/chonburi-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">Kalm Bangsaen Hotel</a> to be in the heart of the festivities.</p>\n<h2><p id=\"Chiang_Mai_City_April_12_to_16_2018\"><p>Chiang Mai City: April 12 to 16, 2018</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-20225\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Chiang-Mai.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Chiang Mai | Where to Celebrate Songkran\" width=\"1000\" height=\"667\">iStock.com/LiptonCNX</p>\n<p>Even if Bangkok has the most parties, Chiang Mai in Northern Thailand hosts the wettest parties. Thanks to the ancient moat that surrounds Chiang Mai&#8217;s Old City in a near perfect 1-mile by 1-mile square, the Old City has access to an unlimited water source. It makes it the perfect spot to spray each other with super&#160;soakers and douse each other with buckets of water.&#160;This is also an excellent time to sample Northern Thai food.</p>\n<p>Songkran usually starts a day early (April 12th) in Chiang Mai. If you&#8217;re interested in the cultural side, don&#8217;t miss the grand floral parade, cultural shows, and beauty pageants. On April 13th at 1 pm there is a procession with Buddha images and Miss Songkran from the Train Station to Wat Phra Singh. On April 14th at 3 pm there is another procession from the Iron Bridge marching to Thapae Gate.</p>\n<p>For the days following the opening parade, join the crowds at the massive music stage set up at <strong>Thapae Gate on the east side of the Chiang Mai&#8217;s Old City moat. </strong>There&#8217;s usually a huge foam party, too. One of the best places to stay just a stone&#8217;s throw from Thapae Gate is the <a href=\"https://www.agoda.com/vieng-mantra-hotel/hotel/chiang-mai-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">Vieng Mantra Hotel</a>.</p>\n<h2><p id=\"Hat_Yai_April_11_to_15_2018\"><p>Hat Yai: April 11 to 15, 2018</p></p></h2>\n<p>Hat Yai Province is in the deep south of Thailand. Not only do local Thais and expats celebrate Songkran&#160;but&#160;many tourists from Malaysia and Singapore do, too. The Hat Yai Midnight Songkran Festival starts in the morning and lasts almost to midnight. <strong>Festivities are centered around Nipat Uthit 1,2,3 Roads and Soi Sanehanusorn.</strong>&#160; One of the best hotels right in the middle of the action on Nipat Uthit Road 3 is <a href=\"https://www.agoda.com/the-three-hat-yai/hotel/hat-yai-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">The Three Hat Yai</a>. Many of the traditional activities such as making merit, bringing sand, and blessing elders will be at&#160;Wat Mahatta Mongkhonram (Wat Hat Yai Nai), too.</p>\n<h2><p id=\"Khon_Kaen_City_April_13_to_15_2018\"><p>Khon Kaen City: April 13 to 15, 2018</p></p></h2>\n<p>In Northeast Thailand (Isaan), Khon Kaen Province hosts one of the largest celebrations. <strong>The Songkran festivities take&#160;place on Khao Nieow Road (Sri Chan Road) in Khon Kaen City as well as around Kaen Nakorn Lake.</strong>&#160;If we were celebrating Songkran in Khon Kaen, we&#8217;d stay at the <a href=\"https://www.agoda.com/glacier-hotel-by-infinity-hotels-and-resorts/hotel/khon-kaen-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">Glacier Hotel by Infinity Hotels and Resort</a> right in the heart of the action.</p>\n<p>As with many other Thai provinces, the holiday&#8217;s highlight is a parade on April 13th featuring a flora procession, a beauty&#160;pageant, folk music, and Thai dancing. In addition to the parade, joyful people fill the streets to the streets and splash and throw water at each other.&#160; If it&#8217;s your first time traveling to Northeastern Thailand, this is a great time to sample <a href=\"https://www.tielandtothailand.com/isaan-thai-food-6-dishes-you-should-try/\">Isaan food</a>, too.</p>\n<h2><p id=\"Phuket_April_13_to_15_2018\"><p>Phuket: April 13 to 15, 2018</p></p></h2>\n<p><img class=\"aligncenter wp-image-20219 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Phuket.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"Phuket | Where to Celebrate Songkran\" width=\"1000\" height=\"666\"><a href=\"https://www.flickr.com/photos/29442821@N07/8661926913/in/album-72157633281602778/\" target=\"_blank\" rel=\"nofollow noopener\">flikr.com &#8211; Lauren Irons</a> | <a href=\"https://creativecommons.org/licenses/by-nd/2.0/\" target=\"_blank\" rel=\"nofollow noopener\">CC</a></p>\n<p>If you want to celebrate Songkran at the beach, Phuket is at the top of the list. With more than 30 beaches on Thailand&#8217;s largest island, you&#8217;ll find people celebrating everywhere. However, several of the more concentrated party zones on Phuket include:</p>\n<h3><p id=\"Patong\">Patong</p></h3>\n<p>Beach Road, the one-way road that runs along the entire length of Patong Beach, is the center of Phuket&#8217;s Songkran festivities. We recommend staying at <a href=\"https://www.agoda.com/surf-hotel-patong/hotel/phuket-th.html?cid=1608701\" target=\"_blank\" rel=\"noopener\">SURF Hotel</a>&#160;if you want to be right in the middle of all the action. The first day of Songkran (April 13) starts off with a floral parade, Miss Songkran beauty pageant, and an art exhibition in addition to water fights. For the craziest parties, go down Bangla Road, which is already famous for its bars and nightclubs.</p>\n<h3><p id=\"Phuket_Town\">Phuket Town</p></h3>\n<p>If you&#8217;re in Phuket and prefer to celebrate in a family-friendly manner, go to&#160;Saphan Hin Park or in front of Limelight Avenue Mall. Both places won&#8217;t allow drugs, alcohol, cigarettes, high-powered squirt guns, powder, water dyes, and bubbles. After you&#8217;ve had your wholesome fun, settle down at the super charming <a href=\"https://www.agoda.com/the-memory-at-on-on-hotel/hotel/phuket-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">Memory at On On Hotel</a> in Phuket Town.</p>\n<h3><p id=\"Chalong\">Chalong</p></h3>\n<p>If you&#8217;re in Phuket and want to know where to celebrate Songkran in a more traditional way, go to Chalong. In the morning, there with be the ancient water blessing ceremony of elders and traditional Thai dancing at Wat Chalong. In the afternoon go to Soi Ta-iad&#160;to splash water around, which is home to the gorgeous <a href=\"https://www.agoda.com/anchan-private-pool-villas/hotel/phuket-th.html?cid=1608701\" target=\"_blank\" rel=\"noopener\">Anchan Private Pool Villas</a>. There will also be several water-related competitions such as fishing boat races, kayak races, and greased pole &#8216;Muay Thai Talay&#8217; competitions near the Pa Lai Pier at Chalong Bay.</p>\n<h2><p id=\"Pattaya_April_10_to_19_2018\"><p>Pattaya: April 10 to 19, 2018</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-20220\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Pattaya.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"Pattaya | Where to Celebrate Songkran\" width=\"1000\" height=\"666\"><a href=\"https://www.flickr.com/photos/29442821@N07/8663030450/in/album-72157633281602778/\" target=\"_blank\" rel=\"nofollow noopener\">flikr.com &#8211; Lauren Irons</a> | <a href=\"https://creativecommons.org/licenses/by-nd/2.0/\" target=\"_blank\" rel=\"nofollow noopener\">CC</a></p>\n<p>Pattaya celebrates both Songkran and the Wan Lai Festival, so the festivities are arguably the longest and wildest in the country. Songkran unofficially starts on April 10th in Pattaya. However, it officially starts on April 13th (first day of Songkran), builds up to a crazy April 15th, drops off a bit and then ends with a big bang on April 19th (last day of the Wan Lai Festival).</p>\n<p>The craziest parties will be in the heart of Pattaya, although they do radiate outward as far as Naklua and Jomtien. <strong>Expect water fights all along the 3-kilometer stretch of Beach Road and 2nd Road as well as Wong Amart, Walking Street, Sois 6, 7, &amp; 8, Soi Buakhao, Soi Khao Talo, and Soi Khao Noi. </strong>Of all the hotels along Beach Road, we&#8217;d opt to stay at the <a href=\"https://www.agoda.com/wave-hotel/hotel/pattaya-th.html?cid=1608701\" target=\"_blank\" rel=\"noopener\">Wave Hotel</a>&#160;for maximum fun.</p>\n<h2><p id=\"Koh_Samui_April_13_to_15_2018\"><p>Koh Samui: April 13 to 15, 2018</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-20215\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Top-10-Cities-Koh-Samui-iStock-664908260.jpg?resize=1000%2C665&amp;ssl=1\" alt=\"Koh Samui | Where to Celebrate Songkran Top 10 Cities\" width=\"1000\" height=\"665\">iStock.com/SCHAMIN</p>\n<p>Koh Samui is one of Thailand&#8217;s most popular and easiest islands to travel to. Luckily it hosts both water wars and traditional celebrations for visitors, expats, and Thai locals to enjoy.</p>\n<h3><p id=\"Chaweng\">Chaweng</p></h3>\n<p>On the northeast corner of Koh Samui is Chaweng Beach, the island&#8217;s famous nightlife area. There you&#8217;ll find beach and pool parties galore&#160;with thumping music, high energy squirt gun fights, and foam parties. <strong>Head to the bars and clubs around Soi Green Mango for buzzing crowd, boozy adult entertainment, and soaking wet action. </strong>When you&#8217;re ready to dry off and enjoy cocktails, head back to the&#160;<a href=\"https://www.agoda.com/baan-samui-resort/hotel/samui-th.html?cid=1608701\" rel=\"nofollow target=\">Baan Samui Resort</a>.</p>\n<h3><p id=\"Maenam_Bophut_and_Choeng_Mon\">Maenam, Bophut, and Choeng Mon</p></h3>\n<p>If you want to know where to celebrate Songkran on Koh Samui without the insanity, <strong>go to one of three family-friendly beaches on the north side of the island: Maenam, Bophut, and Choeng Mon.</strong>&#160;You&#8217;ll still be able to enjoy splashing water at each other. These areas are just better for people with children or who don&#8217;t want to be around wild parties. We recommend staying at the centrally located <a href=\"https://www.agoda.com/celes-beachfront-resort-koh-samui/hotel/samui-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener\">CELES Beachfront Resort Koh Samui</a> on Bophut.</p>\n<h2><p id=\"Lampang_City_April_9_to_13_2018\"><p>Lampang City: April 9 to 13, 2018</p></p></h2>\n<p>Lampang Province celebrates Songkran slightly differently than the rest of Thailand. The main venue is a special <strong>Royal Salung Luang parade to</strong>&#160;<strong>Wat Phrathat Lampang Luang&#160;</strong>on April 12th.&#160;Thais dress in ancient Lanna-style clothing and parade around carrying a giant&#160;silver water bowl. Before and after the parade, people make merit, build sand pagodas, and bless their elders by gently pouring water on them. There will also be lots of Northern Thai food, folk music, traditional shows, and playful water fights.&#160;Back in the heart of Lampang City, cozy up in the gorgeous Thai-styled <a href=\"https://www.agoda.com/baan-kum-on/hotel/all/lampang-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener rel=\">Baan KUM &#8211; ON</a> homestay.</p>\n<h2><p id=\"Phra_Pradaeng_April_20_to_22_2018\"><p>Phra Pradaeng: April 20 to 22, 2018</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-20217\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/04/Where-to-Celebrate-Songkran-Top-10-Cities-Tradtional-iStock-473447792.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Tradtional | Where to Celebrate Songkran Top 10 Cities\" width=\"1000\" height=\"667\">iStock.com/Tanuza</p>\n<p>If you miss the main days of Songkran or prefer to enjoy something that&#8217;s enchanting rather than wet and wild, then head to the streets around Wat Protket Chettharam in&#160;Phra Pradeang. It&#8217;s just outside the south side of Bangkok in Samut Prakan Province.</p>\n<p>There, the <strong>Thai-Mon Songkran celebrations include elaborate processions and flower parades from the Phra Pradaeng district office to Wat Protket Chettharam.</strong> The men and women participating in the ceremony are dressed in traditional Raman and Loy Chai clothing. There are also cultural shows and dances, a flag ceremony, &#8216;saba&#8217; games, and a beauty contest. You&#8217;ll see people splashing water around, but it&#8217;s done softly and respectfully. Just a short ways away is the <a href=\"https://www.agoda.com/fahsai-antique-homestay-near-brt/hotel/all/bangkok-th.html?cid=1608701\" target=\"_blank\" rel=\"nofollow noopener rel=\">Fahsai Antique Homestay</a> for an extra dose of Thai culture.</p>\n<h2><p id=\"Where_to_Celebrate_Songkran_in_2018_Map\"><p>Where to Celebrate Songkran in 2018 Map</p></p></h2>\n<p>&#65279;&#65279;\n\t\t\t\t</p></div>","title":"Where to Celebrate Songkran: 10 Best Cities"}},"pageContext":{"id":"5b95ee7a87be0583274900dd"}}