{"data":{"mongodbDatabaseArticles":{"id":"5b937ae287be056953db7ce6","content":"<div><h1 name=\"40e6\" id=\"40e6\" class=\"graf graf--h3 graf--leading graf--title\">Meet the digital nomad who uses&#160;Revolut</h1><h2 name=\"7b44\" id=\"7b44\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">Pieter is never in one place for a long time. As a digital nomad and founder of the biggest <a href=\"https://nomadlist.com/\" class=\"markup--anchor markup--h4-anchor\" rel=\"noopener nofollow\" target=\"_blank\">nomad community</a> in the world, we wanted to explore his experience with traditional banks and understand why <a href=\"http://revolut.com\" class=\"markup--anchor markup--h4-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Revolut</a> is an essential card he carries in his&#160;wallet.</h2><h3 name=\"d7a0\" id=\"d7a0\" class=\"graf graf--h3 graf-after--figure\">Pieter, can you tell us how your journey&#160;started?</h3><p name=\"fb7d\" id=\"fb7d\" class=\"graf graf--p graf-after--h3\">Almost ten years ago, I was a drum &amp; bass DJ and producer known as Panda. Those were fun times&#8202;&#8212;&#8202;I would hear my songs on the radio while I was busy organising my own events in the Netherlands.</p><p name=\"5520\" id=\"5520\" class=\"graf graf--p graf-after--p\">I think it all started with the release of my debut album in 2008, when YouTube was still in its infancy. At the time, there was hardly any music on the platform (after all, YouTube was a video site), but I decided go ahead and publish my album there.</p><p name=\"4ecc\" id=\"4ecc\" class=\"graf graf--p graf-after--p\">Soon after, my channel took off and it starting growing fast. My videos were getting millions of views and I was approached by YouTube to become one of their first paid partners in Europe. I was really excited. I was suddenly earning ~$2,000/month. That&#8217;s a lot of money for a student (and for anyone really!). I saved it all up.</p><h3 name=\"b0f1\" id=\"b0f1\" class=\"graf graf--h3 graf-after--p\">So, what made you decide to move abroad and work remotely?</h3><p name=\"ac0e\" id=\"ac0e\" class=\"graf graf--p graf-after--h3\">It was actually my friend, Hasse, who hinted at the idea of working while travelling. Back in 2013, I had just graduated from University and my YouTube channel was doing well, which gave me the freedom to steer clear of a boring office job.</p><p name=\"80ee\" id=\"80ee\" class=\"graf graf--p graf-after--p\">But while the success of my channel was an achievement, it wasn&#8217;t all I wanted to do in life. At the time, I was relying heavily on my PC to create all the videos I was uploading on YouTube, so in a sense, I was grounded by technology.</p><p name=\"5327\" id=\"5327\" class=\"graf graf--p graf-after--p\">Hasse completely opened my eyes when he suggested I buy a laptop instead and go travelling for a while, which is exactly what I did. I booked a flight to Asia because I had studied there before and thought it was a safe and fairly easy starting point.</p><h3 name=\"827c\" id=\"827c\" class=\"graf graf--h3 graf-after--p\">Given your nomad lifestyle, what has been your experience with traditional banks?</h3><p name=\"23c6\" id=\"23c6\" class=\"graf graf--p graf-after--h3\">It&#8217;s funny because actually, at the time, I had no idea there was such a thing as a &#8220;digital nomad&#8221;, except for maybe Tim Ferriss&#8217; &#8220;4-hour work week&#8221;, which didn&#8217;t appeal to me at all. Why would anyone want to work for 4 hours a week, if you love what you do? It just seemed very superficial to me, and promoted an unbalanced lifestyle.</p><p name=\"1dc1\" id=\"1dc1\" class=\"graf graf--p graf-after--p\">I remember that pretty early on, while I was in Seoul, South Korea, my debit and credit cards were being declined. I had been banking with Rabobank for some time in The Netherlands and to be honest, I didn&#8217;t really have any issues prior to my trip.</p><p name=\"ea2f\" id=\"ea2f\" class=\"graf graf--p graf-after--p\">Their problem had to do with my whereabouts, which resulted in the bank blocking all my cards due to &#8216;a number of suspicious transactions&#8217; from South Korea, which I had explained were my own.</p><p name=\"9a46\" id=\"9a46\" class=\"graf graf--p graf-after--p\">On one occasion, the agent on the other side of the call even asked me to get back in touch in a few days because the relevant department who could unblock my cards had already left for the weekend. I was left out in the cold, having to walk for nearly 2 hours back to my accommodation. Meanwhile, I had more than enough money to my name, but no way to actually access it&#8202;&#8212;&#8202;Well done Rabobank!</p><p name=\"a522\" id=\"a522\" class=\"graf graf--p graf-after--figure\">A similar incident happened while I was in Taiwan&#8202;&#8212;&#8202;my cards had been blocked once again. This time however, a quick phone call was all I had to do to access my money. But what the bank failed to mention over the phone, was the fact that I had been skimmed for about $5K. When I called back to ask what had happened, I was told that I had made the purchases. Essentially, Rabobank had either assumed I was in two places at the same time (Taiwan where I was currently based; and Bali, where the fraudulent transactions originated from), or that I had been stealing money from my own account.</p><p name=\"4f07\" id=\"4f07\" class=\"graf graf--p graf-after--p\">To top it all off, I was asked to come into the local branch in Amsterdam to discuss my relationship with the bank. They were so serious about the issue, and actually believed I was the perpetrator. Somewhere in the middle of our heated phone calls, emails and angry tweets, Rabobank decided that this was the perfect opportunity to entice me into getting a mortgage and home owner&#8217;s insurance.</p><p name=\"2028\" id=\"2028\" class=\"graf graf--p graf-after--p\">As you can imagine, I was furious and never wanted to deal with them ever again. After even more complications, my funds were finally deposited back into my account about 2 weeks later.</p><h3 name=\"ca3b\" id=\"ca3b\" class=\"graf graf--h3 graf-after--p\">How did you overcome these issues with your&#160;bank?</h3><p name=\"54a2\" id=\"54a2\" class=\"graf graf--p graf-after--h3\">At the time, the only option available to me was to open a new account with a different bank. I chose ING, which is another major bank in The Netherlands.</p><p name=\"9fe4\" id=\"9fe4\" class=\"graf graf--p graf-after--p\">Sadly, the customer experience was less than ideal. I couldn&#8217;t open an account online or via their app and had to visit one of their branches, which, to my mind, shouldn&#8217;t have taken longer than 10&#8211;15 minutes.</p><p name=\"88f4\" id=\"88f4\" class=\"graf graf--p graf-after--p\">However, the process felt like a lengthy interrogation. I was asked if I had any connections with Syria or Cuba, to which I said &#8216;sure, I sell rockets as a hobby&#8217;, just to gauge the lady&#8217;s reaction. The Dutch usually have a good sense of humour, but not at ING. I mean, I understand this is a serious issue but is it really appropriate to ask these type of questions during the first meeting with a brand new customer?</p><p name=\"8bf9\" id=\"8bf9\" class=\"graf graf--p graf-after--p\">I finally received my bank account. I then asked for a credit card because Dutch debit cards tend to not work so well abroad due to the incompatible archaic systems used at home. What really put me off using traditional banks was the fact that my credit card application was denied, when I had clearly stated that I&#8217;d be travelling and would need a reliable solution to manage my money. Never again would I trust traditional banks, especially Dutch ones&#8202;&#8212;&#8202;I was so fed up with it all.</p><h3 name=\"679d\" id=\"679d\" class=\"graf graf--h3 graf-after--p\">And at what point did Revolut become your primary&#160;card?</h3><p name=\"988e\" id=\"988e\" class=\"graf graf--p graf-after--h3\">After my frustrations with the banks and my endless pursuit for justice on Twitter, I was recommended to try <a href=\"https://medium.com/@RevolutApp\" class=\"markup--user markup--p-user\" target=\"_blank\">Revolut</a>. I know this is probably going to sound like an infomercial, but my experience with them was flawless. Revolut isn&#8217;t a traditional bank account. They call themselves a &#8216;digital banking alternative&#8217; and rightfully so&#8202;&#8212;&#8202;Revolut gives you everything you&#8217;d expect from a bank and so much more, all without actually being one.</p><p name=\"f4d3\" id=\"f4d3\" class=\"graf graf--p graf-after--p\">I downloaded the <a href=\"http://revolut.com/get\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Revolut app</a> and opened an account within a few minutes. Less than 48 hours later, I had my prepaid MasterCard delivered by post&#8212; again, great service. On the app, I can add virtual cards, which help me manage all my different subscriptions. I can also switch cards on and off and use all the other extra security features. In use, the app itself is 10x smoother than traditional bank apps I&#8217;ve used.</p><p name=\"3152\" id=\"3152\" class=\"graf graf--p graf-after--p\"><a href=\"http://revolut.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Revolut</a> never blocked my card. It let me set which countries the card works in. It also sent me push notifications for all my transactions and important account events. Being able to instantly change my card limits is another great feature. I&#8217;ll usually have it set to a small amount, say $100, and whenever I have to pay for a bigger purchase, I would simply raise it in the app. With the banks, that would require at least one phone call and the whole process could sometimes take over 24 hours before the change came into effect.</p><h3 name=\"fc29\" id=\"fc29\" class=\"graf graf--h3 graf-after--figure\">Where do you think traditional banks can&#160;improve?</h3><p name=\"2579\" id=\"2579\" class=\"graf graf--p graf-after--h3\">Banking is an exceptionally archaic industry. It runs on legacy systems and there&#8217;s too much regulation in place to begin with. The traditional way to bank, which has been in place for far too long, doesn&#8217;t cut it anymore. People are online 24/7 now and they expect to use a product that offers a great user experience.</p><p name=\"0511\" id=\"0511\" class=\"graf graf--p graf-after--p\">One thing I&#8217;m against is the traditional business model used in retail banking. Most banks will offer consumer banking as a free service, but then they will try to upsell mortgages and insurance policies to recoup the costs. That&#8217;s not transparent to me. I&#8217;ll happily pay for the entire cost of operating a bank account for me and not be upsold! When I&#8217;ll need a mortgage, I&#8217;ll get it myself, thanks!</p><h3 name=\"bdab\" id=\"bdab\" class=\"graf graf--h3 graf-after--p\">Going forward, what would you like to see next from your Revolut&#160;account?</h3><p name=\"be5b\" id=\"be5b\" class=\"graf graf--p graf-after--h3\">I own some cryptocurrencies, so it would be nice to be able to have a small wallet (e.g. $500) built into the <a href=\"http://revolut.com/get\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Revolut app</a> and be able to easily convert my USD/EUR into Bitcoin, if I&#8217;d like to.</p><p name=\"5ade\" id=\"5ade\" class=\"graf graf--p graf-after--p\">I&#8217;d also love to see actual Revolut credit cards, as well as <a href=\"https://www.revolut.com/personal-loans\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Revolut Credit</a> available anywhere in Europe.</p><p name=\"1325\" id=\"1325\" class=\"graf graf--p graf-after--p\">Personally, I&#8217;m intrigued by <a href=\"https://www.revolut.com/business\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Revolut for Business</a>, which I heard will have its own API. It&#8217;d be great if I could feed my business payments straight into my bookkeeping system with a Webhook or something similar. For small business owners like me, that would means quicker accounting and less hassle overall.</p><p name=\"643f\" id=\"643f\" class=\"graf graf--p graf-after--p\">Finally, I&#8217;d love to see Revolut expand into other countries like Singapore, where a huge number of internet business owners are registered. Some food for thought, Revolut!</p><h3 name=\"0547\" id=\"0547\" class=\"graf graf--h3 graf-after--p\">And finally, what advice would you give your younger self on becoming a digital&#160;nomad?</h3><p name=\"b49d\" id=\"b49d\" class=\"graf graf--p graf-after--h3\">I would forget the concept of &#8220;digital nomad&#8221; altogether. We&#8217;re living in a world where most of us already work remotely without realising it. Whenever you go on a weekend trip and you find yourself replying to the odd email from your phone, that&#8217;s called <strong class=\"markup--strong markup--p-strong\">working</strong>. Also, more and more employers are offering staff the possibility to work remotely and more and more people are choosing to become freelancers or starting their own businesses.</p><p name=\"23cb\" id=\"23cb\" class=\"graf graf--p graf-after--p graf--trailing\">In terms of advice, I&#8217;d say don&#8217;t do it full-time and don&#8217;t see it as an identity. You can do whatever you want&#8202;&#8212;&#8202;settle down, fly away, live abroad, settle back, or whatever you feel like doing. You don&#8217;t have to confine yourself to a term, just because it&#8217;s trending. Do whatever you want to do and believe in yourself.</p></div>","title":"Meet the digital nomad who uses Revolut – Revolut Blog – Medium"}},"pageContext":{"id":"5b937ae287be056953db7ce6"}}