{"data":{"data":{"edges":[{"node":{"id":"5b937b3787be056953db7d3b","title":"No one is going to teach you how to become a digital nomad","source":"medium_search_nomad","summary":"No one is going to teach you how to become a digital nomadAre you looking for some advice on how to become a digital nomad?\nHere are two cents from someone that has been traveling the world while working remotely for the past four years:No one is going to teach you how to become a digital nomad.\nI’ve met people working remotely with psychology, illustration, medicine, cryptocurrency, education and even oceanography.\nIt’s possible that you will not be able to become a digital nomad doing exactly the job you’re doing right now.\nThere’s no such thing as a single secret formula to become a digital nomad.","info":{"author":"Debbie Corrano","top_img":"https://cdn-images-1.medium.com/max/1200/1*4EbWvWO_O3TEK43Pq13yeQ.jpeg"}}},{"node":{"id":"5b937b3787be056953db7d3a","title":"The 'digital nomad' is the modern hobo – WEG Pub – Medium","source":"medium_search_nomad","summary":"The ‘digital nomad’ is the modern hoboRecently, we’ve seen the rise of what is euphemistically known as the ‘digital nomad’.\nI propose we call them by what they really are: digital hobos.\nOr, really, let’s just call them hobos, since the only significant difference between the hobos of the early 20th century and today’s ‘digital nomads’ is the tech.\nThe digital hobo can project themselves as heroic and enterprising, rather than as frightened and alone.\nThis is what digital hobos leave behind.","info":{"author":"Wyatt Edward Gates","top_img":"https://cdn-images-1.medium.com/max/1200/1*rsuOXdv_wfUCvoCVFZflIA.png"}}},{"node":{"id":"5b937b3687be056953db7d39","title":"Digital Nomad Guide to Plovdiv, Bulgaria: The “Chiang Mai of Europe”","source":"medium_search_nomad","summary":"Digital Nomad Guide to Plovdiv, Bulgaria: The “Chiang Mai of Europe”The reasons to come to Plovdiv this year if you’re a travelling entrepreneur!\nOne of the many cafes in Kapana, PlovdivPlovdiv nomad score: https://nomadlist.com/plovdiv-bulgaria/scoresChiang Mai, for comparison: https://nomadlist.com/chiang-mai-thailand/scoresThis is my digital nomad guide to Plovdiv.\nIn reality, they’re probably just embarrassed that they don’t speak English well and don’t know how to help you.\nNavigating the bureaucracy is difficult if you don’t speak Bulgarian, so I highly recommend that you get a good immigration lawyer to help you.\nThe only issue is that many households in Plovdiv (and Bulgaria in general) still use coal for heating in the winter.","info":{"author":"Euvie Ivanova","top_img":"https://cdn-images-1.medium.com/max/1200/1*cx3omSK8oeyGko4tGX549A.jpeg"}}},{"node":{"id":"5b937b3387be056953db7d38","title":"The Dark Side of Being an Expat and a Digital Nomad that No One Talks About","source":"medium_search_nomad","summary":"Getting visas is like that times 10, with different languages, governments, immigration lawyers, and time zones added in.\nI had planned on staying with my friend for a week before going up to New York.\nThere was always one more document to find, one more form to fill out, one more delay from the solicitor.\nYou know, like going out for drinks regularly, or having a car.\nIt’s just been two years since the live-in lovah & I moved into a flat that had more than 150 square feet.","info":{"author":"Rachel Allen","top_img":"https://cdn-images-1.medium.com/max/1200/1*rLrnHR4JpOuU9gp3CPmGXA.jpeg"}}},{"node":{"id":"5b937b3287be056953db7d37","title":"Rise of Digital Nomad Destinations – Ben Keene – Medium","source":"medium_search_nomad","summary":"My first ‘digital nomad’ experience was as a volunteer in 1999 at Glengarry — a spectacular outdoor school in the heart of New South Wales.\nWe now know quite a lot about being a digital nomad: airbnb, couchsurfing, home swapping and house sitting have enabled this growth as much as wifi and cheaper travel has.\nHere are 9 digital nomad destination ideas that I’ve come across that have the potential to ride this wave.\nJoining our diverse community of members and collaborators will inspire, connect, and enable you to develop your best work every step of the way.\nFind a home/office in the best nomad destinations.","info":{"author":"Ben Keene","top_img":"https://cdn-images-1.medium.com/max/1200/1*l7rmS0r01_LTrDIHn1i79g.jpeg"}}},{"node":{"id":"5b937b3187be056953db7d36","title":"Learning to code and becoming a software engineer. – codeburst","source":"medium_search_nomad","summary":"Learning to code and becoming a software engineer.\nOne of my goals for this blog is to start offering real skills of how to become a software engineer and learn to code.\nOver the past few years, I have seen so many resources for how to learn to code on the internet.\nThere is Code Academy, Code School, General Assembly, etc that have all popped up as great ways to learn how to code.\nHow do I know you can succeed with this and even get your own app on the Apple App store or Google Play?","info":{"author":"The Ginger Nomad","top_img":"https://cdn-images-1.medium.com/max/1200/1*RzaInxk-6KSfmGQtFiEuIw.jpeg"}}},{"node":{"id":"5b937b3187be056953db7d35","title":"How I Went From A Broke College Kid To Traveling The World As A Digital Nomad","source":"medium_search_nomad","summary":"I needed money &/or a source of incomeAt the time, I was working 20 hours a week as a shoe salesman at Bon-Ton.\nI strived to acquire as much knowledge as I could around what was involved to perform these marketable skills effectively.\nGraphic design had the smallest barrier to entry for me and I could learn new design skills in as little as 15 minutes by watching a Youtube video.\nPhotoshop building mockupOnce I started getting real results ($$$) from learning design skills on Youtube, it started a snowball effect.\nI didn’t have enough time in the day to balance college classes and my freelance design gig — so I dropped out of college.","info":{"author":"Dan Sapio","top_img":"https://cdn-images-1.medium.com/max/1200/1*R7HneaJobQlvdwaOFMqatw.jpeg"}}},{"node":{"id":"5b937b3187be056953db7d34","title":"I went full nomad and it (almost) broke me – Hacker Noon","source":"medium_search_nomad","summary":"I went full nomad and it (almost) broke meEntrepreneurs are used to constantly adapting to unpredictable situations.\n📍 Lisbon | Barcelona | Paris | Bilbao | London | Beirut | Lima | Bogota—✍️ Sign the NOMAD mental health pledge now to continue the conversation and contribute to groundbreaking research 👩‍🔬—Why does this matter?\nIt’s time to have the essential conversation about the physical and mental health of people living as nomads.\nIt’s time to have the essential conversation about the physical and mental health of people living as nomads.\nPeace and love️ global adventurers ✌—✍ Sign the NOMAD mental health pledge now to continue the conversation and contribute to groundbreaking research 👩‍🔬Want to connect?","info":{"author":"Sam Applebee","top_img":"https://cdn-images-1.medium.com/max/1200/1*Il4XkJJ2vPya3aI6GSaScg.png"}}},{"node":{"id":"5b937b3087be056953db7d33","title":"One way to change your life, learn to vlog like Jack Coyne","source":"medium_search_nomad","summary":"In the spring of 2010, Jack was just finishing up his first year of college where he was studying film.\nAfter Jack watched the series, he decided that he needed to figure out how to be around these guys.\nGraduating college and going to work for CaseyCasey and Matt Hackett were just building out their startup company Beme which Jack helped them build.\nTo grow the company, Casey started daily vlogging (video logging).\nBut I’m going to bet that being fired from Beme might be the best thing that ever happens to Jack.","info":{"author":"The Ginger Nomad","top_img":"https://cdn-images-1.medium.com/max/1200/1*XlwX7bz73BXc17z_BEld7g.png"}}},{"node":{"id":"5b937b2e87be056953db7d32","title":"Ultimate Guide to Being a Lady Nomad – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"Meetup- great way to find hiking, hacking, or fun groups of like minded people.\nDo research on local nonprofits and cold email themTry coworking- I always feel safe at coworking spaces.\nUsually you can make friends there and this is great way to have a local buddy.\nCopass- a membership service that gives you access to coworking spaces around the world.\nSharedeskCoworking Wiki- a list of coworking spaces around the worldFind Trustworthy Accommodation- For accommodation, check the reviews diligently.","info":{"author":"Nicole Kelner","top_img":"https://cdn-images-1.medium.com/max/1200/1*F51oYTmUqNGvMwYGdvC3pA.png"}}},{"node":{"id":"5b937b2c87be056953db7d31","title":"Dating as a Digital Nomad – Tessa Clare – Medium","source":"medium_search_nomad","summary":"Dating as a Digital Nomad My quest for love takes me across continents.\nIn the last year, I’ve never spent more than a few weeks in the same city as someone I’ve dated.\nYou meet someone, and a few hours later, you’re sharing things that you haven’t even told your friends from back home.\nMy first relationship as a digital nomad started two weeks before I left the United States.\nIt was one of the most freeing things I’d ever done in my life.","info":{"author":"Tessa Clare","top_img":"https://cdn-images-1.medium.com/max/1200/0*ZAsU0kkshdVe9yDG"}}},{"node":{"id":"5b937b2b87be056953db7d30","title":"From Mafia Wife to Nomad Entrepreneur – The Mission – Medium","source":"medium_search_nomad","summary":"Heading into the UnknownFrom Mafia Wife to Nomad Entrepreneur7 Key Lessons I learned for Reinventing MyselfTime and again, the very nature of life brings us face to face with reinvention.\nThat same night our house was burned to the ground, in a Mafia deal gone bad.\nI was not strong — I was very weak and naïve with no inner power or essence, as I was not allowed to work, pursue a career or find myself in any way.\nBut I had no interest in money as I had no spirit or life in me.\nI was growing an entrepreneurial spirit, and started working different gigs and starting cool ventures and adventures worldwide.","info":{"author":"Maria Camille","top_img":"https://cdn-images-1.medium.com/max/1200/1*bGafrsqo0IXmLVus02Rt3A.jpeg"}}},{"node":{"id":"5b937b2a87be056953db7d2f","title":"Best Online Banks for American Digital Nomads – Nomad Gate – Medium","source":"medium_search_nomad","summary":"In this article, I review the 3 best online American banks (Aspiration Bank, Simple Bank, and Ally Bank) and determine which ones are the best for a digital nomad.\nSupport, ATM Fees, Transfers, and App.\nATM FeesDoes the bank refund international ATM fees and how low are their international transaction fees?\nIn terms of how long you can put in a travel notice, Ally Bank’s support team told me you can do it up to a year.\nATM Fees: 1/2Ally doesn’t charge any fees on their end for withdrawing money.","info":{"author":"Derick Sozo","top_img":"https://cdn-images-1.medium.com/max/1200/1*MSfl4CzUAT616P72JiTX8Q.png"}}},{"node":{"id":"5b937b2987be056953db7d2e","title":"Things You Should Know Before Flying with Children – Future Travel","source":"medium_search_nomad","summary":"Things You Should Know Before Flying with ChildrenThere are not many things I am an expert on, but flying alone with children is one.\nGiven I travel from San Francisco to Boston with three kids on a regular basis gives me some legit street cred.\nFirst, a quick background: I’ve started flying alone with each of my children when they were three months old.\nYour husband will be forced to watch the children while you browse for magazines or pee way more times than you really need, just so you can be alone.\n(By the way, the gate assist doesn’t work with kids as old as mine, but my husband still gets a gate pass every time.","info":{"author":"Eileen Stanley Conway","top_img":"https://cdn-images-1.medium.com/max/1200/1*JvPslx8x4zbvVXjK0WZlBw.jpeg"}}},{"node":{"id":"5b937b2987be056953db7d2d","title":"6 Tools I’ve Used to Survive the Digital Nomad Lifestyle","source":"medium_search_nomad","summary":"6 Tools I’ve Used to Survive the Digital Nomad LifestyleEverything I’ve learned to make living & working remotely fun & (mostly) crisis-free.\nThat may not sound like much to you, but when you’re a digital nomad who’s flying solo, every day can present unexpected adventures — some more welcome than others.\nThe only investment you’re really putting in is your time and patience to set up your daily and weekly to-dos.\nThis is really nice for digital nomads, because you can go to any ATM to withdraw cash without getting fleeced by hidden fees.\nIf your charges go higher than that over 24 hours, you’ll need to contact Simple to increase your spending limit, which can go as high as $6,000.","info":{"author":"Tiffany Sun","top_img":"https://cdn-images-1.medium.com/max/1200/1*Xhxre9Bli6atKOyZOwkbHA.jpeg"}}},{"node":{"id":"5b937b2687be056953db7d2c","title":"A Nomad’s Guide to Staying Fit – Amy Scott – Medium","source":"medium_search_nomad","summary":"A Nomad’s Guide to Staying FitI’ve been location independent since 2004, and a full-time nomad off and on ever since.\nStaying healthy on the road is probably one of my biggest challenges, and I certainly don’t claim to have it all figured out!\nBodyweight exercises are a great tool for staying healthy on the road because they don’t require any special equipment.\nWhen you’re in sightseeing mode, you might naturally stay fit by spending a lot of time walking around a new city.\nI also suggest asking a local for good places to exercise, and letting someone know where you’re headed if you’re going alone.","info":{"author":"Amy Scott","top_img":"https://cdn-images-1.medium.com/max/1200/1*YQHwnDrfdMt07gArXWEcgg.jpeg"}}},{"node":{"id":"5b937b2687be056953db7d2b","title":"讀書筆記-Nomad Life 新遊牧生活 – 刻意練習團練室 – Medium","source":"medium_search_nomad","summary":"Like what you read?\nGive 刻意練習團練室 a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*WNjTfkiPblg32Nj_CMQXxg.jpeg"}}},{"node":{"id":"5b937b2687be056953db7d2a","title":"3 Steps to Living the Nomad Life – The Mission – Medium","source":"medium_search_nomad","summary":"3 Steps to Living the Nomad Life How to set up your dream lifestyle…Ever dreamed of living a nomadic lifestyle?\nIf so, you’re probably one of the many people that gets consistently envious of nomad life whenever you browse Instagram.\nAnd without fuel in modern nomadic living — you’re going nowhere.\nOrganizing your affairs will bring you so much closer to nomad life.\nJust remember — with patience and hard work you will soon be living the nomad life.","info":{"author":"Phil Manning","top_img":"https://cdn-images-1.medium.com/max/1200/1*AqEKvnkkpjPqNxggCr7XAA.jpeg"}}},{"node":{"id":"5b937b2687be056953db7d29","title":"A digital nomad guide to incorporating a company & opening a bank account in Hong Kong","source":"medium_search_nomad","summary":"The banks in Hong Kong include some of the biggest and best brands in the world and all use the latest technology, so e-banking is everywhere (perfect for those who don’t plan to go in any Hong Kong bank branches any time soon).\nA caveat is that Hong Kong-sourced profits are subject to 16.5% tax, so you will need some care if selling products to Hong Kong customers.\nTypes of company and bank account you can openYou need a residents permit to open a sole trader business and bank account, so as a nomad, you will need to focus on opening a Limited Company.\nSetting up shop (or at least getting an office address)Unless you are actually moving to Hong Kong and setting up an office, chances are you will not have a Hong Kong business address or a Hong Kong-based company secretary.\nOther things to note about Hong Kong companies and bank accounts","info":{"author":"James Hunt","top_img":"https://cdn-images-1.medium.com/max/1200/1*Qac2uFJ71CSqWHGeyxZA0w.jpeg"}}},{"node":{"id":"5b937b2587be056953db7d28","title":"52 Best Digital Nomad Destinations to Go in 2018 – Life Designed – Medium","source":"medium_search_nomad","summary":"52 Best Digital Nomad Destinations to Go in 2018Bali is one of the hottest places to go in 2018.\nBut what are the best digital nomad destinations?\nI reached out to 30 digital nomads, location independent entrepreneurs and travelers and asked them to share their top picks for the best digital nomad destinations to go in 2018.\nChristopher Dodd is a blogger and social media influencer who writes and creates videos about the digital nomad lifestyle.\nJennifer Lachs is a former chemist turned digital nomad and founder of Digital Nomad Girls, the largest community for location independent women in the world.","info":{"author":"Tomas Laurinavicius","top_img":"https://cdn-images-1.medium.com/max/1200/0*sEgusqBeKI0N73AB.jpg"}}},{"node":{"id":"5b937b2487be056953db7d27","title":"Digital Nomad Insurance – The Mission – Medium","source":"medium_search_nomad","summary":"Digital Nomad Insurance A Guide to Health Insurance as a Global CitizenI’d like to tell you this is THE source, the ABSOLUTE complete guide to digital nomad insurance…but I have to be honest…The more I research digital nomad health insurance — the more I get confused.\nNomad Insurance: Travel vs. Health InsuranceFirst things first — don’t think you can just get digital nomad travel insurance and call it a day.\nThis is ideal when we’re talking about digital nomad health insurance.\nCigna -Cigna may be one of the most chosen options for digital nomad insurance and rightfully so.\nBut as one of the leaders in travel insurance naturally they decided to go into digital nomad health insurance.","info":{"author":"Phil Manning","top_img":"https://cdn-images-1.medium.com/max/1200/1*i6fwF6nN5SOQn9_JPai4LA.jpeg"}}},{"node":{"id":"5b937b2287be056953db7d26","title":"How do e-residents pay taxes? – E-Residency Blog – Medium","source":"medium_search_nomad","summary":"Estonia currently ranks first in the International Tax Competitiveness Index and enables entrepreneurs to pay Estonian taxes entirely online with minimal hassle.\nYour personal taxes pay for a wide range of services from healthcare to pensions in the country that you are personally tax resident.\nSteve’s personal tax residency is still in the UK and that allows him to keep contributing to his healthcare and pension there.\nSteve pays UK taxes on his salary as a foreign employee and his company pays Estonian taxes on his dividends.\nMore informationThere’s more information about Estonian taxation for non-residents here on our website for the Estonian Tax and Customs Board.","info":{"author":"Evelyn Liivamägi","top_img":"https://cdn-images-1.medium.com/max/1200/1*zQ56WlZs_dgBmyd8Cyhcrg.png"}}},{"node":{"id":"5b937b2187be056953db7d25","title":"You Can Help Create The World’s First (Real) Digital Nomad Visa","source":"medium_search_nomad","summary":"You Can Help Create The World’s First (Real) Digital Nomad VisaNo visa runs, no legal gray area—a legit visa tailor-made for digital nomads.\nTo put together a solid proposal for the visa, Jobbatical is pairing up with Estonia’s Ministry of the Interior to collect input from the digital nomad community.\nWhat is a digital nomad anyway?\nHow would you legally define a digital nomad?\nWhat would you expect from a digital nomad visa?","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*1MfAOLAKJeM3moPk_0lCsA.gif"}}},{"node":{"id":"5b937b2087be056953db7d24","title":"Why I left San Francisco to build my new startup while traveling the world","source":"medium_search_nomad","summary":"Because San Francisco is expensive and Asia is not.\nI needed at least $4,000 per month to live in San Francisco without any kind of crazy luxury.\nThe customers of my new company were not in San Francisco, so there was no reason for me to actually be there.\nWhen I was in San Francisco, I knew that quitting my job was going to limit my runway to build a company.\nAfter a few years in San Francisco of saying yes to almost every dinner and weekend plan, it was not easy to start exercising this muscle again.","info":{"author":"Ariel Camus","top_img":"https://cdn-images-1.medium.com/max/1200/1*Y3TGJ8_SEQyb0BEs3fnXKQ.jpeg"}}},{"node":{"id":"5b937b1f87be056953db7d23","title":"The Swashbuckling Adventures of a Digital Hermit (Not Nomad)","source":"medium_search_nomad","summary":"The Swashbuckling Adventures of a Digital Hermit (Not Nomad)Photo by Yareli Urzua on UnsplashI know you are in Bali.\nAnd you only think you like the digital nomad lifestyle because you are running away from something.\nHow I SwashbuckleI understand that your digital nomad lifestyle affords you a certain swagger.\nBut then I pontificate about how my digital hermit lifestyle matches up and I start to feel good about myself again.\nBecause this is the digital nomad life (in my head).","info":{"author":"Jonathan Greene","top_img":"https://cdn-images-1.medium.com/max/1200/0*cqPov-QsG9FBLgFB"}}},{"node":{"id":"5b937b1f87be056953db7d22","title":"Digital Nomad Backpack – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"Optimal settings for a digital nomad, but not a really cheap destination.\nBeing on the road as digital nomad for several months means to carry your business in a backpack.\nI roamed from the small beach village Jericoacoara, Brazil to the Amazonas rain forest and moved further on to the digital nomad hotspot Medellin in Colombia.\nPlease let me know via comment, personal mail or face time on the DNX GLOBAL ★Digital Nomad Conference.\n❤ THX for reading and sharing ❤I am Digital Nomad by heart and founder of DNX — Digital Nomad Hub.","info":{"author":"Marcus Meurer","top_img":"https://cdn-images-1.medium.com/max/1200/1*U4U7oRLfjUiGULQT_nHT1A.png"}}},{"node":{"id":"5b937b1e87be056953db7d21","title":"Nomad Life — 數位遊民與遠端工作甘苦談 – 玩簡報，學設計 – Medium","source":"medium_search_nomad","summary":"Like what you read?\nGive 金彥良（Wade Jin） a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"金彥良 Wade Jin","top_img":"https://cdn-images-1.medium.com/max/1200/1*Y2qm7WOznHbkElSBqnNvcA.png"}}},{"node":{"id":"5b937b1e87be056953db7d20","title":"Traveling Around The Globe With a Budget of $1000/Month","source":"medium_search_nomad","summary":"Traveling Around The Globe With a Budget of $1000/Month Lithuania, Hungary, Ukraine, Romania, Bulgaria, UAE, Malaysia, Singapore, Indonesia, Philippines, Thailand, Vietnam, USA, UK, Lithuania What happened when I packed my life into a backpack and left home with a one-way ticket?\nToday I’d like to share some lessons I’ve learned traveling and exploring the world with an average budget of $1000/month.\nPlanning If you think there is a secret to cheap traveling and seeing the world on a tight budget, it must be a never-ending-planning.\nAnyway, food in Thailand, Bali, Singapore is incredible.\nA simple meal in Bali, Thailand, Vietnam can cost you from $1 to $3 depending on the place.","info":{"author":"Tomas Laurinavicius","top_img":"https://cdn-images-1.medium.com/max/1200/1*LITnpMPS4HehMk6cqbLX2w.jpeg"}}},{"node":{"id":"5b937b1d87be056953db7d1f","title":"Nomad Capitalist Andrew Henderson on Launching an International Life","source":"medium_search_nomad","summary":"Nomad Capitalist Andrew Henderson on Launching an International LifeAndrew Henderson in Tbilisi, GeorgiaThis interview with Andrew Henderson was originally published by Huffington Post, written by a HuffPost contributor and Nomad Capitalist’s editor.\nFor Nomad Capitalist founder Andrew Henderson, the philosophy is simple: go where you’re treated best.\nThe idea of going where you’re treated best means proactively pursuing the numberless opportunities the world has to offer.\nIf you’re an American, the first step toward finding where you’re treated best is to leave the United States.\nThey want to move to Canada or England or some other “first world” country that’s “just as good” as the United States.","info":{"author":"Nomad Capitalist","top_img":"https://cdn-images-1.medium.com/max/1200/1*PqRFtNkbCRWVBFloZfJ3Cg.jpeg"}}},{"node":{"id":"5b937b1c87be056953db7d1e","title":"The Ultimate Guide to Estonian E-residency, Banking and Taxes","source":"medium_search_nomad","summary":"What the Estonian e-residency is not:IT IS NOT an actual residency .\nIT IS NOT a citizenship , and you will never receive any consular support from the Estonian government for holding an e-residency.\nThe e-residency does not give you a right to open an account with any bank in Estonia.\nLHV is a mid-sized, modern Estonian bank with roots as an investment firm.\nPanama), in many cases, no other tax than the 20% Estonian corporate tax will need to be paid.","info":{"author":"Thomas K. Running","top_img":"https://cdn-images-1.medium.com/max/1200/1*9vdNgIihp5FUJl2ZijPtEg.png"}}},{"node":{"id":"5b937b1a87be056953db7d1d","title":"Waking up in Thailand – Hacker Noon","source":"medium_search_nomad","summary":"They make more money than you, they work at exciting startups, they live in cool places.\nTo work at Google, to be the CTO of your own startup, to live somewhere warm and beachy.\nYou see lots of people posting selfies on Thai beaches, sipping sugary cocktails while they work on their startups.\nMaybe they’re in Thailand, maybe they’re in Singapore, maybe they’re in Nepal.\nYou’re not really sure; you’d be hard-pressed to label these countries on a map.","info":{"author":"Lev Kravinsky","top_img":"https://cdn-images-1.medium.com/max/1200/1*UkJDuTBV0ZTor9Wy4EQegg.jpeg"}}},{"node":{"id":"5b937b1887be056953db7d1c","title":"Isn’t being a nomad just being homeless ? – Sara Vieira – Medium","source":"medium_search_nomad","summary":"Isn’t being a nomad just being homeless ?\nshit about to get deepHi 👋My name is Sara and this is how many conferences/meetups I have this year: https://www.notion.so/saravieira/52a9335125324fd5bc520dd413bc9ff8?v=e59d1553ee474c32abf6f7cd6cec6efd, if you lazy that is 22.\nI keep hearing this like:Oh I wish I had your job, you get to travel Europe for free, that is so cool !\nThe reason I travel so much is because I am trying to find my home, the place I feel like I am at home.\nSome people envy me because I have no one to give satisfactions to and I sometimes envy them because they do.","info":{"author":"Sara Vieira","top_img":"https://cdn-images-1.medium.com/max/1200/1*hpbfO5XlBHfmNWTVjZq5OA.jpeg"}}},{"node":{"id":"5b937b1887be056953db7d1b","title":"11 months & $750,000 later, I decided to close my drop shipping business. Here’s why.","source":"medium_search_nomad","summary":"In this way, starting this business was quite intense and steep, in the beginning.\nYet, the 3 most valuable things I’ve learned are not about this business itself, but more about the mindset I developed.\nOnce the business is running (aka, is profitable), what you need is not to work more, but to work smarter.\nThere is millions of ways to be busy, work and doing things on the business.\nMoreover, as most of the time you’ll be wrong, being wrong is what brings the most interesting insights.","info":{"author":"Thomas Despin","top_img":"https://cdn-images-1.medium.com/max/1200/1*N8jOk5SStnpk6tFA3sApNg.jpeg"}}},{"node":{"id":"5b937b1887be056953db7d1a","title":"I’m Not Living The Dream – The Startup – Medium","source":"medium_search_nomad","summary":"I’m Not Living The Dream I’m a nomad.\nAnd I’m not living the dream.\nPhoto credit: Alexandre PerottoI decided to write this after I had a conversation with a friend who wanted this lifestyle.\nCompared to the vast, vast majority of the world, I shouldn’t be complaining.\nEven now as I’m writing this, I’m hesitant to hit publish.","info":{"author":"Charlie Guo","top_img":"https://cdn-images-1.medium.com/max/1200/1*m8yNeF6J4HQ-2BRi8M3v5Q.jpeg"}}},{"node":{"id":"5b937b1887be056953db7d19","title":"How to travel the world as a developer – freeCodeCamp.org","source":"medium_search_nomad","summary":"Having a job that allows you to make your own hours and travel at the same time is pretty cool.\nSet Realistic Expectations of Remote Work First off, let’s get one thing straight.\nThe reality of remote work is you’ll probably be spending most of your time in cafes, co-working spaces, public areas with wifi, and at home.\nRemote work can be extremely rewarding if you get into a good groove with it.\nMethod #3: Negotiate a few small baby steps for remote work with your boss, then knock it out of the park.","info":{"author":"Iskender Piyale-Sheard","top_img":"https://cdn-images-1.medium.com/max/1200/1*rK0jwo0-Zx4dectQ2uzZJg.jpeg"}}},{"node":{"id":"5b937b1787be056953db7d18","title":"Digital nomad? Nope. I chose the freelance life so I can stay at home.","source":"medium_search_nomad","summary":"I chose the freelance life so I can stay at home.\nI still work about the same amount of hours that most people do, but when I’m not working, I’m with them.\nWhen you run your own freelance business, you can build variety into your workload to keep your creative juices happy.\nGet closer to your clientsThere’s an intimacy⁷ you have with freelance clients that you never quite get if you’re working for a larger company.\nTo summarise…Despite what some self-help listicles may say, the freelance life is rarely glamorous or globe-trotting.","info":{"author":"Benek Lisefski","top_img":"https://cdn-images-1.medium.com/max/1200/1*A6SFwHAQlwml4ff8HOA2jQ.jpeg"}}},{"node":{"id":"5b937b1787be056953db7d17","title":"I quit my job and I have one year to get to profitability","source":"medium_search_nomad","summary":"I quit my job and I have one year to get to profitabilityThe BeginningI have a dreamI want to ship products and earn $1,000/month (recurring) doing itWhy $1,000?\nI didn’t hate my job but I knew that following my passion, instead of just daydreaming about it, was going to be the road to success.\nFearsI feared randomly being fired from my job, emptying my bank account and wasting my time on a dream that didn’t pan out.\nI feared the unknown that would come with quitting my job and attempting to create something on my own.\nI officially quit my job and made a commitment to myself to make product(s) with $1,000 / monthly revenue by shipping full time for 1 year.","info":{"author":"Andrey Azimov","top_img":"https://cdn-images-1.medium.com/max/1200/1*Vxp7HWUTpseb0ap4XpQZAQ.png"}}},{"node":{"id":"5b937b1687be056953db7d16","title":"Traveling the world full-time doesn't solve anything","source":"medium_search_nomad","summary":"Traveling the world full-time doesn't solve anythingI’ve been traveling the world full time for a bit more than 4 years.\nEven though I’ve been pretty much changing places every few months or so, I’ve been also looking for a change.\nI wanted to do things differently and I knew I had to step out of my comfort zone so this could happen.\nMy comfort zone was back there on the road, not watching the trees grow in Palermo.\nIt’s kicking my comfort zone in the ass and doing something I’m not used to do.","info":{"author":"Debbie Corrano","top_img":"https://cdn-images-1.medium.com/max/1200/1*GZOKlDR5ykkr0jglL-Yj4g.jpeg"}}},{"node":{"id":"5b937b1587be056953db7d15","title":"This Is How You Survive as an Airbnb Nomad (dating app suggestions included)","source":"medium_search_nomad","summary":"This Is How You Survive as an Airbnb Nomad (dating app suggestions included)I finally learned how to be at peace when I’m on the road for months at a time.\nAirbnb was my first stop in San Francisco when I got a gig there for the summer.\n#Airbnb hasn’t stopped being my stop-along-the-way to a permanent place for nearly a year now.\nYou want details about surviving as an Airbnb nomad at the age of 50.\nFor now, I leave you with a list of ‘essentials to pack’ that you need to have at all times if you want to survive nine months as a nomad.","info":{"author":"Denise Brodey","top_img":"https://cdn-images-1.medium.com/max/1200/1*A1TtHj0k4GrgmDsk6XarLA.png"}}},{"node":{"id":"5b937b1487be056953db7d14","title":"How I got the “German Freelance Visa” in Berlin, April 2017","source":"medium_search_nomad","summary":"How I got the “German Freelance Visa” in Berlin, April 2017My experience, in grave detail of how I got my residence permit in Germany as a freelancer, aka “The German Freelance Visa”.\nI sold everything and moved without having ever been to Berlin, not knowing a single person or a lick of German.\nOk, so:As you’ve probably figured out, for non-EU citizens, staying in Germany (or most of Europe) for longer than 90 days requires a visa or residence permit.\nAs for registering at the Bürgeramt: You’ll need to go in person to your local Bürgeramt, or registration office, and submit your application form.\nMake your appointment at the Ausländerbehörde (foreigner’s office) before your 90 days as a tourist are upBy this I mean, before your 90 days are up, go online and book your appointment.","info":{"author":"Paige Rollison","top_img":"https://cdn-images-1.medium.com/max/1200/1*tMwPr-gK5jNmP_VXvVojeA.jpeg"}}},{"node":{"id":"5b937b1387be056953db7d13","title":"Work-friendly cafes in Singapore you can really get work done in","source":"medium_search_nomad","summary":"Work-friendly cafes in Singapore you can really get work done inCoffee + WiFi + Power outletsI’m a visual designer working remotely in Singapore, which means I spend most days in the comfort of my home.\nSometimes, though, when I need a change in environment, I’d go to a cafe to get my work done.\nThe problem is that it’s incredibly difficult to find cafes to work in.\nBy “work”, I mean actual, serious work—creating mockups on Sketch, liaising with colleagues via Slack, having video calls on Skype.\nBut first, a few tips:Cafe etiquetteThe most important thing about working in cafes is to not be an ass!","info":{"author":"Teo Yu Siang","top_img":"https://cdn-images-1.medium.com/max/1200/1*US9WKDD0S0DU1Iids7iPyw.jpeg"}}},{"node":{"id":"5b937b1087be056953db7d12","title":"Digital Nomad Gear Essentials 2018 [Updated!] – Future Travel","source":"medium_search_nomad","summary":"It’s a powerhouse in terms of what I need for developer work, with easily a day’s worth of battery life to boot.\nWhen I’m using it on a plane or haven’t brought my Roost Stand and external keyboard along, the Carbon’s built-in classic ThinkPad keyboard is still a pleasure to use.\nThe Roost StandThis was one of the first items I invested in, along with the Roost Stand.\nThere are two little fold-out feet on the bottom of the keyboard that make it even more ergonomically friendly.\nI’m able to fit all of my clothing into the large packing cube, which compresses it slightly when zipped up.","info":{"author":"Vicky Lai","top_img":"https://cdn-images-1.medium.com/max/1200/1*j59WaCFSLT9or7ki9OOztQ.jpeg"}}},{"node":{"id":"5b937b0e87be056953db7d11","title":"In no particular order: Some things I have learned so far in my 9ish months as a nomad","source":"medium_search_nomad","summary":"In no particular order: Some things I have learned so far in my 9ish months as a nomadIt’s okay to say this sucks sometimes.\nI still like to check off all the things you’re supposed to see, but I don’t sweat it if I miss a few.\nI’m way more concerned with who makes the best croissant.\nI actually finish all the things I was supposed to do, so I just.. go to bed when I’m tired.\nIt’s worth the extra weight/space/snarky-remarks to be able to come home and wash off a bad day with all my favourite things.","info":{"author":"Meg Robichaud","top_img":"https://cdn-images-1.medium.com/max/1200/1*hQuWySQ1C9naQ2VvrOnNrw.png"}}},{"node":{"id":"5b937b0d87be056953db7d10","title":"Want to be a digital nomad? Read this first. – Hacker Noon","source":"medium_search_nomad","summary":"I come across a lot of people drooling over the digital nomad lifestyle nowadays.\nBefore and througout your trip you’re going to spend time and money on all that bureaucratic nonsense you didn’t know even exist.\nSo even if you’ve won the birth lottery and hold the passport of some developed country you’re still going to lose time and money on paperwork.\nSo while I find this whirlwind of people enjoyable, there is no way I’m going to keep doing this on a permanent basis.\nRemember, you’re going to forget it after leaving the country anyway.","info":{"author":"Alex Moskovski","top_img":"https://cdn-images-1.medium.com/max/1200/1*DUaK_xd_3W1pGnGPGEa7RQ.jpeg"}}},{"node":{"id":"5b937b0b87be056953db7d0f","title":"遠距工作薪水支付方式與行政瑣事 – Remote Taiwan","source":"medium_search_nomad","summary":"Like what you read?\nGive Yu-Fang Wu a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"Yu-Fang Wu","top_img":"https://cdn-images-1.medium.com/max/1200/1*WaDtEY8Qa79M7EOGmENTPw.jpeg"}}},{"node":{"id":"5b937b0a87be056953db7d0e","title":"Digital Nomads Are Not the Future – Member Feature Stories – Medium","source":"medium_search_nomad","summary":"How Do Digital Nomads Live?\nBuilding a location-independent business is incredibly difficult, and often, digital nomads have professional jobs that pay above-average incomes.\nUsing funds from a previous job to build a new businessOther digital nomads come from professional backgrounds where they were earning good salaries.\nProperty prices increased because digital nomads can pay more than locals, leading to the displacement of longtime residents in favor of well-off, white newcomers.\nDigital nomads evidently do not care about the places where they happen to live and, for that reason, they have no place in the future.","info":{"author":"Paris Marx","top_img":"https://cdn-images-1.medium.com/focal/1200/632/52/76/0*lbyYFCms47u_cMJA"}}},{"node":{"id":"5b937b0a87be056953db7d0d","title":"How I Moved from New York to Los Angeles in an Attempt to Escape My Problems.","source":"medium_search_nomad","summary":"I chose Los Angeles for several reasons, the first and foremost being that it was warm and as far from New York as I could get without leaving the continent or going to Canada.\nSecondly, as someone who identified herself as a comedy writer, I figured Los Angeles was were I could truly realize my dream which was, and currently is, to write for film and television.\nI idealized Los Angeles.\nIf there’s one thing I can say about Los Angeles, it’s that there are assistant jobs a-plenty and boy, did I assist!\nOne of the main reasons I ventured out to Los Angeles was to work on my comedy and comedy was the last thing on my mind.","info":{"author":"Jackie Rae Aubel","top_img":"https://cdn-images-1.medium.com/max/1200/1*aCdl1OUjrs-bgKb60yh2NA.gif"}}},{"node":{"id":"5b937b0987be056953db7d0c","title":"Why I Never Use Co-Working Spaces as a Digital Nomad & Why You Might Not Want to Either","source":"medium_search_nomad","summary":"Why I Never Use Co-Working Spaces as a Digital Nomad & Why You Might Not Want to EitherLast week, I wrote a piece on digital nomad gurus and how to spot the vampires who will weasel their way into your wallet and suck it dry, if you are foolish enough to let them do so.\nThey are Full of Digital NomadsYes, I’m a digital nomad but please don’t tell anyone.\nHaving read their “how to be a digital nomad” guru who insists that they work in a co-working space, that’s what they’re going to do.\nThat’s why you won’t find me in a co-working space and why I’d prefer you didn’t tell my clients that I’m a digital nomad.\nAnd don’t forget that you spend this time, in co-working spaces, in order to be around people like the Atlas brothers.","info":{"author":"Nicholas Barang","top_img":"https://cdn-images-1.medium.com/max/1200/1*buAlXkwPmNAOOG23fX6rFw.jpeg"}}},{"node":{"id":"5b937b0687be056953db7d0b","title":"F*ck Work-Life Balance – On Your Terms","source":"medium_search_nomad","summary":"For a long time I struggled with the idea of work life balance.\nWhatever I’m doing, I’m fully invested in that thing as I’m doing it.\n“I’ve decided it’s not about work-life balance,” he mused, “It’s about work life integration.”“It’s about work life integration.”The world stopped for a moment as he put words to the ephemeral thought I’d been brewing for the previous seven months.\nWork life integration.\nThis is work life integration in action.","info":{"author":"Jenn Sutherland-Miller","top_img":"https://cdn-images-1.medium.com/max/1200/1*L6oFaoKeFIwylFW2nPt_ew.jpeg"}}},{"node":{"id":"5b937b0687be056953db7d0a","title":"How I built a startup while traveling to 20 countries","source":"medium_search_nomad","summary":"I’m living in Bali right now for $1,200 per month.\nTraveling makes me more productiveWhen I first started traveling, I was a great tourist, taking pictures of everything and doing all the activities listed in tour guides.\nI was surprised to find out that I’m significantly more productive while traveling.\nAnd even though I was in 6 different cities in September, I managed to work extremely productive 48 hour weeks.\nCycling between fun and work makes my days less exhausting and makes me less prone to burnout.","info":{"author":"Jay Meistrich","top_img":"https://cdn-images-1.medium.com/max/1200/1*ZfIFhOWwH1ebeP77bmQ4ng.jpeg"}}},{"node":{"id":"5b937b0587be056953db7d09","title":"Goodbye boring, hello adventure — An interview with a veteran digital nomad","source":"medium_search_nomad","summary":"Goodbye boring, hello adventure — An interview with a veteran digital nomadNora Dunn is a Canadian who sold everything she owned in 2006 to embrace her dreams and travel the world.\nOften times people think a digital nomad must be an entrepreneur, working independently.\nThe balance between work and play is the main challenge every digital nomad faces.\nFor fast, seamless country-hopping, its best to do your research before you go and on-the-go with real-time information from other digital nomads.”How much money do I need to be a digital nomad?\nWhat resources did you rely upon for your digital nomad journey?","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*hkySxRE_dS2G_mL6J6U62A.jpeg"}}},{"node":{"id":"5b937b0587be056953db7d08","title":"The full-stack employee – Chris Messina – Medium","source":"medium_search_nomad","summary":"What is a full stack employee?\nJust as there are full-stack engineers and full-stack startups, the full-stack employee has a powerful combination of skills that make them incredibly valuable.\nFull stack employees have an insatiable appetite for new ideas, best practices, and ways to be more productive and happy.\nIt’s this aspect above others that defines and separates the full stack employee from previous generations.\nWhat it’s like to be a full stack employeeBeing a full stack employee isn’t necessarily easier or harder; it’s different.","info":{"author":"Chris Messina","top_img":"https://cdn-images-1.medium.com/max/1200/1*MFEVCOgGeEP695XXBfs0Ig.jpeg"}}},{"node":{"id":"5b937b0587be056953db7d07","title":"Nomad and traveler is not the same thing – Thomas K. Running – Medium","source":"medium_search_nomad","summary":"As a person that has gradually become more and more nomadic over the last five years, I can definitely relate.\nIn fact, even though I have no permanent home, I don’t see myself as a constant traveler.\nIn my mind, I move around every few months, usually staying in one place for one to three months at a time.\nBy now, the people I care the most about (other than my close family) are spread all over the world anyway.\nBeing a nomad is about the freedom to be where you want, when you want.","info":{"author":"Thomas K. Running","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b937b0487be056953db7d06","title":"Why I nomad – The Coffeelicious – Medium","source":"medium_search_nomad","summary":"Only I don’t really like travelling.\nWhat I really value is knowing myself through each new place I visit.\nI’ll lead what psychologist Martin Seligman calls the ‘pleasant life’ — but not the good life.\nWhen it comes to the good life, there is no more profitable pursuit then self-knowledge.\nI travel because it helps me to love less — and to really appreciate what a good life means for me.","info":{"author":"Rezzan Hussey","top_img":"https://cdn-images-1.medium.com/max/1200/1*0L0CjC-K23wppwAtWy1oGw.jpeg"}}},{"node":{"id":"5b937b0487be056953db7d05","title":"Hardcore Year: I Learned Swift, Build a Mac app and Earned $1635 in 1.5 months","source":"medium_search_nomad","summary":"Hardcore Year: I Learned Swift, Build a Mac app and Earned $1635 in 1.5 months3 month ago, I quit my job to follow my passion and make my own products.\nSome of my ideas, prioritized before Uber Horse, are creating a marketplace for buying crypto with Paypal and launching Progress Bar OSX.\nIdea of Progress Bar OSXSince I quit my job and started working alone, I measure time differently.\n:)I don’t care what day of the week it is or whether it’s a weekend or not.\nBut I don’t want to find a developer job so I don’t care.","info":{"author":"Andrey Azimov","top_img":"https://cdn-images-1.medium.com/max/1200/0*UGXKmbcX5bmVWbUY"}}},{"node":{"id":"5b937b0387be056953db7d04","title":"I’ve given up my home to become a digital nomad – Hostfully","source":"medium_search_nomad","summary":"I’ve given up my home to become a digital nomadSince two weeks I don’t have a home city, or a permanent address, and I’m not looking for one.\nIn January I started a new life, building my second startup and challenging myself to become a digital nomad.\nThe more you bring with you the more likely you won’t actually need them.\nThat’s more than enough, I don’t need a residency permit in any of them.\nCan I run a company remotely and can it actually work?","info":{"author":"Uldis Leiterts","top_img":"https://cdn-images-1.medium.com/max/1200/1*Ss77jp9HChkD3ewCXDQ_OA.jpeg"}}},{"node":{"id":"5b937b0287be056953db7d03","title":"I quit, I’m going nomad – The Future of Work – Medium","source":"medium_search_nomad","summary":"I quit, I’m going nomadHacker Paradise GroupLast Monday, I got early at the office, called my boss and just told him “I quit, here’s my resignation letter, please accept it.”.\nAfter 8 years of remote work, I decided to try to move again into a on site job, I thought a change would be good.\nI’m not afraid of getting old, instead, I’m afraid of not living the life I wished I could’ve lived.\nI’m a developer, I’ve the luckiest job on earth, I can create things from anywhere, my work is everywhere.\nAnd so, I quit my on-site job, I’m going back to remote, but this time, I’m going to be free.","info":{"author":"Henrique Barroso","top_img":"https://cdn-images-1.medium.com/max/1200/1*RKaBN2iVkveXxwaVj2qbJg.jpeg"}}},{"node":{"id":"5b937b0187be056953db7d02","title":"My 4 month Journey in Southeast Asia as a Digital Nomad: Thailand","source":"medium_search_nomad","summary":"My 4 month Journey in Southeast Asia as a Digital Nomad: ThailandA paradise for foodies, travelers and minorities.\nJust to prepare my stomach for legit Thai food.\nI don’t know why he’s on the floor, but just pretend everything’s okay.\nThai girls are blunt when it comes to what they want.\nThai food in 3 words","info":{"author":"Tiffany Sun","top_img":"https://cdn-images-1.medium.com/max/1200/1*rwV8J-gXitiwjrf1X_fqKg.png"}}},{"node":{"id":"5b937b0087be056953db7d01","title":"What travel insurance REALLY means. *Warning*: graphic content","source":"medium_search_nomad","summary":"What travel insurance REALLY means.\nMy most recent experience with insurance, is the travel kind.\nI already have insurance on my belongings, so it was purely medical emergencies that I was hoping to find cover for.\nMany roads lead me to insureandgo.com, as their backpacker insurance would cover me for 18 months of travel, which was exactly what I needed.\nOr my £5,000,000 of medical cover?","info":{"author":"Ryan Badger","top_img":"https://cdn-images-1.medium.com/max/1200/1*2P0Pk32Tc45fgZtDwtWGzw.jpeg"}}},{"node":{"id":"5b937afe87be056953db7d00","title":"How to find a remote job in 30 days. My life as a (wannabe) digital nomad","source":"medium_search_nomad","summary":"How to find a remote job in 30 days.\nMy life as a (wannabe) digital nomadI recently quit my job to follow my dream of being location independent.\nI read thousands of posts about digital nomad life and, of course, it seemed amazing: full of extreme sports, paradise beaches, colorful cocktails and multicultural friends.\nAnd this is what I’m going to do in the next 30 days: I’m going to look for a job.\nOf course, if you have any feedback on my LinkedIn profile, don’t hesitate to tell me, I will be glad to modify it again!","info":{"author":"Alessia Anniballo","top_img":"https://cdn-images-1.medium.com/max/1200/1*DqYt8PGvc1ihtrox2N6sMg.jpeg"}}},{"node":{"id":"5b937afb87be056953db7cff","title":"How to Make Money Online: 38 Remote Jobs in 2018 – The Mission – Medium","source":"medium_search_nomad","summary":"How to Make Money Online: 38 Remote Jobs in 2018 Every year it’s becoming easier to work from your laptopIf you haven’t thought about how to make money online you’re either…A) 90 years old and your grandchild just got you your first computer,orB) uhhh honestly, I don’t know what the hell you’re doing.\nOf course the blogger has been on the list for how to make money online since the beginning of RSS feeds.\nOnline TutorTeaching online classes is always a sure shot way to make money online.\nSell Online CoursesOne way I’ve personally made money online is through selling my online course — The Complete Travel Developer Course.\nNow this can be harder than you may think, but with services like Teachable and ConvertKit it’s never been easier to make money online with online courses.","info":{"author":"Phil Manning","top_img":"https://cdn-images-1.medium.com/max/1200/1*MajAzYSF1wd0J_3RYUq2kQ.jpeg"}}},{"node":{"id":"5b937afa87be056953db7cfe","title":"4 Thoughts on Personal Finance and Investing that You Have to Know in Your 20s","source":"medium_search_nomad","summary":"The power of compounding, coupled with a simple investing strategy can get you far enoughInvesting to grow your wealth needs not be difficult and complicated.\nHe knows that he would get an annual return of 6% on his investment amount every year.\nThis is why I say using a simple investing strategy and the power of compounding to grow your wealth can be simple, but not easy.\nThe power of compounding, coupled with a simple investing strategy can get you far enough.\n“It is not necessary to do extraordinary things to get extraordinary results.” — Warren Buffett","info":{"author":"The Nomad Investor","top_img":"https://cdn-images-1.medium.com/max/1200/1*0WtWj7f0zYbCvaT5VbM71Q.jpeg"}}},{"node":{"id":"5b937af887be056953db7cfd","title":"4 Harsh Realities Of Working As A Full-Time Digital Nomad","source":"medium_search_nomad","summary":"4 Harsh Realities Of Working As A Full-Time Digital Nomad*Clink*That was two beach-side Mai Tai’s touching rims in case you didn’t know.\nI’m on a beach with my laptop writing, staring out at the teals and dark blues of the ocean in between sentences.\nIn case you didn’t know, there’s no wi-fi directly on any beach anywhere — especially in Southeast Asia where many Digital Nomads go.\nYou’ve heard the saying “more money more problems?” There should be one like:More freedom more problems.\nI recently sat down with Kate Smith of The Remote Nomad (featured on CNN, HuffPo, etc.)","info":{"author":"Tom Kuegler","top_img":"https://cdn-images-1.medium.com/max/1200/1*-1ELESHOnB45D3w1tRuh8g.jpeg"}}},{"node":{"id":"5b937af687be056953db7cfc","title":"Nomad and Flow – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"I recently gave a talk at DNX Global on running a profitable business from anywhere in the world.\nRunning a profitable business after all has nothing to do with being a digital nomad and vice versa.\nHowever, being on the move poses challenges to running a business (regardless if profitable or not).\nYou obviously have no choice when you’re completely offline, but having just that little bit of internet is even worse.\nRegardless of what title or job role we’ve given ourselves, we still need to know the basics.","info":{"author":"Noel Tock","top_img":"https://cdn-images-1.medium.com/max/1200/1*Ek-KeKh9kS8voFzYXgfP5w.jpeg"}}},{"node":{"id":"5b937af587be056953db7cfb","title":"Lessons I learned on the road as a Digital Nomad – Noel Tock – Medium","source":"medium_search_nomad","summary":"There’s been quite a lot of Digital Nomad discussion as of late.\nThe traditional Digital Nomad (as we’re led to believe) pursues a sunny and warm path.\nEveryone has a routine, in most cases you don’t need to sacrifice essentials in the slightest.\nTraveling as a nomad isn’t a vacation, you need plenty of time to work comfortably without feeling rushed.\nThere’s even a conference (DNX in Berlin) and some communities trying to aggregate individuals (Nomad Project).","info":{"author":"Noel Tock","top_img":"https://cdn-images-1.medium.com/max/1200/1*dJpucFrnSvh8k1656JAFsg.jpeg"}}},{"node":{"id":"5b937af587be056953db7cfa","title":"Everything You Need to Travel the World in One Backpack","source":"medium_search_nomad","summary":"Everything You Need to Travel the World in One BackpackEdit: I’ve launched a full website called PackHacker: We test and review the best gear for travel so you don’t have to.\nThis allows for relaxed, fluid travel, with no need to race other passengers to the overhead bins.\nTee Shirts & TankOutlier Ultrafine Merino T-Shirt | Woolly Short Sleeve Ultralight V-Neck | Icebreaker Men’s Anatomica Tank TopOutlier Ultrafine Merino T-Shirt (left): My favorite of the bunch.\nSweatersWoolly Long Sleeve V-Neck | Ministry of Supply Mercury SweaterWoolly Long Sleeve V-Neck (left): Basically the long sleeve version of the Woolly shirt above.\nBillabong Crossfire X Submersible Short (right): Another shorts / swim trunks combo.","info":{"author":"Tom Wahlin","top_img":"https://cdn-images-1.medium.com/max/1200/1*dkxUytrbgGcd45ft1flYAw.jpeg"}}},{"node":{"id":"5b937af587be056953db7cf9","title":"The Dark Side of Digital Nomad Life, Going Beyond Bad Guru Techniques","source":"medium_search_nomad","summary":"The Dark Side of Digital Nomad Life, Going Beyond Bad Guru TechniquesThese men may seem like harmless, badly dressed doofuses but the truth is far more sinister.\nI had never realized that so many people aspire to malnutrition and a boring diet until I started reading digital nomad lifestyle tips.\nIt has awesome nightlife, plenty of cultural expeditions, fireflies on the river and no “official” digital nomad scene — it really couldn’t be any better if it tried.\nIf you’re considering studying under a “digital nomad guru”, I wrote a piece on that too recently.\nTheir Digital Nomad Campus and Digital Nomadness (seriously) websites have already been shuttered too.","info":{"author":"Nicholas Barang","top_img":"https://cdn-images-1.medium.com/max/1200/1*8PGFicc1vuzPcgtXL0JRDA.jpeg"}}},{"node":{"id":"5b937af487be056953db7cf8","title":"Digital Nomad lifestyle 2.0 – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"I am sure the Digital Nomad lifestyle is in the switch from stage 1 to stage 2.\nDigital Nomad movement is getting bigger > 2.0Thanks to fresh and motivated people like Pieter Levels who started Nomad List, #nomads a Digital Nomad chat community and Nomad Forum the Digital Nomad movement gained awareness and traction again all over the world in 2014 > Digital Nomad movement 2.0.\nMore Digital Nomad projects all over the worldSince 2014 more and more really exciting Digital Nomad projects and coliving concepts have popped up: CoBoat, Nomad House, Copass, Hacker Paradise and Turn Point.\nDigital Nomads shape the future of work > 3.0I am sure what started in the last months is just the beginning of the Digital Nomad movement 2.0 and will lead into the Digital Nomad work option 3.0.\n❤ THX for reading and sharing ❤I am Digital Nomad by heart and founder of DNX — Digital Nomad Hub.","info":{"author":"Marcus Meurer","top_img":"https://cdn-images-1.medium.com/max/1200/1*g8GooWiPvzPwmm-wwuIBPw.jpeg"}}},{"node":{"id":"5b937af487be056953db7cf7","title":"The digital nomad lie – Thought Pills – Medium","source":"medium_search_nomad","summary":"The digital nomad lieby Yann GirardI’ve now been traveling and working remotely for the past three and a half months.\nWhatever a true digital nomad really is.\nAnd all of this stuff you’re reading online on how awesome it is to be a digital nomad is basically a lie.\nIf you’re not able to be alone a lot, then being a digital nomad is definitely not for you.\nBefore you believe in the digital nomad hype..More about Yann | Yann’s Books | Yann on Facebook | Yann’s Podcast |","info":{"author":"Yann Girard","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b937af287be056953db7cf6","title":"10 Signs That Your Digital Nomad Guru or Advisor Is a Crackpot","source":"medium_search_nomad","summary":"10 Signs That Your Digital Nomad Guru or Advisor Is a CrackpotI’d probably enjoy hanging out with this person but I wouldn’t pay for their advice on protective headgear.\nYou can decide that SEO (search engine optimization) is the way to go and you’ll do it yourself because that’s “free”.\nA guru who hides where they make their money isn’t a guru — they’re a shyster.\nSign Number Seven — There Is Guru SaturationIf you’re looking for a guru on a particular topic.\nAnybody that tries to sell you something that suggests otherwise is not a guru, they’re a shyster.","info":{"author":"Nicholas Barang","top_img":"https://cdn-images-1.medium.com/max/1200/1*0kQIFOccEmAkMZXYmNH_JA.jpeg"}}},{"node":{"id":"5b937af287be056953db7cf5","title":"Life with the iPad Pro and Apple Pencil – Practical Pixels – Medium","source":"medium_search_nomad","summary":"Life with the iPad Pro and Apple Pencil for artists and developers on the go Contents: Part 1: Life before the iPad Pro and Apple Pencil (4 min read)Part 2: Life with the iPad Pro and Apple Pencil (9 min read) Skip to Part 2 if you want to jump straight into action.\nPart 1: Life before the iPad Pro and Apple Pencil One year ago, my graphic tablet finally broke down.\nI had three goals with buying the iPad Pro and Apple Pencil: Replace my old iPad.\nPart 2: Life with the iPad Pro and Apple Pencil As of yesterday, iPad Pro comes in two sizes: 10.5-inch and 12.9-inch.\niPad Pro is an iPad, so all your iPad stuff is as good as before, except bigger, and smoother.","info":{"author":"Matej, Retro","top_img":"https://cdn-images-1.medium.com/max/1200/1*rG2ppUmbj61Iga21AvliCA.jpeg"}}},{"node":{"id":"5b937af187be056953db7cf4","title":"11 sharing economy resources for making digital nomad life affordable","source":"medium_search_nomad","summary":"11 sharing economy resources for making digital nomad life affordableThis post originally appeared on the CloudPeeps blog.\nWith today’s technology, more and more people are living the life of a digital nomad, travelling the world while doing meaningful work.\nHowever it actually costs me much less per month to live as a digital nomad than it cost me to live as a permanent resident of NYC!\nNomadList.com andDynamite Circle are two such digital nomad communities that ensure you have a group of friends and professional connections to tap into wherever you go.\n8) Any other tips or words of wisdom for someone considering the digital nomad lifestyle?","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*fOLA9pRAdJitVEQmP92Azg.jpeg"}}},{"node":{"id":"5b937aef87be056953db7cf3","title":"Here’s why the life of a digital nomad isn’t always what it seems","source":"medium_search_nomad","summary":"Here’s why the life of a digital nomad isn’t always what it seemsAn increasing number of people are choosing to work online with no fixed location offline.\nThe media call them ‘digital nomads’, but their media portrayal doesn’t always match reality …in surprising ways.\nType ‘digital nomad’ into Google Images and you’ll see one picture that keeps reoccurring.\nThere are over 30,000 digital nomads connected in just one Facebook group called Digital Nomads Around the World.\nLike many digital nomads, Nenov agrees that the life of a digital nomad may not be quite what it seems to many at first, but the greater freedom and opportunities for remote employees and entrepreneurs make it far more rewarding.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/0*aTCW8gAqfspYubgJ."}}},{"node":{"id":"5b937aee87be056953db7cf2","title":"Digital Nomad, Digital Expat or Digital Loser? The Big Debate","source":"medium_search_nomad","summary":"Digital Nomad, Digital Expat or Digital Loser?\nThis leads to many people arguing that they have lost their “digital nomad” status and become, instead, “digital expats.”The trouble with this is that it is pure hokum.\nThe digital loser moves to a developing nation to earn the same as a farm worker in that developing nation.\nIf you want to be a digital nomad — work out how you’re going to get paid before you leave home.\nThen we’ll be moving on to examine the cult of the Digital Nomad (loser) in Chiang Mai and why it’s important to tackle this now.","info":{"author":"Nicholas Barang","top_img":"https://cdn-images-1.medium.com/max/1200/1*UTH4ruRrhJwE-atk6R7tug.png"}}},{"node":{"id":"5b937aed87be056953db7cf1","title":"Is it possible to be a nomad forever? – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"But we also miss our family, we think about our careers, our friends, problems, diseases, money and other things that are a part of the nomad life (and the life of everyone else too).\nToday, I’m really happy with my digital nomad life.\nJust like everybody else, I don’t know what is going to make me happy in one, five or ten years.\nYour decisions don't need to be others tested hypothesis.\nWe don't need to ride on the same road our whole life.","info":{"author":"Debbie Corrano","top_img":"https://cdn-images-1.medium.com/max/1200/1*5GYKGyyq_xHptUK7G8kxIA.jpeg"}}},{"node":{"id":"5b937aec87be056953db7cf0","title":"Digital Nomad Guide to Budapest, Hungary – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"Digital Nomad Guide to Budapest, HungaryWhat I’ve learnt living and working in Budapest as a digital nomadThis article originally appeared on Dare With Us.\nAirbnb is also a pretty good option as it gives more privacy and high living standards, you’ll feel like home as everything will be provided.\nThermal bathsThere are quite a lot of thermal baths in Budapest and Budapest is quite famous for that.\nThere are little fast food shops for hot dogs, burgers, pizza that can kill hunger for some time and taste pretty good.\nI found that Foursquare is pretty good tool for discovering new places and seeing reviews makes you make decision quicker.","info":{"author":"Tomas Laurinavicius","top_img":"https://cdn-images-1.medium.com/max/1200/1*c_pjmYvCJBTD4Poo9cBAGg.jpeg"}}},{"node":{"id":"5b937aec87be056953db7cef","title":"After Two Years Of Being A Digital Nomad, Here’s How I Find Work","source":"medium_search_nomad","summary":"So we have a ton of postings, but a limited number of applications…To tell you honestly this is a good thing.\nThere’s a ton of jobs posted on the site, but the number of bad ones FAR outweigh the good.\nThere’s at least ten new jobs posted in each of those keyword searches every day, and I think the same can happen to you.\nTrade Work For A Place To StayThis doesn’t exactly count as being a “digital nomad,” but you could use Worldpackers to exchange work for a place to live.\nAny Work, Anywhere — Yet another job board for temp jobs, check this site out as a last resort.","info":{"author":"Tom Kuegler","top_img":"https://cdn-images-1.medium.com/max/1200/0*qUscHCOERV5NETnS.jpeg"}}},{"node":{"id":"5b937aeb87be056953db7cee","title":"Why I Quit My Job, Sold All My Stuff, Moved Out of My NYC Apartment, and Became a Digital Nomad","source":"medium_search_nomad","summary":"Why I Quit My Job, Sold All My Stuff, Moved Out of My NYC Apartment, and Became a Digital NomadMore than a year ago, I began seriously considering changing my life and becoming a digital nomad.\nI knew some friends who traveled constantly and who had already made the jump into the nomad lifestyle.\nIf you’re not sure what “digital nomad” means; it’s a person who works and earns a living remotely from their laptop via the internet, and uses that opportunity to live abroad/traveling/on the road.\nCoworking spaces, coffee shops, restaurantsThe Job The digital nomad lifestyle stood out for me mainly because I knew it wasn’t so far out of reach.\nBeing a Nomad As a nomad, I live out of carry-on luggage and Airbnb’s.","info":{"author":"Nicole Dominguez","top_img":"https://cdn-images-1.medium.com/max/1200/1*rXWvvxkdw874G-Ps1yqgMA.jpeg"}}},{"node":{"id":"5b937ae987be056953db7ced","title":"How I Got My Start Working Remotely and Turned Into Full Time Digital Nomad","source":"medium_search_nomad","summary":"How I Got My Start Working Remotely and Turned Into Full Time Digital NomadBy Hailley GriffisI remember the first time I met an exchange student.\nI asked both of them if I could work remotely.\nCheck out Nomad Pass’ 22 of the Best Remote Job Resources to get you out of the office and on the road.\nThey ended up implementing a remote work policy of one week per quarter, which is super awesome!\nThe most northern point I’d ever been in Canada and as I write this post, I’m working from London, UK.","info":{"author":"Nomad Pass","top_img":"https://cdn-images-1.medium.com/max/1200/1*WMIkrf_9y4StNaq273G7IA.jpeg"}}},{"node":{"id":"5b937ae887be056953db7cec","title":"9 Reasons Every Digital Nomad Needs LeapIN – LeapIN Blog","source":"medium_search_nomad","summary":"That’s great for digital nomads as it’s a stable global currency that protects you from fluctuations elsewhere.\nMany digital nomads will know the frustration of needing to find a printer then either scanning or posting a form.\nAn international business bank accountAs a digital nomad, it can be hard to separate your business and personal life.\nThey support digital nomads across every time zone so there’s always someone available to assist you.\nThey can answer anything related to your business — from accounting and taxation to 3rd party services like your business bank account.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*_Pfgvta11DnuujLmlviUlQ.jpeg"}}},{"node":{"id":"5b937ae687be056953db7ceb","title":"What’s wrong with this Digital Nomad thing? Just do you.","source":"medium_search_nomad","summary":"What’s wrong with this Digital Nomad thing?\nBut here is what’s wrong:people forget that being a digital nomad is not an end, but a mean.\nMy first “digital nomad” experience came when I pedaled 12,000km around Europe and USA.\nSometimes, people call me successful and send me messages saying they want to become a “successful digital nomad” like me.\nIt’s exactly the same with this Digital Nomad thing.","info":{"author":"Thomas Despin","top_img":"https://cdn-images-1.medium.com/max/1200/1*v49_W4-w_OMsheC4CXgWbw.jpeg"}}},{"node":{"id":"5b937ae587be056953db7cea","title":"From Desk Jockey to Digital Nomad in One Year – Jessica Guzik – Medium","source":"medium_search_nomad","summary":"From Desk Jockey to Digital Nomad in One YearI am what a lot of the Internet would call a digital nomad.\nSo in March 2016, I started writing on Medium.\nApril 2016As I continued to write on Medium, you could see my interest in digital nomadism creeping into my work.\nWhen I started writing about WeLive, a particular contact reached out on Twitter and suggested that she and I get drinks.\nAt this point I got a bonus from my full-time job.","info":{"author":"Jessica Guzik","top_img":"https://cdn-images-1.medium.com/max/1200/1*fLKC9DrI9HiB9L5ObvBurg.png"}}},{"node":{"id":"5b937ae487be056953db7ce9","title":"My 4 month Journey in Southeast Asia as a Digital Nomad: Malaysia","source":"medium_search_nomad","summary":"Last but not least…I want to end this post raving about the exquisite taste of Malaysian food!\nBoat noodles are actually a Thai-style noodle dish that’s becoming more popular in Malaysia.\nBest Grilled Stingray:Restoran Meng Kee Grill FishOpen hours:6pm-4amAddress:39, Jalan Alor, Bukit Bintang, 50200 Kuala Lumpur, Wilayah Persekutuan Kuala Lumpur, MalaysiaLaksaIt’s almost like eating ramen, but creamier.\nHere in Malaysia, you can order the roast chicken alternative of this Hainan chicken dish (which I personally like more).\nI didn’t realize how much I loved crab until I had a bite of this Singaporean (but prevalent in Malaysia) dish: chili crab.","info":{"author":"Tiffany Sun","top_img":"https://cdn-images-1.medium.com/max/1200/1*NW2RDLDZCIxNG_kiM9xKrQ.png"}}},{"node":{"id":"5b937ae387be056953db7ce8","title":"The Digital Nomad Era Is Upon Us – The Post-Grad Survival Guide – Medium","source":"medium_search_nomad","summary":"The Digital Nomad Era Is Upon Us9–5 is irrelevant.\nWhen I started my Nomad journey, it wasn’t a financially comfortable situation for me to be in, but I did it anyways.\nWhat kind of crapshoot was she involved in that led her to denounce corporate life and embrace digital nomad-ism?\nWhat’s really crazy about her journey is how sure she was of her path in college and early adulthood.\nShe worked as a Project Manager for three years and slowly realized this wasn’t the life she wanted.","info":{"author":"Tom Kuegler","top_img":"https://cdn-images-1.medium.com/max/1200/1*-1ELESHOnB45D3w1tRuh8g.jpeg"}}},{"node":{"id":"5b937ae287be056953db7ce7","title":"Why e-Residency and LeapIN Is the Ideal Solution for a Digital Nomad","source":"medium_search_nomad","summary":"Why e-Residency and LeapIN Is the Ideal Solution for a Digital Nomad We asked Dylan, a British national who wanted to become a digital nomad, why he chose e-Residency to support his ambitions.\nUK based, global aspirationsI’m a British national based in London where I’ve always worked for large companies like Hootsuite.\nAfter speaking to many of my friends, I found that they’re digital nomads, and wanted to know how they did it.\nThey’re an entirely remote company so I began working remotely for them.\nThe freedom of this remote work has led me to places including France, Canada, Finland, and of course Estonia.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*gpfMlZq_4SBTR_LngPvUbg.jpeg"}}},{"node":{"id":"5b937ae287be056953db7ce6","title":"Meet the digital nomad who uses Revolut – Revolut Blog – Medium","source":"medium_search_nomad","summary":"Meet the digital nomad who uses Revolut Pieter is never in one place for a long time.\nGiven your nomad lifestyle, what has been your experience with traditional banks?\nNever again would I trust traditional banks, especially Dutch ones — I was so fed up with it all.\nRevolut isn’t a traditional bank account.\nIn use, the app itself is 10x smoother than traditional bank apps I’ve used.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*3ZLsMT45NBjD9HzLBXpHPg.jpeg"}}},{"node":{"id":"5b937ae187be056953db7ce5","title":"22 of the Best Remote Job Resources – Nomad Pass – Medium","source":"medium_search_nomad","summary":"Remote work is becoming the new wave of achieving work-life balance and more and more companies are turning toward tech to help them manage a remote staff.\nWorking Nomads — curates remote jobs in multiple fields, sign up for their newsletter to get up to date information about new jobs.\nFlexJobs — fully screened, legit remote job listings featured in many notable publications.\nRemote OK features thousands of remote jobs from every field possible.\nSkip the Drive — has a large amount of options for remote work with handy filters.","info":{"author":"Nomad Pass","top_img":"https://cdn-images-1.medium.com/max/1200/1*Y12Hrflvfyxp2plzTqC2Wg.png"}}},{"node":{"id":"5b937ae087be056953db7ce4","title":"What I learned about coworking camps and digital nomad retreats when organizing my own.","source":"medium_search_nomad","summary":"What I learned about coworking camps and digital nomad retreats when organizing my own.\nDuring my sabbatical, I decided to set up a coworking camp for betahaus in collaboration with our lovely friends from DNX and Copass.\nThe solution is to escape the routines and make some space at a coworking camp outside your regular day-to-day activity.\nFor digital nomads, the picture looks slightly different: Nomads are working all year from the beaches of kolanta or the jungle of ubud.\nWe can see it happening right now by the example of retreats, sabbaticals and coworking camps.","info":{"author":"Christoph Fahle","top_img":"https://cdn-images-1.medium.com/focal/1200/632/0/0/1*u8GVCA0XL9PQsDfwEfSc8w.jpeg"}}},{"node":{"id":"5b937adf87be056953db7ce3","title":"Why Becoming a Digital Nomad Didn’t Give me the Freedom I Longed For","source":"medium_search_nomad","summary":"Why Becoming a Digital Nomad Didn’t Give me the Freedom I Longed ForFreedom has always been a fundamental value of mine.\nI longed to find the ultimate freedom.\nSo I became a solopreneur and digital nomad.\nFast-forward a couple of months and I had decided to move to Berlin with my partner (who was also a digital nomad).\nThat’s when I realized something: Discovering the ultimate freedom has nothing to do with becoming financially — or locationally — independent.","info":{"author":"Liz Huber","top_img":"https://cdn-images-1.medium.com/max/1200/1*cqirBgUnVLIIfdXDAjQ4tw.jpeg"}}},{"node":{"id":"5b937ade87be056953db7ce2","title":"How I Accidentally Became a Design Nomad – Future Leaders – Medium","source":"medium_search_nomad","summary":"Eventually, when I was 21, I was offered a job to help run a mobile app studio in Vietnam.\nI said yes, and in a week, I had arrived in Ho Chi Minh City amongst the chaos of people, motorbikes and chickens.\nI had no idea what I was doing, but I knew I was going to do it anyway.\nIt was a flurry of flights, packing, unpacking and learning to say ‘thank you’ in more languages than I could count.\nBy the time the year was up, I had taken 49 flights, seven buses and one very rocky boat.","info":{"author":"Melissa Ng","top_img":"https://cdn-images-1.medium.com/max/1200/1*ne9DMK0vcA48PzBZ7xurUQ.jpeg"}}},{"node":{"id":"5b937add87be056953db7ce1","title":"The Birth of a Digital Nomad — My Journey Towards Location Independence While Building Nomad House.","source":"medium_search_nomad","summary":"The first digital nomad that I met was @youjindo .\nShe’s shooting an awesome documentary about the digital nomad lifestyle called One Way Ticket .\nThe result : I was happy, but I felt disconnected with the goal I was trying to achieve: a digital nomad.\nI was working on Nomad House, a startup you haven’t heard about but will in the next year, I hope.\nFrom that the reason why I was building Nomad House beginning to become clear in my mind.","info":{"author":"Arthur Yeti","top_img":"https://cdn-images-1.medium.com/max/1200/1*WzfJDZzRlWoPuVXfFlhl_A.png"}}},{"node":{"id":"5b937adc87be056953db7ce0","title":"5 Reasons Why Being A Digital Nomad Might Not Be Your Thing, After All","source":"medium_search_nomad","summary":"5 Reasons Why Being A Digital Nomad Might Not Be Your Thing, After AllThe life of a digital nomad.\nA few years ago, being a digital nomad was a concept known only by few.\nWithin that context, becoming a digital nomad presented itself as an opportunity to live lives more suitable to the inner cores of many of us.\nAnd why might being a true digital nomad not be for you, after all?\nNot being a digital nomad still doesn’t necessarily mean that you’re home, even just within yourself.","info":{"author":"Adina Dincă","top_img":"https://cdn-images-1.medium.com/max/1200/1*jaHdQs2bl_lqqsdFxJa3zQ.jpeg"}}},{"node":{"id":"5b937adb87be056953db7cdf","title":"The World is Our Home — Let’s Stop Using the Term ‘Digital Nomad’","source":"medium_search_nomad","summary":"Today I despise the term ‘digital nomad’ because it affirms a view that the world is closed, fragmented, divided by borders.\nInstead of thinking that you left home to explore the world (to become a nomad) let’s expand our definition of home to encompass the universe.\nWe are living through a massive shift from an analog to digital world.\nThe ‘digital nomad’ community must evolve and champion an emerging future of crowd-based prosperity.\nThe term digital nomad is outdated.","info":{"author":"David Passiak","top_img":"https://cdn-images-1.medium.com/max/1200/1*RYgX-T7fPK9IME_pWR-8Gw.jpeg"}}},{"node":{"id":"5b937adb87be056953db7cde","title":"Becoming a Digital Nomad – Balind – Medium","source":"medium_search_nomad","summary":"I inferred to my boss that it could be confusing to clients if we present our advertising and digital departments as separate.\nThat’s my experience in traditional advertising as a digital creative.\nI learned a ton moving from digital to traditional, above-the-line advertising — it was an incredible education.\nHere I am on ‘vacatioin’ in VegasNot belonging to an agency this past week, has been awesome.\nI’ve seen more of San Francisco in the past week than I have in the previous 10 months.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*YCYj7Yuba7aacTHiOHKXpA.jpeg"}}},{"node":{"id":"5b937adb87be056953db7cdd","title":"You can be a ‘digital nomad’ – The Post-Grad Survival Guide – Medium","source":"medium_search_nomad","summary":"Recent Contributed PostsThe topic of this Tuesday’s newsletter is traveling and remote work.\nWe had a lot of amazing submissions revolving around these topics, so I thought ‘Why don’t I just make the newsletter ALL about this?’ So I did.\nThe Completely Unexpected Way Traveling Changed My Life Direction — Jessica Nicasio talks about how traveling not just changed her life, but set her off on a COMPLETELY new direction.\n✈️There Are Still 576 Hours Left In 2017 — Zachary Forget tells you what you should do with them.\n⏲The Hardest Part Of Living Abroad Nobody Wants To Talk About — Tom Stevenson’s been traveling for the last five years.","info":{"author":"The Post-Grad Survival Guide","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b937ada87be056953db7cdc","title":"The First Step to Becoming a Digital Nomad Is Finding The Right Company","source":"medium_search_nomad","summary":"The First Step to Becoming a Digital Nomad Is Finding The Right CompanyI am so grateful to work for a company that is 100% remote.\nIn the past few months, I’ve had so many people I know, either on Twitter or at a coffee shop, ask me how working remotely is possible.\n❤So how can you find your remote team and take off as a digital nomad?\nWell, a remote job hunt is almost the same as a any other job hunt.\nWould love to hear about your journey to digital nomadia, are you working remotely or currently applying to remote positions?","info":{"author":"Hailley Griffis","top_img":"https://cdn-images-1.medium.com/max/1200/1*1jGzGg8Xli4z72JPT5B88w.jpeg"}}},{"node":{"id":"5b937ad987be056953db7cdb","title":"On Being An Entrepreneur, A Digital Nomad, and a Heroin Addict — Part 1","source":"medium_search_nomad","summary":"I watched someone overdose on the sidewalk one early afternoon, tons of people walking by without offering help, seeing if he was okay, NOTHING.\nI ran down the street asking every single junkie and person if they had a kit on them.\nI had watched this man die, along with my heart shattering, my mind going in spirals, and tears pouring down my face.\nThe addict within still wanted me to stay and feed the habit, tricking me into thinking I could somehow make it work.\nI still had 2 days left in Vancouver, and I was living in a homeless shelter right down the street from Hastings St. aka Skid Row.","info":{"author":"Ben Schwartz","top_img":"https://cdn-images-1.medium.com/max/1200/1*s7zkesA-GH5vr1p7GUz1jw.jpeg"}}},{"node":{"id":"5b937ad787be056953db7cda","title":"One of the often under talked about aspects of software engineer, debugging","source":"medium_search_nomad","summary":"One of the often under talked about aspects of software engineer, debuggingThere are tons of resources out there that teach you how to code, but I have seen a lack of resources that teach you one of the most important aspects of being a software engineer, debugging!\nI’m not actually sure off the top my head where the term “bug” came from when we talk about a software bug, but it is basically an error in our code.\nOver the course of the last 15 years, I can’t tell you how many times I’ve had to track down a software bug that was just a one character error.\nSometimes software bugs can crash your program and sometimes they can slip by without you even realizing it.\nAs a software engineer, you are lucky if that is what happens when your program encounters the error.","info":{"author":"The Ginger Nomad","top_img":"https://cdn-images-1.medium.com/max/1200/0*J1kVSWZJm2eTzHB9."}}},{"node":{"id":"5b937ad687be056953db7cd9","title":"So You Wanna Be A Digital Nomad? – ART + marketing","source":"medium_search_nomad","summary":"If you want to be a nomad, you need to be prepared for the reality of being a nomad.\nThat’s nomad life for you.\nAs a digital nomad, travel isn’t just your life, it’s kinda your business too.\nNot quite as flexible a travel life you had in mind, is it, when that budget long stay traps you right where you don’t wanna be.\nThe mysteries of nomad life.","info":{"author":"Steffani Cameron","top_img":"https://cdn-images-1.medium.com/max/1200/1*yEQYVRYShxWmZwkkrAunQg.jpeg"}}},{"node":{"id":"5b937ad587be056953db7cd8","title":"Traveling the World as a Digital Nomad – This Publication is Moved – Medium","source":"medium_search_nomad","summary":"My girlfriend Felicia and me founded that event after being overruned by the rising demand for infos on the Digital Nomad lifestyle.\nFor 3 years I have been traveling the world as a digital nomad with my girlfriend Felicia, able to live from my business.\nAs a digital nomad you’re not on vacation but you’ve shifted the focal point of your life to other places in the world.\nIf not, I can only recommend you give the digital nomad lifestyle a try.\nAt this event you’ll be able to exchange ideas with interesting like-minded people and receive tips for getting started as a digital nomad.","info":{"author":"Marcus Meurer","top_img":"https://cdn-images-1.medium.com/max/1200/1*AFNWsz4lmbeUK8ppZo5nBQ.jpeg"}}}]}},"pageContext":{"source":"medium_search_nomad","alias":"experience","label":"经历感悟"}}