{"data":{"mongodbDatabaseArticles":{"id":"5b95eef687be058327490100","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Thailand Budget Mistakes</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p dir=\"ltr\"><a title=\"Thailand budget mistakes\" href=\"https://www.tielandtothailand.com/thailand-budget-mistakes/\"><img class=\"aligncenter wp-image-7369 size-full\" title=\"Thailand Budget Mistakes\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/09/Thailand-Budget-Mistakes-5.jpg?resize=563%2C412&amp;ssl=1\" alt=\"Thailand Budget Mistakes\" width=\"563\" height=\"412\"></a></p>\n<p dir=\"ltr\">In March 2013, we each had our one carry-on and two checked bags and a plan to move to Thailand and live on $1000 a month. We were ready to embrace a new lifestyle in Chiang Mai that included plates of food for a dollar and rent for only a few hundred bucks. It turns out that even though we set aside a &#8220;move in fund,&#8221; we completely underestimated the cost of our first month&#8217;s budget. We&#8217;re sharing our biggest Thailand budget mistakes, blunders, and solutions for the prospective expat.</p>\n<p><strong></strong></p>\n<h2><p id=\"Adjusting_to_a_New_Budget_and_Lifestyle_Ain8217t_Easy\"><p>Adjusting to a New Budget and Lifestyle Ain&#8217;t Easy!</p></p></h2>\n<p>It&#8217;s pretty damn hard. What we thought we&#8217;d buy and what we actually bought were quite different. As we were finding essential things for our new home, we felt a little homesick and succumbed to buying brands we recognized and familiar western groceries. We allowed the convenience of superstores that accepted credit cards to cloud the reality of how much we were spending.</p>\n<p>We underestimated how much we would spend during our first month in Chiang Mai and failed to stay within our $1000 monthly budget even when combined with our extra move-in fund. We hadn&#8217;t mentally switched over to our new monthly budget, and we were in for a shock when we began shopping in superstores and realized how many things were just as expensive as back home.</p>\n<h2><p id=\"Items_That_We_Budgeted_For_Prior_to_Moving\"><p>Items That We Budgeted For Prior to Moving</p></p></h2>\n<p>Before we beat ourselves up publicly about our Thailand budget mistakes and failures, here&#8217;s a short list of the things we actually budgeted for and got right.</p>\n<h3 dir=\"ltr\"><p id=\"First_Months_Rent_500\"><strong><p>First Month&#8217;s Rent: $500</p></strong></p></h3>\n<p dir=\"ltr\">Although we weren&#8217;t completely sure what we would end up spending when it came to monthly rent, after doing our research we thought it would be realistic to budget for something between $300 and $500 a month. We heard about those lucky few that pay less than $300 a month for a place, but we were bringing our cat along and wanted to live near Chiang Mai&#8217;s old city, so our price was a lot higher.</p>\n<h3 dir=\"ltr\"><p id=\"Laptop_1200\"><strong><p>Laptop: $1200</p></strong></p></h3>\n<p dir=\"ltr\">We sold our desktop and only brought an iPad to Thailand. Knowing that our iPad was more for convenience and not necessarily the workhorse we needed, we set aside extra cash for a <a title=\"MSI GE60 Laptop\" href=\"https://www.amazon.com/gp/product/B00CU9GKTO/ref=as_li_tf_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00CU9GKTO&amp;linkCode=as2&amp;tag=tielandtothai-20\" target=\"_blank\" rel=\"nofollow\">quality laptop</a> that could handle picture and video editing for our budding blog.</p>\n<h3 dir=\"ltr\"><p id=\"Motorbike_5570\"><strong><p>Motorbike: $5570</p></strong></p></h3>\n<p dir=\"ltr\">We agreed to buy a <a title=\"2013 Honda Forza\" href=\"https://www.tielandtothailand.com/a-big-white-monster-forza/\" target=\"_blank\">new motorbike</a> because we knew we would be here for a long time and didn&#8217;t want to worry about secondhand mechanical issues. The entire package, including a <a title=\"Residence Certificate Required to Buy a Vehicle\" href=\"https://www.tielandtothailand.com/certificate-residency/\">Thai residence certificate</a>, accessories, and insurance was toward the top of our allotted motorbike budget. However, we paid upfront using the money we made selling our car in the US to ensured that we&#8217;d continue to stay financially free of any debt and payment obligations.</p>\n<h2><p id=\"Thailand_Budget_Mistakes_That_Blew_Our_First_Months_Goals\"><p>Thailand Budget Mistakes That Blew Our First Month&#8217;s Goals</p></p></h2>\n<p><img class=\" aligncenter\" title=\"The Budget Mistake Prone Superstores\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/09/Thailand-Budget-Mistakes.jpg?resize=563%2C383&amp;ssl=1\" alt=\"Thailand Budget Mistakes at Tesco Lotus\" width=\"563\" height=\"383\"></p>\n<p dir=\"ltr\">It only took a handful of large shopping trips to destroy our spending goal, and we&#8217;re embarrassed by how much we overspent. For those who are curious, here are our Thailand budget mistakes within the first month moving abroad:</p>\n<h3 dir=\"ltr\"><p id=\"Imported_Groceries_200\"><strong><p>Imported Groceries: $200</p></strong></p></h3>\n<p dir=\"ltr\">We should have just accepted imported western groceries for what they are, expensive and difficult to find, but we tried stocking our kitchen with familiar food anyways. We later realized that it&#8217;s more cost-effective for the two of us to go out and eat Thai food more often.</p>\n<h3 dir=\"ltr\"><p id=\"Household_Items_380\"><strong><p>Household Items: $380</p></strong></p></h3>\n<p dir=\"ltr\">We needed things such as linens, toiletries, cookware, and cleaning supplies. We shopped at Robinson, Big C, and Tesco Lotus, which are Super Wal-Mart equivalents. These superstores sell overpriced name brand items that burned through our budget.</p>\n<h3 dir=\"ltr\"><p id=\"Furniture_390\"><strong><p>Furniture: $390</p></strong></p></h3>\n<p dir=\"ltr\">We figured we&#8217;d be living in a fully furnished apartment, but we jumped the gun and fell in love with a&#160;partially furnished townhouse after our studio apartment fell through. Unfortunately, the pantry, cushions for our daybed, and a computer desk and chair were as expensive as furniture back home.</p>\n<h3 dir=\"ltr\"><p id=\"Camera_and_Video_Equipment_815\"><strong><p>Camera and Video Equipment: $815</p></strong></p></h3>\n<p dir=\"ltr\">We treated ourselves to a nice&#160;<a title=\"Nikkon D7000\" href=\"https://www.amazon.com/gp/product/B0042X9LCO/ref=as_li_qf_sp_asin_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B0042X9LCO&amp;linkCode=as2&amp;tag=tielandtothai-20\" target=\"_blank\" rel=\"nofollow\">DSLR camera</a> as a Christmas present before moving to Thailand but ended up spending $175 in additional camera equipment once we got here. We also ending up buying a <a title=\"GoPro Hero3\" href=\"https://www.amazon.com/gp/product/B009TCD8V8/ref=as_li_tf_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B009TCD8V8&amp;linkCode=as2&amp;tag=tielandtothai-20\" target=\"_blank\" rel=\"nofollow\">GoPro camera</a>&#160;with various accessories once we were in Chiang Mai.</p>\n<h3 dir=\"ltr\"><p id=\"Security_Deposit_For_Our_New_Home_1000\"><strong><p>Security Deposit For Our New Home: $1,000</p></strong></p></h3>\n<p dir=\"ltr\">Something that we hadn&#8217;t considered before moving was the prospect of having to pay a security deposit for our home in Chiang Mai. We knew this to be an unavoidable reality in the States, but we were so excited by the thought of paying less than $500 a month in rent that we were completely blindsided when we needed to pay two month&#8217;s rent security deposit.</p>\n<h3 dir=\"ltr\"><p id=\"TEFL_Certification_1500\"><strong><p>TEFL Certification: $1,500</p></strong></p></h3>\n<p dir=\"ltr\">A Teaching English as a Foreign Language <a title=\"Do I Really Need a TEFL to Teach in Thailand?\" href=\"https://www.tielandtothailand.com/do-i-need-a-tefl/\">(TEFL) certification is great to have on a resume</a> if you&#8217;re looking teach in Thailand, so Angela enrolled in a class that was offered in Chiang Mai within the first month of moving here. With a new school year starting only two months after we arrived, earning the TEFL so soon proved to be a wise decision.</p>\n<h2><p id=\"Could_We_Have_Spent_Less\"><p>Could We Have Spent Less?</p></p></h2>\n<p dir=\"ltr\">We saw the electronics as investments in our blog and the TEFL certification as an investment to secure a teaching position. These things could have been purchased while we were still living in the States, but with the limited space in our luggage and our busy schedule, we decided to wait until we arrived in Thailand. Could we have purchased a less expensive motorbike or rented one for a while instead? Yes, but after experiencing a few 150cc rentals, we love our 2013 300cc Honda&#160;Forza and think it&#8217;s an excellent choice for two people living long-term in Thailand.</p>\n<p dir=\"ltr\">On the flip side, we shouldn&#8217;t have spent nearly $1,000 on western groceries, furniture, and household items. No matter how convenient superstores may be, they open you up to budget mistakes. We simply should have avoided one-stop-shopping habit because of the expensive price tags. No matter how much we wanted to make our new place feel like home, we shouldn&#8217;t have been so anxious to fill it with stuff again. Especially after working so hard to <a title=\"Cashing in on Craigslist\" href=\"https://www.tielandtothailand.com/cash-in-on-craigslist/\" target=\"_blank\">sell everything we owned</a>.</p>\n<h2><p id=\"How_Much_Do_We_Spend_Now\"><p>How Much Do We Spend Now?</p></p></h2>\n<p dir=\"ltr\">We&#8217;ve since recovered from our Thailand budget mistakes during our first month in Chiang Mai. We actually increased our <a title=\"Chiang Mai Budget Breakdown\" href=\"https://www.tielandtothailand.com/chiang-mai-budget-breakdown/\" target=\"_blank\">monthly budget to $1200</a> and it has worked well.</p>\n<p dir=\"ltr\">We never step foot in the superstores and instead buy all of our fresh produce from the local markets and the occasional packaged item, such as yogurt or dry noodles, from our local mini Tesco Lotus Express or 7-Eleven.</p>\n<p dir=\"ltr\">Household items, such as dishes or curtains, can be found at outdoor shopping markets. We&#8217;re lucky to have the Warorot Market in Chiang Mai, which is located just outside the northeast corner of the Old City.</p>\n<p dir=\"ltr\">We also learned our lesson to stick with fully furnished houses and apartments in the future due to the disproportionately expensive furniture . We would do things differently if given a second chance, but at least we&#8217;ve finally found a happy balance.</p>\n<h2><p id=\"Takeaways_from_Our_Thailand_Budget_Mistakes\"><p>Takeaways from Our Thailand Budget Mistakes<br>\n</p></p></h2>\n<p>Although we failed miserably at our first month&#8217;s budget, we learned valuable lessons that will help us with moves future. We hope they serve as a pointers for those looking to make similar lifestyle changes as well.</p>\n<h3 dir=\"ltr\"><p id=\"Slow_Down\"><strong><p>Slow Down</p></strong></p></h3>\n<p dir=\"ltr\">The biggest thing we learned is that you shouldn&#8217;t rush off to replace the things that once made you feel secure in your home country. This will almost always lead to costly budget mistakes. Learn to live with what your new surroundings can offer you. Don&#8217;t give up so easily and head for the superstores if you cannot find a particular item at the market or local shop. You&#8217;ll feel accomplished when you do finally find that item you have sought for so long. Remember, there is a chance that others have gone through exactly what you&#8217;re going through, so make sure you look around for tips online.</p>\n<h3 dir=\"ltr\"><p id=\"Track_Every_Purchase\"><strong><p>Track Every Purchase</p></strong></p></h3>\n<p dir=\"ltr\">If you&#8217;re moving to Thailand or another predominantly a cash based society, then tracking your spending will be key to being successful during your first few months abroad. There are plenty of smartphone apps that will do this for you. Budget mistakes are going to happen, but being able to take note of them before they become a problem can really save you from prolonged issues . After our first month&#8217;s budget mistakes we found a great app called <a title=\"Trail Wallet\" href=\"https://itunes.apple.com/us/app/trail-wallet-travel-budget/id547171665?mt=8&amp;uo=4&amp;at=10lcbj\" target=\"_blank\" rel=\"nofollow\">Trail Wallet</a> that helped keep us under control moving forward.</p>\n<h3 dir=\"ltr\"><p id=\"Overestimate_Your_Spending_and_Save_Accordingly\"><strong><p>Overestimate Your Spending and Save Accordingly</p></strong></p></h3>\n<p dir=\"ltr\">You&#8217;re about to move halfway around the world. You don&#8217;t want to underestimate your initial budget, but if you do, make sure you have extra cash for emergencies! If you don&#8217;t have work lined up or some sort of reliable income stream then you should make sure you have enough to get you through those first crucial adjustment months.</p>\n<p dir=\"ltr\">Yes, some bloggers make it seem extremely easy to just get up and move, and a few have had success in not planning much at all.&#160; But is that really a risk that you&#8217;re willing to take? Nobody wants to quit their jobs, sell everything, say their goodbyes to loved ones, and then turn around once they realize that what they saved isn&#8217;t going last long enough to get their new lives in order.</p>\n<p dir=\"ltr\">Expat life can be as great as you allow yourself to make it. Remember why you&#8217;re making the change! Don&#8217;t let unpreparedness ruin the way you see your new home before you have a chance to let things develop. Save at least one and a half times more money than you think you will need to make it the first ninety days. Budget mistakes are bound to happen, but it&#8217;s how your prepare yourself in advance that can make or break your big move.</p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Thailand Budget Mistakes"}},"pageContext":{"id":"5b95eef687be058327490100"}}