{"data":{"mongodbDatabaseArticles":{"id":"5b9382f387be056953db7e0f","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"fcf6\" id=\"fcf6\" class=\"graf graf--h3 graf--leading graf--title\">3 myths of distributed work and remote employees</h1></p><p name=\"7779\" id=\"7779\" class=\"graf graf--p graf-after--figure\">Working in slippers. Lavish snack breaks to the pantry. A commute no longer than 30 seconds. These are just a few of the benefits of working remotely, among others. According to <a href=\"https://insights.stackoverflow.com/survey/2016\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Stack Overflow&#8217;s 2016 developer survey</a>, about 30% of developers already work remotely. With flexible working options becoming a top priority for devs and as more employees move out of physical offices and into a remote working world, it&#8217;s important to acknowledge the challenges that distributed work can bring and combat them head on.</p><p name=\"2bf6\" id=\"2bf6\" class=\"graf graf--p graf-after--p\">Andela CIO <a href=\"https://medium.com/@lisbi\" class=\"markup--user markup--p-user\" target=\"_blank\">Lisbi Abraham</a> spoke at <a href=\"https://medium.com/pluralsight/pluralsight-live-2017-ultimate-recap-7969fdbdfd48\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Pluralsight LIVE</a> to dispel some of the myths that surround remote workers and distributed teams. In his session, The future of work is distributed, Lisbi elaborated on how Andela adopted this mentality to make remote work a big win. So, before you write off remote and lose out on what could be a big advantage for you and your company, get rid of these myths.</p><blockquote name=\"9333\" id=\"9333\" class=\"graf graf--pullquote graf--startsWithDoubleQuote graf-after--p\">&#8220;If you want to be competitive today, you have to offer your developers the option to be distributed. Remote working options are a top priority.&#8221; &#8211;Lisbi Abraham, Andela&#160;CIO</blockquote><h3 name=\"e52f\" id=\"e52f\" class=\"graf graf--h3 graf-after--pullquote\"><strong class=\"markup--strong markup--h3-strong\">Myth: Lack of communication</strong></h3><p name=\"01d6\" id=\"01d6\" class=\"graf graf--p graf-after--h3\">Working distributed can actually improve team communication. That&#8217;s for two reasons: It allows coworkers to communicate <strong class=\"markup--strong markup--p-strong\">when</strong> they need to and avoid unnecessary disruptions, and it forces people to say <strong class=\"markup--strong markup--p-strong\">what</strong> they need to and do it clearly.</p><p name=\"2c8e\" id=\"2c8e\" class=\"graf graf--p graf-after--p\">Yet, there&#8217;s no undermining how impactful face-to-face communication can be. One of the big problems of distributed teams is you can miss context. When communication is over Slack or email, it&#8217;s tough to understand urgency or tone. Communication can get messy if people aren&#8217;t thoughtful about it and there isn&#8217;t an established process.</p><h4 name=\"454c\" id=\"454c\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Solution</strong></h4><p name=\"3f03\" id=\"3f03\" class=\"graf graf--p graf-after--h4\">You need to pick the right tools for the right purpose. There are times when email makes a lot of sense. There are times when Slack makes a lot of sense. There are times when video calls make even more sense. And so, you have to have rules about what goes on and when communication should happen. A good rule of thumb is squashing back and forth that&#8217;s overkill. If there&#8217;s ongoing back and forth in an email or on Slack, it&#8217;s time for a call&#8202;&#8212;&#8202;no one is going to resolve it through more communication via Slack or email. You just need to call. In this case, most of the time, what&#8217;s preventing you from moving forward is the lack of context not the information.</p><p name=\"7294\" id=\"7294\" class=\"graf graf--p graf-after--p\">Another way to enhance communication between distributed teams is to remove the fear of &#8220;where are they?&#8221; If an employee is going offline or heads down in a project, encourage them to let team members know. If an employee puts Slack into snooze mode to focus for a few hours, ask them to let you and other team members know there&#8217;s a blackout period by updating their status. This gets rid of the fear that an employee isn&#8217;t being productive and diminishes frustrations when the employee isn&#8217;t reachable.</p><h3 name=\"11fd\" id=\"11fd\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Myth: Hurts&#160;culture</strong></h3><p name=\"e4b6\" id=\"e4b6\" class=\"graf graf--p graf-after--h3\">A desirable company culture is one that reinforces collaboration, trust and shared values&#8202;&#8212;&#8202;all things that are possible to cultivate regardless of geography. Part of your culture could be as simple as gathering around the ping pong table or going out for drinks with people. And then people feel tighter and bonded. You can&#8217;t do that with distributed workforces. You can&#8217;t just say: &#8220;Let&#8217;s go have a drink.&#8221;</p><p name=\"1432\" id=\"1432\" class=\"graf graf--p graf-after--p\">Therefore, you have to be very thoughtful about it&#8202;&#8212;&#8202;and activities that help create a healthy culture have to work across multiple places. People who are working from home, or a coffee shop, or a distributive center should all feel like they&#8217;re a part of the company.</p><h4 name=\"1a5c\" id=\"1a5c\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Solution</strong></h4><p name=\"ec78\" id=\"ec78\" class=\"graf graf--p graf-after--h4\">Create respect for remote. Make sure all employees work to include in-person and distributed employees through their actions. At Andela, when there&#8217;s a call that&#8217;s partially distributed (even if it&#8217;s just one person that&#8217;s distributed), everybody will be distributed. There will be no conference room where a group of people sit in and then another group on video chat. What happens when you do that is distributed people on the other end of the screen feel very left out. They don&#8217;t get the jokes that are being told around the conference room table. They don&#8217;t hear half of the things that are said. And it&#8217;s very hard for them to interject with their ideas and opinions. But when everybody is distribute, it puts everyone on an equal playing field. It shows the distributed employees they&#8217;re just as important to the success of that meeting as the ones who are actually local.</p><p name=\"f59a\" id=\"f59a\" class=\"graf graf--p graf-after--p\">And while distributed is great, it&#8217;s not a complete replacement for in-person time. At some point, you&#8217;ve got to get everybody together. In-person time is important to bond on a different level. It&#8217;s very hard to bond beyond work-related tasks when you&#8217;re remote. So, make sure your employees are getting fact time every couple of months.</p><h3 name=\"fc64\" id=\"fc64\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Myth: Productivity decreases</strong></h3><p name=\"3544\" id=\"3544\" class=\"graf graf--p graf-after--h3\">A <a href=\"https://hbr.org/2014/01/to-raise-productivity-let-more-employees-work-from-home\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Stanford University study</a> found remote workers are 13.5% more productive than their in-office counterparts&#8202;&#8212;&#8202;and they put in longer hours. And they broke that down into two components: Nine percent of that productivity came from having more time (taking less breaks and sick days and having less meetings). And then about 4% came from being able to focus. Office workers are constantly interrupted&#8202;&#8212;&#8202;roughly every three minutes. This is a big challenge, especially for developers whose work requires focus and detail. When employees are free from common office distractions like unnecessary meetings, loud conversations, impromptu requests, etc. their productivity increases, not decreases as is often perceived.</p><h4 name=\"09cf\" id=\"09cf\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Solution</strong></h4><p name=\"28c6\" id=\"28c6\" class=\"graf graf--p graf-after--h4\">Productivity can be tricky to measure, but it starts with giving people the right tasks and projects. Developers tend to like what they do, and they crave challenges and growth. In fact, <a href=\"https://www.pluralsight.com/resource-center/infographics/why-your-best-tech-talent-quits\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">36% of developers left a job because they wanted more challenging work</a>. So, finding the sweet spot for every employee is key to keeping people productive.</p><p name=\"4877\" id=\"4877\" class=\"graf graf--p graf-after--p\">Andela uses what they call a <a href=\"https://www.linkedin.com/pulse/developing-people-distributed-environment-scott-carleton/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">&#8220;Zone of Proximal Development,&#8221;</a> which is basically the space where an employee is being challenged enough they&#8217;re continually growing, but aren&#8217;t so challenged they feel it&#8217;s too hard and want to give up. Andela&#8217;s developer framework allows them to measure how an employee is performing across major attributes that relate to their growth and learning. And when they see something slipping on that developer framework, they know that employee has slipped out of the zone of proximal development. Creating a framework or program like this can greatly help productivity and overall employee satisfaction&#8202;&#8212;&#8202;and dispel the myth that remote workers aren&#8217;t productive.</p><p name=\"5713\" id=\"5713\" class=\"graf graf--p graf-after--p\">Today, geography doesn&#8217;t always hinder who you hire. And whether you&#8217;re a remote employee or looking to distribute your team, combatting some of the challenges that remote employees face will not only help you and your team, but your entire company.</p><p name=\"7327\" id=\"7327\" class=\"graf graf--p graf-after--p graf--trailing\"><strong class=\"markup--strong markup--p-strong\">Check out four big wins of rethinking remote here: </strong><a href=\"https://www.pluralsight.com/resource-center/guides/4-benefits-of-a-distributed-workforce\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Hiring top talent: 4 benefits of a distributed workforce</strong></a><strong class=\"markup--strong markup--p-strong\">.</strong></p></div>","title":"3 myths of distributed work and remote employees – Pluralsight – Medium"}},"pageContext":{"id":"5b9382f387be056953db7e0f"}}