{"data":{"mongodbDatabaseArticles":{"id":"5b937b0a87be056953db7d0d","content":"<div><p name=\"afd6\" id=\"afd6\" class=\"graf graf--p graf--leading\">I chose Los Angeles for several reasons, the first and foremost being that it was warm and as far from New York as I could get without leaving the continent or going to Canada. Secondly, as someone who identified herself as a comedy writer, I figured Los Angeles was were I could truly realize my dream which was, and currently is, to write for film and television.</p><p name=\"4313\" id=\"4313\" class=\"graf graf--p graf-after--p\">I idealized Los Angeles. Having only visited there to party and go to festivals, I naively expected it to immediately provide me with an easier and happier life. I quickly realized that putting 3,000 miles between myself and my problems wouldn&#8217;t make them go away, just throw them off course for a couple weeks.</p><p name=\"8b47\" id=\"8b47\" class=\"graf graf--p graf-after--p\">After the novelty of California wore off, which was about a week, life started to suck quite a bit. I came out here without a job (despite all the advice I got to the contrary) and within two weeks, my boyfriend started a job where he worked no less than 12 hours a day. During the day, I frantically applied to any position I was remotely qualified for as I anxiously crunched the numbers in my bank account.</p><p name=\"5b89\" id=\"5b89\" class=\"graf graf--p graf-after--p\">I was lucky enough to collect a few odd-end jobs my first few months here. If there&#8217;s one thing I can say about Los Angeles, it&#8217;s that there are assistant jobs a-plenty and boy, did I assist! I assisted in marketing for a large restaurant group, I assisted in casting for a wonderful casting director and I assisted as a camera op for a small, yet successful production company. I also &#8216;assisted&#8217; in the setup and execution of parties, making me a real-life bonafide cater waiter for the second time in my life. The first time, I was 18 and in college, a point where working as a cater waiter &#8220;made sense&#8221;. Now that I was 26 with a degree and 4 years of work experience, I couldn&#8217;t help but think that somewhere, something went wrong.</p><p name=\"a786\" id=\"a786\" class=\"graf graf--p graf-after--p\">Despite all my assisting, my bank account balance was still rapidly depleting. Every night, I tossed and turned thinking about how much time I had left before I had to make the dreaded phone call home requesting a one-way ticket back to New York. The worst part about my situation was that I had worked myself into such a deep self-hatred spiral that I was no longer performing. One of the main reasons I ventured out to Los Angeles was to work on my comedy and comedy was the last thing on my mind.</p><p name=\"c524\" id=\"c524\" class=\"graf graf--p graf-after--p\">Being separated from my family, my friends and my social networks for the first time in my life exacerbated the problems I tried to suppress in New York. My fear of failure and inability to be vulnerable had me keep everyone at arm&#8217;s length least they discover who I really was; a fraud. By isolating myself mentally and physically from those around me, I descended deep into a depression that I was convinced I could overcome if I just had one, tiny bit of success in this new city. My only saving grace was that I lived in a bustling house with three stupidly adorable dogs and one incredibly supportive boyfriend turned fianc&#233;e, who rubbed my back and told me everything was going to be okay whenever I descended into a blubbering lump of cry, which happened, on average, once every six weeks.</p><p name=\"9b0f\" id=\"9b0f\" class=\"graf graf--p graf-after--p\">My decision to move wasn&#8217;t only a little haphazard, it was completely unplanned and stemmed in something more serious than wanting to &#8220;make a change&#8221; or &#8220;escape the city&#8221;. I came to LA without a job, three months rent and the naive assumption that a writer&#8217;s assistant job would be handed to me along with my California ID, a medical marijuana card, and a renewed sense of self worth.</p><p name=\"fc43\" id=\"fc43\" class=\"graf graf--p graf-after--p\">Around the six month mark, I swallowed my pride and accepted that a steady job in &#8216;entertainment&#8217; wouldn&#8217;t come as easy as I hoped. I resigned to take a job at a tech start-up so I could at least get my finances in order and start performing again. Around the same time I got placed on a sketch team with some amazing writers and performers who helped me remember that life is funny and full of joy.</p><p name=\"7de3\" id=\"7de3\" class=\"graf graf--p graf-after--p\">Performing helped bring me back to almost normal. I was productive and happy to be working on projects that I cared about. However, it wasn&#8217;t long before the negative self-talk began to resurface. This time, I was telling myself that I wasn&#8217;t doing enough. I wasn&#8217;t doing enough live shows, I wasn&#8217;t putting myself out there enough, and that I was wasting too much time on frivolous things like cooking, spending time with friends and just straight up chillin&#8217;.</p><p name=\"95e4\" id=\"95e4\" class=\"graf graf--p graf-after--p\">Do you see the problem here?</p><p name=\"648b\" id=\"648b\" class=\"graf graf--p graf-after--p\">While a good chunk of my sadness was remedied by re-engaging with my creative outlet, I was still trying to motivate myself through negative self-talk and fear. You know, a tactic commonly found in emotionally manipulative and abusive relationships.</p><p name=\"9838\" id=\"9838\" class=\"graf graf--p graf-after--p\">This story doesn&#8217;t necessarily have a happy ending, or an ending at all. I don&#8217;t know if LA is my final destination and I don&#8217;t know where I&#8217;ll be at the end of this year, but none of that matters. All that matters is that I start to show myself the same amount of compassion and kindness I extend to my friends, my family, my fiancee and literally, every dog that I meet. If I don&#8217;t do that, it won&#8217;t matter where I live, who I&#8217;m with or what I achieve because I&#8217;ll always be miserable and being miserable is something I do not want to be.</p><p name=\"4b9d\" id=\"4b9d\" class=\"graf graf--p graf-after--p graf--trailing\">TLDR; You can&#8217;t run away from your problems, go to therapy, learn to love yourself more.</p></div>","title":"How I Moved from New York to Los Angeles in an Attempt to Escape My Problems."}},"pageContext":{"id":"5b937b0a87be056953db7d0d"}}