{"data":{"mongodbDatabaseArticles":{"id":"5b96246d87be058327490e65","content":"<div><p><img src=\"http://photos.foxnomad.com/Europe/Ireland/Dublin/i-kTSWs5K/0/M/CIMG2597-M.jpg\" alt=\"guinness storehouse barrels\" width=\"260\" height=\"195\">There are a few places in Dublin that tend to make most people&#8217;s itinerary the first time around. There are a lot of famous sites like the <a href=\"http://www.guinness-storehouse.com/TicketSelection.aspx\">Guinness Storehouse</a> you&#8217;ll be recommended to visit, required to pay a few Euro for, and all the while be unsure of whether your time is worth each one. I was in Dublin for the <a href=\"http://www.foxnomad.com/2010/02/01/the-2010-hoscars-award-ceremony/\">2010 Hoscars</a> and arrived a few days early to do some research for a few upcoming posts and put all of these places on my to-do list.</p>\n<p>These are my impressions and if you have limited time in Dublin, this post might help you trim down or add a few items to your travel itinerary.</p>\n<p><strong>The Guinness Storehouse</strong></p>\n<p>This isn&#8217;t the building where they brew the Guinness but it is Ireland&#8217;s most popular tourist destination. You won&#8217;t actually get to see the process of Guinness being made but if you love the drink you&#8217;ll enjoy learning about the history and <a href=\"http://www.foxnomad.com/2009/10/01/the-culture-of-guinness/\" target=\"_blank\">culture of Guinness</a>. Those who aren&#8217;t as enthusiastic about Guinness or beer in general might not find it as interesting for the 15 Euro admission. Buy your <a href=\"http://www.guinness-storehouse.com/TicketSelection.aspx\">tickets online in advance</a> and you&#8217;ll save 10% off the price (and cut to the head of the lines).</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/02/guinness-storehouse1.jpg\" alt=\"guinness storehouse\" width=\"690\"></p>\n<p><strong>Dublinia and The Viking World</strong></p>\n<p>Dublin has a Viking heritage you can learn about in <a href=\"http://www.dublinia.ie/index.htm\" target=\"_blank\">Dublinia</a>. It costs about 6 Euro to get in and you&#8217;ll get to wander around on your own through the museum. It&#8217;s not visually impressive but there is a lot of interesting historical information along the walls and exhibits if you&#8217;re wiling to take the time to read them. Perhaps the most interesting part is the archeological artifacts, bones, and interactive exhibit on the top floor &#8211; great for children and archeology fans.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/02/dublinia1.jpg\" alt=\"dublinia\" width=\"690\"></p>\n<p><strong>Christ Church Cathedral</strong></p>\n<p>Next to Dublinia, entrance to the Cathedral costs another 3-6 Euro, depending whether or not you can get a student discount. (Looking like a student seemed to be good enough in most cases.) The church is over 1,000 years old but isn&#8217;t worth the price of admission. There are plenty of other old churhces that are visually stunning in Dublin and most you can just walk in for free. You might actually get to see the church in action and get a few pictures before you leave.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/02/christ-church-cathedral-dublin.jpg\" alt=\"christ church cathedral\" width=\"690\" height=\"462\"></p>\n<p><strong>The Temple Bar</strong></p>\n<p>There is no cover charge to get into this famous Dublin pub, located at the corner of Temple Lane. There is live music from 2pm until late and the beer prices aren&#8217;t too much more than in other parts of town (6 Euro). It&#8217;s not a place to drink the night away as it&#8217;s crowded and there are plenty of other nice bars in the area and all over town (<a href=\"http://www.foxnomad.com/2010/02/05/dolier-chambers-dublin-ireland/comment-page-1/#comment-72812\">a ratio of 1:495</a>) but if you&#8217;re strolling around <a href=\"http://www.thetemplebarpub.com/\">The Temple Bar</a> is a nice place to stop by for a pint. Andrew <a href=\"http://www.thebrooklynnomad.com/\">The Brooklyn Nomad </a>also suggested the <a href=\"http://www.brazenhead.com/\">Brazen Head Pub</a> which is a good alternative.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/02/temple-bar-dublin.jpg\" alt=\"inside temple bar dublin\" width=\"690\"></p>\n<p><strong>Trinity College</strong></p>\n<p>College campuses can make for good, free, travel opportunities in many cities and Trinity College is in the middle of Dublin a good location to stop by. While you&#8217;re walking around taking pictures, stop by the <a href=\"http://sciencegallery.com/\">Science Gallery</a> (free), the <a href=\"http://www.douglashydegallery.com/index.php\">Douglas Hyde Gallery</a> (free), and the <a href=\"http://www.bookofkells.ie/\">Old Library</a> (about 8 Euro). The campus is also right next to St. Stephens Green park, a nice walk to add to your day.</p>\n<p><img src=\"http://photos.foxnomad.com/Europe/Ireland/Dublin/i-VGMMS25/0/XL/CIMG2652-XL.jpg\" alt=\"trinity college dublin\" width=\"690\" height=\"920\"></p>\n<p><strong>Kilmainham Gaol</strong></p>\n<p>A large unoccupied prison (now museum) that costs 6 Euro to get in but is a fascinating historical experience. The price of admission comes with a guided tour and you&#8217;ll to learn that the prison wasn&#8217;t segregated, it was built in 1796, or that prisoners were sent here to die at <a href=\"http://www.heritageireland.ie/en/Dublin/KilmainhamGaol/\">Kilmainham Gaol</a> for their nationalist ideals among other crimes.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2010/02/kilmainham-gaol-dublin.jpg\" alt=\"kilmainham gaol dublin\" width=\"690\" height=\"518\"></p>\n<p>Dublin is a nice city to wander around and has its fair share of touristic destinations. I don&#8217;t think any of these places will disappoint particularly if you&#8217;ve got a slight inclination toward any of them. There&#8217;s also the <a href=\"http://www.jamesonwhiskey.com/home.aspx\">Old Jamison Distillery</a> and a host of <a href=\"http://www.imma.ie/en/index.htm\">other museums</a> and <a href=\"https://en.wikipedia.org/wiki/Irish_Houses_of_Parliament\" target=\"_blank\">national</a> <a href=\"http://www.dublincity.ie/RecreationandCulture/MuseumsGalleriesandTheatres/CityHall/Pages/city_hall_hub.aspx\">buildings</a> to visit in addition to the over 1,000 pubs in the city.</p>\n<p>[photos by: (2nd photo) <a href=\"https://www.flickr.com/photos/shadowgate/\" target=\"_blank\">Shadowgate</a>, <a href=\"https://www.flickr.com/photos/anams/\" target=\"_blank\">* mario *</a>, <a href=\"https://www.flickr.com/photos/zaniac/\" target=\"_blank\">ZaNiaC</a>, <a href=\"https://www.flickr.com/photos/logicalrealist/\" target=\"_blank\">Sean Munson</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Rating Dublin’s Popular Tourist Attractions"}},"pageContext":{"id":"5b96246d87be058327490e65"}}