{"data":{"hippie_inheels":{"edges":[{"node":{"id":"5b962b9987be0583274911df","title":"Hippie In Heels","source":"hippie_inheels","summary":"This award isn’t bad though, because they aren’t saying I’m bad, just that I’m new.\nUnlike a chain emails I’ve never passed on, I am happy to send this award on to other newbie travel bloggers.\nShe’s an Indian blogger here and I love her site as a reference when I’m looking for a nice getaway.\nWhat travel tips would you tell your readers if you could only give them one?\nI’d love to keep giving you travel tricks & tips so feel free to subscribe by e-mail in the big purple box below.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2013-11-22-at-5.21.39-PM.jpg?fit=479%2C323&ssl=1"}}},{"node":{"id":"5b962b9387be0583274911de","title":"Travel Blog Interview with Jo from Dirty Paws- Hippie in Heels","source":"hippie_inheels","summary":"“It’s time to get your paws dirty…” a travel blog interview.\nJo really caught my attention when she posted how “the shopaholic” saved money for travel.\nWhen you have bit of a tan, this colour can look really pretty (Think Amber Heard in The Rum Diaries).\nI really think that travel gives you that confidence and freedom and develop’s the most important part of you, your character!\nMy bed is definitely something I will miss because in the process of saving money for travel I have become such a homebody.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/diving-photo-002.jpg?fit=457%2C596&ssl=1"}}},{"node":{"id":"5b962b8487be0583274911dd","title":"Want to Win a Free Vacation in the UK?","source":"hippie_inheels","summary":"Want a chance to win a free vacation!?\nI just took a quiz from a UK travel agency called Parkdean Holidays to be entered to win a prize of a 7 day stay at one of their two dozen resorts across the UK for your family- it’s worth 750 pounds.\nMake sure after you finish the quiz, you enter you e-mail after so they can contact you if you win.\nThe only time I’ve spent beachside in the UK is when Ben took me to Brighton Pier, but I’ve always wanted to see more.\nI’d love to keep giving you travel tricks & tips so feel free to subscribe by e-mail in the big purple box below.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-05-11-at-3.04.56-PM.jpg?fit=800%2C501&ssl=1"}}},{"node":{"id":"5b962b6287be0583274911dc","title":"India Someday – India travel with a little assistance","source":"hippie_inheels","summary":"-This post is brought to you and written by India Someday-India Someday is a travel service that offers just the right amount of assistance to independent travelers looking at planning a trip to India.\nDepending on how much assistance you are looking at we will help you fill in the gaps of your India travel.\nIndia someday is a travel service that fills in that gap.\nDepending on what you need we help you plan your route, help you book right places to stay and book your trains/buses/cars and flights.\nHippie on Heels has not had a chance to experience our services yet but do take a look at the reviews by people who’ve used our service on how they benefited travelling with India someday assistance.","info":{"author":"Rachel Jones","top_img":"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/Screen-shot-2015-03-24-at-6.16.08-PM.jpg?fit=800%2C372&ssl=1"}}},{"node":{"id":"5b962b0d87be0583274911db","title":"3 Packing Tips that will Ensure you get the Most out of Your Vacation Time","source":"hippie_inheels","summary":"You’ve been saving up your vacation days all year so you can kick back and relax for a full week of nothing but sunshine and sightseeing.\nFollow these tips and plan ahead by packing light and efficiently so you can get to your final destination as quickly and painlessly as possible!\nSkip the check in line and eliminate the risk of your bag not arriving when you do by only packing a carry-on.\nGet enough rest and hydratePrepare your body for the journey and you wont feel as jet lagged when you finally make it to your vacation spot!\nBy following these 3 simple tricks you can give yourself the no hassle stress-free vacation you’ve been hoping for!","info":{"author":"Rachel Jones","top_img":"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/06/packing-for-florida-IT-luggage8.jpg?fit=560%2C420&ssl=1"}}},{"node":{"id":"5b962aba87be0583274911da","title":"How to Change to a Nomadic Lifestyle in the Modern Era","source":"hippie_inheels","summary":"Regardless of whether you are a writer, computer programmer, design expert or photographer, there are ways to make a considerable amount of money online.\nThe Best Places in the World to Live the Digital Nomad LifestyleIt is important to consider the cost of living ratio when deciding where to become a digital nomad.\nFor example, parts of the world such as Southeast Asia, Africa, Latin America, and parts of Europe naturally lend themselves to being ideal digital nomad hubs.\nThese parts of the world are gorgeous, but are also peaceful for the digital nomad to enjoy.\nConcluding RemarksBecoming a digital nomad is something that many individuals fantasize about.","info":{"author":"Rachel Jones","top_img":"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/05/2016-04-27-11.56.20-1.jpg?fit=560%2C416&ssl=1"}}}]},"nomadicmatt":{"edges":[{"node":{"id":"5b95eb3a87be058327490009","title":"Amsterdam Travel Guide: Expert Travel Advice From Nomadic Matt","source":"nomadicmatt","summary":"Made with love by travelers for travelers!\nUpdated: July 2018Return policy: No risk, 30 Day, 100% Money Back GuaranteeDetails: 96 pages of expert budget travel advice with mapsI loved Amsterdam from the moment I first wandered into the city in 2006.\nIt’s a truly magical place and I want you to love it the way I love it.\nI want you to experience it the way it’s meant to be experienced – the Dutch way!\nIt shares the hidden secrets of the city and offers an authentic local experience into quaint cafes, beautiful parks, and architecture, and overlooked sights.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/NM_Guide_to_Amsterdam_Flat-1.jpg"}}},{"node":{"id":"5b95eb3487be058327490006","title":"Nomadic Matt's Guide to Paris","source":"nomadicmatt","summary":"Paris, a city of 2 million people, has its gems, nooks, and crannies where prices are reasonable and there isn’t a tourist in sight.\n(A very happy me in front of the Eiffel Tower)What’s in this Paris Guide?\nBudget advice – Discover money-saving tips and budget suggestions not found elsewhere, so you’ll know how to save on your upcoming trip.\n– Discover money-saving tips and budget suggestions not found elsewhere, so you’ll know how to save on your upcoming trip.\nA history of Paris – Learn about how Paris became the city it is today.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/07/NM_Guide_to_Paris_Flat.jpg"}}},{"node":{"id":"5b95eb3187be058327490005","title":"Nomadic Matt’s Guide to Iceland","source":"nomadicmatt","summary":"See the Authentic Side of IcelandMade with love by travelers for travelers!\nUpdated: July 2018Return policy: No risk, 30 Day, 100% Money Back GuaranteeDetails: 196 pages of expert budget travel advice with mapsIceland.\nMy love for Iceland became an obsession.\nIceland is a place that many travelers want to go – but are all worried about cost.\nThis guide is meant for travelers looking to see the most of Iceland.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/04/NM_Guide_to_Iceland_Flat-sm.jpg"}}},{"node":{"id":"5b95eb1d87be05832748fffb","title":"Bangkok Travel Guide: Expert Travel Advice from Nomadic Matt","source":"nomadicmatt","summary":"July 2018No risk, 30 Day, 100% Money Back Guarantee110 pages of expert budget travel advice with mapsWondering how you’re going to get around Bangkok or make the most of your visit?\nBangkok is a city that opens itself up when you ditch the typical tourist path.\nI used to hate Bangkok until, on my third visit, wanting to learn Thai, I decided to stay for a month.\nThis guide is meant for travelers looking to see the most of Bangkok.\nYou’ll see the local side of the city as I take you off the tourist trail and show you Bangkok’s inner world.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/05/NM_Guide_to_Bangkok_Flat.jpg"}}},{"node":{"id":"5b95eb0d87be05832748fff2","title":"How NOT to Let Anxiety Stop You From Traveling","source":"nomadicmatt","summary":"Today, Lauren writes in-depth about her panic attacks, how travel helped her cope, and gives advice to others facing the same issues.\nBy the time I left, my anxiety had improved, but I was still suffering from panic attacks anywhere from once a month to several times a day.\nIn the four years I’ve been on the road, though, I can count the number of attacks I’ve had on two hands.\nTurning my anxiety into a positiveWriting about my anxiety on my travel blog was the best thing I ever did.\nI’ve had a total of two anxiety attacks in the past 12 months.","info":{"author":"Yeison Kim, Brittany Herriot, Ryan Biddulph, Nancy Lendved, Suzanne Fluhr, Karadeniz Tur, Tom Miller, Jane M, Lauren Erickson, Jon B","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/anxiety08.jpg"}}},{"node":{"id":"5b95eb0987be05832748fff1","title":"How to Visit New York City on a Budget","source":"nomadicmatt","summary":"See More, Spend Less, Travel DeeperMade with love by travelers for travelers!\nWhen it came time to slow my travels, I knew there was no other city to move to.\nWhen I’m not on the road, I’ve lived in New York City and have used my personal, insider view to write this guidebook.\nI know the city like the back of my hand.\nToo many people think NYC is “too expensive” but actors, writers, and everyday people manage to live in the city without going bust.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/NM_Guide_to_NYC_Flat.jpg"}}}]},"tielandtothailand":{"edges":[{"node":{"id":"5b95f51887be058327490140","title":"Don’t Become a Teacher in Thailand If…","source":"tielandtothailand","summary":"Don’t Become a Teacher in Thailand If…Teaching English is the go-to job for foreigners who wish to earn money while living in Thailand.\nBefore you think it’ll be a breeze to become a teacher in Thailand, there are a few things worth considering.\nFor some people, the only thing separating them from becoming a teacher in Thailand is a one-way ticket abroad.\nYou Don’t Like ChildrenI hate to state the obvious but if you don’t like children you won’t like being a teacher.\nWeigh your options, and if you choose to become a teacher in Thailand, I wish you luck on your adventure.","info":{"author":"Chris, Ajarn Jaid, Yves Herz, Charlotte Major, Nelson Jones, Stew Shaw, Kuenzang Dorji","top_img":"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/10/Dont-Become-a-Teacher-in-Thailand-Header2-1000px1.jpg?fit=1000%2C550&ssl=1"}}},{"node":{"id":"5b95f50e87be05832749013f","title":"Overcoming Culture Shock in Thailand","source":"tielandtothailand","summary":"Overcoming Culture Shock in ThailandI remember when I started shopping at our local Thai market.\nHere are the problems we first wrestled with and how we eventually overcame culture shock in Thailand.\nA Look Back on Overcoming Culture Shock in ThailandThe irony about culture shock in Thailand was that, at first, we didn’t recognize it as the problem.\nBut by accepting change in ourselves and learning to become resourceful and flexible, we were able to overcome culture shock.\nWhat have you heard, if anything, about culture shock in Thailand?","info":{"author":"Chris, Thai People, Marianne Miller, Leigh Anne, Tanya Dye, Mike H, Ed Levenson, Roger Lucarelli","top_img":"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/05/CS.png?fit=563%2C373&ssl=1"}}},{"node":{"id":"5b95f4fa87be05832749013e","title":"Thai Visa 101: Common Misconceptions and Lingo Mistakes","source":"tielandtothailand","summary":"Thai Visa 101: Common Misconceptions and Lingo MistakesUnderstanding Thailand’s visa laws can be quite frustrating.\nA Thai visa should also not be confused with the free Visa Exempt Stamp, which isn’t a visa.\nLet’s clarify a few things:A visa exempt stamp is not a visa.\nIn lieu of a visa, a visa exempt stamp (the rubber kind with ink) is stamped into your passport.\nCovering the Thai Visa BasicsWe hope this sets straight some of the basic questions people often have with Thai visas.","info":{"author":"Chris, Gina Harbison, Khadi Wolf-Brooke, Jamie Ross, Rob Atkinson, Robert Atkinson","top_img":"https://www.tielandtothailand.com/wp-content/uploads/2014/09/ThaiVisa101r1.png"}}},{"node":{"id":"5b95f4f987be05832749013d","title":"2 Weeks Onsite Training with accommodation plus 4-5 Month Teaching Placement","source":"tielandtothailand","summary":"SEE TEFL offers a 4-5 month placement for PAID full-time English Teaching in Central and Northern Thailand — 2 weeks of TEFL training at our training school in Chiang Mai + accommodation (while training) included.\nTEFL Teacher Internship Training ComponentsThere are two training components:Pre-arrival : Videos and assignments that introduce classroom management skills and review common grammar terminology.\n2018 DatesOnsite training from September 24th – October 5th followed by a paid teaching internship for 4-5 months2019 DatesOnsite training from April 16th – 26th followed by a paid teaching internship for 4-5 monthsfollowed by a paid teaching internship for 4-5 months Onsite training from September 23rd – October 4th followed by a paid teaching internship for 4-5 monthsOnsite training always starts on a Monday; however, Please note that for only our April 16th training date, training starts on a Tuesday as the Monday is the last day of the Songkran National Holiday.\nThe two week teaching essentials align with the start of a school semester, and the teaching Internship placements are for that length of time.\nThis includes the two weeks of Teaching Essentials training and comfortable resort accommodation during the 2-week course in Chiang Mai.","info":{"author":"","top_img":"https://seetefl.com/images/seetefl/favicon.png"}}},{"node":{"id":"5b95f4f087be05832749013c","title":"4 Week TEFL Training Course in Chiang Mai","source":"tielandtothailand","summary":"5.2 Teaching vocabulary using ‘3Ps’ methodologyTeaching Grammar6.1 Teaching English language structures effectively using 3Ps methodology.\n7.2 A discussion of the particular stages of a ‘3Ps’ lesson when EFL students will participate in a speaking activity.\n11.3 Spoken practice activities using the associated language structures 11.4 Effective production activities using the associated language structures.\nSummary of Course OutlineWe have designed and improved our TEFL Training Course over the past 11 years.\nHowever, we have a very organized and effective course schedule and have an overwhelmingly successful completion rate.","info":{"author":"","top_img":"https://seetefl.com/images/seetefl/favicon.png"}}},{"node":{"id":"5b95f4e387be05832749013a","title":"Is Teaching in Thailand Worth It?","source":"tielandtothailand","summary":"Is Teaching in Thailand Worth It?\nTeaching is one of the most accessible positions for foreigners who want to earn money while residing in Thailand legally, but is teaching in Thailand worth it?\nIs Teaching in Thailand Worth it?\nIs teaching in Thailand worth it for up to 15 months of no border runs?\nTo the teachers living here, based on what you get for what you give, is teaching in Thailand worth it to you?","info":{"author":"Chris, Vincent Mancini, Leandro Dacera, Aileen Lawless, Michelle Honig, Isabel Boehms, American Teacher, Karl Grutter, Mike Vogler, Megan Peiler","top_img":"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Dusit-7.jpg?fit=563%2C405&ssl=1"}}}]},"foxnomad":{"edges":[{"node":{"id":"5b9624f987be058327490f51","title":"Which Star Trek Crew Member Do You Travel Like?","source":"foxnomad","summary":"“To boldly go where no man has gone before.”-Star Trek title sequenceThe voyagers of the original Star Trek Enterprise inspired an entire generation to explore beyond what their imaginations had to capture.\nWhile the worlds of Star Trek may be fantasy, the personalities behind the original characters embody several ‘traveler types’ that we all are and see in others.\nBelow is a quick recap of some other Star Trek characters from the original 1960s series.\nWhich Star Trek Crew Member Do You Travel Like?\nI hope that you enjoyed this little traveling personality chart based on the Star Trek characters.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/05/tos_crew1.jpg"}}},{"node":{"id":"5b9624f887be058327490f4f","title":"Post Highlights: [5/1/2009]","source":"foxnomad","summary":"Post Highlights are a selection of the best and most popular posts from the past two weeks updated every other Saturday.\nAnother great way to get the best of foXnoMad is to subscribe to my RSS feed (what is RSS?).\n48 Hours In IstanbulIstanbul is many things to many people and if I had 48 hours in the city, here’s what I’d recommend to get your feet wet, jump in the pool, or become a fish in this city which spans two continents.\nThree Location Based Social Networks Travelers May Find UsefulThere are some differences between three of the popular options, Loopt, brightkite, and foursquare so here are the basics to introduce you to them.\nTurkish Remedies For Preventing An Upset StomachOnly some of these are backed by science, and the others may just be old wives tales but won’t hurt to try especially if you’ve got a sensitive stomach.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b9624f687be058327490f4d","title":"Changes Coming To Email, Design, and Some Contest News","source":"foxnomad","summary":"Over the coming weekend I’ll be expanding and reworking the email updates so they are more useful and readable with some new options.\nA number of you have sent me suggestions about them, and some features you’d like built into the website.\nIf you’ve got anything to add, feel free to let me know in the comments or send me an email.\nAlso, I’m planning another summer contest, although I’m thinking of pushing it back to June or July.\nIt’s typically slower on the Internets during the busy summer traveling months and might be a nice change of pace.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/05/ideas1.jpg"}}},{"node":{"id":"5b9624f687be058327490f4b","title":"From Lisbon To Saigon In One Shot: The Ultimate Train Challenge","source":"foxnomad","summary":"40 Shares PinThis September, I will begin a race against 5 other travel bloggers to break the record for the world’s longest continuous train journey.\nTo be more precise, The Ultimate Train Challenge will have me hopping from train to train, beginning in Lisbon, Portugal all the way to Vietnam’s Saigon.\nWhat Is The Ultimate Train Challenge?\nWhen I was first approached with the idea by Michael Hodson, I found both the travel and personal challenge difficult to resist.\nThe Devil Is In The PlanningEach of us train challenge participants can choose our own paths -north or south across Europe – then south from China into Vietnam.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/06/madrid-atocha-train-station.jpg"}}},{"node":{"id":"5b9624f587be058327490f4a","title":"The Rode VideoMicro Compact Microphone Will Significantly Improve Your Travel Video Audio","source":"foxnomad","summary":"﻿More and more of you are adding travel videos to your trip collections as phones of the past 2 years have made major jumps in video quality.\nAs cameras and mobiles get better at taking video, they still suck at audio.\nFor video with any kind of intelligible speaking in it, a microphone can go a long way.\nThe Rode VideoMicro is a compact, durable microphone under $60 that dramatically improves audio in any video.\nYou can watch my full review of the Rode VideoMicro in the video above.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2018/05/rode-vidmicro.jpg"}}},{"node":{"id":"5b9624f487be058327490f49","title":"The Best Falafel In The World Is In The Middle Of A Decade-Old Sibling Feud","source":"foxnomad","summary":"This is the story of two brothers in Beirut, Lebanon, who haven’t spoken in since 2006, when they’re split up their father’s famous falafel shop.\n(Falafel is a simple dish of fried chickpeas, often wrapped in pita bread.)\nThe two sons of Mustapha Sahyoun, Fuad and Zuheir, inherited the shop in 1992 but due to a dispute they won’t discuss, in 2006, Fuad opened his falafel shop right next door.\nBoth of these shops are considered some of the best falafel in the world; though which is better is something of a local rivalry in itself.\nI visited the Sahyoun falafel shops during a visit to Beirut and you learn more about the story in the video here.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/Thumbnails/n-G3vWG/i-G3MvQsC/0/b68c3745/1682x1152/i-G3MvQsC-1682x1152.jpg"}}}]},"levels":{"edges":[{"node":{"id":"5b9248ea87be056953db7c12","title":"Co-working spaces in Bangkok: Hubba","source":"levels","summary":"I knew co-working spaces were starting to pop up everwhere but I had never considered them before.\nWell, in Amsterdam co-working spaces seem to be filled with hypey wannabe startup folk building \"the next Facebook For Dogs with GroupOn Deals\".\nSo there's no use for co-working spaces to me.\nI browsed around the terrific ShareDesk, which provides a listing of co-working spaces around the world.\nOne of the best co-working spaces I found in Bangkok was HUBBA.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/05/hubba920.jpg"}}},{"node":{"id":"5b9248ea87be056953db7c11","title":"How technology changed the music industry","source":"levels","summary":"I just graduated with a Master's degree in Business Administration from Rotterdam School of Management with my thesis entitled \"How Technology Changed the Music Industry: The New Appropriability Regime and Its Influence on Artists’ Commercialization Strategy, Business Models and Skill Sets\".\nI interviewed 12 respondents that all participated in the music industry in different ways and even though the sample size is limited, my thesis offers some interesting information for artists on where the music industry is at right now and where it may be headed in the future.\nTL;DR: It's now cheaper to make music resulting in more musicians, more music produced, higher competition and thus more independent artists, new business models and an enormous entrepreneurial opportunity to present all that music to listeners.\nDue to easier access to the means of music production and distribution, the amount of artists participating in the music industry has increased substantially with a much higher competition among artists than before.\nHowever, it may also make it more difficult for listeners to find music they like, simply because there is so much music available now.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2012/09/Screenshot-2015-11-11-22.39.33.png"}}},{"node":{"id":"5b9248e987be056953db7c10","title":"Why overnight success is a myth","source":"levels","summary":"Great bit by tsunamifury on Hacker News:Most people fail, most projects go unfinished, most beyond that never make enough money to sustain a company.\nA successful product is the evolutionary result of 10,000 products before it that failed, went unfinished, or were unprofitable.\nEven the best of the Valley didn't sit down, bang out some brilliant code, slap a business strategy on top, then cash a billion dollar check.\nThen after that, they spend months or years compiling a business strategy and altering the product to become palatable to enough customers to gain a profit.\nEven finishing a unprofitable product is an massive achievement in itself.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/02/nofailstartupsuccess.jpg"}}},{"node":{"id":"5b9248e887be056953db7c0f","title":"Anna Lunoe & Diamond Lights – Stronger (Willy Joy Remix)","source":"levels","summary":"Super original track By Willy Joy who actually uses a drum loop as his melody, wat!","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2012/08/annalunoereleasesvideoforallout_1600x560.jpg"}}},{"node":{"id":"5b9248e787be056953db7c0e","title":"In the 21st century, Maria Montessori shows to be more relevant than ever","source":"levels","summary":"In fact, the idea of \"learning by doing\" stretches back to education legends Maria Montessori and John Dewey, both of whom felt teachers should act more as guides to students' independent discoveries than as founts of information.\nDecades of research confirm that making and doing things cement knowledge in ways that lectures can't.\n\"The driver is hands-on and the passenger does what students normally do in class, which is sit passively.\nMaria Montessori's philosophies on education are more relevant than ever, now we are in the 21st century.\nAs a Montessori graduate myself, it makes me happy to see the world slowly realizing this too.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/01/maria-montessori.jpg"}}},{"node":{"id":"5b9248e687be056953db7c0d","title":"How I switched from PC to Mac in less than 7 days","source":"levels","summary":"Every time I would install Windows, I would spend days customizing it and configurating it to work like I wanted it too.\nHowever, in a week, I was doing more work and doing it faster than on my PC.\nInstead of working with 2 screens on my PC, I now work with 4 screens next to each other.\nI built up a list of tips to optimise OSX for PC users that can help you transition too.\nYou don't really know what you're missing on a PC, if you don't try a Mac for at least a week.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/03/IMG_0962.jpg"}}}]},"nomadcapitalist":{"edges":[{"node":{"id":"5b92397b87be0583cfde680d","title":"America’s bad excuse for citizenship-based taxation","source":"nomadcapitalist","summary":"No other country, “civilized” or not, has such a requirement.\nI would argue that Belgium and Norway are better places to live, eat well, raise a family, and bank – Norway is even better at managing their fiscal affairs.\nIt’s bad enough American embassies are about the only ones that take up multiple city blocks surrounded by huge fences and nasty-looking armed guards.\nOnce inside, you get barked at by staff who get vacation days on both US holidays and whatever country they’re working in.\nIf I ever get stuck in a war zone, I wouldn’t trust the US consulate to keep me safe.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2013/06/eritrea-us-citizenship-based-taxation.jpg"}}},{"node":{"id":"5b92397a87be0583cfde680c","title":"Five US Tax Myths about expats, nomads, and renunciation","source":"nomadcapitalist","summary":"In this article, I want to address some of the most popular myths about citizenship-based taxation for expats, digital nomads, and renunciants in the United States.\nHowever, as is so often the case, his US tax advisor was totally clueless as to the many tax strategies available for expats and had not advised his client.\nFor two years in a row, I have gladly paid zero dollars and zero cents in US taxes; that’s $0 in federal income tax, $0 in state income tax, and $0 to Social Security and Medicare.\nIn fact, the United States is one of the friendlier developed countries for digital nomads.\nFor the reasons listed above and others, many expats and nomads assume that they don’t qualify for many of the tax exemptions available to others.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/06/us-tax-myths.jpg"}}},{"node":{"id":"5b92397987be0583cfde680b","title":"How to Go Where You’re Treated Best","source":"nomadcapitalist","summary":"Nomad Capitalist, however, is all about my five magic words: “go where you’re treated best”.\nMost people don’t go where they’re treated best because the idea of doing anything outside of Adelaide, or Salt Lake City, or Manchester seems frightening.\nThat’s why, today, I want to reiterate the importance of going where you’re treated best.\nGo where you are treated best.\nIf you want to learn more about going where you’re treated best for your specific situation, my best blog posts are a great place to start getting inspiration.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/05/how-to-go-where-youre-treated-best.jpg"}}},{"node":{"id":"5b92397987be0583cfde680a","title":"Why I decided to get citizenship through investment","source":"nomadcapitalist","summary":"A lawyer friend of mine helped one of his clients obtain his first economic passport more than a decade ago.\nWhat economic citizenship has taught meOne of the things you’ll see in this blog series is that I’m open to changing my mind when circumstances change.\nFirst, each article will feature notes from my journal as I underwent the citizenship by investment process.\nIt will also cover issues surrounding second citizenship such as citizenship renunciation, financial matters, visas, travel and more.\nGet your own economic citizenship and second passportMy goal in doing this series is to help as many people as possible become global citizens by obtaining second citizenship.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/10/Economic-citizenship-series-passport.jpg"}}},{"node":{"id":"5b92397787be0583cfde6809","title":"Where to incorporate your Amazon FBA business to reduce taxes","source":"nomadcapitalist","summary":"However, if you’re trying to decide where to set up a company to reduce your taxes and liability, there are a few factors that you need to consider.\nMore importantly, there are also things that you can do to help reduce, or even eliminate, the tax that you pay.\nWhen you trade online, there is a high possibility that you’re going to run into jokers and fraudsters.\nIf you live in The USA that company could be an LLC (limited liability company.)\nTaxWhere you live and how you run your business largely dictates how much tax you’re going to pay.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/05/where-to-incorporate-amazon-fba-business.jpg"}}},{"node":{"id":"5b92397687be0583cfde6808","title":"9 Expat-Friendly Countries with No Capital Gains Taxes","source":"nomadcapitalist","summary":"Paying capital gains tax is not only a pain, but it also discourages investment and stops capital from reaching its highest use.\nAround the world, there are dozens of countries that impose no taxes on capital gains in one way or another.\nThe fact that Belize boasts zero capital gains taxes for residents or non-residents alike doesn’t hurt its appeal, either.\nAs part of its tradition of respect for capital, Hong Kong does not tax capital gains.\nUnrestricted shares and options are, however, free from capital gains taxes.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/03/belize-no-capital-gains-tax.jpg"}}}]},"medium_search_nomad":{"edges":[{"node":{"id":"5b937b3787be056953db7d3b","title":"No one is going to teach you how to become a digital nomad","source":"medium_search_nomad","summary":"No one is going to teach you how to become a digital nomadAre you looking for some advice on how to become a digital nomad?\nHere are two cents from someone that has been traveling the world while working remotely for the past four years:No one is going to teach you how to become a digital nomad.\nI’ve met people working remotely with psychology, illustration, medicine, cryptocurrency, education and even oceanography.\nIt’s possible that you will not be able to become a digital nomad doing exactly the job you’re doing right now.\nThere’s no such thing as a single secret formula to become a digital nomad.","info":{"author":"Debbie Corrano","top_img":"https://cdn-images-1.medium.com/max/1200/1*4EbWvWO_O3TEK43Pq13yeQ.jpeg"}}},{"node":{"id":"5b937b3787be056953db7d3a","title":"The 'digital nomad' is the modern hobo – WEG Pub – Medium","source":"medium_search_nomad","summary":"The ‘digital nomad’ is the modern hoboRecently, we’ve seen the rise of what is euphemistically known as the ‘digital nomad’.\nI propose we call them by what they really are: digital hobos.\nOr, really, let’s just call them hobos, since the only significant difference between the hobos of the early 20th century and today’s ‘digital nomads’ is the tech.\nThe digital hobo can project themselves as heroic and enterprising, rather than as frightened and alone.\nThis is what digital hobos leave behind.","info":{"author":"Wyatt Edward Gates","top_img":"https://cdn-images-1.medium.com/max/1200/1*rsuOXdv_wfUCvoCVFZflIA.png"}}},{"node":{"id":"5b937b3687be056953db7d39","title":"Digital Nomad Guide to Plovdiv, Bulgaria: The “Chiang Mai of Europe”","source":"medium_search_nomad","summary":"Digital Nomad Guide to Plovdiv, Bulgaria: The “Chiang Mai of Europe”The reasons to come to Plovdiv this year if you’re a travelling entrepreneur!\nOne of the many cafes in Kapana, PlovdivPlovdiv nomad score: https://nomadlist.com/plovdiv-bulgaria/scoresChiang Mai, for comparison: https://nomadlist.com/chiang-mai-thailand/scoresThis is my digital nomad guide to Plovdiv.\nIn reality, they’re probably just embarrassed that they don’t speak English well and don’t know how to help you.\nNavigating the bureaucracy is difficult if you don’t speak Bulgarian, so I highly recommend that you get a good immigration lawyer to help you.\nThe only issue is that many households in Plovdiv (and Bulgaria in general) still use coal for heating in the winter.","info":{"author":"Euvie Ivanova","top_img":"https://cdn-images-1.medium.com/max/1200/1*cx3omSK8oeyGko4tGX549A.jpeg"}}},{"node":{"id":"5b937b3387be056953db7d38","title":"The Dark Side of Being an Expat and a Digital Nomad that No One Talks About","source":"medium_search_nomad","summary":"Getting visas is like that times 10, with different languages, governments, immigration lawyers, and time zones added in.\nI had planned on staying with my friend for a week before going up to New York.\nThere was always one more document to find, one more form to fill out, one more delay from the solicitor.\nYou know, like going out for drinks regularly, or having a car.\nIt’s just been two years since the live-in lovah & I moved into a flat that had more than 150 square feet.","info":{"author":"Rachel Allen","top_img":"https://cdn-images-1.medium.com/max/1200/1*rLrnHR4JpOuU9gp3CPmGXA.jpeg"}}},{"node":{"id":"5b937b3287be056953db7d37","title":"Rise of Digital Nomad Destinations – Ben Keene – Medium","source":"medium_search_nomad","summary":"My first ‘digital nomad’ experience was as a volunteer in 1999 at Glengarry — a spectacular outdoor school in the heart of New South Wales.\nWe now know quite a lot about being a digital nomad: airbnb, couchsurfing, home swapping and house sitting have enabled this growth as much as wifi and cheaper travel has.\nHere are 9 digital nomad destination ideas that I’ve come across that have the potential to ride this wave.\nJoining our diverse community of members and collaborators will inspire, connect, and enable you to develop your best work every step of the way.\nFind a home/office in the best nomad destinations.","info":{"author":"Ben Keene","top_img":"https://cdn-images-1.medium.com/max/1200/1*l7rmS0r01_LTrDIHn1i79g.jpeg"}}},{"node":{"id":"5b937b3187be056953db7d36","title":"Learning to code and becoming a software engineer. – codeburst","source":"medium_search_nomad","summary":"Learning to code and becoming a software engineer.\nOne of my goals for this blog is to start offering real skills of how to become a software engineer and learn to code.\nOver the past few years, I have seen so many resources for how to learn to code on the internet.\nThere is Code Academy, Code School, General Assembly, etc that have all popped up as great ways to learn how to code.\nHow do I know you can succeed with this and even get your own app on the Apple App store or Google Play?","info":{"author":"The Ginger Nomad","top_img":"https://cdn-images-1.medium.com/max/1200/1*RzaInxk-6KSfmGQtFiEuIw.jpeg"}}}]},"medium_search_remote":{"edges":[{"node":{"id":"5b93838887be056953db7e5c","title":"Why I Only Work Remotely – NewCo Shift – Medium","source":"medium_search_remote","summary":"Open officesMost startups nowadays are obsessed with the open office environment, and it’s nearly impossible to find companies that do not implement this type of layout.\nIt’s hard to estimate how many startups are being held back by the obsession and group think around the open office environment.\nButts in seats thinking vs ROWEROWE (results only work environment) is a fantastic framework that needs to be adopted in places employing knowledge workers.\nIn the case of working from home/remote work, some employees do not do their best work from home, or simply don’t like it.\nIt’s the same reason that communism does not work nearly as well as capitalism — things work best when you give people freedom as individual actors.","info":{"author":"Yan Lhert","top_img":"https://cdn-images-1.medium.com/max/1200/1*n-RV1WLO6v0NdyvZ0LBvnA.jpeg"}}},{"node":{"id":"5b93836d87be056953db7e5a","title":"iOS remote push notifications in a nutshell – Flawless App Stories – Medium","source":"medium_search_remote","summary":"Follow these steps again Certificates, IDs & Profiles -> Identifiers -> App IDs and you should see that Push Notifications are now enabled for Development:Developer Push Notifications enabledStep 4, some code finally: Lengthy configuration, I know, but as mentioned earlier, security is security.\nIn that way, we make sure the user is asked to register for push notifications at the start of the application.\nHowever, there is a pitfall to bear in mind in general — a user can always disallow push notifications authorization in the phone’s settings.\nIn Xcode, go to File->New->Target… like this:File->New->Target… selectionThen in the next menu, under iOS, Filter “service” and choose Notification Service Extension like so:Filtering Notification Service ExtensionClick the Next Button and give it a name of your choosing.\nAnd that is how the Notification Service would know what notification actions to show!","info":{"author":"Deyan Aleksandrov","top_img":"https://cdn-images-1.medium.com/max/1200/1*N5S-XOXZwTQlVdO1ozeLkw.png"}}},{"node":{"id":"5b93836487be056953db7e58","title":"Top 20 Remote Working Apps – The Mission – Medium","source":"medium_search_remote","summary":"Top 20 Remote Working AppsEssential Apps for Home, Co-working spaces and Coffee shopsIn a video last month I wanted to document some of the applications I’m currently using as resources for daily remote work.\nWorking remotely is becoming increasingly popular as technology continues to improve.\nWith research from Stanford suggesting that telecommuting from home has improved performance by 13%, per employee.\nAll of these applications have been handpicked for their flexibility and features to enable you as a remote worker.\n► Top 20 Remote Working Apps • Full Video Here ◄All of the photos from this piece are taking from my remote working adventures.","info":{"author":"Francesco D'Alessio","top_img":"https://cdn-images-1.medium.com/max/1200/1*BHtafTPrsTPNudCsKV8-FA.png"}}},{"node":{"id":"5b93835f87be056953db7e57","title":"How to Make Money Online: 38 Remote Jobs in 2018 – The Mission – Medium","source":"medium_search_remote","summary":"How to Make Money Online: 38 Remote Jobs in 2018 Every year it’s becoming easier to work from your laptopIf you haven’t thought about how to make money online you’re either…A) 90 years old and your grandchild just got you your first computer,orB) uhhh honestly, I don’t know what the hell you’re doing.\nOf course the blogger has been on the list for how to make money online since the beginning of RSS feeds.\nOnline TutorTeaching online classes is always a sure shot way to make money online.\nSell Online CoursesOne way I’ve personally made money online is through selling my online course — The Complete Travel Developer Course.\nNow this can be harder than you may think, but with services like Teachable and ConvertKit it’s never been easier to make money online with online courses.","info":{"author":"Phil Manning","top_img":"https://cdn-images-1.medium.com/max/1200/1*MajAzYSF1wd0J_3RYUq2kQ.jpeg"}}},{"node":{"id":"5b93835d87be056953db7e56","title":"How to Run a Remote Design Sprint Without Going Crazy","source":"medium_search_remote","summary":"How to Run a Remote Design Sprint Without Going CrazyA few tricks for distributed teamsOne of the most common questions about the GV sprint process is “How do you run a remote sprint?\nWhat if the team can’t be together in one place?”I’ve heard stories of people running successful remote sprints, but to be honest, I never totally believed it.\nI still don’t have a perfect answer for how to make remote sprints work.\nRunning a remote sprint is pretty exhaustingRemote sprints are harder than in-person sprints.\nIf there was ever a time to break a sprint over a couple of weeks (maybe “Monday” happens on week 1, and the rest of the sprint happens on week 2) it’s with a remote sprint.","info":{"author":"Jake Knapp","top_img":"https://cdn-images-1.medium.com/max/1200/1*QMqfG7etf8MSL-sAWdMr_g.png"}}},{"node":{"id":"5b93835b87be056953db7e55","title":"6 things to ask when interview for a remote job – freeCodeCamp.org","source":"medium_search_remote","summary":"Let’s take a look at some guidelines and questions that you can ask a potential remote employer.\nFully Remote PositionsMost companies that I have worked for supported remote work in some fashion or another, some better than others, however there’s clearly a learning curve for employers as well as remote employees.\nTypically jobs listed as remote are fully remote.\nCommunication is done through things like Slack/Hipchat, video chat like Skype or Google Hangouts, project management tools and let’s not forget email and phone calls.\nYou should try to get interviews with multiple companies that support remote workers and see how they answer your questions differently.","info":{"author":"Thomas Schultz","top_img":"https://cdn-images-1.medium.com/max/1200/1*S8xlaxth2uIZecHTVMNpHw.jpeg"}}}]}},"pageContext":{}}