{"data":{"mongodbDatabaseArticles":{"id":"5b9248d287be056953db7bfb","content":"<div><p>On my third day, I decided to finally visit the co-working space I had heard so much about: PunSpace. It was located near the Nimman area, near Chiang Mai University. When I arrived, I was quickly shown around by its founders Em and Pique, they were super sweet and cool. I worked all day and in the first day met more people. I had never seen such a high work ethic at any co-working space before than at Punspace. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2870-1024x764.jpg\" width=\"100%\"><br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2874-1024x764.jpg\" width=\"100%\"> <p>Everybody just shuts up and wants to get work done. That's great. People do greet each other, and people ask you if you want to join when they're going for lunch, but the focus is on getting things done. I love that. That's why I'm here too.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/06/IMG_3189.jpg\" width=\"100%\"> <p>After going for drinks with many of the people I met at Punspace, I found out a bit about the bars, clubs and parties here. Chiang Mai wasn't that boring after all. It was fun. Even though your options of where you can go are more limited than in Bangkok since there's less clubs and bars, you can still have a solidly good night out here. And there was another benefit. In Bangkok you'll get sick of seeing so many foreign tourists everywhere, in Chiang Mai many of the foreigners you meet actually work here. And that makes the conversations a lot more interesting.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/06/IMG_3190.jpg\" width=\"100%\"> <p>I had never before felt I was around people that did the same thing as me. And the first few days, it felt quite magical. In Amsterdam, I knew nobody that had an online business. Like literally zero. Most people that I knew 'talked' about doing it, but nobody really did anything. Here I was surrounded by people that had running websites, blogs, startups and apps that actually generated income. I must admit I was a bit shocked by the focus on 'money' here, it's all about making more and more money, while I'm more focused on just surviving and creating something I am passionate about, but it's because everyone's pushing each other to be more successful and the metric for success is usually the inflow of money: revenue. You can't blame them really.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/06/IMG_3191.jpg\" width=\"100%\"> <p>PunSpace was good in more than just one way, they were also open 24/7. If you are a member, you get 24/7 access with your fingerprint and can work whenever you want. That's awesome and for me their biggest selling point.</p> <p>Now that I could get my work done at PunSpace, <a href=\"/chiang-mai-apartment/\">I had to find an apartment in Chiang Mai &#187;</a>.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Co-Working Spaces in Chiang Mai: PunSpace"}},"pageContext":{"id":"5b9248d287be056953db7bfb"}}