{"data":{"mongodbDatabaseArticles":{"id":"5b96294e87be058327491180","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What I was up to other than here:</h2><ul><li>Hippie in Heels got added to this list of <a href=\"http://www.holidify.com/blog/top-travel-bloggers-india/\" target=\"_blank\">travel bloggers in India</a> &amp; this insane list of 2300 travel blogs, divided into categories- for solo female travel blogs, Hippie in Heels is #8 of 309 blogs based on traffic! Big happy news for the blog!</li><li>I pretty much wait to do my online shopping while I&#8217;m home since shipping to India is expensive, and&#160;found this cute&#160;<a href=\"http://www.wallpapered.com/wallpaper/world-maps\" target=\"_blank\">world map wallpaper</a>. I swear one day when I have a house, it&#8217;s going to look like a globe lol or a museum.</li></ul><p><img class=\"aligncenter size-full wp-image-10782\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/07/wallpapered.jpg?resize=546%2C434&amp;ssl=1\" alt=\"wallpapered\" width=\"546\" height=\"434\">I love maps and think they make great souvenirs. This company can make personal orders for you of any size color or location, so of course I want an India one! I love decorations, like&#160;<a href=\"http://www.wallpapered.com/\" target=\"_blank\">wallpapered</a>,&#160;that can give you that travel-y feeling while you&#8217;re at home.</p><h1>Now your story,</h1><p>If you&#8217;ve been to India or read my blog often, you&#8217;ll know that of all the habits the Brits gave to India, standing patiently in the queue isn&#8217;t one of them.</p><p>Whether it&#8217;s someone pushing your shopping cart out of the way and cutting in the supermarket, or someone at a veg market not giving you a chance to order while literally pushing you out of the way&#8230; it&#8217;s something that you&#8217;ll encounter almost every single day in India.</p><p>Well, I have had enough! When it&#8217;s a free for all that&#8217;s one thing and even I will push to the front. If you don&#8217;t you&#8217;ll never get anything done. But, when it&#8217;s a single file line and someone wants to cut, I draw the line&#8230; and lose my temper.</p><p>On a flight in India is when you&#8217;ll see things that shock you&#8230; I promise you that. Just last week our friend had someone light a cigarette on his flight before take off. How did he even get the lighter in!? Anyways, the story&#8230;</p><p>The flight landed and I got up, grabbed my bag and stood my ground so to speak. I was in the aisle seat and near the front. When I&#8217;m in the middle, back, or not an aisle seat I just wait. Outside India, I stay seated until it&#8217;s my aisles turn, but if you do that flying in India no one will give you a turn. The aisle filled up quickly.</p><p>There were people in front of my all the way to the plane door which was still closed. The guy behind me taps my shoulder while holding his bag above my head and says,</p><blockquote><p>&#8220;s<i>cuse me&#8230;.&#8221;&#160;</i>while he tries to physically push past me, trying to push me back into the seat I was next to.</p></blockquote><p>Where did he think he was going to go? Does he not understand we all need off the plane? Does he not realize there is a bus shuttle we all have to wait on for more people to get off the plane?</p><p>I gave him a little piece of my mind. I know, I know I&#8217;m supposed to love everything about India and only say nice things&#8230; but I do lost my temper.</p><p>There was a little friendly cursing, there was some borderline name-calling.. but mostly it was explaining something called common sense to him.</p><p>I&#8217;m not proud of my meanness, but I do lose my temper here sometimes.. I can&#8217;t be a perfect lady all the time, ha ha. I was already in a bad mood or maybe I would have just ignored him and continued standing my ground.</p><p>If you&#8217;ve flown in India, I have to imagine you&#8217;ve seen this&#8230; I see it about half of the flights that I take so it can&#8217;t be coincidence. It&#8217;s something expats sit around and have a real bitch-sesh about. Alright now I&#8217;ll take a deep breath and go back to forgetting about it :)</p><h1>This is India!</h1><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on&#160;<a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>,&#160;<a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>,&#160;<a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a>&#160;&amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p>P.S. this post was sponosred by Wallpapered, but all opinions are my own. Also, feature image source: <a href=\"https://www.flickr.com/photos/clodreno/46378381\" target=\"_blank\">pushkar</a></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! 57"}},"pageContext":{"id":"5b96294e87be058327491180"}}