{"data":{"mongodbDatabaseArticles":{"id":"5b95f51887be058327490140","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Don&#8217;t Become a Teacher in Thailand If&#8230;</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/dont-become-a-teacher-in-thailand-if/\"><img class=\"aligncenter wp-image-13849 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/10/Dont-Become-a-Teacher-in-Thailand-Header2-1000px1.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"6 Reasons why you may not want to become a teacher in Thailand | TielandtoThailand.com\" width=\"1000\" height=\"550\"></a><br>\nTeaching English is the go-to job for foreigners&#160;who wish to earn money while living in Thailand. But it&#8217;s not that easy.&#160;I think that many prospective teachers, myself included, simply don&#8217;t know what they&#8217;re getting after accepting a position at a Thai school.&#160;Before you think it&#8217;ll be a breeze to become a teacher in Thailand, there are a few things worth considering.&#160;They are especially true if you&#8217;ve never taught before.</p>\n<p>I&#160;get it &#8211; teaching abroad sounds like a dream. For some people, the only thing separating them&#160;from becoming a teacher in Thailand is a one-way ticket abroad. They&#8217;ve already doubled checked Thailand&#8217;s basic&#160;teaching requirements and they&#8217;ve&#160;already earned a&#160;<a title=\"SEE TEFL\" href=\"http://seetefl.com/?ap_id=tielandtothailand\" target=\"_blank\" rel=\"nofollow\">TEFL certification</a>&#160;(recommended for first-timers).</p>\n<p>As many&#160;times as I&#8217;ve heard that teaching is among&#160;the hardest, least appreciated, and most underpaid jobs out there, these truths still apply in Thailand. Yes, it&#160;will continue to be&#160;a physically and an emotionally demanding job. After all,&#160;<strong>teaching&#160;doesn&#8217;t become easier just&#160;by crossing a few countries&#8217; borders.</strong></p>\n<p>And so, I wanted to put a few things into perspective.&#160;For those who are considering taking&#160;their teaching career abroad or for those who simply want a reason to stay in Thailand and think teaching is&#160;easy money, you may be in for a rude awakening.</p>\n<p><strong>Simply put, you may&#160;not want to become a teacher in Thailand if&#8230;</strong></p>\n<h2><p id=\"You_Can8217t_Tolerate_Deliberate_Ignorance_or_Failure\"><p>You Can&#8217;t Tolerate Deliberate Ignorance or Failure</p></p></h2>\n<p>Aside from a few exceptions,&#160;the Thai education system has a no fail policy. So whether or not a student participates in class, puts effort into a task, or understands the material, they pass.</p>\n<p>Many foreign teachers accept this system for what it is and grade on a curve without question. I envied those teachers who can teach with enthusiasm even though they have students in their class who couldn&#8217;t&#160;be bothered to learn.</p>\n<p>For me, this was a source of a lot of heartache.&#160;I had a hard time accepting&#160;that it was ok for students to not participate, put forth effort, or understand the material in class but were still&#160;rewarded with passing grades<strong>.</strong> I couldn&#8217;t wrap my brain&#160;around the concept of giving a passing grade that had not been earned.&#160;In fact, just writing this nearly makes my head explode.</p>\n<p>If grades don&#8217;t matter, then why make teachers (like myself) give and record grades at all? I wish I could take those precious hours wasted on grading and put them towards something that matter to me &#8211; whether researching better teaching techniques, finding better classroom material, or hell, napping.</p>\n<p>To make a long story short, it was a personal struggle whenever I had a&#160;student turn in a project or worksheet on which they merely doodled, knowing that the lowest grade they could get was a 60%.</p>\n<p>And it gets worse: I&#160;couldn&#8217;t sit down and have a heart-to-heart conversation with these students, hoping to motivate&#160;or inspire them, because they wouldn&#8217;t have understood me! Those who handed in blank worksheets were the same students who had been allowed to pass, year after year, even though they couldn&#8217;t understand English.</p>\n<p>I have since read dozens of articles about Thailand&#8217;s education culture (i.e., losing face over poor grades, cheating is&#160;considered helping a struggling friend) as well as Western topics on education and how a child shouldn&#8217;t be judged by their grades.&#160;Still, I shake my head.</p>\n<h2><p id=\"You_Think_You_Don8217t_Need_to_Speak_Thai\"><p>You Think You Don&#8217;t Need to Speak Thai</p></p></h2>\n<p>A common question, and one that I was personally curious about before becoming&#160;a teacher, is:</p>\n<p><strong>Can you teach English without speaking Thai? Well, yes. </strong>(At least that&#8217;s what I kept reading on various blogs and forums.)</p>\n<p><strong>Will your students really understand you? Probably not.</strong></p>\n<p>Ok,&#160;to be fair, this depends a lot on whether you are teaching introductory or advanced level English. <strong>Knowing how to speak and write Thai is invaluable if you are teaching beginners.</strong></p>\n<p>I taught students from five years old to eleven years old (phratom 1 through 6).&#160;I could not communicate at all with my first and second year students because they were beginners. Lord help me if a student misplaced their pencil, felt sick, or worse &#8211; did not understand the directions for a worksheet or game. I relied so heavily on my Thai assistant teacher to translate directions and to keep my youngest students focused on their task that <strong>on my best days I felt challenged&#160;and on my worst days I felt worthless.</strong></p>\n<p>As for my students in fifth and sixth grades, their English speaking and writing abilities varied so greatly that my top students translated for the ones who didn&#8217;t understand. At least I was able to connect with the students who spoke English and I was grateful for that, as much as they were grateful for me attempting to communicate in Thai.</p>\n<p>I did notice that <strong>speaking basic Thai to&#160;my students got their attention and they respected me a helluva lot more</strong>&#160;when I finally learned how to say &#8220;Listen to the teacher,&#8221;&#160;&#8220;Sit down,&#8221; &#8220;Line up,&#8221; and &#8220;Talk quietly&#8221; in Thai.</p>\n<p>I also noticed a drastic improvement in the class&#8217;s performance and understanding when I included the Thai vocabulary word alongside a new English word. This was actually done against&#160;the direct orders of my school&#8217;s principle, who had instructed all English teachers to never use Thai. I shrugged it off</p>\n<p>&#160;</p>\n<p>By far <strong>the most successful and well-liked English teachers at my school spoke&#160;Thai. </strong>They&#160;were able to casually communicate with the students, give directions and any followup clarifications,&#160;and even understood a student when he or she had a problem. The students loved them.</p>\n\n\n\n<strong><p>TIP:</p></strong> Keep an ear out for the commands that your fellow Thai teachers use. &#160;Listen to what and how they say it&#160;rather than&#160;using the literal translation from, say, Google.\n\n\n\n<h2><p id=\"You_Need_to_Be_8220In_the_Know8221\"><p>You Need to Be &#8220;In the Know&#8221;</p></p></h2>\n<p>I&#8217;m not sure why this happened, but <strong>the foreign English teachers at my school never knew the schedule of school events</strong>. This included events&#160;that we were required to attend, to actually participate in, or even&#160;to organize and lead. Rarely were we given more than 24 hours notice to prepare.</p>\n<p>And this wasn&#8217;t just at my school. There was a&#160;general consensus among friends of mine who taught elsewhere who&#160;had the same experience.</p>\n<p>One time I was told to participate in ta teacher soccer competition for&#160;<a href=\"https://www.tielandtothailand.com/thai-school-sports-day/\">Sports Day</a>&#160;and at the last second was told to wear a green shirt because it was my&#160;team color. I had to spend my time and money buying a solid Crayola&#160;green shirt because it was very important&#160;that I play soccer while wearing my team colors.</p>\n<p>Other times the English teachers found&#160;out the hard way that the supply shop was closed &#160;for the day. Or that we needed to have submitted our worksheets to the copy room&#160;yesterday&#160;because the photocopy machine was now being repaired. That&#8217;s because none of the Thai staff told&#160;us!</p>\n<p>A language barrier? Culture difference in priorities? Simple forgetfulness? To this day I haven&#8217;t found out why there was little to no planning in advance.</p>\n<h2><p id=\"You_Don8217t_Like_Children\"><p>You Don&#8217;t Like Children</p></p></h2>\n<p>I hate to state the obvious but <strong>if you don&#8217;t like children you won&#8217;t like being a teacher.</strong></p>\n<p>I will be the first to say Thai children are ah-DOR-ruh-bul. And they love having fun and are playful as much as any other child.</p>\n<p>But they are still children.</p>\n<p>Even the super cute Thai students&#160;cry and yell and ask many many questions (to which you give answers many many times), and they have a hard time understanding simple directions or using their gross motor skills. Heck, sometimes they just can&#8217;t be convinced to listen and learn and do the task they are supposed to be doing.</p>\n<p>With the older students, it&#8217;s all of this plus attitude.</p>\n<p>And then everything is exasperated because of the language barrier!</p>\n<p>Perhaps you don&#8217;t yet know if you like or dislike children. If that is the case, teaching will certainly&#160;help you figure that out.</p>\n<h2><p id=\"You_Don8217t_Want_to_Bring_Work_Home\"><p>You Don&#8217;t Want to Bring Work Home</p></p></h2>\n<p>Unless you are conveniently provided with lesson plans, student workbooks, tests, and classroom materials by your school or hiring agency, you will have a lot of after-hours work.</p>\n<p>You know that dreamy image of yourself kicking back and relaxing on a tropical beach after an easy day&#8217;s work teaching English?&#160;Nope. Scratch it. It&#160;won&#8217;t happen nearly as often as you&#8217;d like, if at all.</p>\n<p>There&#8217;s a good chance that&#160;<strong>grading and creating lesson plans will roll over in your personal time</strong>&#160;no matter how hard you try to take care of everything&#160;during your planning periods at school. And don&#8217;t forget about designing worksheets or shopping for materials if those aren&#8217;t readily provided to you.</p>\n<p>If you are lucky and find a good online teaching resource, you won&#8217;t be creating your worksheets from scratch like I did. Unfortunately, <strong>it&#160;still takes time to find the right teaching material online and often the good stuff doesn&#8217;t come free.</strong></p>\n<p>I say this about Thailand but I think it&#8217;s safe to say that teachers everywhere spend their own time and money to take care of school-related tasks.</p>\n<h2><p id=\"You_Don8217t_Have_the_Energy\"><p>You Don&#8217;t Have the Energy</p></p></h2>\n<p>Teachers walk a lot, and I say that as an eight year veteran of the restaurant industry. <strong>A typical teaching day had me standing between five or six hours</strong> every day out of my eight hour shift. This was split between writing on the board for the first part of the class and then walking around answering questions and assisting students&#160;for most of the remaining time.</p>\n<p>How some teachers manage to&#160;sit down most of the day blows my mind.</p>\n<p>Something I hadn&#8217;t realized before I became a teacher in Thailand is that <strong>speaking for 5+&#160;hours a day is exhausting</strong>. My ears and voice box were worn out at the end of most days so I talked much less in my off time.</p>\n<p>You know the phrase &#8220;Breakfast is the most important meal of the day&#8221;? Before my teaching days, I&#8217;d drink a cup of coffee for breakfast and then eat&#160;my first meal a few hours later. But when I was a teacher, I found myself completely wiped out&#160;if I didn&#8217;t properly fuel my&#160;body in the morning. Word to the wise: do not skip breakfast!</p>\n<p>Now, combine all of these and throw the following wrench into the mix: <strong>try teaching in a tropical country with no air conditioning.</strong>&#160;Air conditioning isn&#8217;t a standard amenity in schools, so some teachers settle for cross-breezes and fans. I think my classroom hovered around 27 C (80 F) and I was always feeling sluggish.</p>\n<h2><p id=\"Should_you_become_a_teacher_in_Thailand\"><p>Should you become a teacher in Thailand?</p></p></h2>\n<p>Teaching isn&#8217;t an easy job, but every job has its ups and downs, right? Hopefully this gives a more realistic perspective into the world of teaching in Thailand rather than the&#160;more&#160;romanticized versions&#160;out there.</p>\n<p>I encourage people to teach in Thailand for the sake of making a&#160;difference in a child&#8217;s life or to be part of a community that shapes young minds. I don&#8217;t encourage it so much if it&#8217;s because you want some quick cash or are looking for a way out of a current career or lifestyle. Weigh your options, and if you choose to become a teacher in Thailand, I wish you luck on your adventure.</p>\n<p>&#8595;&#160;PIN THIS POST FOR LATER&#160;&#160;&#8595;</p>\n<p><img class=\"aligncenter wp-image-13084 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/10/Dont-Become-a-Teacher-in-Thailand-Pinterest.jpg?resize=416%2C622&amp;ssl=1\" alt=\"Six reasons why you may not want to become a teacher in Thailand | TielandtoThailand.com\" width=\"416\" height=\"622\"></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Don’t Become a Teacher in Thailand If…"}},"pageContext":{"id":"5b95f51887be058327490140"}}