{"data":{"mongodbDatabaseArticles":{"id":"5b9248bd87be056953db7be3","content":"<div><p>Last Sunday, my post <a href=\"/bootstrapping-startup-thailand/\">\"What I learnt from bootstrapping my startup in Thailand for 6 months\"</a> hit #1 on <a href=\"http://news.ycombinator.com/\">Hacker News</a> and then stayed there for most of the day. Here's some of the craziness that ensued.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"HNnumberone\"></p><img src=\"/wp-content/uploads/2013/10/HNnumberone-1024x290.png\" alt=\"HNnumberone\"> <h2>From submitting to #1</h2> <p>If you submit to HN, usually it hits the front-page for a few minutes (if you're lucky) and then ever so quickly disappears in to the abyss that is HN's second page to then never be seen again...This post however immediately stuck at the #3 position and after an hour shot up to #1 to stay there like superglue for the rest of the day.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/10/Screen-Shot-2013-10-19-at-20.56.11-1024x209.png\" width=\"100%\"> <p>I was so surprised. Although it was 3 at night, I had to stay awake to experience this. Being a reader of HN for 3 years now, it's my primary source of information and I would have never imagined I of all people would someday be #1 on the frontpage. I wasn't as hip as all those developers that post about their new Scala/Haskell/Ember/Node.js framework. Far from it.</p> <h2>Metrics (first 24 hours)</h2> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/263visitors-1024x270.png\" width=\"100%\"> <ul> <li><strong>Submission time:</strong> Sunday 10 October 2013 at 2:40 AM (ICT), 12:40 PM (PDT afternoon), 19:40 PM (LDN), 18:40 PM (UTC).</li> <li>24 hours on HN's frontpage</li> <li>150+ points on HN</li> <li>170+ comments on HN</li> <li>15,000+ unique visitors</li> <li>25,000+ page views</li> <li>Avg. visit duration: 2 minutes</li> <li>250+ simultaneous readers at its first peak @ (3 PM SFO, 11 PM LDN, T+3h) </li><li>200+ links to my post from other websites</li> <li>450+ Facebook shares</li> <li>200 new Twitter followers</li> <li>300+ tweets</li> <ul> <li>The first tweets were by cool start-up people (like Zapier's co-founder)<br> <blockquote class=\"twitter-tweet\"> <p>Fascinating article on bootstrapping a startup from Thailand <a href=\"http://t.co/gzQSNrKW0f\">http://t.co/gzQSNrKW0f</a></p> <p>&#8212; Wade Foster (@wadefoster) <a href=\"//twitter.com/wadefoster/statuses/389433395199356929\">October 13, 2013</a></p></blockquote> <p></p></li> <li>Then celebrities covered me (this one from The Apprentice UK)<br> <blockquote class=\"twitter-tweet\"> <p>If I wasn't running <a href=\"//twitter.com/WhiskTeam\">@whiskteam</a>, I'd do this: \"What I learnt from bootstrapping my <a href=\"//twitter.com/search?q=%23startup&amp;src=hash\">#startup</a> frm Thailand in 6m\" <a href=\"http://t.co/HsnuGyFXWB\">http://t.co/HsnuGyFXWB</a></p> <p>&#8212; Nick Holzherr (@nickholzherr) <a href=\"//twitter.com/nickholzherr/statuses/389393117302231040\">October 13, 2013</a></p></blockquote> <p></p></li> <li>And then I hit China<br> <blockquote class=\"twitter-tweet\"> <p>&#20026;&#20160;&#20040;&#24212;&#35813;&#21435;&#27888;&#22269;&#29983;&#27963;&#65311;&#9312;&#29983;&#27963;&#25104;&#26412;&#20302;&#24265;&#65292;1000&#32654;&#20803;/&#26376;&#21487;&#20197;&#20303;&#24102;&#28216;&#27891;&#27744;&#30340;&#26053;&#39302;&#65292;&#20197;&#21450;&#22825;&#22825;&#19979;&#39302;&#23376;&#65307;&#9313;&#24037;&#20316;&#29615;&#22659;&#21644;&#19978;&#32593;&#26465;&#20214;&#20339;&#65292;2GB&#25968;&#25454;&#27969;&#37327;20&#32654;&#20803;/&#26376;&#65307;&#9314;&#31038;&#20250;&#24179;&#38745;&#65292;&#20154;&#27665;&#21451;&#22909;&#65292;&#29983;&#27963;&#24736;&#38386;&#65292;&#27809;&#26377;&#21387;&#21147;&#65307;&#9315;&#22909;&#21507;&#30340;&#39135;&#29289;&#65292;&#20016;&#23500;&#30340;&#20241;&#38386;&#27963;&#21160;&#65292;&#28418;&#20142;&#30340;&#28023;&#28393;&#12290;<a href=\"http://t.co/9lKOnSXY4w\">http://t.co/9lKOnSXY4w</a></p> <p>&#8212; yifeng.ruan (&#38446;&#19968;&#23792;) (@ruanyf) <a href=\"//twitter.com/ruanyf/statuses/389255375058264064\">October 13, 2013</a></p></blockquote> <p></p></li> </ul> </ul> <h2>Emails</h2> <ul> <li>30+ e-mails of congratulations, compliments and practical questions how to move to Asia and do the same </li><li>1 email with someone telling me they booked a flight to Chiang Mai straight after reading my blog, talk about dedication (!)</li> <li>1 e-mail from a famous start-up</li> <li>1 job offer from a famous start-up</li> <li>3 (disguised) sales pitches from start-ups (2 being completely irrelevant to me)</li> </ul> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/10/sale-1024x232.png\" width=\"100%\"> <h2>7-day traffic tail</h2> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/Screen-Shot-2013-10-19-at-21.22.21-1024x203.png\"><br> Traffic remained steady at 250 daily uniques after a week and had an extra burst 6 days after. <h2>Demographics</h2> <p>Traffic remained steady at 250 daily uniques after a week and had an extra burst 6 days after.</p><p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/Screen-Shot-2013-10-19-at-16.27.25-1024x428.png\"><br> I was surprised to see China being up there so high, but it seems HN reaches so far now too. <h2>Why did it hit #1?</h2> <p>I was surprised to see China being up there so high, but it seems HN reaches so far now too.</p><p>It can be luck, or it can be that <a href=\"/remote-working-fashionable/\">remote working is becoming fashionable</a> these days. Where before it was limited to <a href=\"http://tropicalmba.com/\">Tropical MBA</a>-type internet marketers, it's now considered by startups and developers due to the high cost of living in most major metropolitan areas around the world. And maybe my post showed it was easier than people think.</p> <h2>Pageviews are not all made the same</h2> <p>For me, 25,000 pageviews in a day seemed not that much. My <a href=\"http://www.youtube.com/watch?v=1NUV2BVyWA0\">YouTube channels for electronic music</a> get about 50,000 to sometimes 200,000 views per day. But I never get this amount of personal feedback on <a href=\"http://www.youtube.com/watch?v=JlAbOwBQmcY\">my YouTube videos</a> as with <a href=\"/bootstrapping-startup-thailand/\">this blog post</a>. I never got 30 personal e-mails with people's life stories in them and 170+ well-written comments (on HN). </p> <p>Page views are not all made the same. The HN audience is full of very smart and highly influential people which means that if there's 15,000 of them on your site, that's a lot more valuable than getting a lot of views on YouTube for a music video.</p> <h2>HN's influence is far-reaching</h2> <p>If the HN audience likes something, they'll spread it to their peers and followers outside HN circles. That's what happened as in the following days I was covered by many major blogs. Many of the people I met in the last 6 months of working in Thailand (both Thai and foreigners) sent me an email after reading my post. None of those ever read HN. That shows how far HN's reach goes.</p> <h2>Top comment snark</h2> <p>I was very scared that the entire thread would turn into hate-fueled lynch mob directed at me. For no real reason other than that I've seen it happen on HN, YouTube and the internet many times before. Fortunately for me, most comments were very supportive of my story.</p> <p>...except for the top comment. Almost a Hacker News tradition nowadays, the <a href=\"//news.ycombinator.com/item?id=6540030\">top comment was quite snarky</a>. PG <a href=\"//news.ycombinator.com/item?id=4397542\">expressed his worries</a> about this before.<br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/Screen-Shot-2013-10-19-at-18.04.021-1024x248.png\" width=\"100%\"><br> I'm not against negative top comments per se but they should at least be factual. Most commenters confirmed that the top comment here was far from factual and half of it could be contributed to not actually reading my post carefully (e.g. I explicitly mentioned Bangkok as a bad place to live since it'd be too expensive which the commenter seemed to have not read). The second highest comment was factual but was overtaken by the top comment at the end of the day.  <p>I'm not against negative top comments per se but they should at least be factual. Most commenters confirmed that the top comment here was far from factual and half of it could be contributed to not actually reading my post carefully (e.g. I explicitly mentioned Bangkok as a bad place to live since it'd be too expensive which the commenter seemed to have not read). The second highest comment was factual but was overtaken by the top comment at the end of the day.</p><p>That seems slightly worrying to me as it means on HN a non-factual snarky comment now has a higher potential to be upvoted than a factual one.</p> <h2>Start-up sign-ups</h2> <p>The post was about how I bootstrapped <a href=\"http://tubelytics.com/\">my new start-up Tubelytics</a>, it provides publishers with tools to track hundreds of YouTube channels' metrics like view counts. Linking to it from the post showed useful:</p> <ul> <li>1,134 unique visitors for Tubelytics (8% of readers clicked through)</li> <li>78 trial sign-ups for Tubelytics (0.5% of readers signed up or 7% of Tubelytics visitors)</li> <li>1 paid sign-up for Tubelytics (0.007% of readers took a paid sign-up or 0.08% of Tubelytics visitors)</li> </ul> <p>...but not as much as I had hoped. These numbers tell me I'll have to completely change the landing page as it's not converting well. Although maybe HN is just not my target audience per se?</p> <h2>My server survived</h2> <p><a href=\"http://dreamhost.com/\">Dreamhost</a> gets a lot of flak on HN and they're probably not suitable for a start-up, but I think they are great for hosting blogs, as they were able to keep my blog live while it was flooded by HN-ers. Luckily, I had <a href=\"http://wordpress.org/plugins/wp-super-cache/\">WP Super Cache</a> enabled which helped defuse the load a bit.</p> <h2>What my mom thinks of HN</h2> <p>I write this blog primarily for my mom to tell her about my work, life and travels. After reading my post, she followed the link to Hacker News and then sent me this frighteningly on-point email:</p> <blockquote><p><i>Dear Pete.</i></p> <p>This hackerssite is quite interesting, but doesn't that take up a great amount of your time?</p> <p>Goodbye MOM</p></blockquote> <p>Mom, you have no idea.</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"What happens when you’re #1 on Hacker News for a day"}},"pageContext":{"id":"5b9248bd87be056953db7be3"}}