{"data":{"mongodbDatabaseArticles":{"id":"5b9629f687be0583274911c7","content":"<div><p>I&#8217;ve tried my fair share of gadgets and gizmos over my years of travel, and it seems like there are new things coming out every day. Here are some of the best travel gadgets I personally use and swear by and have for quite&#160;a while. Whether it&#8217;s to make my trips easier or safer, these have all come in hand plenty of times!</p><h1>Best Travel Gadgets</h1><h2>Luggage Weigher</h2><p>You guys &#8211; GET a luggage weigher! If you travel a lot, this is so necessary. I am always packing right up the maximum allowance so love to weigh it on the dot so that is one less stress to think about at the airport. I can go to the check-in counter sure that my luggage isn&#8217;t overweight.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p>Even with more and more of us using technology, it seems like finding an open and working outlet is still always a challenge. Portable chargers are the BEST if you&#8217;re stuck on a train for 10 hours and your phone&#8217;s battery (with all your maps and notes) is in its last 10%. I LOVE the&#160;<a class=\"easyazon-link\" title=\"\" href=\"https://www.amazon.com/Anker-PowerCore-Ultra-Compact-High-speed-Technology/dp/B0194WDVHI?tag=Hipinhee-20\" target=\"_blank\" rel=\"nofollow noopener\"><strong>Anker Portable Charger</strong></a>&#160;since it&#8217;s small and lightweight, but here are some similar options:</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p>This is perfect to charge my computer and phone at the same time. Because it has a&#160;surge protector, you don&#8217;t have to worry about blowing any fuses or any of your electronics going on the frizz.</p><p>I travel with a world adapter so I can put any plug I own in any socket in the world! Can&#8217;t beat it. This one is special because it has two USB ports AND works as a power bank. You can buy these cheap as chips in Walmart or anywhere else, but keep in mind the cheap ones break SO easily then you&#8217;re abroad without a plug which is pretty unfortunate.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p>When you travel with a phone, kindle, and camera it seems like there are never enough plugs.&#160;This has an extension cord, 2 USB plugs + regular plugs, and has a surge protector. They make these so tiny now that it really doesn&#8217;t take up much extra space and keeps you way more organized when you are working.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p class=\"arrow\"></p><strong><img class=\"easyazon-popover-image aligncenter\" src=\"https://i2.wp.com/images-na.ssl-images-amazon.com/images/I/51zlARdIohL._SL75_.jpg?resize=75%2C75&amp;ssl=1\" alt=\"Master Lock 8147D Light Weight Combination Bike Chain Lock, Red, 4-Foot\" width=\"75\" height=\"75\"></strong><p class=\"easyazon-popover-information\"></p><p><img src=\"http://ir-na.amazon-adsystem.com/e/ir?t=hipinhee-20&amp;l=as2&amp;o=1&amp;a=B000BD692Y\" alt=\"\" width=\"1\" height=\"1\" border=\"0\">The exact one linked above is lightweight and four feet long. I put this on the top of my Osprey 65L and the weight never bothered me. I did a lot of research on bike chains/locks for trains and this one came up over and over. I slept like a baby knowing this was keeping my bag safe on the base of the train. I simply locked it around my luggage and the train seat poles.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p>I use these on my closed backpack zippers while I sleep. These come in handy all the time and are lightweight. I actually have some that I&#8217;ve lost the key too, but keep them because it at least scares theives off and they look for a new bag to try and open. When you&#8217;re on trains and buses traveling in Asia and South America, you might consider using these so no one opens up your luggage while you sleep.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p>It was worth its weight in gold. In India, you&#8217;ll learn power outages are very common and overnight buses are pitch black. I used this constantly, even on pre-sunrise hikes. You definitely don&#8217;t look cool, I&#8217;ll admit that. But, it was SO worth it.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<p>It&#8217;s a genius little thing. It knows what time it is wherever you travel and changes automatically (I think it&#8217;s solar?). It&#160;has&#160;thermometer reading, is very tiny, and great when you want to save battery on your cell phone overnight. Perfect for making sure you don&#8217;t miss your train stop. In sleeper class, nobody is going to wake you up.</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<h2>Noise Canceling Headphones</h2><p>Once I got a pair of Bose, I really couldn&#8217;t go back to regular headphones. The sound is so much better plus it really does cancel out any other noise. The downsize is they take up more space than the little ear buds. I know that I will always keep traveling with my Bose, though!</p><p></p><img src=\"https://i2.wp.com/assets.rewardstyle.com/images/search/350.gif?w=1250&amp;ssl=1\"> Turn on your JavaScript to view content<h2>For More Best of Posts</h2><h2>Pin &#8220;Best Travel Gadgets&#8221; for later!</h2><p><img class=\"aligncenter wp-image-25227 size-large\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/08/best-travel-gadgets-pin.jpg?resize=585%2C1024&amp;ssl=1\" alt=\"\" width=\"585\" height=\"1024\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Best Travel Gadgets: These Are the Ones I Swear By!"}},"pageContext":{"id":"5b9629f687be0583274911c7"}}