{"data":{"mongodbDatabaseArticles":{"id":"5b95ea2e87be05832748ff89","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/2018/azer2.jpg\" alt=\"a scenic view in Azerbaijan\"><br> POSTED: 08/06/18 | August 6th, 2018</p><p>I don&#8217;t remember the first time I heard about Azerbaijan, but it&#8217;s always held an exotic allure to me. Azerbaijan &#8212; even the name sounds exotic &#8212; a place of&#8230;well, I didn&#8217;t know what. It just sounded intriguing and off the beaten path. I knew two things about Azerbaijan before I visited: it won the Eurovision Song Contest in 2011 and has a lot of oil money.</p><p>It was only in the last few years that I began to think in earnest about visiting.</p><p>But years passed without any progress toward that goal &#8212; until this June when, on a whim, I went there with a friend. We had found a <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-find-a-cheap-flight/\" rel=\"noopener\" target=\"_blank\">cheap flight</a> from <a href=\"https://www.nomadicmatt.com/travel-guides/england-travel-tips/london/\" rel=\"noopener\" target=\"_blank\">London</a>, so off we went! Sometimes that&#8217;s all it takes to end up somewhere.</p><p>Azerbaijan matched my expectations: Baku was a modern city steeped in oil money with a recently built subway, fast Wi-Fi, and tons of Parisian-style and futuristic buildings, while the rest of the country was incredibly rural with small towns surrounded by gorgeous mountains and farmland. In tiny villages, old men with canes sat in town squares gazing at passersby. Old babushkas with their backs bent and heads covered with scarves wandered past with groceries, off to make dishes for the family.</p><p>A visa to Azerbaijan costs $25. You have to get it beforehand, and you can apply online. It takes three days to process (if you pay an additional $30, you can get one in three hours). You can stay in the country for up to ten days before you need to register with the police and provide an address of where you are staying (you just need one address and you don&#8217;t need to stay there the entire visit). Most hotels and hostels will help you do this. After registering, you&#8217;ll get the full 30 days in the country your visa allows.</p><p>But honestly, you don&#8217;t really need 30 days to visit Azerbaijan. In fact, even two full weeks would be a bit of a stretch. Baku is cool and can make for a fun few days, but outside the city, there really isn&#8217;t much to do besides hike and wander around some cute villages. Granted, that is pretty awesome, but if you aren&#8217;t going on any major multi-day hikes, you&#8217;ll most likely get bored quickly.</p><h3>What to See and Do in Azerbijian: One-Week Itinerary</h3><p><strong>Day 1 &#8211; Baku</strong><br> <img src=\"https://media.nomadicmatt.com/2018/baku.jpg\" alt=\"locals out for a walk in Baku, Azerbaijan\"><br> Before the discovery of oil, Baku was a sleepy little town passed over by the world. After oil was discovered in 1846, the city grew: large boulevards and buildings were built to emulate Paris, as the nouveaux riches loved all things French. The city grew well into the early 20th century before subsequent world wars and Soviet rule pushed it off the world stage. Now, thanks in part to Eurovision and lots of oil money, Baku is a mix of its ancient core, the surrounding 19th-century Parisian-style neighborhoods, and the sprawling modern city with its futuristic buildings, expanding outward.</p><p>On your first day here, wander around the old city. Visit the Palace of the Shirvanshahs, which was built in the 15th century and includes a mosque, bathhouse, and mausoleum, as well the famous Maiden Tower with its great views of the city. (Fun fact: They still have no idea what this tower was built for.)</p><p>Afterward, <a href=\"https://bakufreetour.com/\" rel=\"noopener\" target=\"_blank\">go on a free walking tour with Baku Free Tour</a> and then take in the Azerbaijan Carpet Museum (the country is famous for carpetmaking) and the National Museum of History, which has a lot of artifacts and a few signs that will give you a decent understanding of the history of Azerbaijan.</p><p><strong>Where to stay in Baku:</strong> <a href=\"https://prf.hn/click/camref:1101lHtj/destination:https%3A%2F%2Fwww.hostelworld.com%2Fhosteldetails.php%2FSahil-Hostel-and-Hotel%2FBaku%2F279766\" rel=\"noopener\" target=\"_blank\">Sahil Hostel</a> &#8211; This hostel has comfortable beds, a nice common area, and incredible showers (they even have massage sprays). The staff is not that friendly, but its central location and facilities, as well the ease in which you can meet other travelers, make up for their sour demeanor.</p><p><strong>Day 2 &#8211; Baku</strong><br> <img src=\"https://media.nomadicmatt.com/2018/azerbaijan_museum.jpg\" alt=\"museum in Azerbaijan\"><br> On your second day, wander some more around the city, take another free walking tour, enjoy a cooking class, stroll along the lovely boardwalk along the Caspian Sea, and explore Upland Park, which offers great views of Baku as well, as it&#8217;s the highest point in town. There&#8217;s a funicular that goes all the way up if you want to avoid the stairs. Be warned: the funicular&#8217;s hours of operation change without notice. Here you&#8217;ll also find Martyrs&#8217; Lane, a cemetery and memorial dedicated to those killed in World War II and the Nagorno-Karabakh War.</p><p>Additionally, nearby are the famous and iconic Flame Towers. Built in 2012, they are 182 meters (600 feet) tall and covered in LED screens displaying images of dancing flames (hence their name). One of them is a hotel with a restaurant at the top; the food there is supposed to be very good and fairly priced. I highly recommend watching the sunset over the city near the Flame Towers, then seeing the tower&#8217;s LED lights come on.</p><p><strong>Day 3 &#8211; Outside Baku</strong><br> <img src=\"https://media.nomadicmatt.com/2018/outsidebaku.jpg\" alt=\"mud volcanoes in Azerbaijan\"><br> Head out of town for a day trip to the four biggest attractions near Baku. First up are the mud volcanoes. Azerbaijan is home to nearly a third of the world&#8217;s mud volcanoes, which form when pockets of underground gas force their way to the surface. They&#8217;re like geysers, but with mud.</p><p>Next are the petroglyphs in Gobustan, home to 6,000 rock paintings that are up to 40,000 years old. The well-preserved sketches display ancient populations traveling on reed boats, men hunting antelope and wild bulls, and women dancing.</p><p>Then visit Ateshgah, a temple that has been used as a Hindu, Sikh, and Zoroastrian place of worship (now it&#8217;s a center for Zoroastrians). Each room has really detailed panels about the history of the temple, the pilgrims who visited, and the Zoroastrian religion. In the center of the complex is a flame representing God.</p><p>Finally, there is Yanar Dag (&#8220;burning mountain&#8221;), which is a natural gas fire that blazes continuously on a hillside. Marco Polo once described the land in this area as being on fire because of phenomena like this, but this is the only fire left. It&#8217;s kind of a disappointment, as it&#8217;s really small. It&#8217;s not worth the journey, to be honest, but it&#8217;s included in most tours, so you&#8217;ll see it anyways.</p><p>None of the sites are too far from Baku, and can all be done in a day. Most leave around 10 am and get back around 5 pm. I suggest taking a tour instead of going on your own, as it makes getting to these sites easy. Only Ateshgah is reachable by public transportation. All the other sites will require a car. Lots of people on Couchsurfing offer to rides too. A full-day tour will cost about $40 USD and include lunch.</p><p><strong>Days 4 &amp; 5 &#8211; Lahij</strong><br> <img src=\"https://media.nomadicmatt.com/2018/lahij.jpg\" alt=\"street view of Lahij, Azerbaijan (Photo by Wikimedia Commons/Public Domain)\"><br> Take a three-hour bus to Lahij (pop. 900) in the Caucasus Mountains (lots of day tours come here because the town is famous for copper wares &#8212; you&#8217;ll hear the clang of metalwork throughout the day). On your way, you&#8217;ll wind through the mountains, over bridges, and along a road so narrow you&#8217;ll feel like you&#8217;re going to fall off before you reach the town. When I was there, the road was partially out because of heavy rain and I was not a fan driving the narrow, gravel road to town!</p><p>But it was worth it!</p><p>Lahij is beautiful, with cobblestone streets, panoramic views of the valley, and old locals sitting in the town square eyeing the tourists that wander past on their way to hike for the day. There&#8217;s not much to do in Lahij itself. OK, there&#8217;s a tiny museum that takes five minutes, and you can ride a horse or shop if you want, but the real reason to visit is to go hiking. There are a lot of trails in the mountains around town, and it&#8217;s best to ask your guesthouse or the tourist office for information, as there&#8217;s no trail map. There are some ruins on the trail leading up from the nearby river and waterfall but be warned: it&#8217;s a steep 6 km up and the ruins (really just a wall) are easily missed.</p><p><strong>Where to stay in Lahij:</strong><br> <a href=\"https://www.booking.com/hotel/az/lahij-guesthouse.en.html?aid=362916&amp;no_rooms=1&amp;group_adults=1\" rel=\"noopener\" target=\"_blank\">Lahij Guesthouse</a> &#8211; This virtual chateau has spectacular views of the mountains, a garden, and incredible wood interiors and patios. It&#8217;s a stunning place, and the owner Rustam is quite knowledgeable and can book anything you want. The breakfast will fill you for days, and you can get an optional dinner each night (you should &#8212; it&#8217;s delicious!).</p><p><strong>Days 5 (&amp; 6?) &#8211; Sheki</strong><br> <img src=\"https://media.nomadicmatt.com/2018/sheki.jpg\" alt=\"a mosque in Sheki, Azerbaijan/photo by Emerson Liu (flickr:@emerson.liuHK)\"><br> From there, head to Sheki via public bus, a famous stop on the Silk Road, and see the old caravanserai (inn with a courtyard), which housed traders and merchants back in the day. Built like a castle to protect merchants (high walls, one gate), it dates back to the early 18th century. Now, it&#8217;s a restaurant (skip it) and a hotel. Additionally, there&#8217;s a fortress and few churches in the old town fortress down the street from the caravanserai. All in all, you only really need a few hours to see everything in town.</p><p>Be sure to visit nearby Kis to see the Albanian church, which dates back to the fifth century and was restored with the help of Norwegians in the early 2000s.</p><p>Afterward, go to the Gelersen-G&#246;resen ruins, which are a lot more expansive than those in Lahij and provide some incredible views of the surrounding valley. I&#8217;d recommend taking a taxi there, as it&#8217;s an uncomfortable and not very scenic two-mile walk on open and exposed road. Your driver will wait (or might join you, like mine did).</p><p>Overall, you really only need a day for these sights. There&#8217;s not much to do, and the attractions aren&#8217;t that stellar. Sheki is a popular day trip from Baku and a weekend spot for locals, who head to the resorts located on the way to the ruins. The only reason I would stay longer is if you wanted to do some hiking and horseback riding in the area.</p><p><strong>Where to stay in Sheki:</strong> <a href=\"https://prf.hn/click/camref:1101lHtj/destination:https%3A%2F%2Fwww.hostelworld.com%2Fhosteldetails.php%2FHost-Ilgar%2FSheki%2F101559\" rel=\"noopener\" target=\"_blank\">Ilgar&#8217;s Hostel</a> &#8211; Ilgar is an incredible host. This homestay is really basic. No A/C, simple accommodations, very basic bathroom. It&#8217;s cheap but you&#8217;re staying in Ilgar&#8217;s home with his family and he&#8217;s an awesome host, who speaks fluent English and knows everyone in the area. There&#8217;s nothing he can&#8217;t help with!</p><p><strong>Day 7 &#8211; Back to Baku</strong><br> <img src=\"https://media.nomadicmatt.com/2018/azerbaijan_sunset.jpg\" alt=\"sunset in Azerbaijan\"><br> Spend the day heading back to Baku to enjoy a last night in the big city before you head home.</p><h3>What to See and Do in Azerbijian: A Two-Week Itinerary</h3><p>Want to spend some additional time in the country? Great! There are a bunch of other places worth visiting too. Here are more suggestions on what to see and do in Azerbijian if you&#8217;re staying longer:</p><p><strong>Days 1, 2, &amp; 3 &#8211; Baku</strong><br> <img src=\"https://media.nomadicmatt.com/2018/azer.jpg\" alt=\"pretty streets in Baku, Azerbaijan\"><br> Follow the Baku itinerary from above.</p><p><strong>Days 4 &amp; 5 &#8211; Quba</strong><br> <img src=\"https://media.nomadicmatt.com/2018/quba.jpg\" alt=\"Quba, Azerbaijan; Photo by Gulustan (Wikimedia Commons)\"><br> Head north by bus to the mountain town of Quba for a cooler climate, old mosques, and traditional carpets in beautiful alpine surroundings. There&#8217;s a lot of hiking here, too, and many people also visit Tenghi Canyon. You can also stop in Khinalig, a major Zoroastrian center, or Krasnaya Sloboda, the only all-Jewish town outside of Israel, populated by the Juhuro, or Mountain Jews.</p><p><strong>Where to stay in Quba:</strong> <a href=\"https://www.booking.com/hotel/az/hostel-bai-guba.en.html?aid=362916&amp;no_rooms=1&amp;group_adults=1\" rel=\"noopener\" target=\"_blank\">Hostel Bai Guba</a> &#8211; A very basic hostel next to some hiking trails, this place also offers airport transfers. <a href=\"https://www.booking.com/hotel/az/dehne-ailevi-istirahet-merkezi.en.html?aid=362916&amp;no_rooms=1&amp;group_adults=1\" rel=\"noopener\" target=\"_blank\">Dehne Ailevi Istirahet Merkezi</a> is a slightly more expensive option, but it&#8217;s an excellent place to stay. There is a restaurant onsite and a really nice garden and terrace.</p><p><strong>Days 5 &amp; 6 (&amp; 7?) &#8211; Lahij</strong><br> <img src=\"https://media.nomadicmatt.com/2018/azerbaijan_mountains.jpg\" alt=\"mountains in Azerbaijan\"><br> Follow my Lahij suggestions from above and spend another day or three hiking the mountains. There are some famous multi-day hikes in the area if you want to camp. A guide is highly recommended for longer hikes; your guesthouse or the tourist office can arrange one for you.</p><p><strong>Days 7 &amp; 8 &#8211; Sheki</strong><br> <img src=\"https://media.nomadicmatt.com/2018/azerbaijan_courtyard.jpg\" alt=\"a courtyard in Azerbaijan\"><br> Follow the itinerary listed in the above section and use your extra time for hiking or horseback riding!</p><p><strong>Day 9 &#8211; Qabala</strong><br> <img src=\"https://media.nomadicmatt.com/2018/azerbaijan_mountains3.jpg\" alt=\"mountains in Azerbaijan\"><br> Once strategically located along the middle of the Silk Road, this dusty, old, not-so-small town now houses several ancient monuments, including a thousand-year-old defense tower, a 13th-century mosque, and a mausoleum. Take an early bus from Sheki and spend the night here. All the attractions are close together, so you can easily see the town in a day. There&#8217;s really nothing else worth sticking around for.</p><p><strong>Where to stay in Qabala:</strong> <a href=\"https://prf.hn/click/camref:1101lHtj/destination:https%3A%2F%2Fwww.hostelworld.com%2Fhosteldetails.php%2FKahran-Hostel%2FGabala%2F290243\" rel=\"noopener\" target=\"_blank\">Kahran Hostel</a> &#8211; This is a newly opened hostel in a good neighborhood located next to some great caf&#233;s, bars, and restaurants. It&#8217;s a social environment and the staff is really helpful.</p><p><strong>Day 10 &#8211; Ganja</strong><br> <img src=\"https://media.nomadicmatt.com/2018/ganja.jpg\" alt=\"Ganja, Azerbaijan; Photo by Urek Meniashvili (Wikimedia Commons)\"><br> Azerbaijan&#8217;s second biggest city dates back to the sixth century. There&#8217;s an attractive square near another caravanserai (similar to the one in Sheki), some traditional churches, a very odd house made from bottles, and the Tomb of Nizami Ganjavi, the country&#8217;s most famous 12th-century poet (he&#8217;s kind of a national hero). It&#8217;s a good stopover on the way south.</p><p><strong>Where to stay in Ganja:</strong> <a href=\"https://prf.hn/click/camref:1101lHtj/destination:https%3A%2F%2Fwww.hostelworld.com%2Fhosteldetails.php%2FOld-Ganja-Hostel%2FGanja%2F275384\" rel=\"noopener\" target=\"_blank\">Old Ganja Hostel</a> &#8211; It&#8217;s located right in the center of the city, and the staff is friendly and helpful.</p><p><strong>Days 11 &amp; 12 (13?) &#8211; Lankaran</strong></p><p>Before heading back to Baku, go south visit this sleepy resort town on the Caspian Sea. See the Old Prison and Lighthouse (Stalin was actually a prisoner here for a while), visit the ancient bazaar, the 18th-century fortress, and the 19th-century mosque. You can spend a good day sightseeing here and then another on the beaches further south in Kenaramesha. If you have more time, take a day trip to the Ghizil-Agaj State Reserve, which is home to about 250 bird species. You can take organized tours from town.</p><p><strong>Where to stay in Lankaran:</strong> <a href=\"https://www.booking.com/hotel/az/khan-lenkaran.en.html?aid=362916&amp;no_rooms=1&amp;group_adults=1\" rel=\"noopener\" target=\"_blank\">Khan Lankaran Hotel</a> &#8211; There are not many hostel options in Lankaran, but this hotel is affordable and incredibly cozy. The restaurant serves Azerbaijani and European food, as well as local drinks.</p><p><strong>Day 13 &#8211; Head back to Baku before heading home. </strong></p><p></p>***<br> <img src=\"https://media.nomadicmatt.com/2018/azerbaijan_fountain.jpg\" alt=\"a fountain in Azerbaijan\"><br> Whenever I leave a place, I always ask myself: On a scale of 1 to 10, how likely am I to come back? I feel like I&#8217;m a 6 with Azerbaijan.<p>Whenever I leave a place, I always ask myself: On a scale of 1 to 10, how likely am I to come back? I feel like I&#8217;m a 6 with Azerbaijan.</p><p>I loved my time there and, if I were in the region again, I would definitely visit again to do some longer hikes I missed this time. But I don&#8217;t think I&#8217;d go out of my way to go again unless there was a compelling reason.</p><p>That said, I found the people incredibly warm and hospitable. Even though we couldn&#8217;t communicate a lot (outside Baku, English is not widely spoken), we pantomimed and <a href=\"https://www.nomadicmatt.com/travel-blogs/four-step-language-learning/\" rel=\"noopener\" target=\"_blank\">communicated nonverbally</a>, which led to some fun and lots of laugh over the confusion of trying to figure out what we were both trying to convey. The food in the country is excellent: a mix of Turkish and Mediterranean styles, with lots of rice, chicken, fresh vegetables, and spices. The landscape is stunning with lush valleys and farmland and the raw beauty of the Caucasus Mountains in the north. And Azerbijian is very safe too, as the government doesn&#8217;t want to anything to ruin the tourism sector; being a quasi-dictatorship, it has the power to make sure nothing does.</p><p>All in all, Azerbaijan is an awesome destination. It&#8217;s easy to get to, super cheap once you arrive (<a href=\"https://www.nomadicmatt.com/travel-blogs/cheap-places-to-visit-on-the-us-dollar/\" rel=\"noopener\" target=\"_blank\">you can live large on $30 USD a day</a>), and beautiful. It&#8217;s definitely a place you shouldn&#8217;t miss, especially if you want something a little exotic, cheap, and filled with outdoor activities.</p><p></p><p id=\"om-brq027uh9rh6olkusuwr-holder\"></p><h4>Book Your Trip to Azerbaijan: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Azerbaijan by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Azerbaijan with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as it consistently returns the cheapest rates. (<a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Europe?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/travel-guides/europe-travel-tips/\" target=\"_blank\" rel=\"noopener\">destination guide on Europe</a>&#160;for even more planning tips!</p><p>Photo credits: <a href=\"https://flic.kr/p/LK5gKe\" rel=\"noopener\" target=\"_blank\">5</a>, <a href=\"https://commons.wikimedia.org/wiki/File:Quba_368.jpg\" rel=\"noopener\" target=\"_blank\">6</a>, <a href=\"https://commons.wikimedia.org/wiki/File:Alexander_Nevsky_church_in_Ganja.JPG\" rel=\"noopener\" target=\"_blank\">7</a></p></div>","title":"How to Visit Azerbaijan: What to See and Do, and Suggested Itineraries"}},"pageContext":{"id":"5b95ea2e87be05832748ff89"}}