{"data":{"mongodbDatabaseArticles":{"id":"5b95eb0987be05832748fff1","content":"<div><p class=\"sub-title\">See More, Spend Less, Travel Deeper</p><p>Made with love by travelers for travelers! The purpose of my guides is to let you live large on a budget. I focus on activities that give you insight into the land, people, and culture.</p><p><strong>Updated:</strong> July 2018<br><strong>Return policy:</strong> No risk, 30 Day, 100% Money Back Guarantee<br><strong>Details:</strong> 91 pages of expert budget travel advice with maps</p><p>No matter where I travel in the world, people light up when I tell them I live here. &#8220;Ohhh New York,&#8221; they say. &#8220;I would love to go there. It&#8217;s my dream.&#8221;</p><p>With its iconic skyline, towering skyscrapers, crowded streets lined with ethnic cuisine, theater, parks, and the fact it&#8217;s the backdrop for like 50% of the movies out there, it is no wonder that it has always been one of the most popular tourist destinations in the world.</p><p>I remember the moment I fell in love with the city. It was on New Years in 1999. As the new millennium ticked over, I sat outside with friends, looked up Broadway, and watched the ball drop in the distance. When it came time to slow my travels, I knew there was no other city to move to. When I&#8217;m in NYC, I still feel like I&#8217;m traveling: languages I don&#8217;t know are spoken all around me and I can get food from any country in the world. To me, NYC is the heart of the world.</p><p>When I&#8217;m not on the road, I&#8217;ve lived in New York City and have used my personal, insider view to write this guidebook. I know the city like the back of my hand. I&#8217;ll give you local, insider knowledge to help you get off-the-beaten path and into the little secret spots free of tourists.</p><p>I know a&#160;visit to NYC can be overwhelming. There&#8217;s just so much to see and do that it&#8217;s easy to and miss some of the little out-of-the-way places and sites that make NYC unique. This travel guide offers an inside look into hostels, restaurants, bars, neighborhoods, and attractions so that you can get the most bang for your buck while visiting.</p><p>Too many people think NYC is &#8220;too expensive&#8221; but actors, writers, and everyday people manage to live in the city without going bust. They do so because there are TONS of cheap things to do here. You just have to know where to find them &#8211; and, in this guide, I&#8217;ll point you in the right direction!</p></div>","title":"How to Visit New York City on a Budget"}},"pageContext":{"id":"5b95eb0987be05832748fff1"}}