{"data":{"mongodbDatabaseArticles":{"id":"5b9248b487be056953db7bdb","content":"<div><blockquote><p>A few years back I was completely disillusioned with living and working in a big city, basically just to buy more stuff. It still boggles my mind we all go to work 40 hours a week then come up with more and more creative ways to waste that excess of money, rather than just work less and have more time.</p></blockquote> <p>&#8212; <a href=\"//news.ycombinator.com/user?id=grecy\">grecy</a> on <a href=\"//news.ycombinator.com/item?id=6629501\">Hacker News</a></p> <blockquote><p>So maybe, then, it&#8217;s time for you and I to leave this cult...The cheap, plastic junk that surrounds us probably isn&#8217;t worth what we paid &#8211; not just in cash (or, more likely, credit) to get it, but in freedom, time, and tears..</p></blockquote> <p>&#8212; <a href=\"http://blogs.hbr.org/2013/10/this-isnt-capitalism-its-growthism-and-its-bad-for-us/\">Umair Haque</a> on <a href=\"http://blogs.hbr.org/2013/10/this-isnt-capitalism-its-growthism-and-its-bad-for-us/\">Harvard Business Review</a></p> <blockquote><p>The posts about how \"wonderful\" it is that everyone has fridges and smartphones make me cringe. These people have satisfied themselves going a few convolutions further than the lowest common denominator- ie: romanticizing the noble savage- so then they go around regurgitating this idiotic reactionary 'wisdom' about being happy with what we have.</p> <p>What we have is an <strong>ideologically broken, personally unfulfilling, extremely resource-intensive society, and indoctrination quips like \"it's the best thing other than all the other things that have been tried\" and \"our luxuries rise other poorer people out of poverty\" shouldn't cut it</strong>.</p></blockquote> <p>&#8212; <a href=\"//news.ycombinator.com/user?id=RodericDay\">RodericDay</a> on <a href=\"//news.ycombinator.com/item?id=6629755\">Hacker News</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"We have an ideologically broken and personally unfulfilling society"}},"pageContext":{"id":"5b9248b487be056953db7bdb"}}