{"data":{"mongodbDatabaseArticles":{"id":"5b95ea3687be05832748ff8d","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/alexsnorkel.jpg\" alt=\"getting ready to go diving in ko tao\">This is a guest post by <a href=\"http://www.alexinwanderland.com\">Alexandra Baackes</a> about her diving experience in Koh Tao, Thailand. Koh Tao is a popular destination for scuba divers, and so in this guide Alexandra gives you the insider scoop for diving schools, prices, and the best areas for seeing sea life.</p><p>Travelers in Thailand like to label their destinations neatly. Intricate island paradises are boiled down to one or two simple words or associations. <a href=\"https://www.nomadicmatt.com/travel-blogs/ko-phi-phi/\">Koh Phi Phi</a>? The Beach. <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/ko-phangan/\">Koh Phangan</a>? The Full Moon Party. Koh Tao? Diving.</p><p>Some of them are fairly well deserved. After all, Koh Tao (&#8220;Turtle Island&#8221;) is second only to <a href=\"https://www.nomadicmatt.com/travel-blogs/the-saturday-city-cairns/\">Cairns</a>, Australia, when it comes to number of annual dive certifications. Travelers flock from all over Southeast Asia to take their first breaths underwater in the coral reefs fringing Turtle Island. And it&#8217;s easy to see why: the courses are cheap, the dive sites are abundant, the island is beautiful, and the lifestyle is easy.</p><p>Prospective divers heading to the island are spoiled for choice when it comes to dive schools, dive instructors, and dive sites. But competition for business is fierce (there are over 50 dive shops on this small island!), so it definitely helps to have a few things in mind when making such a big investment of your time and travel budget.</p><h2>PADI or SSI?</h2><p>There are over 50 scuba diving training systems, but in Koh Tao, the choice almost always comes down to two: PADI or SSI. Each organization develops its&#160;own teaching materials, sets&#160;its&#160;own standards, and awards its&#160;own certifications. But the differences are minimal. No matter what certification card you walk away with, you&#8217;ll use the same equipment, see the same fish, and be able to dive at the same resorts. Certifications are interchangeable and recognized worldwide. No matter which organization you choose to certify with, the most important factors in the quality of your course will be your dive school and your dive instructor. But there are minor differences you&#8217;ll want to consider:</p><p><strong>PADI (Professional Association of Diving Instructors) &#8211;</strong>&#160;PADI is the world&#8217;s leading scuba diving training organization, with more than 6,000 dive shops and resorts worldwide. If you find comfort in numbers, then the agency with nearly one million certifications per year might just be for you! The major benefit to diving with PADI comes at the professional level. For instructors and divemasters, PADI provides far more employment opportunities, and PADI instructors can work independently (while an SSI instructor must teach through an SSI-registered shop). So if you have dreams of staying in Thailand for good to teach the backpacker masses and you want to be loyal to one agency, PADI is your best bet.</p><p><strong>SSI (Scuba Schools International)</strong>&#160;&#8211; This group has over 2,500 authorized dealers around the world. For divers on Koh Tao, the benefit of doing an SSI certification comes down to best bang for your baht. An SSI course will typically cost you nearly 10% less than a PADI course. If you&#8217;re coming to Koh Tao specifically for its status as one of the world&#8217;s cheapest places to get certified, those extra baht can make a big difference.</p><h2>What&#8217;s the Course Like?</h2><p><img src=\"https://media.nomadicmatt.com/alexsnorkel2.jpg\" alt=\"a boat in ko tao\"><br> The typical diving course is completed in three days. There are videos to watch, book chapters to read, tests to take, and, of course, dives to do! It might sound intimidating, but the course is designed for students as young as 12. The academics shouldn&#8217;t intimidate you.</p><p>Here&#8217;s a rough outline of what your course will look like:</p><p>Day 1: Classroom work in the morning learning about basics skills, equipment, and the effects of diving on the body. Afternoon is spent in the pool or at shallow dive sites doing skills.</p><p>Day 2: Morning is spent in classroom finishing knowledge reviews and taking some quizzes. In the afternoon are open water dives 1 and 2. Some skills will be practiced during the dives.</p><p>Day 3: You&#8217;ll go out on a morning boat and complete open water dives 3 and 4. In the afternoon, you&#8217;ll take the final exam. Congratulations! You are now an open water diver.</p><p>After three days of hard work and fun, you&#8217;ll receive a certification card that allows you to dive anywhere in the world with a buddy, independent of a professional, to a depth of 18 meters.</p><p><strong>How Much Will It Cost?</strong><br> A PADI course will typically run you 9,800 baht, including three nights&#8217; accommodation, though at smaller schools you can often negotiate down to 9,000 baht. An SSI course will not go above 9,000 baht with accommodation. If you&#8217;re arranging your own accommodation, you can wrangle a PADI course for 8,500 or an SSI for 7,500. (<strong>Note:&#160;</strong>There are 36 baht to one dollar.)</p><p>Many schools will have a videographer come along on dives 3 and 4 and make a 10-20&#8211;minute music video&#8211;style film of your day. At night, the class will gather to watch it. Depending on how many copies are sold, you can take one home for anywhere from 1,500 to 2,500 baht. If you&#8217;d rather be behind the lens, most dive shops rent underwater still cameras for around 1,500 baht.</p><p>For divers who have already completed their open water course, fun dives cost around 700&#8211;1,000 baht each, depending on how many dives you&#8217;ll do and if you have your own equipment. Those with time and money constraints will want to make it a priority to visit at least one of Koh Tao&#8217;s premier dive sites.</p><h2>Which School Should I Choose?</h2><p><img src=\"https://media.nomadicmatt.com/alexsnorkel3.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> Koh Tao ain&#8217;t called a mecca for diving for nothing: there are nearly 50 dive schools on this 13-square-mile rock! This decision is the biggest when it comes to determining the quality of your diving course. For the most part, the schools fall into a few categories:</p><p><strong>Big Schools:</strong> Bans, Big Blue, Buddha View, Crystal<br> These schools are ideal for someone who is confident about going under water (i.e., doesn&#8217;t need extra individual attention) and wants to make friends and meet people in a big group setting. These schools have instructors for almost every language imaginable. However, groups can be a bit too large for comfort, and Bans in particular does not take open water students to any of the premier dive sites around the island.</p><p><strong>Medium Schools:</strong> New Way, Scuba Junction, Simple Life<br> Medium dive schools generally have the best of both worlds. They have a range of instructors and groups large enough to make friends in, but they aren&#8217;t as prone to overcrowding or rushing through the course.</p><p><strong>Small Schools</strong>: Sairee Hut, Roctopus<br> These schools are great at accommodating special needs and arranging great deals. For example, you might be able to negotiate discounted fun dives post-course. The extra attention with the instructors that small schools and groups allow is key for those who are feeling uncertain about heading underwater or who simply want to be spoiled with attention.</p><p>When picking a school and an instructor, consider these factors:.</p><ul><li>Do they have an instructor who speaks your language?</li><li>How many students will be in the group?</li><li>What time do they leave in the morning? Those eager beavers who want to be the first on the dive site might not mind being up in time for New Way&#8217;s 6am departure, while night owls might prefer Roctopus&#8217;s more relaxed dive times.</li><li>Will my course include a visit to one of Koh Tao&#8217;s top dive sites (see list below)? Some of the big schools, unfortunately, don&#8217;t send open water divers there.</li><li>Is the equipment up to date and in my size? Schools in Koh Tao have a good record for equipment range and maintenance, but it never hurts to ask.</li><li>How qualified is the instructor? Some students may appreciate the enthusiasm and up-to-date training of a new instructor, while others may find comfort in a teacher with tons of qualifications and years of experience.</li><li>Do you like the instructor?</li></ul><h2>What Are the Can&#8217;t-Miss Dive Sites?</h2><p><strong>Chumphon</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving4.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> Chumphon is typically visited for dive 3 of the open water course. The pinnacles are covered in colorful sea anemone and surrounded by large schools of trevally, batfish, and baraccuda. Lucky divers will spot giant barracuda, scorpionfish, and <a href=\"http://www.alexinwanderland.com/2011/10/14/whale-shark-koh-tao/\">even whale sharks</a>. For those hoping to fun dive, Chumphon is almost always visited on the morning boats.</p><p><strong>Southwest</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving5.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> Southwest is an alternative site for dive 3 of the open water course. This fun dive site is also carpeted in anemone and the clown fish that accompany them. This is another great site for barracuda and giant groupers. Southwest is almost always visited on the morning boats.</p><p><strong>The Wreck of the Sattakut </strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving12.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> This former US Navy ship was sunk in June, making it Koh Tao&#8217;s <a href=\"http://www.alexinwanderland.com/2011/10/24/diving-the-htms-sattakut/\">newest dive site</a>. Sea life like stingrays and a pufferfish have already started to make a home here. Most schools will require you to be an advanced open water diver to dive here or to do it as part of that course.</p><p><strong>Shark Island</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving7.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> Named for its resemblance to a dorsal fin, this dive site is often less congested than the others listed above due to its location on the western side of Koh Tao. Highlights include a myriad of different corals home to nudibranchs, stingrays, and moray eels. On the downside, Shark Island can have a killer current and very aggressive triggerfish.</p><p><strong>Sail Rock</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving8.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> <a href=\"http://www.alexinwanderland.com/2011/10/17/diving-sail-rock/\">Sail Rock</a> is an ocean pinnacle located between Koh Tao and Koh Pha Ngan. The dive site takes about two hours to reach from Koh Tao. Occasionally, you can get lucky and complete dives 3 and 4 of your open water here for an extra fee, though generally this is a specialty trip costing anywhere from 2,500&#160;to&#160;3,500 baht. A handful of schools take trips to Sail Rock, but most only go once a week, so if you&#8217;re interested, start investigating the day you arrive.</p><p><strong>The Twins</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving9.jpg\" alt=\"people getting ready to go diving in ko tao\">This is a common training dive site used for dives 1 or 2 of the open water course. It is just off the coast of Koh Nang Yuan, a tiny island north west of Koh Tao. This site is great for new divers, thanks to its shallow depth and simple layout. One standout is the family of rare saddleback clownfish living in an anemone that divers have clearly marked with a ring of rocks.</p><p><strong>White Rock</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving10.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> White Rock is one of the most commonly visited dive sites on Koh Tao, frequently for dive 4 of the open water course. It boasts one of the largest areas of any dive site on the island and a range of sea life, from butterflyfish to angelfish to blue-spotted stingrays. Lucky divers may spot a sea turtle passing through.</p><p><strong>Green Rock</strong><br> <img src=\"https://media.nomadicmatt.com/kotaodiving11.jpg\" alt=\"people getting ready to go diving in ko tao\"><br> Green Rock is located north of Koh Nang Yuan. The standout feature of this dive site is its many &#8220;swim-throughs,&#8221; which are caves or cut-throughs that divers can pass through. They are great for practicing buoyancy and finding shy marine life. This is also a popular breeding ground for the aggressive trigger fish, so take care not to lose a chunk of fin!</p><p>Learning to dive in Koh Tao should be approached with caution, as it can lead to a very serious addiction to the diving hobby and lifestyle! Many a dive virgin has arrived by ferry with plans to stay a few days and get certified, only to find themselves months later calling the island home and working toward becoming a scuba diving instructor.</p><p>Diving is a lifetime skill that you can take with you around the globe. From the <a href=\"https://www.nomadicmatt.com/travel-blogs/diving-the-great-barrier-reef/\">Great Barrier Reef</a> of Australia to the Blue Holes of the <a href=\"https://www.nomadicmatt.com/travel-guides/caribbean-travel-tips/the-bahamas/\">Bahamas</a>, from the shipwrecks of Micronesia to the whale sharks of Mexico, diving will allow you to explore more of the world than you ever knew possible. Enjoy it!</p><p>For more on traveling to Thailand and diving, check out these resources:<br> <a href=\"https://www.nomadicmatt.com/travel-blogs/learning-how-to-scuba-dive/\">Learning How to Scuba Dive</a><br> <a href=\"https://www.nomadicmatt.com/travel-blogs/how-much-a-holiday-in-thailand-costs/\">How Much Does a Holiday in Thailand Cost?</a><br> <a href=\"https://www.nomadicmatt.com/travel-blogs/best-places-to-go-scuba-diving/\">The Best Places to Go Scuba Diving</a></p><p>Alexandra Baackes is an enthusiastic diver and underwater videographer, as well as an on-land writer and designer. She blogs about travel, diving, and living in Southeast Asia at <a href=\"http://www.alexinwanderland.com\">Alex in Wanderland</a>. You can find her on Twitter talking about fast food cravings and wanderlust at <a href=\"https://twitter.com/WanderlandAlex\">@WanderlandAlex</a>.</p><h3>Get the In-Depth Budget Guide to Thailand!</h3><p><a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://www.nomadicmatt.com/wp-content/uploads/2016/09/cover_thailand_2016-2.png\" alt=\"Guide to Thailand\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p></div>","title":"The Complete Guide to Diving in Koh Tao"}},"pageContext":{"id":"5b95ea3687be05832748ff8d"}}