{"data":{"mongodbDatabaseArticles":{"id":"5b96249587be058327490eba","content":"<div><p><img src=\"http://photos.foxnomad.com/NorthAmerica/California/San-Francisco/i-3wvW5LJ/0/M/CIMG3602-M.jpg\" alt=\"\" width=\"143\" height=\"216\" align=\"right\">Many airlines are now resorting to <a href=\"http://www.lockergnome.com/forsythe/2008/02/05/united-airlines-new-baggage-fee/\">charging you</a> for having <a href=\"http://www.inflighthq.com/archives/2008/02/united-ads-a-25-fee-for-a-second-checked-bag.htm\">checked luggage</a> in order to compensate for higher gas prices and operating costs. Paying more than you have to for a trip isn&#8217;t what smart travelers do. Frugal fliers can sacrifice some luxuries to keep luggage fees off of their <a href=\"http://www.foxnomad.com/2008/01/24/how-to-create-a-simple-vacation-budget/\">vacation budget</a> and save time waiting at baggage carousels.</p>\n<ul>\n<li><strong>Bring One Pair Of Tennis Shoes </strong>&#8211; &#8230;and keep them on your feet. Shoes are one of the biggest bag space hogs and heavy at that. Wear a single multi-purpose pair that will be easy on your feet &#8211; preferably in black to help you <a href=\"http://www.foxnomad.com/2008/01/30/how-americans-can-blend-in-abroad/\">blend in</a>. <ul> <li>If you must bring an extra pair (or heavens two), tie them <a href=\"http://www.foxnomad.com/2008/02/01/save-space-in-your-suitcase-by-tying-your-extra-shoes-to-your-carry-onbackpack/\">by the laces</a> to your carry on.</li>\n</ul>\n</li>\n<li><strong>Buy A Sturdy Multi-Pocketed Backpack</strong> &#8211; Very obvious, but don&#8217;t just bring your old <a href=\"https://best-luggagereview.blogspot.com/2008/02/jansport-big-student-classic-daypack.html\">Jansport</a> from school with you. One large pocket isn&#8217;t very efficient since you&#8217;ll be packing both small and large items. Also, school bags tend to have thin material and tear easily. <ul> <li>I recommend the <a href=\"http://macfling.com/bags/2008/01/wenger-swiss-gear-marlet-laptop-backpack/\">Wenger Swiss</a> line of travel bags.</li>\n<li>Here are some other <a href=\"http://rtwtripplanner.com/rtw-trips/recommended-rtw-backpacks/\">recommended RTW backpacks</a>.</li>\n</ul>\n</li>\n</ul>\n<p></p>\n<ul>\n<li><strong>Consider A Solar-Powered Backpack </strong>&#8211; Most <a href=\"http://www.foxnomad.com/2007/04/17/solar-powered-backpack/\">solar powered backpacks</a> will charge iPods, cell phones, and some even laptops. You&#8217;ll save space and strain on your back by not having to bring along chargers. You won&#8217;t have to worry about bringing 50 voltage adapters. <ul> <li>The average solar backpack will run you about $250.</li>\n</ul>\n</li>\n<li> <strong>Follow The <a href=\"http://www.foxnomad.com/2007/03/05/10-of-essentials-rule/\">10 Of Essentials Rule</a></strong> &#8211; This rule applies even to thoughtfully packed carry on bags. Essentially you bring 10 of every essential clothing item; socks, underwear, and T-shirts. Wash any dirty items in hotel or hostel showers using soap and dry them over night by hanging.</li>\n<li><strong>Get An Ultimate Jacket </strong>&#8211; These jackets have around <a href=\"http://www.foxnomad.com/2007/06/08/237d-ultimate-jacket/\">33 pockets</a> both inside and out that are secured by magnetic flaps (not sure how much trouble this would with metal detectors). Some of the pockets are hidden and can be used to protect yourself from pickpockets. <ul> <li>Ultimate jackets run about $75, but a cheap old jean jacket does the job pretty well too and they last forever.</li>\n</ul>\n</li>\n<li><strong>Leave Your Books At Home, Download eBooks</strong> &#8211; Find online copies of your favorite books for free and upload them to your laptop, <a href=\"https://lifehacker.com/software/ipod/make-ebooks-for-your-ipod-196143.php\">iPod Classic</a>, or <a href=\"http://www.foxnomad.com/2008/01/18/the-best-ipod-touch-and-iphone-hacks-for-travelers/\">iPod Touch</a>. Here are <a href=\"https://text2go.wordpress.com/2008/01/04/the-top-13-drm-free-ebook-sites/\">13 great sources</a> for free content. <ul> <li>Audio books are also another option.</li>\n</ul>\n</li>\n<li><strong>Tie Warm Clothes Around Your Waist</strong> &#8211; It&#8217;s so 90s, but any sweaters, light jackets, or hoodies shouldn&#8217;t take up space in your carry on.</li>\n<li><strong>Unplug</strong> &#8211; Laptops are wonderful for travelers and provide information via the Internet, entertainment via <p>porn</p> eBooks, and access to email, networking sites, and more <p>porn</p> eBooks.Workaholics and travelers going to questionable places should leave the metal brick at home. With an <a href=\"http://www.foxnomad.com/2008/01/18/the-best-ipod-touch-and-iphone-hacks-for-travelers/\">unlocked iPod Touch</a> you can do most of the things a laptop can do. <ul> <li>For cheap phone calls from a cell using Skype, try <a href=\"http://blog.tmcnet.com/blog/tom-keating/skype/skype-from-mobile-cell-phone.asp\">iSkoot</a>.</li>\n</ul>\n</li>\n<li><strong>Buy All Of Your Toiletries There</strong> &#8211; Toothpaste, nail clippers, and other essentials tend to get confiscated in airport security anyway. Buy the travel size of these items once you get to your destination and discard them on your return.</li>\n</ul>\n<p>A few of these methods require some upfront cost, but they all have free alternatives. Living out of a single bag for up to 10 days or more is possible &#8211; the best advice is to not bring or combine what you can. Groups of travelers can pack all of their items into a single suitcase and still use some of the ideas above to conserve space.</p>\n<p>Not only will you be able to get around with a light load on your back, not have to worry about lugging a suitcase, best of all you&#8217;ll have to rely on your wits and get creative &#8211; which doesn&#8217;t cost you a penny, let alone $25.</p>\n<p>[photo by: <a href=\"https://flickr.com/photos/mil8/\">mil8</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"How To Keep To A Single Carry On"}},"pageContext":{"id":"5b96249587be058327490eba"}}