{"data":{"mongodbDatabaseArticles":{"id":"5b9624ad87be058327490ecf","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">30 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p><img alt=\"jose mariano lopez-urdiales\" src=\"https://foxnomad.com/wp-content/uploads/2013/07/jose-mariano.jpg\" width=\"198\" height=\"219\">Space may be the final frontier, but you don&#8217;t have to wait for warp drive to explore it. Like myself, I&#8217;m sure many of you are waiting for the chance to extend your travels beyond our planet and my <a href=\"https://foxnomad.com/live-chats/\">live chat</a> guest today is working to make that happen.</p>\n<blockquote><p>In 2009 Jose Mariano Lopez-Urdiales founded <a href=\"http://www.0ll00.com/\">Zero2Infinity</a> in Barcelona, Spain; its maiden vehicle is <a href=\"http://www.inbloon.com/\">bloon</a>, a stratospheric balloon that will allow people to fly to Near-Space.&#160;Thanks to his astronomer father, he has been in close contact with space missions ever since he was a child. He graduated in Aeronautical Engineering from Universidad Polit&#233;cnica de Madrid, and since then has been involved in a host of cutting-edge projects such as building and flying microgravity payloads for the European Space Agency, rocket science at&#160;the Massachusetts Institute of Technology and the Ariane 5 Evolution Space launcher, to name a few.</p></blockquote>\n<p><strong>The Q&amp;A is now closed. Thanks everyone for participating! open today, July 11th from 1-2pm US EST (5pm-6pm GMT; 12am-1am Bangkok). Scroll down or <a href=\"https://foxnomad.com/2013/07/11/ask-aerospace-engineer-jose-mariano-anything-you-want-about-space-tourism/#comments\">click here to submit your questions</a> below!</strong></p>\n<p>I first met Jose in 2011 when he gave a talk about bloon at a conference on space tourism and interviewed him <a href=\"https://foxnomad.com/2011/04/07/talking-near-future-space-tourism-on-bloon-with-zero2infinity-ceo-jose-mariano/\">about near-future space tourism</a> later that year. Today, he&#8217;ll be here for one hour to answer your questions about how you can become a space tourist, the costs, challenges, and what&#8217;s next for tourism far beyond the stars, all in <a href=\"https://foxnomad.com/2013/07/11/ask-aerospace-engineer-jose-mariano-anything-you-want-about-space-tourism/#comments\">the comments section below</a>.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Ask Aerospace Engineer Jose Mariano Anything You Want About Space Tourism"}},"pageContext":{"id":"5b9624ad87be058327490ecf"}}