{"data":{"mongodbDatabaseArticles":{"id":"5b96297f87be058327491193","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What I was up to other than here:</h2><ul><li>I didn&#8217;t do a lick of writing outside of this blog this week&#8230; except in Hindi class! I had class every day this week &amp; I&#8217;m loving it. The hardest part is that I&#8217;m not learning reading and writing, because sanskrit is hard to teach (according to my teacher). She will tell us a sentence and what it means, and we have to write it down phonetically to use for studying and repeat her. I have a hard time hearing the new words &amp; she has to repeat herself 5 times before I really hear it correctly.. Very different. The teacher says I&#8217;m &#8220;slow&#8221; and &#8220;not very good&#8221; ha ha ha! Ben, she says, is much better.</li><li>Also, I am starting a <p><strong>NEW SERIES</strong></p> on my blog. If you want to participate (and I hope you do) please e-mail me and I&#8217;ll give you the information.</li></ul><h1>Now your story,</h1><p>I was in the bank (I suppose I won&#8217;t say which one) right at closing time trying to wire money to someone. I had just come from the police station to submit my C form (anywhere you stay in India you fill one out, even in our own home) so I had my passport with me.</p><p>The bank teller saw my passport and said, &#8220;why don&#8217;t you open a bank account?&#8221; I told him I didn&#8217;t think I could open a bank account in India without OCI or PIO.</p><p>He flipped through a little bit, checking my new and old Indian visas. He told me that I could and got me pretty excited. This would mean I could wire money money from home, online, and not deal with Mapusa traffic. It would also mean I&#8217;d have an account to use Indian websites that don&#8217;t take foreign cards, like the official train-booking site. I could even take out a loan (not that I want to), but it&#8217;s still very cool.</p><p>Then he added, &#8220;yes, it&#8217;s perfect, no problem&#8230; just little thing&#8230; you have to close your account every 180 days. When you come back to India you just re-open the account&#8221;.</p><p>Per my visa requirements, I do have to exit every 180 days at least and re-enter. It&#8217;s a pain in the ass. So, if I have an account full of money, when I close it out for a visa run, I have a bunch of cash on me or left at my house?</p><p>I told him that just seemed silly and I wasn&#8217;t going to bother. Why should I?</p><p>He said, &#8220;because&#8221;&#160;he started with a sneaky smile,&#160;&#160;&#8220;I get commission EVERY&#160;time someone opens an account&#8221;&#160;with an eager head wobble he said&#160;&#8220;and you can open an account many many times!&#8221;</p><p>It was pretty funny; I took his card and told him I&#8217;d consider it.</p><h1>This is India!</h1><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on&#160;<a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>,&#160;<a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>,&#160;<a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a>&#160;&amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! (twelve)"}},"pageContext":{"id":"5b96297f87be058327491193"}}