{"data":{"mongodbDatabaseArticles":{"id":"5b9382e787be056953db7e07","content":"<div><h1 name=\"2a18\" id=\"2a18\" class=\"graf graf--h3 graf--leading graf--title\">A Pin on our Remote&#160;Map</h1><p name=\"4c9b\" id=\"4c9b\" class=\"graf graf--p graf-after--h3\">Less than two years ago, we at Remote Year threw a question out to the internet: &#8220;Who&#8217;s crazy enough to join us on a year-long journey around the world?&#8221; The only thing we could promise was that the trip would be unlike any other&#8202;&#8212;&#8202;we were committed to a new model of creating value on the road.</p><p name=\"e0c8\" id=\"e0c8\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Seeds of A Nation</strong></p><p name=\"948a\" id=\"948a\" class=\"graf graf--p graf-after--p\">As our radical idea caught the attention of a few early believers, our band of explorers began to assemble. Even though we all came from different backgrounds, nationalities, ages and professions, we were connected by a shared hunger to get out there and experience the world. Murmurs of our mission spread, and more and more people opened their eyes to this new way of living, planting the seeds of what is known today as the <a href=\"https://medium.com/go-remote/pardon-our-dust-revolution-in-progress-75aa3ab49adb\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Remote Revolution</a>.</p><p name=\"cd03\" id=\"cd03\" class=\"graf graf--p graf-after--p\">From our inaugural group of 75 remotes, we&#8217;ve evolved into a growing nation of over 500 traveling professionals. Together, we&#8217;ve clocked over 150,000 working hours from more than 25 countries around the world, proving that <a href=\"https://medium.com/go-remote/what-we-learned-after-traveling-a-year-with-75-digital-nomads-af400b42f2c7\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">great work can be done from anywhere</a>.</p><p name=\"ab93\" id=\"ab93\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Band of Mavericks</strong></p><p name=\"d652\" id=\"d652\" class=\"graf graf--p graf-after--p\">Our community&#8217;s unique core values set us apart. We believe that the most important things in life aren&#8217;t things we own, but rather, experiences we share with others. We know that we are most productive in work and happy in life when we feel inspired by our surroundings. So, it&#8217;s a no-brainer why we&#8217;re more than willing to trade in our ping pong paddles and cubicles for a backpack full of independence.</p><p name=\"3b8a\" id=\"3b8a\" class=\"graf graf--p graf-after--p\">The quality of work that has been produced on Remote Year is creating waves in the professional community. We&#8217;ve already forged alliances with 100+ companies and 20+ Fortune 500 companies who currently have their employees on Remote Year, and are in talks with hundreds more. These are forward-thinking companies that recognize this massive shift in values and see this change as an opportunity to <a href=\"http://remoteyearbusiness.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">shape the future of work with us</a>.</p><p name=\"802c\" id=\"802c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Looking Ahead</strong></p><p name=\"cc8f\" id=\"cc8f\" class=\"graf graf--p graf-after--p\">We are excited to welcome some new faces to our Remote Nation. We are happy to announce that we&#8217;ve partnered with Dan Nova and Craig Driscoll at <a href=\"http://www.hcp.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Highland Capital Partners</a> who have led an investment of <a href=\"https://techcrunch.com/2016/10/11/remote-year-series-a/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">$12 million in Remote Year</a>. Highland shares our vision for the future of work and have been deeply thoughtful on it through their investments in <a href=\"https://gocatalant.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Catalant</a>, <a href=\"https://www.xometry.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Xometry</a> and <a href=\"https://www.onespace.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">OneSpace</a>.</p><p name=\"7c23\" id=\"7c23\" class=\"graf graf--p graf-after--p\">Also joining us in this round are some of the early leaders in the collaborative working and living space: Jesse Middleton, co-founder of WeWork Labs (now at <a href=\"http://www.flybridge.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Flybridge</a>) and Nate Blecharczyk, co-founder / CTO of Airbnb.</p><p name=\"6f6e\" id=\"6f6e\" class=\"graf graf--p graf-after--p\">With this new funding, we can double down on providing the best infrastructure, programming, communities and team for the Remote Year experience. Having launched seven programs thus far, we&#8217;ve learned what it takes to deliver a consistent, high-quality living experience across the world, and we now have the means to carry out that vision to the fullest.</p><p name=\"b980\" id=\"b980\" class=\"graf graf--p graf-after--p\">We will also continue to invest in creating world-class professional infrastructure across the world. We just opened our first permanent co-working space in Split, Croatia, that has everything a remote worker needs to be successful, including great internet, ample call booths, and inspiring and comfortable work environments.</p><p name=\"21ec\" id=\"21ec\" class=\"graf graf--p graf-after--p\">Additionally, we will further invest in creating unique opportunities to connect with and give back to the communities we interact with around the world. This will ensure that in addition to a high-quality living and working environment, our participants will also have an authentic cultural experience that instills leadership, innovation, empathy and global understanding.</p><p name=\"f642\" id=\"f642\" class=\"graf graf--p graf-after--p\">As more people take part in this movement and our Remote Nation continues to grow, we&#8217;ll help the world become a more connected community and a better place for everyone.</p><p name=\"c672\" id=\"c672\" class=\"graf graf--p graf-after--p graf--trailing\">To learn more about Remote Year, visit us <a href=\"http://www.remoteyear.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">here</a>.</p></div>","title":"A Pin on our Remote Map – Go Remote – Medium"}},"pageContext":{"id":"5b9382e787be056953db7e07"}}