{"data":{"mongodbDatabaseArticles":{"id":"5b95eaa087be05832748ffbe","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/khaoyai6.jpg\" alt=\"Khao Yai National Park\">Updated: 04/01/2018 | April 1st, 2018</p><p>Khao Yai National Park is located about 2.5 hours north of <a href=\"https://nomadicmatt.com/travel-blogs/the-saturday-city-bangkok/\" target=\"_blank\" rel=\"noopener\">Bangkok</a> and is one of Thailand&#8217;s best national parks. Established in 1962, it was Thailand&#8217;s first national park and is now even a UNESCO World Heritage site.</p><p>I&#8217;d always heard great things about the park while I lived in the country. Despite living in Thailand for several years, I never managed to get there. But, luckily a got to play tour guide to a friend from Boston on a recent visit and used that as my excuse to finally make it there.</p><p>I can&#8217;t believe it took me so long.</p><p>The park is truly amazing. It&#8217;s filled with lush flora and fauna, tons of birds, waterfalls, beautiful hikes, a few wild elephants, and is empty of tourists.</p><p>Arriving at our guesthouse in the afternoon, we were just in time to make a half-day tour. This tour brought you to a few caves and a natural spring. The first cave was home to over 2,000 bats and used to be a Buddhist monastery before the local community helped to build the monks a proper temple. However, the monks still come down here at night to meditate. I suspect the darkness and tranquility are good for meditation.</p><p><img src=\"https://media.nomadicmatt.com/khaoyai2.jpg\" alt=\"Khao Yai National Park\"></p><p>Our guide seemed to be an expert in everything, showing us all the insects, talking about the life cycle of bats, and even giving us a soil lesson on the composition of the dirt and how bat guano can be used to make explosives. Usually, tour guides in Thailand are just ushers, walking you from place to place, discussing very little, letting you take your photos, and then moving on. But this guide knew it all and was able to explain the history and zoology of not only this cave but the whole region.</p><p><img src=\"https://media.nomadicmatt.com/khaoyai5.jpg\" alt=\"Khao Yai National Park\"></p><p>The second cave featured over two million bats, and we arrived just in time to see them head out for their nightly feed. Watching it was like watching something on the Discovery Channel, a seemingly endless stream of bats flying out in pursuit of their evening meal as the sun set below the horizon. Our guide, who seemed to know our cameras better than any of us, was able to catch some of it on tape for us through the telescope:<br> </p><p>We spent the following day back in the park for a full day of hiking through the jungle and trying to spot wildlife. Our day began with bird watching, followed by a five-hour <a href=\"https://nomadicmatt.com/travel-blogs/jungle-trekking-and-leeches-in-khao-sok/\" target=\"_blank\" rel=\"noopener\">trek through the jungle</a>. We spotted a lot of birds throughout the day, including the Great Hornbill, which has a wingspan over two meters wide. Monkeys hovered on the side of the road, and gibbons swung through the trees. As we made our way through the jungle, it became clear to me we were the only group on this trail, allowing us extra personal time with the animals. Usually, in northern Thailand, you see a lot of tour groups on the trails, so it was nice to finally get somewhere where we could be alone with nature.</p><p><img src=\"https://media.nomadicmatt.com/khaoyai3.jpg\" alt=\"Khao Yai National Park\"></p><p>The monsoon season kicked in about halfway through our trek, pouring down an ocean of water on us as we made our way back to the car. The rain abated just as we hit the last few waterfalls, including the one Leonardo Di Caprio jumped off in the movie <a href=\"https://nomadicmatt.com/travel-blogs/the-ultimate-list-of-travel-movies/\" target=\"_blank\" rel=\"noopener\">The Beach</a>.</p><p>Now, normally I never use Lonely Planet for accommodation recommendations. However, this time, I did (as did everyone else at the guest house). I must say that for once, Lonely Planet didn&#8217;t disappoint. Despite being in LP for years, the Greenleaf Guesthouse had not suffered in quality (and having been back since, I can say it&#8217;s still one of the best places to stay). Usually, press in a Lonely Planet book means higher prices and poorer quality. However, this place offered cheap accommodation, excellent food, reasonably priced tours, and very knowledgeable tour guides. If you ever go to Khao Yai, this place comes with my highest recommendation. I&#8217;d go back in a second.</p><p><img src=\"https://media.nomadicmatt.com/khaoyai1.jpg\" alt=\"Khao Yai National Park\"></p><p>Despite being one of the biggest and most well-known parks in Thailand, there were few tourists there, making for an enjoyable and peaceful experience. With it being only half a day from Bangkok, you should really consider visiting Khao Yai before you head off to the tropical islands that make Thailand so famous.</p><p><strong>How to get to Khao Yai National Park</strong><br> The park isn&#8217;t really easy to get to. Pak Chong is the closest towns. Buses leave frequently from Bangkok&#8217;s Mo Chit Bus Station. You can also take the train from Bangkok but the journey is much slower. All guesthouses will come pick you up from the bus or train station. The train to Pak Chong is around 400 baht and the park&#8217;s entrance fee is also 400 Baht. Half day tours at Greenleaf begin at 500 Baht.</p><p>You can hike many of the shorter trails yourself as well as camp in the park too. There are limited spots so book in advice. I wouldn&#8217;t hike one of the longer trails without a guide.</p><h2>Get the In-Depth Budget Guide to Thailand!</h2><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Thailand_Flat.jpg\" alt=\"Nomadic Matt's Thailand Guide\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p><h4>Book Your Trip to Khao Yai National Park: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Thailand by using <a href=\"http://www.tkqlhce.com/click-3032045-10641624\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines.</p><p><strong>Book Your Acommodation</strong><br> You can book your hostel in Khao Yai National Park with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to a hotel, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"nofollow noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never take a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Khao Yai National Park?</strong><br> Be sure to visit our robust <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener\">destination guide on Thailand</a> for even more planning tips!</p></div>","title":"How to Visit Khao Yai National Park in Thailand"}},"pageContext":{"id":"5b95eaa087be05832748ffbe"}}