{"data":{"mongodbDatabaseArticles":{"id":"5b96299c87be05832749119d","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><p>feature image:&#160;<a class=\"owner-name truncate\" title=\"Go to Bs0u10e0's photostream\" href=\"https://www.flickr.com/photos/bs0u10e0/\">Bs0u10e0</a></p><h1>A Luxury Guide to Cannes</h1><p class=\"p1\"><b><i>Tell us a little about&#160; yourself and tell us why you&#8217;re an expert on luxury travel in Cannes.</i></b></p><p class=\"p1\">I am a UK based luxury travel and lifestyle blogger. On my blog <a href=\"http://www.jet-settera.com\">www.jet-settera.com</a>, I write about the most luxurious jet-set destinations around the World and the hottest events that take place in these places. Every year I attend the Cannes and Venice Film Festivals, the Monaco Grand Prix, Oscars Parties in LA, Art shows in Miami, Basel, London and in Venice, Fashion Weeks in Paris or Milan. I spend a couple of weeks in St-Tropez every Summer, where I attend many villa and yacht parties. My blog allows my readers to have a glance at these upscale destinations and some of the most prestigious events around the World.</p><p class=\"p1\">I have been to Cannes about 10 times as I regularly attend the <a href=\"http://www.jet-settera.com/the-5-best-movies-of-the-cannes-film-festival-15/\">Cannes Film Festival</a> that takes place every May. This year&#8217;s festival is only a month away and my intention is to put you in the mood to visit Cannes, during the most glamorous film festival of the year.</p><p class=\"p1\"><b><i>What makes Cannes a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p1\">Former Lord Chancellor Lord Brougham set out to visit Nice in 1834, but he was stuck in a small fishing village called Cannes, because of a cholera outbreak in Nice. After this winter, he spent the next 30 winters in Cannes and he became the first person to spread the words to the European aristocrats to come and visit the place. By the beginning of the 20th century Cannes had become one of the most glamorous cities of Europe.&#160;</p><p class=\"p1\">The World&#8217;s oldest and most prestigious film festival takes place in this beautiful coastal town every May for the last 68 years. During the 10 days of the festival, Cannes becomes a melting pot of celebrities, billionaires and wannabes. If you are looking for a quiet time in Cannes, you are better off visiting during the Summer, when the city is less crowded. On Boulevard de la Croisette the long beach promenade that traverses Cannes you can find <b>Le Grand Theatre Lumiere,</b> where the annual film festival takes place, as well as luxurious designer stores, hotels, beach clubs and Michelin-starred restaurants.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-14276\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/Adriana-Lima-on-the-Red-Carpet.jpg?resize=312%2C415&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"312\" height=\"415\"></p><p class=\"p1\"><b><i>What 5 star hotel is the best in </i></b><b><i>Cannes</i></b><b><i>?</i></b></p><p class=\"p1\">The oldest most traditional hotel in Cannes is the <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/InterContinental_Carlton_Cannes.htm\"><b>Intercontinental Carlton Hotel</b>.</a> It is situated right on the middle of the Croisette at at <i>58 Boulevard de la Croisette</i>. Book into Room 623, also known as the Alfred Hitchcock suit. It was featured in the movie <i>To Catch a Thief </i>with Cary Grant and Grace Kelly. The two domes on either sides of the hotel resemble the breast of a female courtesan. The terrace of the hotel is one of the best spots in town for people watching. It is a place where producers, actors, journalists meet for a coffee to get their next blockbusters started or promoted. </p><p class=\"p1\">For an ultimate luxury experience stay in <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Hotel_du_Cap_Eden_Roc.htm\"><b>Hotel du Cap, Eden Rock</b></a> in <b>Cap d&#8217;Antibes</b>. It is 15 kms away from Cannes and it is listed amongst the best hotels in the World. It is right on the coast of the Mediterranean overlooking the sea and the surrounding yachts. Many celebrities stay in this world famous hotel, therefore no one is allowed to take photos. The most <a href=\"http://www.jet-settera.com/the-most-glamorous-events-of-the-cannes-film-festival/\">prestigious events</a> of the festival take place in this fabulous hotel, such as the <a href=\"http://www.amfar.org/\"><b>amfAR Gala</b></a> organized by <b>Sharon Stone</b>. The place is often surrounded by paparazzi. Even if you cannot afford to stay here, I recommend you to visit this place for lunch to admire the view and to take a stroll in the garden of this magnificent hotel.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-14284\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/View-from-Hotel-du-Cap-Eden-Rock.jpg?resize=415%2C312&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"415\" height=\"312\"></p><p class=\"p1\"><b><i>What about boutique hotels in </i></b><b><i>Cannes, </i></b><b><i>of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p1\"><b>Hotel Le Cavendish</b> at <i>11 Boulevard Carnot</i> in the heart of Cannes, is about 5 minutes walk away from the beach. It was a <b>Travellers&#8217; Choice 2016 Winner of Top Hotels</b>. It is famous for its delicious homemade breakfast. The beds are very comfortable and the staff is helpful and friendly. Click <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Hotel_Le_Cavendish.htm\">here</a> for rates and availability.&#160;</p><p class=\"p1\"><b><i>Are there any fun luxury activities for the adventurous traveler in </i></b><b><i>Cannes?</i></b></p><p class=\"p1\">Hiring a yacht is the best way to enjoy the South of France. Some of the biggest yachts in the World show up during the Film Festival in Cannes and many of them can be chartered. If you walk down on the Jetee Albert Edouard, you can see some of&#160; the most incredible yachts in the World, such as Dennis Rich&#8217;s mega yacht the <b>Lady Joy</b> or <b>Paul Allen&#8217;s Octopus</b>.&#160; Often times, there are celebrity parties on these mega-yachts. Roberto Cavalli threw a star-studded party 2 years ago on his yacht, where Kyle Minogue, John Travolta as well as Heidi Klum appeared. </p><p class=\"p1\"><b><i>Where are the best hang outs during the day in </i></b><b><i>Cannes</i></b><b><i>?</i></b></p><p class=\"p1\">Most beach clubs are operated by large hotels on the Croisette and they host exclusive parties during the festival. Beach beds run around 40&#8364; at <b>Le Majestic Plage </b>of <a href=\"http://www.hotelsbarriere.com/fr/cannes/le-majestic.html\"><b>The Majestic Barriere Hotel</b></a>, where they serve a delicious seafood buffet lunch. If you are lucky you can watch a photo call during the festival here, I spotted Jennifer Lawrence during her photocall for The Hunger Games: Mockingjay &#8211; Part 1. Also, the champagne reception of the 20th anniversary Pulp Fiction screening took place here with Tarantino and Uma Thurman and John Travolta. Another hot spot during the day is the<b> Carlton Beach. </b>Get yourself a sun lounger and you can watch all the photo calls here during the festival. Borat&#8217;s mankini was first launched here.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-14285\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/View-of-Cannes.jpg?resize=415%2C312&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"415\" height=\"312\"></p><p class=\"p1\"><b><i>If you have a big date night, what are the most delicious restaurants in </i></b><b><i>Cannes </i></b><b><i>and what are their best dishes?</i></b></p><p class=\"p1\">The most famous restaurant is <a href=\"http://cannesmartinez.grand.hyatt.com/en/hotel/dining/la-palme-dor.html\"><b>Palm d&#8217;Or</b></a>, (named after the award of the 69 year old film festival) in the <a href=\"http://cannesmartinez.grand.hyatt.com/en/hotel/home.html\"><b>Martinez Hotel</b></a>. It is a two Michelin-starred restaurant and a hot spot to see some of the celebrities who turn up in Cannes during the festival. </p><p class=\"p1\">On the small streets between the Croisette and Rue d&#8217;Antibes, there are plenty of choices for restaurants, but one of the oldest most famous places is<b><i> </i>La Mere Besson</b>&#160;<i>13 Rue Fr&#232;res Pradignac</i> <i>+33 4 93 39 59 24 </i> that has been open since 1959, and specializes in delicious seasonal Provencal dishes. Many French filmmakers turn up here for a meal after a red carpet premier.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-14283\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/Seafood-Lunch-at-Majestic-Beach.jpg?resize=415%2C234&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"415\" height=\"234\"></p><p class=\"p1\">A short taxi ride away from Cannes, is the famous seafood restaurant called<b> </b><a href=\"http://www.tetou.fr/\"><b>Tetou</b></a><b> </b><i>8 Avenue des Fr&#232;res Roustan, Goulfe</i> <i>+33 4 93 63 71 16</i> facing the beach of<b> Golfe Juan</b>. After promoting <b>Kung Fu Panda 2, Brad Pitt </b>and <b>Angelina Jolie </b>appeared here for dinner.&#160; The food is excellent, but make sure to bring cash as they will not take any credit cards.<b> </b></p><p class=\"p1\"><b><i>Let&#8217;s talk desserts- what place makes the best?</i></b></p><p class=\"p1\"><b>Vilfeu Glacier</b> <i>14 Rue Bivouac Napol&#233;on +33 4 93 39 26 87&#160;</i>in the historic old town, <b>Le Suquet</b>, makes the best ice-cream in town. Kim and Kanye showed up here a couple of years ago after a yacht party. </p><p class=\"p1\"><b><i>Tell us all the hot shopping spots in </i></b><b><i>Cannes</i></b><b><i>; who&#8217;s carrying the trendy local designers? Are there designers we should make sure to meet?</i></b></p><p class=\"p1\">Le Croisette and Rue d&#8217;Antibes offers the best choices for shopping in Cannes. Beautiful designer shops like <b>Chanel, Prada, Roberto Cavalli</b> line up along the beach on the Croisette, while Rue d&#8217;Antibes offers less luxurious brands such as Zara, Mango.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-14280\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/Grand-Theatre-Lumiere.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"560\" height=\"420\"></p><p class=\"p3\"><b><i>What are a couple of the best salons and spas in </i></b><b><i>Cannes</i></b><b><i>?</i></b></p><p class=\"p3\"><a href=\"http://www.hotelsbarriere.com/fr/activites/thalasso-spas.html\"><b>Spa Diane Barriere by Clarins</b></a> in the Majestic Barrier Hotel<i> </i>at<i> 10 Boulevard de la Croisette +33 4 92 98 77 00</i> is a 450 m2&#160; spa with sauna, steam room, sensory space, fitness room. The spa is free for hotel guests and 45&#8364; for visitors. The spa offers a wide selection of beauty treatments, some of which were especially created for the hotel, using the famous brand Clarins.</p><p class=\"p1\"><b><i>Time for a great sunset view&#8230; where would you go?</i></b></p><p class=\"p1\">Stay on the beach of Cannes to see the sunset at one of the Beach Clubs;<b><i> </i>Carlton Beach </b>or <b>Le Plage</b> at the Majestic Hotel offer a great sunset view and a nice selection of cocktails. They often have DJs playing in the early evenings to ensure a fun atmosphere.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-14278\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/amfAR-Gala-at-Hotel-Du-Cap.jpg?resize=560%2C373&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"560\" height=\"373\"></p><p class=\"p1\"><b><i>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot. </i></b></p><p class=\"p1\"><b>Le Bar L&#8217;Amiral</b> in the Martinez Hotel at <i>73 Boulevard de la Croisette</i>, <i>+33 4 93 90 12 34</i></p><p class=\"p1\">This bar has won an endless list of awards and it ranks amongst the best piano bars of France. The venue is designed in an elegant art deco style, the walls are decorated with photos of celebrities. Have a martini on the terrace during the film festival and you will surely see some famous people sipping cocktails at the nearby tables. </p><p class=\"p1\">Another upscale bar is the <b>Carlton Bar</b> at <i>58 Boulevard de la Croisette,</i> <i>+33 4 93 06 40 06 </i>which is probably the best place for people watching as the place attracts some of the wealthiest, most famous people in town. The place is swanky and refined. This is a sophisticated place for beautiful cocktails and snacks, while you have to make sure to keep your eyes open for celebrities. </p><p class=\"p1\"><b><i>If you end the night at a fancy club in </i></b><b><i>Cannes</i></b><b><i>, which one do you head towards? </i></b></p><p class=\"p1\"><a href=\"http://gotha-club.com/\"><b>Gotcha Club</b></a> at <i>Place Franklin Roosevelt</i> <i>+33 4 93 45 11 11 </i>is the hottest night club in town, where celebrity DJs like Bob Sinclair and David Guetta are spinning during the film festival. Regulars like Leonardo DiCaprio and Justin Bieber can be often spotted in the VIP section during the festival. The after party of <b>Expendables 3</b> took place here two years ago, when all the biggest Hollywood actors showed up like Antonio Banderas, Sly Stallone and Arnold Schwarzenegger. </p><p class=\"p3\">Bio:</p><p class=\"p4\"><b><img class=\"alignleft wp-image-14282 size-full\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/04/Profile-Photo.jpg?resize=150%2C140&amp;ssl=1\" alt=\"luxury guide to cannes\" width=\"150\" height=\"140\">Barbara is a London based luxury travel and lifestyle blogger of www.jet-settera.com</b>. She left her country when she was 17 to conquer the World as a model. Ever since she has lived in seven countries and visited 63. She blogs about the hottest jet-set destinations and the most prestigious events around the World such as Venice, Cannes San Sebastian Film Festivals<b>,</b> Oscar Parties in LA, Fashion Weeks in Milan or Paris, yacht parties in St-Tropez as well as Prince Albert&#8217;s wedding in Monaco. She writes about art shows like Freeze in London, Miami Art Basel<b> </b>or the<b> </b>Biennale in Venice. She also writes about adventure travel across Asia, South-America and Europe. Read about her latest adventures to Cuba, Argentina, Chile and Brazil on her blog. Find her on <a href=\"https://twitter.com/jet_settera\">Twitter</a>, <a href=\"https://www.facebook.com/jetsettera/?ref=aymt_homepage_panel\">Facebook</a>, <a href=\"https://www.instagram.com/jetsettera/\">Instagram</a> or <a href=\"https://plus.google.com/b/105777779602160824687/+Jetsetteraofficial/posts\">Google+</a>.</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Cannes- Hippie in Heels"}},"pageContext":{"id":"5b96299c87be05832749119d"}}