{"data":{"mongodbDatabaseArticles":{"id":"5b937b0687be056953db7d0b","content":"<div><h3 name=\"5546\" id=\"5546\" class=\"graf graf--h3 graf--leading\">It is three in the afternoon on a Tuesday afternoon and I&#8217;m sitting on my dock with a&#160;beer.</h3><p name=\"9e30\" id=\"9e30\" class=\"graf graf--p graf-after--h3\">There are sailboats moored in the bay. The sun has fallen beneath the fringe of the oak trees who are stretching their long grey fingers over the grey blue of the lapping water. Other Tuesdays have found me climbing volcanoes and camping out beneath the jungle canopy with an intrepid friend, or diving the Great Barrier Reef with my kids, or collecting pink shells along the ruffled fringe of the Andaman Sea. Tuesday afternoons are perfect for quiet adventures; particularly since I don&#8217;t have to show up for a job.</p><h4 name=\"c4f0\" id=\"c4f0\" class=\"graf graf--h4 graf-after--p\">I&#8217;m one of the early adopters to the burgeoning digital nomad&#160;crowd.</h4><p name=\"fcec\" id=\"fcec\" class=\"graf graf--p graf-after--h4\">We read The 4 Hour Work Week and found it, largely, snake oil. We work 20 instead. We watched the rise of the World Domination movement, and quietly went about the business of dominating our world without making a big deal of it. By the time lifestyle design was a thing, ours was a well oiled machine. For pushing a decade we&#8217;ve traveled for a lifestyle, worked from every continent, and adventured on Tuesday afternoons.</p><p name=\"7911\" id=\"7911\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">It sounds idyllic, doesn&#8217;t it?</strong> And sometimes it is. But, like any work, it&#8217;s also, well, work. And it&#8217;s a choice. And it&#8217;s often a lot more complicated than just showing up at the office, pounding out a solid eight, then clocking out, leaving it all behind. Especially when you throw in the details of two adults juggling similar schedules while traveling full time and, oh yes, did I mention? We have four children, who travel with us, and who we school as we go. Four.</p><h4 name=\"358b\" id=\"358b\" class=\"graf graf--h4 graf-after--p\">For a long time I struggled with the idea of work life&#160;balance.</h4><p name=\"9788\" id=\"9788\" class=\"graf graf--p graf-after--h4\">All of the &#8220;professionals,&#8221; who &#8220;had it all together,&#8221; waxed poetic about personal time, partitioning mental and emotional space, quality time with kids, blocked work hours, productivity hacks, investing in primary relationships, and the sanctity of the holy of holies: self care.</p><p name=\"cdb7\" id=\"cdb7\" class=\"graf graf--p graf-after--p\">Clearly these people did not live in my world. Or they didn&#8217;t have four kids. Or they didn&#8217;t travel full time. Or they didn&#8217;t have editorial deadlines. Or something.</p><p name=\"2f3a\" id=\"2f3a\" class=\"graf graf--p graf-after--p\">I got up earlier and did yoga. I stayed up later to get quiet space to write. I locked myself behind a door and insisted that all children stay OUT unless there was blood, or fire. I hired an assistant (that actually helped). I set office hours and &#8220;off&#8221; hours. I set &#8220;school time&#8221; and &#8220;me time.&#8221; And I continued to juggle laundry, dishes, travel planning, tween tantrums, and stomach illnesses like a circus clown at the end of her act when all of the dishes are shattering around her and she&#8217;s running in circles with her hair on fire. You&#8217;ve seen that act, right? Maybe you starred in it too.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*NH657c5MTSAXpgOv1XFk2w.jpeg\">Purple Peak, above Akaroa,&#160;NZ<p name=\"fe8a\" id=\"fe8a\" class=\"graf graf--p graf-after--figure\">And then, one day, on a green mountainside dotted with sheep on the South Island of New Zealand, as I huffed my way up a steep path toward the summit I came to an important realization:</p><h2 name=\"518c\" id=\"518c\" class=\"graf graf--h2 graf-after--p\">Fuck work-life balance.</h2><h3 name=\"f3b1\" id=\"f3b1\" class=\"graf graf--h3 graf-after--h2\">There is no such&#160;thing.</h3><p name=\"f39b\" id=\"f39b\" class=\"graf graf--p graf-after--h3\"><strong class=\"markup--strong markup--p-strong\">At least not for those of us who do more than one thing at a time. </strong>Those of us who live robust and messy lives knee deep in personal fulfillment and creativity, alongside the necessities of self-supporting adult life with more dependents than sense. Four kids seemed like a good idea at the time.</p><p name=\"73b9\" id=\"73b9\" class=\"graf graf--p graf-after--p\">Work-life balance doesn&#8217;t exist in a world where sippy cups, Algebra lessons, Swedish massage class, yoga, conference calls, editorial deadlines and living in a third language all co-habitate in the same mental space. It just doesn&#8217;t. And, it&#8217;s asinine to pretend that it does.</p><p name=\"d000\" id=\"d000\" class=\"graf graf--p graf-after--p\">Saddling one another with the idea that we can somehow perfectly balance it all and make a Pinterest beautiful life out of the intersections of the crazy is unkind. And it&#8217;s the biggest lie we tell ourselves. I let go of the kite string of that impossible dream and kept walking, thinking as I went.</p><p name=\"7069\" id=\"7069\" class=\"graf graf--p graf-after--p\">Before I reached the top of Purple Peak, I&#8217;d come to a new commitment:</p><h3 name=\"6735\" id=\"6735\" class=\"graf graf--h3 graf-after--p\">Building a passion driven&#160;life.</h3><p name=\"4471\" id=\"4471\" class=\"graf graf--p graf-after--h3\">I would only work on things that I was passionate about, and, instead of trying to balance it all, the solution, for me, is to throw myself into the moment, headlong.</p><p name=\"45f7\" id=\"45f7\" class=\"graf graf--p graf-after--p\">Whatever I&#8217;m doing, I&#8217;m fully invested in that thing as I&#8217;m doing it. From making sourdough bread, to hiking Borneo, to riding the ferris wheel on the wharf in Seattle. Kids can interfere with work. Work can interfere with kids. Work and kids can hold hands and skip around the park some days.</p><p name=\"3e83\" id=\"3e83\" class=\"graf graf--p graf-after--p\">Many days, yoga doesn&#8217;t happen and self care is an after thought because airplanes wait for no one and editorial deadlines don&#8217;t flex. But, then, I don&#8217;t feel guilty about taking six weeks to walk across Spain alone, or three weeks off the grid in Peru with my mother.</p><h4 name=\"c2b1\" id=\"c2b1\" class=\"graf graf--h4 graf-after--p\">Whatever a day brings me, I&#8217;m all&#160;in.</h4><p name=\"bf69\" id=\"bf69\" class=\"graf graf--p graf-after--h4\"><strong class=\"markup--strong markup--p-strong\">I gave myself permission to say, &#8220;Yes,&#8221; to the things that inspire me and, &#8220;No,&#8221; to the things that no longer serve me.</strong></p><p name=\"e98f\" id=\"e98f\" class=\"graf graf--p graf-after--p\">I gave myself permission to work insane hours if I wanted to, and not to care if my kids, who primarily eat organic, homeade, non-box type things, lived on Chinese takeout for three days while Mommy made the impossible happen on a big project. They love Chinese take out.</p><p name=\"839f\" id=\"839f\" class=\"graf graf--p graf-after--p\">I gave myself permission to cancel conference calls, pre-schedule the non-essential, and spend two days deeply investing in relationships that matter to me, instead of splitting my attention.</p><p name=\"e814\" id=\"e814\" class=\"graf graf--p graf-after--p\">The reality, of course, is that my attention is almost always split, and I like it that way. I work at the table where my teenage sons study most mornings. We discuss my work, and their reading. I punctuate intense hours of writing with detox time in the kitchen. I sit on the dock and sip my beer, while answering email on my phone. I take conference calls from the roof top terrace of my hotel in Cuzco. I edit on the train.</p><p name=\"1a44\" id=\"1a44\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">My friend Sean puts it well:</strong></p><p name=\"251c\" id=\"251c\" class=\"graf graf--p graf-after--p\">He lives in this same world of more kids than sense, big dreams, and endless ambition. He shares my commitment to a deep love of self and a relentless desire to change the world. We were standing, calf deep, in the Hood River, on the Oregon side last summer. He had a twin on each hip. My teenagers were playing crocodile with his little son. We were talking hard and fast about a passion project we share.</p><blockquote name=\"8104\" id=\"8104\" class=\"graf graf--blockquote graf--startsWithDoubleQuote graf-after--p\">&#8220;I&#8217;ve decided it&#8217;s not about work-life balance,&#8221; he mused, &#8220;It&#8217;s about work life integration.&#8221;</blockquote><h3 name=\"6287\" id=\"6287\" class=\"graf graf--h3 graf--startsWithDoubleQuote graf-after--blockquote\">&#8220;It&#8217;s about work life integration.&#8221;</h3><p name=\"ce89\" id=\"ce89\" class=\"graf graf--p graf-after--h3\">The world stopped for a moment as he put words to the ephemeral thought I&#8217;d been brewing for the previous seven months. <strong class=\"markup--strong markup--p-strong\">That&#8217;s it exactly.</strong></p><p name=\"2d3e\" id=\"2d3e\" class=\"graf graf--p graf-after--p\">This whole new movement away from traditional work environments into remote, time-zone flexible, results driven, career paths comes down to that.</p><h4 name=\"e1fb\" id=\"e1fb\" class=\"graf graf--h4 graf-after--p\">Work life integration.</h4><p name=\"55dc\" id=\"55dc\" class=\"graf graf--p graf-after--h4\">We&#8217;re moving away from a style of living and working that fits into neat boxes: literally, the buildings we moved between to accomplish life&#8217;s tasks: Home. Office. School. Church. Community center. Shopping center. Vacation spot.</p><p name=\"8b2b\" id=\"8b2b\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Increasingly, life, and all of it&#8217;s activities, happens all around us, all the time.</strong></p><p name=\"5690\" id=\"5690\" class=\"graf graf--p graf-after--p\">We work at home. We school our kids online or outside. We shop and have it delivered. Our community exists as much in the virtual world as it does in the physical. Our phones tether us to everything, all the time. We can&#8217;t escape work, and we are constantly connected to home, and to community. It&#8217;s all become integrated.</p><p name=\"b0c8\" id=\"b0c8\" class=\"graf graf--p graf-after--p\">So, here I sit on my dock, watching the sky and the river melt into exactly the same shade of shimmering grey. A bass just passed beneath my toes, which are dangling over the water. My beer is getting warm, and I&#8217;m writing. Working in the only place in the world I want to be at this moment. A kid crashed the party, asking what was for dinner. I told him, and sent him to start the grill. My husband is beneath a red umbrella, having a conference call about the launch of his latest invention. A teenager is finishing an Algebra 2 lesson.</p><p name=\"7195\" id=\"7195\" class=\"graf graf--p graf-after--p\">This is work life integration in action.</p><p name=\"8310\" id=\"8310\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Give me passion over balance any day.</strong></p><p name=\"0007\" id=\"0007\" class=\"graf graf--p graf-after--p\">***</p><p name=\"ceb4\" id=\"ceb4\" class=\"graf graf--p graf-after--p graf--trailing\">On Your Terms is a publication by <a href=\"http://www.tortugabackpacks.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Tortuga</a>, makers of the ultimate travel backpack.</p></div>","title":"F*ck Work-Life Balance – On Your Terms"}},"pageContext":{"id":"5b937b0687be056953db7d0b"}}