{"data":{"mongodbDatabaseArticles":{"id":"5b921d2c87be0571ac1b0508","content":"<div><p>Tired of earning tiny interest rates in your local bank? Looking for some of the highest interest rates in the world? If you have a sense of adventure, you can earn high yields in <a title=\"Are high interest rates on emerging market currencies worth it?\" href=\"http://nomadcapitalist.com/2013/11/07/high-interest-rates-emerging-market-currencies-worth/\">emerging market banks</a>.</p>\n<p>These aren&#8217;t your average <a href=\"http://www.nomadcapitalist.com/offshore-banking\">offshore bank accounts</a>. But yields are high. How high? Up to 20% high. Of course, these high emerging market interest rates come with serious caveats: concerns about bank stability, troubled foreign currencies, and even the Mafia stealing your money.</p>\n<p>Of course, I&#8217;m a big fan of emerging markets and do believe in the the safety of banking offshore &#8212; sometimes even in emerging markets. You just have to do your own due diligence and decide how big of a risk you&#8217;re willing to take for huge yields.</p>\n<p>Just a little note: I decided to exclude countries in which you can&#8217;t actually open a bank account, such as Iran. Sanctions and all. Iranian banks pay 20% yields&#8230; but the flip side is <a title=\"Top 5: Countries by highest inflation rate\" href=\"http://nomadcapitalist.com/2013/11/03/top-5-countries-highest-inflation-rate/\">sky high inflation</a>.</p>\n<p>Likewise, Argentina is excluded thanks to its <a title=\"The wait for capital controls is over\" href=\"http://nomadcapitalist.com/2013/02/01/the-wait-for-capital-controls-is-over/\">capital controls</a> and the fact that the country is run by a psychopath.</p>\n<h2>The five highest emerging market bank interest rates</h2>\n<p></p><img class=\"size-full wp-image-6535\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/turkey-bank-high-interest-rates.jpg\" alt=\"Turkey bank high interest rates\" width=\"700\" height=\"466\"><p><strong>5. Turkey</strong><br>\nAdvantages: Large international banks<br>\nDisadvantages: Worries about further currency devaluation</p>\n<p>The Turkish lira has taken quite the beating lately. And political ridiculousness &#8212; like the Prime Minster trying to shut down Twitter &#8212; haven&#8217;t helped the overall image of Turkey, either. Turkey is home to the second largest current account deficit among emerging nations, which isn&#8217;t helping its currency stability.</p>\n<p>However, Turkish banks are paying some of the world&#8217;s highest interest rates these days in order to attract deposits in Turkish lira. The concern is that foreign investment into Turkey could dry up and leave the country with no choice but to devalue the lira. It&#8217;s a story that&#8217;s happened before.</p>\n<p>If you&#8217;re ready to take the gamble, you can earn up to 10% on Turkish lira-denominated online savings accounts, or 8-9% on general term deposits. The good news is international banks like HSBC offer accounts in Turkey, as do regional players like Garanti, so you should have less to worry about in terms of bank stability.</p>\n<p></p><img class=\"size-full wp-image-6538\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/uganda-bank-high-interest-rates.jpg\" alt=\"Uganda banks pay some of the world's highest interest rates\" width=\"700\" height=\"466\"><p><strong>4. Uganda</strong><br>\nAdvantages: Multi-currency accounts, including US dollars<br>\nDisadvantages: Corruption and instability</p>\n<p>Can you name the currency of Uganda? I couldn&#8217;t. But if you&#8217;re willing to hold some of your assets in (spoiler alert) the <a href=\"https://en.wikipedia.org/wiki/Ugandan_shilling\" target=\"_blank\">Uganda shilling</a>, you can earn a cool 12% annual yield. Uganda, one of sub-Saharan Africa&#8217;s smaller countries, has an interesting place on the map. To its west are some of Africa&#8217;s largest failed states, such as the Democratic Republic of the Congo and the struggling new nation of <a title=\"Top 5: Countries by highest inflation rate\" href=\"http://nomadcapitalist.com/2013/11/03/top-5-countries-highest-inflation-rate/\" target=\"_blank\">South Sudan</a>. However, to the east are Kenya &#8212; which is trying to reinvent itself as an offshore <a title=\"Laws of motion and the history of offshore tax havens\" href=\"http://nomadcapitalist.com/2013/09/16/laws-of-motion-and-the-history-of-offshore-tax-havens/\">financial center</a> &#8212; and Tanzania.</p>\n<p>Deposit some cash in Uganda shillings and you&#8217;ll earn 12% on a one-year term deposit at the Bank of Baroda. The bank is actually a state-owned bank of India and the second largest bank there. They even have branches in New Zealand. The bank also opens US dollar accounts, paying 2.5% interest on one-year or longer CDs. That may sound appealing, but there are better, more stable yields out there for US dollar deposits.</p>\n</div>","title":"The five highest bank interest rates in emerging markets"}},"pageContext":{"id":"5b921d2c87be0571ac1b0508"}}