{"data":{"mongodbDatabaseArticles":{"id":"5b95ea2287be05832748ff83","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/spartaguide.jpg\" alt=\"the Spartan soldier statue in Sparta\"><br> Sparta was the ancient rival of Athens and known for her fierce warriors (see the historically inaccurate movie &#8220;300&#8221;). The city has a long history and ruins to explore. There is no shortage of things to do, excursions to take, and places to eat when you visit the city. It&#8217;s an often overlooked city (most travelers skip it as it&#8217;s out of the way) but you can get all the history of Greece without the tourists of Athens if you visit. I wouldn&#8217;t suggest skipping Sparta &#8211; your visit here will be very rewarding and give you a chance to see Greece without the crowds!</p><h3 id=\"activities\">Top 5 Things to See and Do in Sparta</h3><img src=\"https://media.nomadicmatt.com/spartaguide2.jpg\"><h4>1. See the King Leonidas Statue</h4><p class=\"back face\"> This was one of the very famous kings of ancient Sparta (see the movie &#8220;300&#8221;). Located in front of a soccer stadium, this statue is a testament to the fading ruins of the Spartan legacy. You can find it easily by heading north, along Paleologou.</p><img src=\"https://media.nomadicmatt.com/spartaguide3.jpg\"><h4>2. Sparta Lakonia Archaeological Site</h4><p class=\"back face\"> Sparta is second only to Athens in terms of historical significance. The archeological site in Sparta is great for anyone interested in Greek history, containing many famous ruins and an archeological museum full of ancient artifacts. It&#8217;s open daily (except Tuesdays) from 8:30am-3pm and admission is 2 EUR.</p><img src=\"https://media.nomadicmatt.com/spartaguide4.jpg\"><h4>3. Tour the Diros Caves</h4><p class=\"back face\"> This can be done as a day trip from Sparta. The Diros Caves consist of a 5-km network of impressive caves, most of which are part of an underground lake. A 30-minute boat tour takes groups of eight to ten people through these caves. Entrance is 15 EUR, and the guided tour is only in Greek, so you may want to buy an information guide.</p><img src=\"https://media.nomadicmatt.com/spartaguide5.jpg\"><h4>4. Visit the Mystras</h4><p class=\"back face\"> These Byzantine ruins are one of the best archaeological sites you can see in the area. You can view a Byzantine church and fortress as well as do a lot of hiking around the area. This is the biggest attraction in the region. Admission is 5 EUR and it&#8217;s open daily from 8am-8pm.</p><img src=\"https://media.nomadicmatt.com/spartaguide7.jpg\"><h4>5. Olive and Greek Olive Oil Museum</h4><p class=\"back face\"> This is a pretty interesting place. Here you can discover all there is to know about olive oil, an important staple of Greek life. The entrance fee is only 3 EUR. It&#8217;s open Wednesday-Monday from 10am-6pm.</p><p></p><h3>Other Things to See and Do</h3><p>(Click the title to expand the text)</p><h5>1. Walk around the modern city</h5><p>Visit Town Hall, which is in the central part of the town&#8217;s square, and from there eat and drink the local food.</p><h5>2. Sanctuary of Artemis Orthia</h5><p>This museum was founded in order to highlight the history of the Greek goddess, Artemis. She was a huge deity for the Spartans. There is a lot of history surrounding her role in mythology, including some interesting ritualistic practices. The museum has a small collection of clay masks that were worn during such rituals as well as some other exhibits about the goddess.</p><h5>3. Byzantine Church of Christ the Saviour</h5><p>On the path to the acropolis lie the ruins of this church. Several important archaeological discoveries were made here and are now the archeological museum.</p><h5>4. John Coumantarios Art Gallery</h5><p>This gallery features a permanent collection of 40 paintings, as well as, a temporary, rotating exhibit of pieces from the National Art Gallery in Athens. The gallery is a small and intimate space.</p><h5>5. Eat out</h5><p>Sparta isn&#8217;t very big so there are only a few big places to eat. Diethnes is a long standing favorite place for locals and Restaurant Elysse is another popular, dual-tavern hot spot, which features Lakonian specialties.</p><h5>6. Visit the Acropolis and Theatre</h5><p>North of the Leonidas statue lies the hill of the acropolis. Here you can find the ruins of a theater from the 2nd-century B.C. Although it used to be one of the largest theaters in Ancient Greece, most of the stones from the site were later scavenged and used in subsequent construction projects.</p><h5>7. Explore the Menelaion</h5><p>A few miles outside of the city lies the Menelaion, a shrine from the 5th-century B.C. that was built to honor King Menelaus, husband of Helen of Troy. There is not a lot left to see of this site, but it&#8217;s worth a visit if you have extra time in Sparta.</p><h3 id=\"costs\">Typical Costs</h3><strong>Hostel prices</strong> &#8211; Hostels don&#8217;t exist in Sparta. Couchsurf or use Airbnb instead.<p>&#8211; Hostels don&#8217;t exist in Sparta. Couchsurf or use Airbnb instead.</p><p><strong>Budget hotel prices</strong> &#8211; You can find a room at 2-star hotel starting at about 40 EUR per night. Hotels at this price point typically include air-conditioning, a private bathroom, and free WiFi. Use <a href=\"https://www.booking.com/searchresults.en.html?city=-828690&amp;aid=362916&amp;no_rooms=1&amp;group_adults=1\" rel=\"noopener\" target=\"_blank\">Booking.com</a> as they consistently return the cheapest rates. On <a href=\"https://www.airbnb.com/?irgwc=1&amp;irclid=24aSyeyRVSO91P6T8RRvwxlWUkjXYMUUKzCZSU0&amp;ircid=4273&amp;sharedid=&amp;af=81115044&amp;iratid=9627\" rel=\"nofollow\" target=\"_blank\">Airbnb</a>, private rooms can be found around 20 EUR and entire homes (including studio apartments) can be rented for 30 EUR.</p><p><strong>Average cost of food</strong> &#8211; Restaurants will cost about 18 EUR for a nice dinner, even in the tourist area. If you really want to eat cheap, eat gyros (like kebabs). A Gyro is around 3 EUR and will easily fill you up. Most cafes will cost you around 9 EUR for a meal. If you cook your meals, expect to pay 50 EUR per week for groceries that will include pasta, vegetables, chicken, and other basic foods.</p><p><strong>Transportation costs</strong> &#8211; Sparta is pretty small and walkable, but taking the bus is a good option if you&#8217;re staying right in Sparta.  If you want to explore other areas, consider renting a car as the train doesn&#8217;t cover a lot of the surrounding region.</p><h4>Suggested daily budget</h4><p>50 EUR / $52 USD (<strong>Note:</strong> This is a suggested budget assuming you&#8217;re staying in an Airbnb, eating out a little, cooking most of your meals, and using local transportation. Using the budget tips below, you can always lower this number. However, if you stay in fancier accommodation or eat out more often, expect this to be higher!)</p><h3 id=\"tips\">Money Saving Tips</h3><ol class=\"guide-columns\"><li><strong>Take a self-guided tour</strong> &#8211; Whether you want to rent a car or not, don&#8217;t indulge in the guided tours that are often very costly. The ruins in the area are easy to get around and visit.</li><li><strong>Eat Gyros</strong> &#8211; Tasty, cheap, and readily available, gyros cost as little as 3 EUR and will satisfy your hunger for quite awhile. They are a good way to avoid racking up hefty restaurant bills.</li><li><strong>Visit in the off-season</strong> &#8211; August is the most expensive month, so if you can arrange for a visit before June which would really cut down your accommodation and flight costs by up to half.</li></ol><h3 id=\"resources\"><p>Booking Resources</p></h3><a href=\"https://www.nomadicmatt.com/travel-resources/\"><img src=\"https://www.nomadicmatt.com/wp-content/themes/nomadicmatt/images/companies_i_use_@2x.jpg\"></a><br> <a href=\"http://www.dpbolvw.net/click-3032045-12356898-1443635018000\"><img src=\"https://media.nomadicmatt.com/siteimages/intrepid-guides.png\"></a><p id=\"wn-insurance-quote-editor\"></p><p>  </p><p>Photo credits: <a href=\"https://flic.kr/p/qwceMX\" rel=\"noopener\" target=\"_blank\">2</a>, <a href=\"https://flic.kr/p/KGfUEH\" rel=\"noopener\" target=\"_blank\">3</a>, <a href=\"https://flic.kr/p/8wzVPV\" rel=\"noopener\" target=\"_blank\">4</a>, <a href=\"https://en.wikipedia.org/wiki/File:Mistra_12.jpg\" rel=\"noopener\" target=\"_blank\">5</a></p></div>","title":"Sparta Travel Guide: What to See, Do, Costs, & Ways to Save"}},"pageContext":{"id":"5b95ea2287be05832748ff83"}}