{"data":{"mongodbDatabaseArticles":{"id":"5b921d1187be0571ac1b04ec","content":"<div><h1></h1>\n<h1>My story</h1>\n<p><strong>Beginning of my journey:&#160;</strong></p>\n<p>After starting and selling two successful businesses in the United States, I left the country to travel the world. </p>\n<p>While I&#8217;ve always had an independent, entrepreneurial streak, I had followed the conventional wisdom of the tim<img class=\"wp-image-16162 alignright\" src=\"http://nomadcapitalist.com/wp-content/uploads/2012/11/Nomad-Capitalist-About-Andrew-Henderson-2-467x467.png\" alt=\"\" width=\"335\" height=\"335\">e in a few ways that ended up costing me. I had invested a sizable portion of my money in mutual funds and real estate. When the stock market crashed in 2008, much of my savings disappeared and sensing the risks of the looming mortgage loan crisis, I managed to get out just in time and avoided losing even more money. On top of this, I had also just taken a huge loss in taxes after selling the businesses.&#160; &#160;</p>\n<p>The feeling of losing the fruits of my labor to something out of my control was quite devastating. It was extremely depressing&#160;to realize that while crony capitalists were succeeding at manipulating government policy, job creators running small businesses like myself were essentially getting the shaft.</p>\n<p>While I knew something was wrong with the system that I was willfully participating in, and I no longer wanted to play casino with my money, I still wasn&#8217;t sure of a solution. </p>\n<p>After having to call a business client while in Asia, it hit me that I no longer needed to be tied to one location to make money, and that each location offers different advantages to optimizing your business and lifestyle.</p>\n<p><strong>Searching for&#160;true freedom:</strong></p>\n<p>So I started to search for a solution, and ways to take back control of my businesses and life. I looked for places and business structures that would allow me to live a life of true freedom and choose how to spend my hard-earned money. Not only places that would be more favorable from a tax standpoint, but places that could diversify my risks and ensure my well-being even if the economy of my home country were to crash again.</p>\n<p><strong>I&#8217;ve spent the past 10 years finding solutions to these issues. I&#8217;m constantly on the move and observe the happenings in countries across all continents of the world</strong>. I want to get the most up to date, on the ground information of what the direction of a country is going is and how easy it is to actually employ the purported solutions available in each one.</p>\n<p>Whether that&#8217;s spending an entire summer in Europe, meeting with the top 2-3 tax lawyers in each country, or packing my bags on a last minute tip to meet with one of the largest investors in Turkey, this is the work that I live for.</p>\n<p>As fun and exciting as this life may sound, that doesn&#8217;t mean I haven&#8217;t had my failures. </p>\n<ul>\n<li><p class=\"s1\">I once spent seven months learning Norwegian in preparation for a fact-finding mission to Norway and the most important take away from the trip ended up being that I spent too much time focusing on the wrong things, as nearly everyone there spoke perfect English.&#160;</p>Still, this was a learning experience, and I&#8217;ve come to understand that the positives of imperfect actions accumulate and are always preferable to the negligible results you would get from perfect inaction.</li>\n<li>I was robbed at gunpoint while walking around Nicaragua. As much as the governments of the West use travel warnings and the like to try to scare us away from traveling to the developing world, I learned there is such a thing as being overexuberant and no investment is worth risking your personal safety over.</li>\n<li>While Mongolia might have exciting interest rates on their bank accounts, after visiting the country and meeting with experts there, I realized that the amount of risk in doing business there is way too high for me to conscionably recommend opening a Mongolian bank account to anyone.</li>\n</ul>\n<p>But all of these unfortunate experiences can lead to something good. I&#8217;m at a stage in life now where I can help people reach a level of success that&#8217;s taken me a decade to achieve much more quickly. <strong>By asking what your desired end result is, I can <a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\" target=\"_blank\" rel=\"noopener\">work with you</a> to map out a game plan for getting there as quickly as possible, so you don&#8217;t have to make the mistakes that I have. </strong></p>\n<p>And even if you don&#8217;t choose to work with me, my blog and products that I offer will help you get a start that I only could have wished for when I was younger. </p>\n</div>","title":"About Nomad Capitalist"}},"pageContext":{"id":"5b921d1187be0571ac1b04ec"}}