{"data":{"mongodbDatabaseArticles":{"id":"5b96249187be058327490eb2","content":"<div><p><img src=\"http://photos.foxnomad.com/NorthAmerica/California/San-Francisco/i-ngK6tD9/0/M/CIMG3591-M.jpg\" align=\"left\" height=\"187\" width=\"126\">Organizing a move from one home to another takes time and effort initially but saves you a number of headaches when you finally begin to settle in. The same is true of packing our carry-ons and suitcases. People tend to wait until the last minute and stuff their baggage with whatever they can find. The result is once you arrive at your destination you waste time site seeing muddling through your disorganized suitcase.</p>\n<p>I&#8217;ve taken Lifehacker&#8217;s <a href=\"https://lifehacker.com/347680/five-essential-tools-for-moving\">5 essential tools for moving</a> and adapted them for lazy travelers.</p>\n<p><strong>Labels</strong></p>\n<p>Using a labeler or masking tape gifts (ones you are taking or bringing back). It amazes me how many people don&#8217;t do this and end up spending time looking for the proper package opening each one. You can also use labels to mark what groups of clothes are clean or dirty.</p>\n<p></p>\n<p><strong>Ziploc Bags</strong></p>\n<p>Save time going through airport security by prepackaging all of your &#8220;liquids&#8221; in ready ziploc bags. You should also store any small items that tend to get lost in the nether regions of any bag &#8211; digital camera memory cards, outlet adapters, and pens. Of course, label the bag!</p>\n<p><strong>Zip Ties</strong></p>\n<p>These work great to tie the zippers of your carry on bags together to prevent crafty thieves. Travelers are easy prey for <a href=\"http://www.foxnomad.com/2007/03/10/pickpockets-in-action-the-map-scam/\">crooks with quick hands</a>. Travelers are tired, in a rush, and not at the airport for every long. For those of you who <a href=\"http://www.foxnomad.com/2008/02/01/save-space-in-your-suitcase-by-tying-your-extra-shoes-to-your-carry-onbackpack/\">tie your shoes to your carry on</a>, you can secure lose laces with a zip tie or two.</p>\n<p><strong>Sliders</strong></p>\n<p>These little disks make moving bulky luggage much easier, taking the load off of your tired arms. Even if your a bouncer at<img src=\"https://foxnomad.com/wp-content/uploads/2008/02/sliders_sm1.png\" align=\"right\" height=\"115\" width=\"179\"> a local nightclub bring a set for when a suitcase wheel inevitably breaks. Depending of your luggage design you may need a slider to get around.</p>\n<p><strong>Protective Plastic Wrap</strong></p>\n<p>Those of you who&#8217;ve been to India or Turkey have seen wrapping stations that encase an entire suitcase in thick plastic to protect the exterior. Ample protective plastic wrap servers the same purpose and can be used to plug up any holes your bags have earned along the way. Protective plastic wrap can also be used to save your fragile gifts from damage during handling.</p>\n<p>Aside from these essential moving tools you&#8217;ll want to keep your <a href=\"http://www.foxnomad.com/2007/09/06/small-travel-essentials/\">small travel essentials</a> with you (in a ziploc bag). All of this organizing takes time, so cut corners by pre-packing <a href=\"http://www.foxnomad.com/2007/03/05/10-of-essentials-rule/\">10 of each essential clothing item</a> or <a href=\"http://www.belazier.com/2007/06/26/how-to-get-someone-else-to-pack-for-you/\">get someone else to pack for you</a> all together.</p>\n<p>[photo by: <a href=\"https://www.flickr.com/photos/dpattinson/\">travelight</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Using 5 Essential Moving Tools For Packing"}},"pageContext":{"id":"5b96249187be058327490eb2"}}