{"data":{"mongodbDatabaseArticles":{"id":"5b93833f87be056953db7e41","content":"<div><h1 name=\"3b63\" id=\"3b63\" class=\"graf graf--h3 graf--leading graf--title\">The practical guide to having a remote&#160;company.</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*iHgw5HqErwL7lLdiZAsS7w.png\"><p name=\"75e2\" id=\"75e2\" class=\"graf graf--p graf-after--figure\">Would you believe me if I told you I had not met my CFO for the 8 years we worked together? In fact, I barely met more than a single-digit fraction of my team.</p><p name=\"b506\" id=\"b506\" class=\"graf graf--p graf-after--p\">In 2006 I had a dream of having a business that I could operate from anywhere. Who wants to be cooped up in a booth anyway? Not me. Not even for free kombucha and a climbing wall.</p><p name=\"1a17\" id=\"1a17\" class=\"graf graf--p graf-after--p\">The remote business I founded is called Mad Mimi, which in 2014 sold to GoDaddy.</p><p name=\"03ae\" id=\"03ae\" class=\"graf graf--p graf-after--p\">My company operated with over 50 remote full time employees and a number of remote contractors, working across countries, continents and time-zones, with no physical shared space. Ever.</p><p name=\"bef9\" id=\"bef9\" class=\"graf graf--p graf-after--p\">Here&#8217;s a glimpse into how we did things.</p><h3 name=\"e398\" id=\"e398\" class=\"graf graf--h3 graf-after--p\">The culture.</h3><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*utxnzWdDfKd6RV-GS2xXjQ.png\"><p name=\"830a\" id=\"830a\" class=\"graf graf--p graf-after--figure\">Culture is based on talent and the way people communicate. Let&#8217;s start with talent and we&#8217;ll get onto communication shortly.</p><p name=\"f4bb\" id=\"f4bb\" class=\"graf graf--p graf-after--p\">Unusually talented people can influence your culture profoundly because they&#8217;re inspiring and brilliant. Recruiting this uncommon talent requires an uncommon approach.</p><p name=\"f839\" id=\"f839\" class=\"graf graf--p graf-after--p\">For engineers, my favorite place to probe for talent is the world of open source. This is a talent pool. Most common disciplines&#8202;&#8212;&#8202;like development, marketing, design&#8202;&#8212;&#8202;have talent pools, and they&#8217;re not hard to find. Engineers that contribute a good deal to open source repositories are usually self-motivated and love to code. They consider themselves craftspeople. The same goes for other disciplines like design and marketing.</p><p name=\"9cdb\" id=\"9cdb\" class=\"graf graf--p graf-after--p\">Since the world is your oyster&#8202;&#8212;&#8202;you&#8217;re remote, remember&#8202;&#8212;&#8202;you can identify interesting contributors, read their blogs, and judiciously solicit their help on your project. If you&#8217;re smart, you&#8217;ll learn about them first, reference that you know what they&#8217;re about, and choose locations carefully (see later in the article). 9 out of 10 of these notables will ignore you, but you won&#8217;t come away empty handed if you invest the effort&#8230; and it is worth it. This talent can be magnetic in its respective field.</p><p name=\"efaf\" id=\"efaf\" class=\"graf graf--p graf-after--p\">But be prepared. Talent-pool luminaires are seldom looking for a job and will usually opt for limited consulting engagements, if at all. That&#8217;s okay because they can do good work (though they don&#8217;t always) and they can attract other talent. Mentioning an authoritative name tells a lot about your culture to subsequent talent. For them, it&#8217;s an easy way to identify cultural synergies. A third virtue is you&#8217;ll get to learn a lot. When you&#8217;re engaged and surrounded by uncommon talent, you position yourself to become a heavy-hitter. Your culture just revved its engine. Vroom.</p><p name=\"805b\" id=\"805b\" class=\"graf graf--p graf-after--p\">My rules of thumb: always start at the top and work your way down. Be humble but not bashful.</p><h3 name=\"5047\" id=\"5047\" class=\"graf graf--h3 graf-after--p\">How to keep talented people&#160;happy.</h3><p name=\"ccac\" id=\"ccac\" class=\"graf graf--p graf-after--h3\">Praise.</p><p name=\"44d6\" id=\"44d6\" class=\"graf graf--p graf-after--p\">Sincere, prompt, frequent, praise.</p><p name=\"9082\" id=\"9082\" class=\"graf graf--p graf-after--p\">In a remote setting, sincere praise can be delivered without the awkwardness or intensity of being close to the person. This is a plus for people who feel uncomfortable or don&#8217;t know how to respond to compliments.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*mRf_fe7s19zsQFPBvyFUgQ.png\"><p name=\"5480\" id=\"5480\" class=\"graf graf--p graf-after--figure\">All praise should be direct and articulate. Not, &#8220;you&#8217;re doing a great job, Joe,&#8221; but rather, &#8220;I friggin love every line of CSS you write; it&#8217;s pure art.&#8221; Or, &#8220;do you have any idea how hard it is to find people like you!?&#8221;</p><p name=\"b0f7\" id=\"b0f7\" class=\"graf graf--p graf-after--p\">Granted, if you can&#8217;t find anything nice to say, you probably shouldn&#8217;t be working together.</p><h3 name=\"44e6\" id=\"44e6\" class=\"graf graf--h3 graf-after--p\">Speaking is performance. Writing is about&#160;ideas.</h3><p name=\"b5f0\" id=\"b5f0\" class=\"graf graf--p graf-after--h3\">When you write, you get to refine and filter ideas. While speaking is a superb vector to convey ideas, for ordinary conversation the virtues of writing outshine those of speaking.</p><p name=\"ea3c\" id=\"ea3c\" class=\"graf graf--p graf-after--p\">Good grammar, dignified and articulate communication standards help make everyone more intelligent. Poorly conceived one-liners, like, &#8220;yes do it and also tell jo$e to get me the numbet&#8221; will ruin whatever mojo you might have had.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*5adM4b_sBrEchzCUgiH6EQ.png\"><p name=\"c4e2\" id=\"c4e2\" class=\"graf graf--p graf-after--figure\">But if I write all the time, won&#8217;t the lack of body language and facial expression make miscommunication much more likely?</p><p name=\"fea5\" id=\"fea5\" class=\"graf graf--p graf-after--p\">Because the medium of text lacks the support of facial signals, what is intended as neutral can be construed as austere, and here&#8217;s how to fix that.</p><p name=\"99c4\" id=\"99c4\" class=\"graf graf--p graf-after--p\">By applying light-hearted gestures and banter when communicating, you can&#8202;&#8212;&#8202;and should&#8202;&#8212;&#8202;set a cheerful tone. It&#8217;s similar to always talking with a smile, and this is important&#8202;&#8212;&#8202;both in customer relationships and also internally. Remote communication can always beam. Why? Because with text, a smile is a mere choice of words. Physically, it&#8217;s a facial contortion that doesn&#8217;t work when the emotion behind it isn&#8217;t aligned. Therefore even if you&#8217;re having a bad day, you can still be nice.</p><p name=\"0710\" id=\"0710\" class=\"graf graf--p graf-after--p\">But not all messages are beamy. Let&#8217;s talk about rebuke.</p><p name=\"f581\" id=\"f581\" class=\"graf graf--p graf-after--p\">All criticism should be delivered constructively and with affection. The good thing is that text is on your side. By means of text, you have time to think and be deliberate. Sensitive dialog however, sometimes needs the personal exchange factor.</p><h3 name=\"d55f\" id=\"d55f\" class=\"graf graf--h3 graf-after--p\">Pointing out flaws in&#160;public.</h3><p name=\"2a09\" id=\"2a09\" class=\"graf graf--p graf-after--h3\">Delivering a balanced critique or reprimand to a team via chat is sometimes appropriate. Humiliating or shaming team members in front of a group is not. Even making fun of team members&#8217; or customers&#8217; accidental errors can be injurious to your company culture.</p><h3 name=\"344d\" id=\"344d\" class=\"graf graf--h3 graf-after--p\">Don&#8217;t make fun of customers. Ever.</h3><p name=\"872a\" id=\"872a\" class=\"graf graf--p graf-after--h3\">Mocking customers creates an innate disdain for the people who matter most. Once this bad habit starts, you actually start believing that everyone is an idiot except yourself. This is called arrogance and no one likes arrogant people.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*2VpZ08saaGl7feid9zOvtw.png\"><p name=\"559c\" id=\"559c\" class=\"graf graf--p graf-after--figure\">Now that we know what not to do, here are a few points to make note when you need to point a finger at something undesirable.</p><h3 name=\"6531\" id=\"6531\" class=\"graf graf--h3 graf-after--p\">Text beats&#160;video.</h3><p name=\"6eea\" id=\"6eea\" class=\"graf graf--p graf-after--h3\">We try to keep back-and-forth communications in text, unless voice or video is vital for more sensitive matters. Text is asynchronous, searchable, recorded, informative and can be a good reference for others later, especially when valuable instruction is exchanged.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*1Su6sotFPIkhnDZDDSJ7tg.png\"><p name=\"5009\" id=\"5009\" class=\"graf graf--p graf-after--figure\">Voice and video are synchronous, and therefore disruptive. This disruption causes a loss of your mental cache and a loss of motivation. Recovery is uncomfortable and time-consuming, making this is a mega-inefficiency.</p><p name=\"3de6\" id=\"3de6\" class=\"graf graf--p graf-after--p\">Speaking of inefficiency, let&#8217;s move onto&#8230;</p><h3 name=\"8597\" id=\"8597\" class=\"graf graf--h3 graf-after--p\">Are people actually&#160;working?</h3><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*3WFi0YAv7O5eUdinl8qZlg.png\"><p name=\"e4eb\" id=\"e4eb\" class=\"graf graf--p graf-after--figure\">In a remote setting, workload is most often directed by a backlog. Some teams use Jira, other use tools like Pivotal Tracker while for a less geeky experience Trello is a solid option. Remote work is task oriented. This means that the tasks and their corresponding goals are clear, prioritized and recorded somewhere. Engineers have a backlog of development tasks, customer support has a backlog of tickets, designers have a backlog of components to design. A remote chat doesn&#8217;t inhibit banter about tasks and projects. Because your team is capable of communicating well, communication channels quickly become filled with friendly chatter, interesting educational matter and even people from other teams who come to sit in to listen and learn.</p><p name=\"862f\" id=\"862f\" class=\"graf graf--p graf-after--p\">Time-zone differences may have a slight social impact but informationally, team members are able to get up to speed on the time they missed by simply scrolling up in the chat channel.</p><p name=\"3c6a\" id=\"3c6a\" class=\"graf graf--p graf-after--p\">This allows people to happily work from&#8230;</p><h3 name=\"883e\" id=\"883e\" class=\"graf graf--h3 graf-after--p\">Anywhere.</h3><p name=\"be9f\" id=\"be9f\" class=\"graf graf--p graf-after--h3\">Remote work isn&#8217;t for everyone, and while it can be surprisingly fraternal there are those who see no substitute for having a tangible social ambiance, or the literal water cooler. Because people are mostly located in different cities, drinks-after-work and group luncheons, team-building events and parties are impossible. But here&#8217;s what is possible:</p><p name=\"3332\" id=\"3332\" class=\"graf graf--p graf-after--p\">Marc (our CTO) sits in his garden. Birds chirp. Dogs bark. Marc works.</p><p name=\"7fa4\" id=\"7fa4\" class=\"graf graf--p graf-after--p\">Rick has a giant comfy chair in a sun-drenched room in his house.</p><p name=\"f5ed\" id=\"f5ed\" class=\"graf graf--p graf-after--p\">Jeff works from a wood cabin in a remote town in Southern Africa. Luckily he has an LTE backup when his internet dies.</p><p name=\"cd3d\" id=\"cd3d\" class=\"graf graf--p graf-after--p\">Jamie is an introvert who stays at home with her four small dogs.</p><p name=\"f1e5\" id=\"f1e5\" class=\"graf graf--p graf-after--p\">Sandy and Themba both have small kids and babysitting help nearby. Being around family for lunch, and early bedtime is positive for them.</p><p name=\"f74c\" id=\"f74c\" class=\"graf graf--p graf-after--p\">Tammy currently works while traveling in Asia. Nearly every week Tammy is in a different city.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*zwF5qS6-UR8J6HgtxYBcVQ.png\"><p name=\"03ed\" id=\"03ed\" class=\"graf graf--p graf-after--figure\">I jump around a lot. These days I&#8217;ve been enjoying working from a tiny local caf&#233;. Can you guess where I&#8217;m located?</p><p name=\"bd1f\" id=\"bd1f\" class=\"graf graf--p graf-after--p\">Remote work is suitable people who like to explore, nature-lovers, moms, dads, introverts, people that love location-independence, people who can&#8217;t move and are located far away.</p><h3 name=\"9617\" id=\"9617\" class=\"graf graf--h3 graf-after--p\">Keeping in rhythm across multiple&#160;teams.</h3><p name=\"fb77\" id=\"fb77\" class=\"graf graf--p graf-after--h3\">How do you keep diverse teams informed?</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*DkhNOyOPE3ee6jiKBBevoA.png\"><p name=\"f7c8\" id=\"f7c8\" class=\"graf graf--p graf-after--figure\">I regret not having discovered this earlier, but once we started daily email based &#8220;standups&#8221; where each engineer would share what they worked on the day before, what they&#8217;re working on today, the challenges they&#8217;re experiencing and what their plan is the following day. This gets shared to multiple teams and enables people to respond with gratitude, comments and feedback.</p><h3 name=\"aedd\" id=\"aedd\" class=\"graf graf--h3 graf-after--p\">Compensation based on cost of&#160;living.</h3><p name=\"361e\" id=\"361e\" class=\"graf graf--p graf-after--h3\">When soliciting a multi-national team across markets, sensitivity to cultural and economic factors can make an impact. South Africa for example, is culturally synergic with English speaking countries with a far lower compensation average, making it economically interesting for US Dollar based companies.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/2000/1*DfaqSjtnt4iF2GS-9p3JSQ.png\"><p name=\"5b57\" id=\"5b57\" class=\"graf graf--p graf-after--figure\">When you&#8217;re small, you&#8217;re probably using independent contractor relationships if you have any foreign employees. As you grow however, you&#8217;ll need to consider authentic employment contracts for full time team members. It&#8217;s important to do a little research into which countries to steer clear of. Like Germany for example. When we switched from a contracting to full time employment agreement for an employee, we started paying nearly 100% of their compensation in fees and taxes.</p><p name=\"302e\" id=\"302e\" class=\"graf graf--p graf-after--p\">Working remotely had a huge impact on my life, my ability to be flexible with family, location and time. The same is true to many people on my team. And not only that, but the number of team members who came in unskilled and today thrive as engineers, finance leaders, product leaders, marketing and business leaders is truly the biggest badge of honor.</p><p name=\"a831\" id=\"a831\" class=\"graf graf--p graf-after--p\">Go remote. Reward yourself.</p><p name=\"7211\" id=\"7211\" class=\"graf graf--p graf-after--p graf--trailing\"><a href=\"https://madmimi.com/signups/e1d91f83e7d547698a206e40c7f5bde7/join\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">P.S. Click here to subscribe for more stories like this.</a></p></div>","title":"The practical guide to having a remote company. – Yala Inc."}},"pageContext":{"id":"5b93833f87be056953db7e41"}}