{"data":{"mongodbDatabaseArticles":{"id":"5b95ea1187be05832748ff7d","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/barrierreef001.jpg\" alt=\"Great Barrier Reef\"><br> The Great Barrier Reef is one of the<a href=\"https://www.nomadicmatt.com/travel-blogs/best-places-to-go-scuba-diving/\"> best dive sites in the world</a>. Running up and down Queensland&#8217;s east coast in <a href=\"https://www.nomadicmatt.com/travel-guides/australia-travel-tips/\">Australia</a>, there are tons of fish to see as well as beautiful, vibrant coral dotting. I was excited to use <a href=\"https://www.nomadicmatt.com/travel-blogs/learning-how-to-scuba-dive/\">my newly acquired dive skills</a> and dive this reef. You always hear how great it is and I wanted to see it first hand. While diving, I got to see a shark, turtle, a ray, and a large fish take a poop right next to me. It was all an interesting experience:</p><p></p><br> <strong>Tips for Diving the Great Barrier Reef</strong><ul><li>Make sure you go with a company that has many dive permits. That allows them to choose the best dive site based on the same conditions and change reefs if one might be too popular. I went on the Tusa T5 and they have 15 dive spots, which is apparently the most out of any company in <a href=\"https://www.nomadicmatt.com/travel-guides/australia-travel-tips/cairns/\">Cairns</a>.</li><li>Though Cairns is the most popular jumping off spot, leaving from Port Douglas, Townsville, or Cape York will get you to much less touristy parts of the reef that are better preserved.</li><li>Dives cost between $169- 250 AUD.</li><li>Even if you don&#8217;t want to dive, most dive trips will let you join and snorkel the reef.</li><li>If you don&#8217;t have a dive camera, most of the bigger boats have some for rent.</li></ul><p>I think the diving on the west coast of Australia is better. The Ningaloo reef has a lot more fish and the reef is more pristine. However, the Great Barrier Reef is like nothing else I&#8217;ve ever seen and if you get away from the areas where all the day trips go, you&#8217;ll find a very pristine environment.</p><p>Photo Credit: <a href=\"https://www.flickr.com/photos/lockthegatealliance/16318890626/\">1</a></p></div>","title":"Diving the Great Barrier Reef"}},"pageContext":{"id":"5b95ea1187be05832748ff7d"}}