{"data":{"mongodbDatabaseArticles":{"id":"5b93834887be056953db7e48","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*frmmAApIaDQXLrsWpfBe8A.jpeg\"><h1 name=\"a63c\" id=\"a63c\" class=\"graf graf--h3 graf-after--figure graf--title\">The 3/2/2/1 Method: Using Self-Awareness to Work Well&#160;Remotely</h1><p name=\"941f\" id=\"941f\" class=\"graf graf--p graf-after--h3\">On any given weekday, I work for approximately eight hours. You might say this is average. Normal, for American standards. There&#8217;s just one caveat&#8212;I work remotely, from different places almost every day, all over the world, with a program called Remote Year. I move to a different international city once a month, where I work remotely for a Boston-based company called Wistia.</p><p name=\"f5aa\" id=\"f5aa\" class=\"graf graf--p graf-after--p\">Remote work is certainly picking up speed. It seems like every week, an article comes out praising its benefits and warning about its potential issues. Working remotely is not a quick-and-dirty setup. Simply getting a remote-friendly or remote-first job does not set an employee up for success. First, they must develop a process that allows them to be productive, connected to their team, and have a healthy work/life balance.</p><p name=\"44e7\" id=\"44e7\" class=\"graf graf--p graf-after--p\">Although I&#8217;ve worked remotely for companies in the past, the kind of moving-heavy lifestyle I currently lead is a bit different from setting up in your home office every day. It requires patience, discipline, and a little creativity.</p><p name=\"a6dc\" id=\"a6dc\" class=\"graf graf--p graf-after--p\">After three months of testing, I&#8217;ve found a working process that (ahem) works for me. I call it 3/2/2/1.</p><h4 name=\"92e9\" id=\"92e9\" class=\"graf graf--h4 graf-after--p\">The math: separating time</h4><p name=\"918c\" id=\"918c\" class=\"graf graf--p graf-after--h4\">Working from Europe for the past three months has opened my eyes to the different ways in which people interact with the world. From obvious changes, such as using 24 hours to tell time instead of A.M./P.M., or the &#8220;siestas&#8221;, or mid-day breaks folks take to refresh themselves, I&#8217;ve found these changes making an impact on the way I work and live.</p><p name=\"30bf\" id=\"30bf\" class=\"graf graf--p graf-after--p\">Here&#8217;s how I see it. I have 24 hours in a day. I need 8 hours to sleep and wake up refreshed. This leaves me with 16 hours that I can split up between work and play. In a regular office setting, we sit down for work (not including an hour lunch break) for approximately 7 hours a day.</p><p name=\"8a4b\" id=\"8a4b\" class=\"graf graf--p graf-after--p\">These 7 hours are when I&#8217;d like to be at my most productive. I want to sit down and use this time to knock out a chunk of work on large projects. I don&#8217;t want to procrastinate, spend time on social media, or feel pulled apart by several small tasks. I love working remotely because it allows me the freedom to work when I&#8217;m most productive, instead of simply when everyone else is in the office. I have agency over my &#8220;deep work&#8221; time.</p><blockquote name=\"61fc\" id=\"61fc\" class=\"graf graf--pullquote graf-after--p\">If I can make every one of those 7 hours incredibly meaningful, that&#8217;s in stark contrast to a regular 8 hour day in the&#160;office.</blockquote><p name=\"c520\" id=\"c520\" class=\"graf graf--p graf-after--pullquote\">Having 7 hours of uninterrupted &#8220;deep work&#8221; time is not only highly improbable, but it&#8217;s absolutely unsustainable. Our brains need breaks from constant focus. This decompression is vital to future concentration. In offices, we try to kick-start this decompression by adding pinball tables, ping pong, lunches, etc. Splitting time up into three, two, and one hour sections allows our brains to have focused concentration time in spurts, with rest and recharging in between.</p><h4 name=\"6364\" id=\"6364\" class=\"graf graf--h4 graf-after--p\">The 3/2/2/1&#160;method</h4><p name=\"1941\" id=\"1941\" class=\"graf graf--p graf-after--h4\">I spread out these 8 hours in intervals of 3/2/2/1. This is a constant exercise mostly in self-awareness and discipline. After reading an <a href=\"https://hbr.org/2007/10/manage-your-energy-not-your-time\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">HBR article about managing energy</a>, I began to try and become more aware of where my energy levels were throughout the day. For me, &#8220;high energy&#8221; means that I&#8217;m mentally fresh, rested, focused, and am able to slip into deep work and strategic thinking. &#8220;Low energy&#8221; means that I&#8217;m lethargic, unable to focus, working on multiple things at once because I&#8217;m not prioritizing well, or am simply not as sharp as during high energy times.</p><p name=\"49e8\" id=\"49e8\" class=\"graf graf--p graf-after--p\">I realized I was most productive in the early morning, before breakfast. I&#8217;m an early riser, and am very high energy between the hours of 6:30&#8211;9:30. I begin to slump at 9:30. Usually, this is when I get breakfast and start getting antsy. In the office, I might walk down to the kitchen, grab a snack I don&#8217;t actually need, pet the office dog, and go back to my computer. That sounds fine, but once I&#8217;m back at my laptop, I&#8217;m unfocused.</p><p name=\"ba92\" id=\"ba92\" class=\"graf graf--p graf-after--p\">There&#8217;s a cycle at work here. Our energy levels are up and down throughout the day, and they&#8217;re impacted by everything from how much sleep you had the night before, to what the weather is like outside. Managing those levels can help us channel them into productivity and joy.</p><p name=\"70ce\" id=\"70ce\" class=\"graf graf--p graf-after--p\">I spread my day out based on my energy levels. In the morning when I&#8217;m most productive, I work for three hours. I start with prioritizing my projects for the day using the <a href=\"https://gone-app.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Gone App</a>. This helps me understand what I need to focus on for the day. I work through quick emails from the previous evening and start/work on/finish my largest project for the day. Once I lose my energy and begin feeling unfocused or lethargic (usually around the three hour mark), I get breakfast, take a walk to explore the city I&#8217;m currently in, go to a farmer&#8217;s market, go on a hike, etc.</p><p name=\"4fd6\" id=\"4fd6\" class=\"graf graf--p graf-after--p\">From there, I focus on keeping an eye on my energy levels throughout the day. Once I feel myself becoming more aware, more alert, I know it&#8217;s time to sit down and work. I might head to my co-working space, or find a cafe with good WiFi to stop in. I do another 2 hours of work, take phone calls and meetings, make a dent on another project. From there, I check in with myself. If my energy is down, I&#8217;ll pause, walk to a place for lunch, perhaps sit in a park, or even take a nap. Then it&#8217;s another 2 hours of work before dinner. I finish up the project I prioritized for the day. I make or go out to dinner with friends, and take an hour to follow up with any emails that need replying before any other plans take hold. From there, I&#8217;m free to go out for drinks, go see a movie, or participate in any evening plans as usual. That completes the 3/2/2/1 cycle.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*l5HEetDe-C8px-_Y_2rZEQ.jpeg\">Photo by <a href=\"http://www.leujaycruz.com/\" class=\"markup--anchor markup--figure-anchor\" rel=\"noopener\" target=\"_blank\">Leujay Cruz</a>, at our co-working space in Split,&#160;Croatia<p name=\"d3fa\" id=\"d3fa\" class=\"graf graf--p graf-after--figure\">3/2/2/1 doesn&#8217;t have to be in that order for everyone. Switch up your hours to match your energy and productivity levels. Because I&#8217;m most productive in the morning, for example, I use the bulk 3 hour portion of 3/2/2/1 right when I wake up.</p><h4 name=\"40a0\" id=\"40a0\" class=\"graf graf--h4 graf-after--p\">Work/life balance when working&#160;remotely</h4><p name=\"3303\" id=\"3303\" class=\"graf graf--p graf-after--h4\">In order to be productive and healthy while working remotely, a successful work/life balance has to be achieved. This is easier said than done. Often, working outside of the office, especially when alone, seems to have a time-warping effect. You wake up, turn on your laptop, work for a while, and oh no it&#8217;s 8pm already, how did that happen?</p><blockquote name=\"6302\" id=\"6302\" class=\"graf graf--pullquote graf-after--p\">Spreading work out into the entire day might seem like work is taking over your life, but in fact, it decreases my work-related stress.</blockquote><p name=\"8678\" id=\"8678\" class=\"graf graf--p graf-after--pullquote\">There&#8217;s no more countdown clock for how much time I have left before the workday is over. I&#8217;m free to work when I&#8217;m most able to deliver. Everything gets done, and I don&#8217;t sacrifice my daytime hours.</p><p name=\"d50e\" id=\"d50e\" class=\"graf graf--p graf-after--p\">3/2/2/1 allows me to have a richer daily experience by allowing myself the time I need to recharge, get inspired, and make the most of my day. I don&#8217;t have the experience of waking up, going to work, coming back home and going to bed. Instead, I&#8217;m able to experience a full day without feeling deprived of time. I don&#8217;t have to be boxed in by time zones, a common theme for remote employees, because I&#8217;m sure to overlap with my colleagues throughout the day. I&#8217;m able to stay in deep work sessions that don&#8217;t drain me, and focus on my prioritized projects.</p><p name=\"d319\" id=\"d319\" class=\"graf graf--p graf-after--p\">Work is a part of life&#8212;it should be something that helps you feel fulfilled, accomplished, and productive. Spreading work out to fit your energy levels will allow you to be more productive, and dare I say it, happier. For me, the 3/2/2/1 method creates a complete harmonious day, with both work and play doing their part in helping me be both very productive and experience driven.</p><h4 name=\"5d74\" id=\"5d74\" class=\"graf graf--h4 graf-after--p\">My experience is&#160;unique</h4><p name=\"10f6\" id=\"10f6\" class=\"graf graf--p graf-after--h4\">The 3/2/2/1 method may not apply to you. On Remote Year, I am in a constant state of flux. I move once a month, sometimes more. I work from a co-working space, a cafe, my apartment, a park with a Wi-Fi hotspot, the patio of a local bar. I am able to take everything I need to work with me in my backpack, to be carried at all times, just in case &#8220;high energy&#8221; comes unexpectedly. My job doesn&#8217;t require very many in-person meetings. This means I don&#8217;t require very quiet spaces to work. I&#8217;m lucky to have noise-cancelling headphones with me wherever I go to make sure I can work in almost any environment.</p><h4 name=\"c1b8\" id=\"c1b8\" class=\"graf graf--h4 graf-after--p\">Managing your energy&#160;levels</h4><p name=\"6b4a\" id=\"6b4a\" class=\"graf graf--p graf-after--h4\">Whether or not you can implement 3/2/2/1 fully, being self aware and managing your energy levels can help create a full integrated day, balancing work and play, and giving you more agency over your day. Start by:</p><ul class=\"postList\"><li name=\"5746\" id=\"5746\" class=\"graf graf--li graf-after--p\">Identify when you feel the most productive. Is it right before you wake up? Is it after dinner, and into the night? When do you find yourself doing the bulk of your prioritized projects? When are you in deep work?</li><li name=\"d9a0\" id=\"d9a0\" class=\"graf graf--li graf-after--li\">Check in with yourself once every two hours. Ask yourself &#8220;am I feeling high energy or low energy?&#8221;.</li><li name=\"dd4f\" id=\"dd4f\" class=\"graf graf--li graf-after--li\">Feed your low energy brain. Find the things that re-charge you. Perhaps it&#8217;s a long walk or a bicycle ride. Maybe it&#8217;s going to the gym or going to a gallery.</li><li name=\"ad50\" id=\"ad50\" class=\"graf graf--li graf-after--li\">Switch up your routine. If you&#8217;re able to, try working from different places. Cafes or parks with Wi-Fi are excellent places to sit down and work. Try using <a href=\"https://itunes.apple.com/us/app/wha-by-work-hard-anywhere-wifi-cafes-and-spaces/id930384923?mt=8\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">Work Hard Anywhere</a> to find great places to settle down for a couple of hours. If you&#8217;re able to focus in places like these, you&#8217;ll get an inspiration boost that can help you be more experience driven.</li><li name=\"3c12\" id=\"3c12\" class=\"graf graf--li graf-after--li\">Prioritize your work. Find the project that you want to focus on for the day, and use the bulk of your 3 hour interval to complete it. I use <a href=\"https://gone-app.com\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">Gone App</a> for this. 3/2/2/1 doesn&#8217;t have to happen in that order&#8212;whenever you feel most productive is where the 3 hour portion should fit.</li></ul><p name=\"65a6\" id=\"65a6\" class=\"graf graf--p graf-after--li graf--trailing\">I&#8217;d love to hear your strategies for staying productive and happy while working remotely. Reply here, or reach out to me on twitter at @margotcodes. If you thought this post was interesting, send me a &#128079;&#127995;.</p></div>","title":"The 3/2/2/1 Method: Using Self-Awareness to Work Well Remotely"}},"pageContext":{"id":"5b93834887be056953db7e48"}}