{"data":{"mongodbDatabaseArticles":{"id":"5b9629a387be0583274911a0","content":"<div><p>Welcome to&#160;<a href=\"http://www.hippie-inheels.com/backpackers-boutique\" target=\"_blank\">Backpacker&#8217;s Boutique</a>. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Medellin</h1><p><strong>Tell us a little about Medellin&#160;and tell us why you&#8217;re an expert on luxury travel there.&#160;</strong></p><p>I&#8217;ve been <a href=\"http://www.girlabouttheglobe.com/blog/living-medellin/\">living in Medellin</a><strong>,</strong> Colombia&#8217;s second largest city for the last 7 months and I absolutely love it here. One of the reasons is because you can live in an amazing city for the fraction of the cost of living in London as everything is so much cheaper here. Being a writer for Medellin Living, the city&#8217;s expat website, I have reviewed bars, restaurants, shopping centres and things to do in the city so I guess you could say that I know my way around a cocktail bar or two.</p><p>Editors note: Lisa just wrote an e-book and I wanted to share that with you. It&#8217;s the <a href=\"http://www.amazon.co.uk/Female-Guide-Solo-Travel-Discover-ebook/dp/B00U7WYVEW/ref=sr_1_1?ie=UTF8&amp;qid=1426077813&amp;sr=8-1&amp;keywords=a+female+guide+to+solo+travel\" target=\"_blank\">female&#8217;s guide to solo travel</a>.&#160;</p><p><img class=\"aligncenter size-full wp-image-9425\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/1354729251_21cd0d9e79_b.jpg?resize=560%2C374&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"374\"><a href=\"https://www.flickr.com/photos/willygil/1354729251\" target=\"_blank\">source</a></p><p><strong>What makes Medellin a perfect destination for travelers seeking a glamorous trip?</strong></p><p>There are swanky hotels, rooftop bars, a revolving restaurant, casinos and more shopping malls than you can shop at. Medellin is fast becoming the fashion capital of Colombia and it&#8217;s evident in the locals (the Paisas) style and heels seem to go with everything so this city is pretty glamourous. This city has amazing views and there are so many rooftop bars with stunning views.</p><p><strong>What boutique hotel would you recommend to your friends that are stopping through?</strong></p><p>If they have money (and I mean a lot), I would definitely recommend <a href=\"http://www.booking.com/hotel/co/art.html?aid=809221%20\" target=\"_blank\">The Art Hotel</a>. It is is a creative blend of style, architecture and modern art and is amazing, and tucked away in a side street so it feel like a secret place.</p><p>But the rooms are very expensive so if you can&#8217;t afford to stay there, you can just buy a cocktail in its boutique wine bar instead. There&#8217;s a quaint little courtyard for a taste of tranquility amongst outdoor living and is the perfect setting for a Cosmopolitan which is a fraction of the cost of a room.</p><p><img class=\"aligncenter size-full wp-image-9424\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/9.jpg?resize=560%2C374&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"374\"><a href=\"http://en.arthotel.com.co/photos/\" target=\"_blank\">source</a></p><p><strong>What about 5 Star, of them all, which is the best in your town?</strong></p><p><a href=\"http://www.booking.com/hotel/co/diez-categoria.html?aid=809221%20\" target=\"_blank\">The Diez Hotel</a> is just gorgeous. It&#8217;s located in the El Poblado area of Medellin, and you feel as though you are immersed in forest surroundings amongst green textured walls and a bamboo decor. The whole theme of the hotel is natural elements and cit ombines the senses of landscapes and ambience for the perfect relaxation experience.&#160;The rooms all have the same natural elements and my favourite part of this hotel is the outdoor spa area with a steam room, sauna and jacuzzi. It&#8217;s really close to the main nightlife area with restaurants and bars but with a lobby bar and a Sushi restaurant on the ground floor, you don&#8217;t even need to leave the building. I love this place!</p><p><strong>Are there any fun activities for the adventurous traveler?</strong></p><p>Every Sunday there is a boat trip to the stunning lake area of Guatape which is just two hours outside the city. It has a bay to rival that of the Rio Harbour and you can climb the Penol Rock for spectacular views of the bay. Plus, ladies go free! Can&#8217;t get more glamorous than that. If you&#8217;re feeling really adventurous then you can paraglide across the city from the mountains surrounding the valley. I definitely recommend taking the <a href=\"http://www.girlabouttheglobe.com/blog/medellin-city-tour/\">Medellin city tour </a>to learn more about the city.</p><p><img class=\"aligncenter size-full wp-image-9428\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/Nice-artchitecture.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"420\"></p><p><strong>Where are the best hang outs during the day?</strong></p><p>Colombians love to hang out and there are so many places to hang out including numerous coffee shops and parks. You&#8217;ll often see older men sat in local parks playing cards, musical instruments or just chatting. Because this city is always a warm temperature, people sit Al Fresco and enjoy the sunshine. Parque Poblado is one of the best parks to hang out in. It&#8217;s in the centre of Poblado and is surrounded by handicraft sellers and bars and restaurants, and you&#8217;ll find locals and tourists there at night, listening to some live music and having a drink before partying in one of the local bars.</p><p>The best hang outs during the day are Ciudad del Rio with cafes and an ice-cream parlour. Then there&#8217;s Parque Poblado and Parque Berrio, opposite Plaza Botero with the big statues that just have to be seen.</p><p><img class=\"aligncenter wp-image-9429\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/Plaza-Botero.jpg?resize=560%2C835&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"835\"></p><p><strong>If you have a big date night, what are the most delicious restaurants in Medellin&#160;and what are their best dishes?</strong></p><p>Sinko does great Italian food. It&#8217;s sophisticated with multiple seating areas, whether you choose to relax on the outdoor terrace or inside on the leather sofas with a giant screen. They have special nights dedicated to salsa with DJ sets including sunset parties.&#160;Whether you choose a pizza or the fish and chips (my personal favourite), the food here won&#8217;t disappoint. The cocktails are great too!</p><p>For breathtaking views of the city, Tony Roma&#8217;s is situated on the top floor of the Hotel Dann Carlton. World famous for their BBQ ribs, the restaurant is the only revolving bar in Medell&#237;n offering a 360 degree panoramic view of the skyline.&#160;Elegant and oozing sophistication, you rotate your way around to the sounds of live piano music. Plus if you visit on a Tuesday you get 30% discount with your Visa card too!</p><p><img class=\"aligncenter size-full wp-image-9431\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/The-Woka-Lounge.jpg?resize=560%2C280&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"280\">Woka Lounge offers great sushi and Thai chicken dishes as well as their own Woka specials. It&#8217;s an amazing setting too and feels like a magical forest hidden high up in the city with tall trees and glass floors. A curved path lights up all the way to the giant bar with bubbling water underneath. Meaning reflection of the moon, Woka is just amazing.</p><p><strong>Let&#8217;s talk desserts- what place makes the best?</strong></p><p>There&#8217;s a chain restaurant called crepes and waffles which do the most divine nutella waffle with ice-cream. It just melts in your mouth. It has the best ice-cream I have come across in the city and you can also buy it to take out.</p><p>Me Late Chocolate is in Oviedo, and offers gorgeous chocolate delights for breakfast and during the day. It&#8217;s a boutique chocolate shop and the Volcan de Chocolate is to die for.</p><p><strong>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers?</strong></p><p>The barrio of Laureles has some of the best boutique shopping you&#8217;ll find in the city. There&#8217;s a choice of unique shops from multi-brand fashion to expensive designer jewellery with some cute cafes and restaurants for when you need a break from shopping. With footwear, clothing, designer bags, jewellery, house accessories, and paintings to furnish your apartment, La Tienda Imaginario is a place for the imagination with unusual items perfect for great souvenirs too. For Colombian brands visit Origen to get your hands on the local fashion, or try Make A Wish for high quality garments with nice designs.</p><p>In La Zona Rosa in El Poblado, you&#8217;ll find boutiques with unique designs along V&#237;a Primavera, one of my favourite areas of the city, known for its choice of gastronomy and creative designs. There are a range of shops here and you can easily spend an afternoon browsing each one whilst stopping for a coffee in Medell&#237;n&#8217;s best coffee shops. It&#8217;s easy to find Colombian designs here and Galer&#237;a Dise&#241;o has a wide range of items from over 40 independent designers.</p><p><strong>What are a couple of the best salons and spas in Medellin?</strong></p><p>Medellin is known for its stunning women and plastic surgery is really popular here. Some locals even go as far as getting a butt job!</p><p>You&#8217;ll find the best salons in the shopping malls. In Santa Fe, there are hair salons to pamper you hair on the top floor. Hotel Park 10 has a great day spa with treatments from a Cleopatra spa to a chocolate spa! They also offer different massages and even ultrasound.</p><p>The Dies Hotel has a lovely spa looking out at the mountains with a steam room, sauna and a jacuzzi. They offer a Secrets of The Amazon treatment for the full body which includes body peeling and a relaxation massage.</p><p><img class=\"aligncenter size-full wp-image-9426\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/6170280599_278020bacb_o.jpg?resize=560%2C560&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"560\"><a href=\"https://www.flickr.com/photos/haquintero/6170280599\" target=\"_blank\">source</a></p><p><strong>Time for a great sunset view&#8230; where would you go?</strong></p><p>Because Medellin is in a valley, if you&#8217;re staying in one of the hotels on a high floor then you&#8217;re nearly almost guaranteed a great sunset (if you&#8217;re facing the right way of course).</p><p>Pueblito Paisa is a cute little mock-up of a Colombian town which sits on top of Nutibarra Hill in the city with a panoramic view of the city, or you can hop in a car and drive up the valley to the best viewpoint where they also sell beers and street food as you watch the sun set.</p><p><strong>Now the the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot.</strong></p><p>Parque Lleras is the most popular hang out in the evening. There are so many bars to choose from whether you just want to listen to live salsa music,&#160;&#160; dance to reggaeton or have a frozen cocktail in a Buddha bar. Crossover bars are really popular and offer each genre of music to dance too. Santa Fe has the more sophisticated bars and a really cool one called Mixology Molecular Bar with liquid nitrogen cocktails. There&#8217;s also the Delaire Skylounge on top of the shopping centre for some pre-evening drinks before heading to nightclub just inside.</p><p>People here drink Aguadiente so you just buy a bottle with glasses of water and a shot glass each and drink the night away before hitting a salsa club.</p><p><img class=\"aligncenter size-full wp-image-9427\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2015/03/Envy-at-Charlee.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to medellin\" width=\"560\" height=\"420\">Envy @ Charlee</p><p><strong>If you end the night at a fancy club, which one do you head towards?</strong></p><p>It depends what type of music you like. The Mansion Club is for those who love trance and house music. There are clubs which offer crossover music &#8211; a mix of everything from salsa and bachata to electronic music (house music). Barrio Colombia is where the fancy clubs are at. make you way to Cameo Teatro Club if you want to look good amongst the illuminating light show.</p><p>Envy at Charlee is just stunning. It&#8217;s the best rooftop bar with amazing views of the city and a pool that&#8217;s illuminated at night. It is so swanky that it even has glow in the dark menus so that you can order in the mood lighting.</p><p>&#160;</p><p>[ Book a room / Book a flight to Medellin ]</p><p>&#160;</p><p><img class=\"alignleft size-thumbnail wp-image-6385\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/NEW-Twitter-Logo.jpg?resize=150%2C150&amp;ssl=1\" alt=\"packing tips from girl about the globe\" width=\"150\" height=\"150\">Lisa Eldridge is a travel writer and self-confessed travel addict currently living in Medell&#237;n, Colombia. Her background in the travel industry fueled her passion to see the world and since the age of twenty one, she has travelled extensively as a solo traveller, living and working in numerous countries. Her aim is to make solo travel easier for females through her website,<a href=\"http://www.girlabouttheglobe.com/\">Girl About the Globe</a>. Connect with her on <a href=\"https://www.facebook.com/GirlabouttheGlobe\" target=\"_blank\">Face</a><a href=\"http://www.facebook.com/GirlabouttheGlobe\" target=\"_blank\">book</a>, <a href=\"https://twitter.com/girlaboutglobe\" target=\"_blank\">Twitter</a>, and <a href=\"https://plus.google.com/+LisaImogenEldridge\" target=\"_blank\">Google plus</a>.</p><p>&#160;</p><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on&#160;<a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>,&#160;<a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>,&#160;<a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a>&#160;&amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p class=\"fusion-clearfix\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"A Luxury Guide to Medellin"}},"pageContext":{"id":"5b9629a387be0583274911a0"}}