{"data":{"mongodbDatabaseArticles":{"id":"5b95eec787be0583274900f4","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Homeless in 31 Days</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>It is just about a month until we leave our comfortable life in Northern Virginia, spend two weeks traveling across America visiting friends and family, and then off to start a new chapter of our lives in Chiang Mai, Thailand. In the next few weeks, we will be selling the last of our belongings, resigning from our jobs, and taking care of the last few responsibilities that will make for a smooth transition to Thailand.</p>\n<p><strong></strong></p>\n<p>To get an idea of what we&#8217;ve done so far:</p>\n<ul type=\"square\">\n<li>Whittling down our belongings by completing over 185 separate transactions via Craigslist, eBay, consignment shops, and friends and family</li>\n<li>Sold Chris&#8217;s 2008 Ford Edge</li>\n<li>Paid off all debt, including car loans, student loans, wedding expenses, Invisalign, and two laser eye surgeries</li>\n<li>Gave 60 notice for apartment move-out, scheduled cancellation of all utilities</li>\n<li>Unlocked our iPhones</li>\n<li>Purchased appropriate travel gear, a professional grade camera, and made a preliminary list of what we are bringing with us vs what is going into storage</li>\n<li>Signed up for several reward cards, earned a Southwest companion pass for 2013, and enough miles to fly to Thailand for free</li>\n</ul>\n<p>And there is still so much to do!</p>\n<p>Even long before went over there, we had been constantly researching and questioning where we wanted to live abroad until we settled on Thailand. Once we made the trip there, it was enough to confirm that Chiang Mai was going to be a friendly, challenging, and beautiful city, and that we couldn&#8217;t wait another 35 years until our retirement to live there. What we look forward most is to taking the step away from e look forward most to the different life we have, and the changes that will ll hopefully give us the opportunity go beyond simply being content with life, but to be adventurous and to make it a priority to do what we love.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Homeless in 31 Days"}},"pageContext":{"id":"5b95eec787be0583274900f4"}}