{"data":{"mongodbDatabaseArticles":{"id":"5b9629e587be0583274911bc","content":"<div><p>The following is a guest post by Fleur&#160;Rollet-Manus about how to have the best time at Rio! This guide to Rio Carnival will hopefully help you plan your trip to Rio de Janeiro.</p><h1>Guide to Rio Carnival</h1><p>Glitter clung to every part of my body, my eyelashes were stuck together and the smell of dancing, intertwined bodies with sweat glistened skin hung heavy in the air. Nobody else in my hostel dorm stirred.</p><p>This was the morning after the night before, Carnival (Carnaval in Portuguese) had claimed us as it&#8217;s victims and carried us into the early hours.</p><p>I&#8217;d danced the soles off of my Havaianas, clinked caipirinha glasses with newfound friends into dawn and filled my ears with the sound of samba.</p><h2>I&#8217;m now reliving my time in Rio de Janerio to bring you my crazy guide to Rio Carnival, the most famous and celebrated festival on Earth!</h2><p><img class=\"aligncenter size-full wp-image-21671\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-10.jpg?resize=1024%2C768&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"768\"></p><p>Taking place over five electrically charged days, forty days before Easter, Rio de Janerio Carnival attracts over 500,000 tourists per year and is known as the carnival capital of the world.</p><p>The party officially gets under way in the laid-back beach city on Friday and finishes on Fat Tuesday, just before Lent begins on Ash Wednesday.</p><p>In all its grandeur, Carnival is an act of farewell to the pleasure of flesh and now engulfs the whole month of February.</p><p><img class=\"aligncenter size-full wp-image-21669\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-8.jpg?resize=1024%2C768&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"768\"></p><h2>Carnival for the Ultimate Partier</h2><p>Prepare to have gravity-defying feather headdresses, extravagant beaded costumes, and rhythmic percussion bands encircle you with their contagious energy in the highlight of the festivities, the Rio Samba Parade in the Sambodromo.</p><p>It is the most OTT party on the planet and it will leave you completely mesmerized. The best samba schools from across the city battle it out in front of a panel of judges, sequins flashing, smiles brimming and hips swinging.</p><p><img class=\"aligncenter size-full wp-image-21670\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-9.jpg?resize=1024%2C485&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"485\"></p><p><img class=\"aligncenter size-full wp-image-21666\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-5.jpg?resize=1024%2C577&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"577\"></p><p>Time to take the party outside, Brazilian style. Street parties take place all over Rio, but there isn&#8217;t a party like a Lapa street party. Vendors line the central nightlife spot with free flowing cacha&#231;a, samba music floating hazily from the surrounding bars.</p><p>To get a true sense of the flavor of Brazil, you can&#8217;t leave without courageously throwing back a few caipirinha&#8217;s, Brazil&#8217;s signature cacha&#231;a cocktail. After the after party, try Rei do Lim&#227;o Caipirinha, which is just near the Lapa steps. The small, inconspicuous takeaway bar takes the art of caipirinha creation seriously, making sure to keep spirits high as you dance your way into a new day.</p><p><img class=\"aligncenter size-full wp-image-21664\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-3.jpg?resize=765%2C1024&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"765\" height=\"1024\"></p><p>After the after party, try Rei do Lim&#227;o Caipirinha, which is just near the Lapa steps. The small, inconspicuous takeaway bar takes the art of caipirinha creation seriously, making sure to keep spirits high as you dance your way into a new day.</p><p>For something more civilized, make a reservation at Bar Astor, a glamorous bar in Ipanema with panoramic views. An ideal spot to enjoy your last night, reminiscing on the culture, the glitter and the glam that carnival encircles around you.</p><p><img class=\"aligncenter size-full wp-image-21667\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-6.jpg?resize=1024%2C575&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"575\"></p><h2>Where to Sleep At Rio Carnival</h2><p>Tired, weary, hung-over, Carnival will test even the most religious partygoers.</p><p>Take a much-needed forty winks in neighboring Santa Teresa. Santa Teresa is filled with talented street art, modern art galleries and quirky caf&#233;s. Whilst the allure of the legendary glitz and glamour of Copacabana is tempting, save yourself several Reals (the official currency of Brazil, although US dollars are also widely accepted) and check into to <a href=\"http://tidd.ly/d5371f4e\">Alma De Santa Guest House</a> and leave with a whole host of global travelling companions at this bohemian inspired pousada (Brazillian guest house).</p><p>Alternatively, check out <a href=\"http://www.airbnb.co.in/c/rjones894?s=8\">Airbnb</a> for apartments in friendly neighbourhoods such as Flamengo or Botafogo, often equipped with hammocks, neighbours that will welcome you with samba blaring from 80&#8217;s radios and freshly baked p&#227;o de queijo (cheese bread).</p><p><img class=\"aligncenter size-full wp-image-21663\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-2.jpg?resize=1024%2C768&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"768\"></p><h2>What to see and do in Rio</h2><p>Step away from the street parties and readily welcome a little R n R. Join the throngs of bikini-clad, bronzed Brazilian bodies and head to the beach.</p><p>Kick back with a revitalizing a&#231;ai bowl before embarking on a football or volleyball tournament with the locals (I lost, epically, every time I was challenged).</p><p><img class=\"aligncenter size-full wp-image-21662\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-1.jpg?resize=1024%2C768&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"768\"></p><p><img class=\"aligncenter size-full wp-image-21665\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-4.jpg?resize=1024%2C744&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"1024\" height=\"744\"></p><p>Copacabana, Leblon and Ipanema all provide the ideal spot for snap-worthy #NoFilter sunsets framed by towering palm trees however, it&#8217;s Arpoador beach that really steals the show.</p><p>Hangout with fishermen, cute couples and other budding photographers on a rock that juts over the water providing an unrivaled spot to have an evening picnic watching the sunset.</p><blockquote><p>Travelers Tip: on a Sunday the roads adjacent to Copacabana beach are shut off from traffic and instead are overrun with scantily-clag skateboarders, rollerbladers and runners. Brazil has no shortage of beautiful people and it is safe to say I resembled Bambi as opposed to a Brazilian- blading expert&#8230;</p></blockquote><h3>Visit the 3 most iconic sites in Rio</h3><p>A visit to Rio de Janerio wouldn&#8217;t be complete without visiting three of the most iconic sights in Brazil. Head out early in the morning, after you&#8217;ve finished your super-food, staple a&#231;ai bowl breakfast of course, and check out the notorious <strong>Christ the Redeemer</strong> statue. The panoramic views from the top make battling with other selfie-loving tourists completely worth it.</p><p>Also, the location for Pharell&#8217;s &#8216;Happy&#8217; music video, <strong>The Selar&#243;n Steps</strong>, nicknamed the Lapa steps, are one of Rio&#8217;s most visited attractions. 125 meters of intricate mosaic tiles constructed by Chilean-born artist Jorge Selar&#243;n who claimed it as &#8220;my tribute to the Brazilian people&#8221;. The steps embody the freedom and passion of the city with their video patterns and patriotic murals.</p><p>Finally, I opted to step aboard the <strong>Sugarloaf Mountain cable car</strong> just before sunset and I wasn&#8217;t disappointed. Rio comes alive at night and as a kaleidoscope of orange, yellows, and pinks are replaced by the navy night sky and twinkling lights litter the mountainside, you see it as a truly beautiful, captivating city.</p><blockquote><p>Secret Suggestion: A five hour bus journey and you&#8217;ll reach the waterside town of Paraty, a hidden gem in the Rio de Janerio state. Locals paddleboard out to the fisherman to haggle over todays catch, men argue over chess games for hours and children chase kites through the streets. It&#8217;s a tranquil time warp peppered with authentic colonial buildings and cobbled streets, the perfect contrast to the notorious debauchery of carnival!</p></blockquote><p>This post is from Fleur Rollet-Manus. Travelling is her favorite form of education. She continually seeks to submerge herself in other cultures, marveling at the wonders of the world and being in complete awe of her surroundings. She is a fully-fledged traveling addict and avid passport stamp collector. You&#8217;ll often find her with an overstuffed backpack, swapping stories with other travelers over a cocktail or two and blogging for the Huffington Post. You can find my Huffington Post author&#8217;s page <a href=\"http://www.huffingtonpost.co.uk/author/fleur-rolletmanus\">here.</a></p><h2>Pin it for later:</h2><p><img class=\"aligncenter wp-image-21673 size-medium\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/02/party-guide-to-rio-carnival-11.jpg?resize=212%2C300&amp;ssl=1\" alt=\"Your Crazy Party Guide to Rio Carnival \" width=\"212\" height=\"300\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Rio de Janeiro Brazil - Hippie In Heels"}},"pageContext":{"id":"5b9629e587be0583274911bc"}}