{"data":{"mongodbDatabaseArticles":{"id":"5b937b1587be056953db7d15","content":"<div><h1 name=\"3a3f\" id=\"3a3f\" class=\"graf graf--h3 graf--leading graf--title\">This Is How You Survive as an Airbnb Nomad (dating app suggestions included)</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*A1TtHj0k4GrgmDsk6XarLA.png\">I finally learned how to be at peace when I&#8217;m on the road for months at a&#160;time.<p name=\"1949\" id=\"1949\" class=\"graf graf--p graf-after--figure\">I&#8217;ve been at this &#8216;free-roaming&#8217; living thing for about nine months. It wasn&#8217;t easy at first. I had to sell everything I own and put the last wobbly bits of furniture and photos in a storage facility a few miles away from where I had lived for the last five years. But once my son and daughter were in college, I just didn&#8217;t see the need for three cars, seven end tables, six lamps, a beat-up kayak, four bikes, a broken tire pump and a whole lot of kitchen gadgets. I also had no clue where I wanted to live&#8202;&#8212;&#8202;Boston? New York? San Fran? Connecticut? I tried to stick a pin in a place that seemed just right, but I failed to find a spot on the map that interested me long term. The spaces were too small or too big, too dark or too noisy, too secluded or not secluded enough. To top it off, my income wasn&#8217;t steady. I&#8217;m part of the gig economy, and I needed gig housing. Airbnb was my first stop in San Francisco when I got a gig there for the summer. #Airbnb hasn&#8217;t stopped being my stop-along-the-way to a permanent place for nearly a year now.</p><p name=\"1c60\" id=\"1c60\" class=\"graf graf--p graf-after--p\">First, friends marveled at my ability to sell 110 items on Facebook marketplace with zero regrets. Poof! With the exception of one peely-paint blue bench, I was free and happy to have the stuff out of my life. I had entered minimalist heaven. No more self-help books, musty trunks, wedding gifts I never liked, scratched up camp songfest albums or high-end designer shoes that pinched my toes. Friends gave me the stare of middle-aged horror when I said I had no permanent address upon leaving San Francisco last fall. Where would I go? What would I do? and most importantly: What did I tell people about my &#8216;situation&#8217;? That last one baffled me. What did I tell people? Oh, that no one loved me or wanted me. That my kids had grown up and I was now an old maid. That I couldn&#8217;t get a full-time job in my profession because I was over the hill. NO!!! I coined the phrase &#8216;home free&#8217; and started working on gigs across the country with some very cool (and a few not so cool) people who had no budget to find a permanent seat for me and were happy to skip the &#8216;onboarding&#8217; process.</p><p name=\"cf00\" id=\"cf00\" class=\"graf graf--p graf-after--p\">Oh, now you get it. Sounds like fun, right? Wrong. Change isn&#8217;t fun. It&#8217;s Challenging. Rewarding. Confidence-building and Really Tough. And sometimes it makes me Very Happy. But not when, for instance, you pick the wrong week or month to find yourself flat out of cash and reservation-less in the middle of winter. That&#8217;s when, instead, you&#8217;ll find yourself at the bottom of a pile of dirty laundry searching for a bottle of anything in the back seat of your Subaru in the driveway of your parents home. Shit happens. That was last week. I failed to plan ahead and didn&#8217;t book a place thinking I might stay with a good friend. When this friend&#8212; who is still a very good friend&#8202;&#8212;&#8202;didn&#8217;t pick up the phone or answer a text for two days, I got their &#8216;I need my space more than I thought or had the courage to say&#8217; smoke signals. My bad.</p><p name=\"30bc\" id=\"30bc\" class=\"graf graf--p graf-after--p\">Note to single Airbnb-ers: When someone&#8212;in my case, both someone male and someone female&#8212;thinks you depend on them, they tend to get cagey. You have to make it clear that you don&#8217;t depend on them. You are not asking them to save you. That&#8217;s why you have mad money in a bank account and Airbnb on your phone. But it can be hard to say, I adore spending time with you, without having it feel like a trap. Trust me when I say: You can&#8217;t save me. But, I am looking for someone to proudly stand or lay by my side as I carry out my plan to rule the world. And if you like, for a day or more, you can be my superhero. I&#8217;d love that, actually.</p><p name=\"89f5\" id=\"89f5\" class=\"graf graf--p graf-after--p\">You&#8217;re probably not reading this to learn about how I define a superhero or a friend though. You want to know what the hell I do each week. You want details about surviving as an Airbnb nomad at the age of 50. I couldn&#8217;t imagine it either, until now. I&#8217;ll be sharing that in upcoming stories.</p><p name=\"dd78\" id=\"dd78\" class=\"graf graf--p graf-after--p graf--trailing\">For now, I leave you with a list of &#8216;essentials to pack&#8217; that you need to have at all times if you want to survive nine months as a nomad.</p></div>","title":"This Is How You Survive as an Airbnb Nomad (dating app suggestions included)"}},"pageContext":{"id":"5b937b1587be056953db7d15"}}