{"data":{"mongodbDatabaseArticles":{"id":"5b95ee1c87be0583274900cb","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Ten Things We&#8217;re Glad We Brought</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>As we sold our belongings on Craigslist a few months before leaving for Thailand, we figured we didn&#8217;t have to sell <i>everything</i>. While we aren&#8217;t going to bore you with the entire list of contents we managed to fit into each of our three bags, we did want to highlight some of the items that came in super handy at the very beginning of our move to Thailand. In addition to about ten shirts and five pairs of shorts (and skirts, for Angela), unmentionables, and toiletries, here are a list of other important items.<br>\n<strong></strong></p>\n<h2><p id=\"Ten_Items_We_Are_Glad_We_Brought_to_Thailand\"><p>Ten Items We Are Glad We Brought to Thailand:</p></p></h2>\n<h3><p id=\"1_Wine_Key\"><p>1. Wine Key</p></p></h3>\n<p>Not those complicated contraptions found at Brookstone or Williams Sonoma, but the traditional ones that servers and bartenders use. In our case, we are happy to be able to open our 45 baht ($1.50) large Chang beers or to crack open a bottle of imported red wine for spaghetti night.</p>\n<h3><p id=\"2_Old_Bay_and_Cajun_Seasoning\"><p>2. Old Bay and Cajun Seasoning</p></p></h3>\n<p>Nothing says home-country cookin&#8217; like the <i>spices</i> of your home country. You think I&#8217;m going to find Old Bay and Cajun Seasoning in Thailand? No, because we&#8217;ve already looked.</p>\n<img class=\"size-full wp-image-6414 \" title=\"Old Bay Seasoning!\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/07/Old-Bay.jpg?resize=563%2C373&amp;ssl=1\" alt=\"Old Bay Seasoning in Chiang Mai\" width=\"563\" height=\"373\"><h3><p id=\"3_Suctioning_SpongeSoap_Rack_aka_Mini_Shower_Rack\"><p>3. Suctioning Sponge/Soap Rack (aka, Mini Shower Rack)</p></p></h3>\n<p>A great alternative to putting our soap bar, pumice stone, and razor on the shower floor&#8230;</p>\n<h3><p id=\"4_Medical_Bag\"><p>4. Medical Bag</p></p></h3>\n<p>We have already used pepto, ibuprofen, hydrocortisone, wet wipes, bug spray, antibacterial gel, and sunblock in the first ten days of arrival. All of these items were in our old medicine cabinet, travel-sized, and unexpired. There was no point in throwing them away only to repurchase in Thailand (albeit, cheaply). We definitely have no regrets bringing these items.</p>\n<h3><p id=\"5_Crocs_Shoes\"><p>5. Crocs Shoes</p></p></h3>\n<p>We never thought in a million years we&#8217;d own a pair of Crocs, but we each purchased a pair right before we moved to Thailand. These shoes are incredibly comfortable, are surprising breathable, and have kept our feet covered and clean. Additionally, they actually look pretty good on.</p>\n<h3><p id=\"6_Small_Backpack\"><p>6. Small Backpack</p></p></h3>\n<p>A purse will certainly work, but having straps on either shoulder offers extra security that your bag won&#8217;t fall off mid-ride on a mo-ped. Plus, the man of the team can carry it, too.</p>\n<h3><p id=\"7_Travel_Laundry_Bag\"><p>7. Travel Laundry Bag</p></p></h3>\n<p>You know, the kind that pops up? It&#8217;s ten times better than a plastic bag, and folds down next to nothing when it&#8217;s time to travel. It makes you feel less like you are living out of a suitcase, and well, more like you are living at home.</p>\n<h3><p id=\"8_Towels\"><p>8. Towels</p></p></h3>\n<p>Of the four hotels we stayed at during our initial stay in Thailand, all four of them lacked wash cloths, and two of them lacked hand towels. Once we moved into our new apartment, we had NO towels of any kind. We brought bamboo-cotton blend wash cloths and hand towels, but the <a href=\"http://www.rei.com/product/832935/rei-multitowel-lite-x-large-towel-54-x-25\">REI bath towel</a> we brought was compact, super absorbent, and fast drying.</p>\n<h3><p id=\"9_Laundry_Drying_Line\"><p>9. Laundry Drying Line</p></p></h3>\n<p>Until you try air drying your laundry for the first time, you won&#8217;t realize that it is impossible to fit an entire load of laundry (in our case, two) onto a typical-sized drying rack. The AAA drying line we brought is made of two lines twisted together so that no clothespins are required to hang clothes.</p>\n<h3><p id=\"10_Hanging_Cloth_Shelf\"><p>10. Hanging Cloth Shelf</p></p></h3>\n<p>Not a single place we&#8217;ve stayed at since being in Thailand has been equipped with a dresser. All we&#8217;ve had available are standing wardrobes, so the handing shelf came in really handy and gave us more organized vertical space for our folded clothes.</p>\n<p>What are some items you would bring, or have brought on your travels or moves?</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Ten Things We’re Glad We Brought"}},"pageContext":{"id":"5b95ee1c87be0583274900cb"}}