{"data":{"mongodbDatabaseArticles":{"id":"5b95eab487be05832748ffc8","content":"<div><p> </p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/nomoneygotravel006.jpg\" alt=\"tourist taking a picture in european city\" width=\"675\" height=\"395\"><br> When you don&#8217;t have much money, travel seems only a nice fantasy. When you have debts, loans, or a crummy job; sleep on your friend&#8217;s couch; or can barely afford McDonald&#8217;s, it seems that traveling is a pipe dream that will probably never come true, <a href=\"https://www.nomadicmatt.com/travel-blogs/too-poor-to-travel-mindset/\">something you&#8217;re going to have to put off until you have money</a>.</p><p>But I don&#8217;t think that&#8217;s the case! I think <b>being broke is the best reason to start traveling</b>.</p><p>When you have the fewest options is when you really have the <i>most </i>options. When you&#8217;re at the bottom, you have little to lose but everything to gain.</p><p>As Janis Joplin said, freedom is just another word for nothing left to lose.</p><p>When you don&#8217;t have any money or a great job, there&#8217;s little downside to picking up, saying goodbye, and going off to travel. You&#8217;ll ride out the storm, maybe find something you really love, and gain life experience and those soft interpersonal skills that employers today find valuable!</p><p>The world is full of opportunities (and jobs), so if you&#8217;ve exhausted those in your area, why not try a new one? If you&#8217;re willing to go out and grab life by the horns, you&#8217;ll find plenty of opportunities out there to earn money, travel, and find what you love.</p><p>Open yourself up to new possibilities and experiences. Don&#8217;t suffer in that crummy job that barely pays the bills. Move somewhere. Pick up and start over. It&#8217;s what our ancestors used to do. They moved to where the opportunity was and they thrived because of it. Where would we be if they didn&#8217;t constantly try to seek a better life but instead sat and watched Netflix?</p><p>I know picking up and leaving when you&#8217;re struggling can seem scary. We often leave a situation only when we are the most secure. When you&#8217;re struggling, your thoughts are more likely to be &#8220;if I can just get ahead a little, then I&#8217;ll be ready to go.&#8221;</p><p>However, <a href=\"https://www.nomadicmatt.com/travel-blogs/there-is-no-tomorrow-in-travel/\">there&#8217;s no perfect time to travel</a>. There&#8217;s no right moment. If you&#8217;re in a bad situation, find opportunities and go try them. Which is scarier: failing and coming back to exactly where you started or continuing down a path that will probably drag you down for the rest of your life?</p><p>Unless you seize the moment, that temp job you&#8217;re in just until you find something new is more likely to be the job you still have years from now.</p><p>If you&#8217;re in a place you don&#8217;t like, are working a job you hate, or have debt, there&#8217;s no better time to say fuck it, <a href=\"https://www.nomadicmatt.com/travel-blogs/move-overseas-family/\">move overseas</a>, find work, and travel. Or <a href=\"https://www.nomadicmatt.com/travel-blogs/volunteer-abroad/\">volunteer</a> with the Peace Corps, work on a farm, train dogs, or <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-create-a-travel-blog/\">start a blog</a>. <a href=\"https://markmanson.net/\" target=\"_blank\" rel=\"noopener\">My friend Mark Manson started his blog</a> when he was sleeping on his friend&#8217;s couch counting pennies to afford McDonald&#8217;s because he figured what else did he have to lose?! (He&#8217;s now a <i>New York Times </i>best-selling author!)</p><p>One of my favorite scenes in <a href=\"https://www.nomadicmatt.com/travel-blogs/the-ultimate-list-of-travel-movies/\">one of my favorite movies</a>, <i>Up in the Air</i>, is when George Clooney&#8217;s character fires J. K. Simmons&#8217; character Bob. Bob is obviously upset &#8212; he has kids (one with asthma) and he feels like a failure. Instead of being sympathetic, George Clooney tells him he <i>is</i> a failure and reads Bob&#8217;s r&#233;sum&#233;: he went to the French culinary institute to study cooking and worked in a fancy French restaurant. To quote:</p><blockquote><p>&#8220;I see guys who work at the same company for their entire lives, guys exactly like you. They clock in, they clock out, and they never have a moment of happiness. You have an opportunity here, Bob. This is a rebirth. If not for you, do it for your children.&#8221;</p></blockquote><p>What George is telling Bob is that now he has a chance to follow his dreams: to work with food instead of a job that saps his soul &#8212; because he has nothing left to lose.</p><p>If you were faced with such an opportunity to change &#8212; to use a setback or constrained circumstances to instead actually do something different &#8212; would you take it?</p><p>It&#8217;s super hard to go against the current. Life gets away from us as the days tick by. But eventually one must say, &#8220;not today, not anymore.&#8221;</p><p>Use the Internet (you can find a lot of work online via websites like Gumroad, UpWork, or Craigslist) and open yourself up to the world and all the jobs and opportunities in it.</p><p>There are ways to earn extra money via <a href=\"https://www.nomadicmatt.com/travel-blogs/sharing-economy-travel-cheap/\">sharing-economy</a> websites like Uber, Lyft, EatWith, TaskRabbit, and a plethora of other random side jobs from the sites listed in the previous paragraph to pad your wallet. (Bonus: you can do this before and after you&#8217;re overseas!!!)</p><p>Once you find yourself overseas, you can get a working holiday visa, use job boards and local expat stomping grounds to find jobs, or take freelance work via a website like Upwork.</p><p>If I was broke, young, or in a job I didn&#8217;t like, I would first try to <a href=\"https://www.nomadicmatt.com/travel-blogs/best-places-to-teach-esl-overseas/\">teach English overseas</a>. You don&#8217;t need to be a teacher to do this &#8212; just a native English speaker (though having a degree will help if you want a better-paying job). There are a ton of schools out there that even pay for your flight to and from the country.</p><p>If I wasn&#8217;t a native English speaker, I would use websites like iTalki and teach people my language! You get paid to be someone&#8217;s language partner. There&#8217;s nothing like getting paid to have a conversation in the language you speak every day. These sites are hugely popular &#8212; and you don&#8217;t need to be a teacher.</p><p>Find something that moves you forward &#8212; even if it&#8217;s only a little bit. Then take the next step. Then the next. Then another.</p><p>Maybe along the way, you may find yourself with a new passion or in a new situation where you happen to feel at home.</p><p>But while you&#8217;re trying something new, you&#8217;ll at least be able to <a href=\"https://www.nomadicmatt.com/travel-blogs/emily-success-story/\">pay off some of your debt</a>, have some cool adventures, and gain some life experience.</p><p>The world can be your oyster if you truly grab it! Whether <a href=\"https://www.nomadicmatt.com/travel-blogs/michael-success-story/\">you make minimum wage</a>, <a href=\"https://www.nomadicmatt.com/travel-blogs/travel-the-world-in-a-wheelchair/\">are wheelchair bound</a>, <a href=\"https://www.nomadicmatt.com/travel-blogs/arielle-success-story/\">have to work on boats</a>, or <a href=\"https://www.nomadicmatt.com/travel-blogs/vikram-success-story/\">come from a developing country</a>, you can make it happen. When you expand your worldview, you increase your possibilities.</p><p>Don&#8217;t make excuses as to why you can&#8217;t &#8212; find all the ways you can.</p><p>Stretch yourself. Piece a few things together. Use the web. Break out of your immediate circle.</p><p>The world can be your oyster if you let it.</p><p>What do you have to lose?</p></div>","title":"Why Being Broke is the Best Time to Travel"}},"pageContext":{"id":"5b95eab487be05832748ffc8"}}