{"data":{"mongodbDatabaseArticles":{"id":"5b937b2a87be056953db7d2f","content":"<div><p name=\"b023\" id=\"b023\" class=\"graf graf--p graf--leading\">In this article, I review the 3 best online American banks (Aspiration Bank, Simple Bank, and Ally Bank) and determine which ones are the best for a digital nomad. Each will be reviewed based on some criteria and then you can make your decision as to which one is best for your financial purposes.</p><p name=\"b5ac\" id=\"b5ac\" class=\"graf graf--p graf-after--p\">There are four main criteria that I believe digital nomads look for when choosing a bank to use abroad. <strong class=\"markup--strong markup--p-strong\">Support</strong>, <strong class=\"markup--strong markup--p-strong\">ATM Fees</strong>, <strong class=\"markup--strong markup--p-strong\">Transfers</strong>, and <strong class=\"markup--strong markup--p-strong\">App</strong>.</p><h4 name=\"d488\" id=\"d488\" class=\"graf graf--h4 graf-after--p\">Support</h4><p name=\"39db\" id=\"39db\" class=\"graf graf--p graf-after--h4\">How well does the bank handle online and phone-based communication? Do they send debit cards to foreign addresses? Can you use your card in any country? How long can you stay abroad before you need to put in another travel notice?</p><p name=\"71b3\" id=\"71b3\" class=\"graf graf--p graf-after--p\">Digital nomads are often in different time zones and having support available at crucial times is an important factor. Also, if something happens to your card, knowing if the bank can send you one while you&#8217;re abroad can be a lifesaver.</p><h4 name=\"debb\" id=\"debb\" class=\"graf graf--h4 graf-after--p\">ATM Fees</h4><p name=\"f690\" id=\"f690\" class=\"graf graf--p graf-after--h4\">Does the bank refund international ATM fees and how low are their international transaction fees?</p><h4 name=\"83eb\" id=\"83eb\" class=\"graf graf--h4 graf-after--p\">Transfers</h4><p name=\"4e3c\" id=\"4e3c\" class=\"graf graf--p graf-after--h4\">How low are the bank&#8217;s incoming and outgoing wire transfer fees? Does the bank accept international transfers?</p><h4 name=\"552c\" id=\"552c\" class=\"graf graf--h4 graf-after--p\">App</h4><p name=\"9b7f\" id=\"9b7f\" class=\"graf graf--p graf-after--h4\">How good is the bank&#8217;s Android / iOS app? Do they provide card control features like blocking the card and resetting the pin? Also, does the app have budgeting features that support you in saving the most money?</p><h4 name=\"b8da\" id=\"b8da\" class=\"graf graf--h4 graf-after--p\">How each bank will be&#160;ranked</h4><p name=\"85a8\" id=\"85a8\" class=\"graf graf--p graf-after--h4\">Each category will receive a rating from 0 to 2 based on how well the bank does when answering each question. Support will receive a 0 to 4 because there are more questions to answer.</p><p name=\"bf46\" id=\"bf46\" class=\"graf graf--p graf-after--p\">I will review the banks in alphabetical order. I want to make it clear that these are best in class banks and I&#8217;m simply comparing features from a high level so you can determine which one is the best for your purposes.</p><h3 name=\"201e\" id=\"201e\" class=\"graf graf--h3 graf-after--p\">Bank Reviews</h3><h4 name=\"9bba\" id=\"9bba\" class=\"graf graf--h4 graf-after--h3\">Ally Bank</h4><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*MRHSut0NmBZGC8DZAC8kEw.png\"><p name=\"57a4\" id=\"57a4\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Support</strong>: 3/4</p><p name=\"9ee1\" id=\"9ee1\" class=\"graf graf--p graf-after--p\">Ally Bank offers 24/7 support. From my experience calling on a Saturday morning in Thailand, they picked up quickly and they were patient during times when the internet wasn&#8217;t stable. Also, they confirmed that they&#8217;re able to send cards to a foreign address. However, they said shipping could take up to 2 weeks and they can&#8217;t guarantee that the card arrives.</p><p name=\"06cc\" id=\"06cc\" class=\"graf graf--p graf-after--p\">Ally Bank has a short list of blocked countries where you cannot use your card. Those are Belize, Burundi, Central Africa Republic, Cuba, Dominic Republic, Iran, Iraq, Lebanon, Libya North Korea, Somalia, South Sudan, Syria, Yemen, Venezuela, Zimbabwe, and countries in the Balkan Peninsula.</p><p name=\"6c5e\" id=\"6c5e\" class=\"graf graf--p graf-after--p\">In terms of how long you can put in a travel notice, Ally Bank&#8217;s support team told me you can do it up to a year. However, you can call again and put in another notice if you need more time. That&#8217;s pretty good. You will also have to call and let them know the countries you will visit beforehand so your card doesn&#8217;t get blocked.</p><p name=\"1126\" id=\"1126\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">ATM Fees</strong>: 1/2</p><p name=\"2415\" id=\"2415\" class=\"graf graf--p graf-after--p\">Ally doesn&#8217;t charge any fees on their end for withdrawing money. However, they do charge a cross-border / currency conversion transaction fee that&#8217;s up to but not more than 1% of the final amount. Although on their website they state that they will refund up to 10 dollars in ATM fees (that the ATM owner charges you) that will only work with specific ATMs in America. If you&#8217;re abroad you have to pay the ATM&#8217;s fee, which in some countries can be around $5 per transaction.</p><p name=\"32b3\" id=\"32b3\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Transfer</strong>: 1/2</p><p name=\"a64f\" id=\"a64f\" class=\"graf graf--p graf-after--p\">Incoming domestic and international transfers are free with Ally Bank. However, it costs $20 dollars to wire money to another domestic bank in the United States. Lastly, Ally Bank does not offer outgoing international transfers.</p><p name=\"4578\" id=\"4578\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">App</strong>: 1/2</p><p name=\"6177\" id=\"6177\" class=\"graf graf--p graf-after--p\">Ally Bank wins when it comes to card control features. They recently released an app called Card Controls that gives you fine control of how to use your card. For example, spending limits for any single transaction, what type of transactions (online, store, ATM) are allowed, Merchant types (Grocery stores, restaurants, department stores), and the location where the card can be used.</p><p name=\"275a\" id=\"275a\" class=\"graf graf--p graf-after--p\">That&#8217;s a lot of control, but people have given it bad reviews because it&#8217;s a 3rd party integration that reads your financial data. The terms and conditions state that they aren&#8217;t liable if any damages occur. Also, it&#8217;s a separate app which doesn&#8217;t make sense. Still, they at least have this feature and it can be very beneficial if you want to use your card instead of cash.</p><p name=\"8970\" id=\"8970\" class=\"graf graf--p graf-after--p\">Ally Bank doesn&#8217;t have any built-in budgeting features so they don&#8217;t get the extra point for this one.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*FZigZvvb_TDlLh6GmjQGHw.png\">Ally Bank pros and&#160;cons</div>","title":"Best Online Banks for American Digital Nomads – Nomad Gate – Medium"}},"pageContext":{"id":"5b937b2a87be056953db7d2f"}}