{"data":{"mongodbDatabaseArticles":{"id":"5b95efc387be05832749011f","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Tips for Teaching English in Thailand for the First Time</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter wp-image-20861 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Tips-for-Teaching-English-in-Thailand-iStock-157108226.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Tips for Teaching English in Thailand\" width=\"1000\" height=\"667\">iStock.com/monkeybusinessimages</p>\n<p>By far, the most popular way to earn a living and secure a long-term visa is teaching English in Thailand. I happen to be one of the many foreigners who started teaching shortly after moving to Thailand. However, I had no prior teaching experience (just one-on-one training new employees at my past job) and it was only after I was accepted a position and worked for a while at a private school in Chiang Mai did I realize what I got myself into.</p>\n<p>So, before you step into a Thai classroom, let me save you confusion and frustration that many first-time teachers deal with (and in some cases, even save your money). I&#8217;ve put together a list of what I think is the most helpful things to know before teaching English in Thailand.</p>\n<h2><p id=\"Requirements_for_Teaching_English_in_Thailand\">Requirements for Teaching English in Thailand</p></h2>\n<p>First and foremost, to be a teacher in Thailand you need:</p>\n<ol>\n<li>A four-year diploma in any major (bachelor&#8217;s degree or higher)</li>\n<li>To be a native English speaker (NES)&#160;OR a non-native English speaker (NNES) with a TOEIC score of 600+ or IELTS score of 5+</li>\n<li>To pass a police background check in your home country</li>\n<li>To pass a simple health check</li>\n</ol>\n<p>Additionally, if you plan to teach in Thailand for more than two years (and up to four years if you request an extension), you&#8217;ll eventually need to apply for a Teacher&#8217;s License. That has its own criteria.</p>\n<p><strong>Surprisingly, you don&#8217;t need teaching experience to become a teacher</strong>, although it&#8217;s highly recommended!</p>\n\n\n\n<p><strong>NOTE:</strong></p> There are many people teaching English in Thailand without one or more of the above requirements. Yes, you can still teach and make money. No, you won&#8217;t be eligible for a Non Immigrant B &#8216;Teaching&#8217; Visa or a Work Permit because it&#8217;s technically illegal. However, foreigners do it all the time and only in rare occasions are they penalized.\n\n\n\n<h2><p id=\"Do_I_need_a_TEFL_to_Teach_English_in_Thailand\">Do I need a TEFL to Teach English in Thailand?</p></h2>\n<p><img class=\"aligncenter wp-image-20862 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Tips-for-Teaching-English-in-Thailand-iStock-933438294.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Thai Student in Library\" width=\"1000\" height=\"667\">iStock.com/2p2play</p>\n<p>A TEFL (Teaching English as a Foreign Language) is not legally required to teach English in Thailand even though many sources misinform readers and say it is. Instead, it acts as a qualifier during the hiring process. Earning a TEFL will help to distinguish yourself from other candidates with similar qualifications and&#160;will help you manage a classroom if you&#8217;ve never taught before.</p>\n<p>Truth be told, if you have a teaching degree and plan to work at an international school (where the students are fluent in English), then a TEFL isn&#8217;t necessary. But for almost all other positions &#8211; especially if you have no prior experience teaching students who aren&#8217;t native English speakers &#8211; you should sign up for a TEFL course.</p>\n<p><strong>A TEFL, CELTA, or TESOL prepares you for the non-native English-speaking&#160;classroom.&#160;</strong>A reputable TEFL company like&#160; <a class=\"thirstylink\" title=\"SEE TEFL Course Dates\" href=\"https://www.tielandtothailand.com/recommends/see-tefl/\" target=\"_blank\" rel=\"nofollow noopener\">SEE TEFL</a> will not only review English spelling rules, pronunciation, and grammar, they will teach you how to:</p>\n<ul>\n<li>create lesson plans if you&#8217;ve never done it before</li>\n<li>incorporate games to make lessons fun</li>\n<li>teach vocabulary through movement (TPR)</li>\n<li>avoid certain cultural faux pas in Thai schools</li>\n</ul>\n<h2><p id=\"What_to_Wear_in_a_Thai_Classroom\">What to Wear in a Thai Classroom</p></h2>\n<p><strong>Presenting yourself in a professional, conservative manner is an essential part of working at a Thai school.</strong> Believe it or not, appearance is weighed equally, if not more, than your teaching skills at some schools.</p>\n<p>Remember: Act professional. Look conservative.</p>\n\n\n\n<p><strong>Proper Classroom Attire</strong></p>\n<p><strong>Inappropriate Classroom Attire</strong></p>\n\n\nLight colored <p>collared</p> short- or long-sleeved shirts\nNon-collared shirts, bold patterns, or sleeveless shirts\n\n\n<a href=\"https://amzn.to/2rGW0ZW\" target=\"_blank\" rel=\"noopener\">Dark dress pants</a> and belt\nJeans, khakis, or shorts\n\n\n<a href=\"https://amzn.to/2GfLayk\" target=\"_blank\" rel=\"noopener\">Dark knee-length or longer skirts</a>\nSkirts or dresses far above the knee\n\n\nStain-free and <a href=\"https://amzn.to/2IiB1qO\" target=\"_blank\" rel=\"noopener\">wrinkle-free&#160;shirts</a> and pants\nWrinkled, dirty, or smelly clothing\n\n\nClosed-toed dark colored shoes\nFlip-flops or sandals\n\n\nClean-shaven face\nFacial hair, even if well-groomed\n\n\nNatural hair color\nNon-natural hair color\n\n\nConservatively and neatly styled or cut hair\nNon-conservative hairstyles, ungroomed hair\n\n\nNo visible tattoos, ear piercings ok\nFacial piercings, visible tattoos\n\n\n\n<p>Western-sized clothing is sometimes difficult to find&#160;in Thailand. This is especially true if you aren&#8217;t teaching in the big cities or if you are particularly tall, wide, or busty. Go through your closet at home and set aside any business-casual clothing you have. Otherwise, it&#8217;s time to go shopping for a few things before you go to Thailand!</p>\n<h2><p id=\"How_to_Apply_for_a_Teaching_Job\">How to Apply for a Teaching Job</p></h2>\n<p>In most cases, the best way to find a teaching job is to apply in person. That means you&#8217;ll need to:</p>\n<ol>\n<li>Make a list of schools in whatever Thai town you want to work in</li>\n<li>Print out several copies of your r&#233;sum&#233;/CV</li>\n<li>Dress professionally</li>\n<li>Go door to door to inquire about available positions</li>\n</ol>\n<p>Why does this work better than applying online in the comfort of your own home?</p>\n<p>It&#8217;s because&#160;<strong>a lot of Thai schools don&#8217;t advertise job listings online in English.</strong></p>\n<p>Secondly, you&#8217;ll&#160;have a better chance of getting a job if your potential boss sees that you dress sharply, speak eloquently, and are charming. In all seriousness, this works particularly well if you aren&#8217;t a blonde, blue-eyed, young female candidate.</p>\n<p>There are exceptions. Some schools post job vacancies online and are great at keeping them updated. These are usually international schools, although you&#8217;ll see some private school listings and universities, too. It depends if the school has the funds to pay someone who can write in English to do this.</p>\n<h2><p id=\"The_Best_Time_to_Apply\">The Best Time to Apply</p></h2>\n<p><strong>The best time to apply for an English teaching job in Thailand is roughly one month before the school year begins.</strong> Government and private schools start in early to mid-May. International schools and universities typically start in mid-August.</p>\n<p>If you want to <a class=\"thirstylink\" title=\"SEE TEFL Course Dates\" href=\"https://www.tielandtothailand.com/recommends/see-tefl/\" target=\"_blank\" rel=\"nofollow noopener\">become TEFL certified</a> in time for hiring season, be sure to add an extra four to six weeks on to that timeline.</p>\n<p>Another good time to apply is during the mid-year break, which is typically in October for government and private schools and in January for international schools and universities.</p>\n<p>Tutoring or language centers are constantly rotating in and out of new short-term courses, so you can count on applying at any time of the year.</p>\n<h2><p id=\"Teach_Legally_Non_Immigrant_B_Visa_Work_Permit_and_Extension\">Teach Legally: Non Immigrant B Visa, Work Permit, and Extension</p></h2>\n<p>Thai schools are responsible for providing you with the correct paperwork so that you can apply for three essential documents:</p>\n<p></p><strong>Non Immigrant B &#8216;Teaching&#8217; Visa</strong>\n<img class=\"aligncenter wp-image-20814 size-full\" title=\"Teaching English in Thailand: Non Immigrant B Visa\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Teaching-English-in-Thailand-Non-Immigrant-B-Visa.jpg?resize=500%2C345&amp;ssl=1\" alt=\"\" width=\"500\" height=\"345\">\n<p></p>Apply for at a Royal Thai Embassy or Consulate outside of Thailand\n\t\t\t\t<p></p><strong>Work Permit</strong>\n<img class=\"aligncenter wp-image-20809 size-full\" title=\"Teaching English in Thailand: Work Permit\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Work-Permit-Thailand.jpg?resize=500%2C345&amp;ssl=1\" alt=\"\" width=\"500\" height=\"345\">\n<p></p>Apply for at the Ministry of Labor Office in the Thai province you live\n\t\t\t\t<p></p><strong>Visa Extension</strong>\n<img class=\"aligncenter wp-image-20810 size-full\" title=\"Thai Visa Extension\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Visa-Extension-Thailand.jpg?resize=500%2C345&amp;ssl=1\" alt=\"\" width=\"500\" height=\"345\">\n<p></p>Apply for at the Immigration Office in the Thai province you live\n\t\t\t\t<p class=\"clear\"></p>\n<p><strong>Reputable schools will, without a doubt, give you what you need for these necessary legal documents.</strong></p>\n<p>It&#8217;s possible to teach and make money at a school that doesn&#8217;t sponsor your Non Immigrant B Visa, Work Permit,&#160;and Visa Extension. Even though this isn&#8217;t legal, Thai law officials neither have a consistent record of making sure schools sponsor their foreign teachers&#8217;&#160;visas and work permits nor do legal authorities regularly double check that teachers have the correct visa and work permit.</p>\n<h2><p id=\"Do_I_need_to_speak_Thai_in_the_Classroom\">Do I need to speak Thai in the Classroom?</p></h2>\n<p><img class=\"aligncenter wp-image-20863 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Tips-for-Teaching-English-in-Thailand-iStock-887732094.jpg?resize=1000%2C625&amp;ssl=1\" alt=\"Inside of a Thai Classroom - Teaching English in Thailand\" width=\"1000\" height=\"625\">iStock.com/smolaw11</p>\n<p>Most schools will tell you to never use Thai in the classroom because they want the students to be totally emersed in English. Many teachers stick to this &#8216;rule.&#8217; In my experience, <strong>using a little Thai at critical moments helped me keep my class under control and helped my students understand English better.</strong></p>\n<p>For my really young students (6,7, and 8 years old), I learned how to say simple commands such as, &#8220;Sit down,&#8221; &#8220;Write your name,&#8221; and &#8220;Line up in two rows&#8221; in Thai. Sometimes I just wasn&#8217;t able to mime out those instructions because my hands were full of papers or supplies. Or, if I was miming, the students weren&#8217;t looking at me! Being able to speak a little Thai was invaluable because my students were just beginning to learn English and they couldn&#8217;t understand me.</p>\n<p>For my slightly older students (9, 10, and 11 years old), I wrote the Thai word next to the English vocabulary word on the blackboard. It made all the difference when I was teaching abstract words or words I didn&#8217;t have pictures for. Otherwise, my students glazed over in confusion and wouldn&#8217;t even attempt the assignment.</p>\n<h2><p id=\"Types_of_Schools_in_Thailand\">Types of Schools in Thailand</p></h2>\n<p><img class=\"aligncenter size-full wp-image-20864\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/05/Tips-for-Teaching-English-in-Thailand-iStock-153584629.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Thai Girls Learning English in Thailand\" width=\"1000\" height=\"667\">iStock.com/pressdigital</p>\n<p>Depending on which type of school you work at, you can expect different hiring requirements, salaries, classroom hours, and holiday breaks. Generally speaking, Thailand has five different types of schools to choose from:</p>\n<p><strong>International Schools</strong><br>\nInternational schools are top tiered in terms of salary, benefits, and classroom provisions. They hire the most qualified teachers (i.e., you earned an education degree or similar) and, ideally, have had prior teaching experience. You can teach subjects other than English. Almost every teacher is a foreigner.</p>\n<p><strong>Private Schools</strong><br>\nPrivate schools offer salaries that are slightly more than public schools and go up from there. They prefer people with some prior teaching experience, although it&#8217;s possible to be hired without this or without having a degree in teaching. There is a very small chance that you will teach subjects other than English.&#160; Usually, there is a small group (10+ people) of foreign teachers.</p>\n<p><strong>Public or Government Schools</strong><br>\nTypically, government schools get the least amount of funding and therefore pay teachers the lowest salary. Class sizes are usually large (25+ students). However, these schools will hire just about anyone, even if you don&#8217;t meet the legal requirements. You may be one of a few foreigners teaching at the school.</p>\n<p><strong>Universities</strong><br>\nThis is a good choice if you want to teach something other than English or if you prefer teaching adults. The pay is usually not that high but your teaching hours per week are extremely low so you&#8217;ll have time to do other things. There may be several foreign teachers at the university and it is possible to teach advanced or specific topics, not just English.</p>\n<p><strong>Language Centers</strong><br>\nThese schools hire year-round because they typically offer short courses to a constant influx of new students. Language centers offer basic pay and a schedule typically outside the normal 9 to 5 hours. The downside is that only some of them are capable of sponsoring your visa and work permit.</p>\n<h2><p id=\"Salary_Benefits_and_Other_Responsibilities\">Salary, Benefits, and Other Responsibilities</p></h2>\n<p>You can expect to sign a semester-long, a year-long, or a two-year contract teaching English in Thailand. Here are a few things to keep in mind so that you aren&#8217;t selling your soul for a job:</p>\n<p><strong>Salary</strong><br>\nYou can expect to earn 30,000 THB per month (945 USD or 790 EUR) or more outside of Bangkok in a government school. Private schools will pay a little more than that and international schools will pay the most. Don&#8217;t accept a job that pays less than 30,000 THB. Your time and efforts aren&#8217;t worth a salary that low, trust me.</p>\n<p><strong>Insurance</strong><br>\nSome schools provide health insurance coverage while others don&#8217;t. Those that do are usually at the higher tier. If you want health insurance (or you want something more robust than what&#8217;s offered by your school), then <a class=\"thirstylink\" title=\"Mister Prakan Health Insurance\" href=\"https://www.tielandtothailand.com/recommends/mister-prakan-health-insurance/\" target=\"_blank\" rel=\"nofollow noopener\">Mister Prakan</a> is an excellent Thai insurance comparison site.</p>\n<p><strong>Teaching Hours</strong><br>\nEven though you are expected to show up to work from 8 am to 4 pm (or a slight variation of this), you should only teach 16 to 18 classroom hours per week. You are being taken advantage of if you work any more than 20 classroom hours per week.</p>\n<p><strong>Working Holidays + Weekends</strong><br>\nYou are not obligated to work on weekends or public holidays. If so, you should get paid extra.</p>\n<p><strong>Substitute Teachers</strong><br>\nYou are not responsible for finding your own substitute teacher. Do not pay for your own substitute teacher.</p>\n<p><strong>Visa + Work Permit</strong><br>\nThe status of your Non Immigrant B Visa, Work Permit, and paychecks do not depend on whether you teach summer school after the normal school year is over. These documents are valid for the entire year unless you quit.</p>\n<p><strong>Taxes</strong><br>\nTaxes (approximately 0% to10%, depending on your pay bracket) and social security (3%) will be deducted from your paycheck. However, double check that no other deductions are being made.</p>\n<p><strong>Bank Account</strong><br>\nWith a work permit, you will be able to easily open a bank account. Open up a bank account even if you get paid in cash because it will come in handy in the future.</p>\n<p>If you&#8217;ve read all the tips in this post, then great! You&#8217;re a step closer to successfully teaching English in Thailand. It&#8217;s hard work being a teacher but some of my closest friends love their jobs and students. I wish you all the best in your teaching endeavors and hope you have fun with your Thai students.</p>\n<p><strong>If you&#8217;ve never taught English in Thailand before, what are your biggest concerns?</strong></p>\n<p>Disclosure: This post contains some affiliate links. There&#8217;s no extra cost if you click one, but in doing so it helps compensate us for our time researching and sharing great finds with readers like you. Thanks!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Tips for Teaching English in Thailand for the First Time"}},"pageContext":{"id":"5b95efc387be05832749011f"}}