{"data":{"mongodbDatabaseArticles":{"id":"5b9629bd87be0583274911ae","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Vancouver</h1><p class=\"p1\"><b><i>Tell us a little about&#160; yourself and tell us why you&#8217;re an expert on luxury travel in&#160;Vancouver.</i></b></p><p class=\"p1\">I&#8217;m Emily and I&#8217;m a Canadian student currently in Ontario. Before I started school I took a year off to travel and in between trips I spent a lot of time working in Vancouver. Of course in a beautiful place like Vancouver my curiosity went wild and I spent every minute I wasn&#8217;t working exploring the city. Now I&#8217;ve pretty much got the best spots figured out and I&#8217;m excited to share them!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13343\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/10455854_10152499709354222_1368117942933662009_n.jpg?resize=425%2C560&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"425\" height=\"560\"></p><p class=\"p1\"><b><i>What makes Vancouver</i></b><b><i>&#160;a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p1\">Vancouver is the ultimate glamour destination in Canada, hands down. They don&#8217;t call it west coast best coast for nothing! The city has everything you could ever want in a big city, with a breath-taking mountain backdrop, and the ocean always only a few steps away.</p><p class=\"p1\"><b><i>What 5 star hotel is the best in&#160;Vancouver?</i></b></p><p class=\"p1\"><a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Pan_Pacific_Vancouver.htm\">The Pan Pacific Vancouver</a> is the perfect luxury hotel to be spoiled at. It&#8217;s located right downtown, at the harbor front, steps away from luxury shopping. Every room provides the most breath-taking , mountain views. There&#8217;s also an outdoor heated pool on the roof that is an absolute dream!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13340\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/1689775_10152198328704222_807067880_n.jpg?resize=560%2C560&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"560\" height=\"560\"></p><p class=\"p1\"><b><i>What about boutique hotels in&#160;<b><i>Vancouver</i></b>, of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p1\">The OPUS hotel in Yaletown is the cutest hotel I&#8217;ve ever seen in my entire life. Yaletown is an excellent area to be located in, with tons of shopping nearby and great proximity to the water front. The OPUS hotel also provides iPad&#8217;s in their guest rooms for use on and off property! </p><p class=\"p1\"><b><i>Are there any fun activities for the adventurous traveler&#160;in&#160;<b><i>Vancouver?</i></b></i></b></p><p class=\"p1\">Vancouver has got to be the prime spot for adventure travelers; there&#8217;s an endless array of options here. One of the top spots for heart racing adventure is the Capilano Suspension Bridge Park. Here you can walk across the 450 foot <a href=\"http://www.seehertravel.com/visit-capilano-suspension-bridge-vancouver-attraction/\">Capilano suspension bridge</a> over the Capilano River, or if you really want to get your heart pumping, stand on a glass platform on the edge of a glacier. Speaking of glaciers, another absolutely amazing thing to do is take a helicopter ride through the mountain ranges. There are also dozens of whale watching tours that depart between April and October for those who want to catch a glimpse of Vancouver&#8217;s incredible wildlife.&#160;</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13339\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/1607013_10152198329774222_1510289703_n.jpg?resize=420%2C560&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"420\" height=\"560\"></p><p class=\"p1\"><b><i>Where are the best hang outs during the day in&#160;<b><i>Vancouver?</i></b></i></b></p><p class=\"p1\">If you&#8217;re feeling outdoorsy, definitely head to Stanley Park! The over 1000 acre park is the perfect for a scenic stroll and a picnic. An alternative hangout option is Buzz Caf&#233; in Yaletown. The caf&#233; has unique lattes such as the Lavender Latte, and there&#8217;s an art gallery on the upper level.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13341\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/10368393_10152499711094222_4286407716275392874_n.jpg?resize=560%2C414&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"560\" height=\"414\"></p><p class=\"p1\"><b><i>If you have a big date night, what are the most delicious restaurants in<b><i>Vancouver</i></b> and what are their best dishes?</i></b></p><p class=\"p1\">Blue Water Caf&#233; &amp; Raw Bar is by far the top restaurant in Vancouver. They are well known for their sustainable and tasty seafood. Be sure to make a reservation early, as the waits for walk ins can be rather long, however if you don&#8217;t mind sitting at the bar instead, I&#8217;ve never encountered kinder bartenders. </p><p class=\"p1\">Another restaurant I absolutely have to mention is the Wildflower diner. They cater to vegans and vegetarians and make the most amazing vegan poutine!</p><p class=\"p1\"><b><i>Let&#8217;s talk desserts- what place makes the best?<br> </i></b>I personally love Edible Flours. They&#8217;re a vegan bakery making incredible cupcakes, loaves, donuts, and cookies. For non-vegans, I&#8217;d recommend Rhino Coffee House. Technically this is a little bit outside Vancouver, in Tofino, however it&#8217;s well worth the trip. This donut shop makes up the crazy donuts you can think of from maple bacon donuts to peanut butter and jelly donuts.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13342\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/10427275_10152499709509222_3534320300526233002_n.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers&#160;in&#160;<b><i>Vancouver?</i></b><br> </i></b>If you&#8217;re looking to shop until you drop Robson Street is the place to be. There&#8217;s over 100 shops ranging from outlet stores to high end designers, boutique stores to department stores, and the Pacific Mall can also be found here. High end brands such as Ferragamo, Tiffany&#8217;s , and Gucci can be found scattered through this area.</p><p class=\"p1\"><b><i>What are a couple of the best salons and spas in&#160;<b><i>Vancouver?</i></b></i></b></p><p class=\"p1\">If you&#8217;re looking to get a haircut or colour I&#8217;d definitely recommended Axis hair salon. I don&#8217;t know how they do it, but they work magic when it comes to colouring hair. </p><p class=\"p1\">If you want a truly unique and memorable spa experience, go to Miraj Hammam. They offer a range of Middle Eastern treatments including the signitaure cleansing and purification ritual of the Hammam bath. The hammam is a centuries-old Turkish bath experience to revel in. It&#8217;s recorded that there were more than 4,000 private and public baths in Istanbul in the 16th century. During the Hammam at this spa in Vancouver you&#8217;ll get to lie on gold marble from Jerusalem in a room filled with eucalyptus steam while you&#8217;re exfoliated and purified.&#160;</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13345\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/photo-2.jpg?resize=422%2C560&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"422\" height=\"560\"></p><p class=\"p1\"><b><i>Time for a great sunset view&#8230; where would you go?</i></b></p><p class=\"p1\">English Bay Beach is one of the most stunning places in Vancouver to watch the sunset. However, if you want an untraditional sunset view, head up to the peak of Vancouver; Grouse Mountain.</p><p class=\"p1\"><b><i>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot. </i></b></p><p class=\"p1\">Guilt &amp; Co is a great place for pre-gaming. The lounge gives off a really laid back feel, but the life size Jenga and live music keep everyone buzzed! It&#8217;s definitely unlike any other lounge in the area and the perfect spot to hit up with some friends.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13346\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/photo-4.jpg?resize=560%2C418&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"560\" height=\"418\"></p><p class=\"p1\"><b><i>If you end the night at a fancy club in&#160;<b><i>Vancouver</i></b>, which one do you head towards? </i></b></p><p class=\"p1\">The Roxy is definitely the go to place in Vancouver. This nightclub plays a variety of live music 365 days a year, from country to hip hop, there&#8217;s something different every night so you&#8217;ll definitely find something you like. Another spot I think everyone should check out at least once is Celebrities night club. This nightclub is a cutting edge dance club that caters to the LGBT community. They do have straight nights, however any night is as fun as any here. You can dress up and be as wild as you like. They&#8217;re known for playing unreal tunes by international DJ&#8217;s and have a different drink special every night. I&#8217;d highly recommend making sure you&#8217;re on the guest list for this club as the wait can be very long.</p><p class=\"p1\"><img class=\"alignleft wp-image-13340 size-thumbnail\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/1689775_10152198328704222_807067880_n.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury Guide to Vancouver\" width=\"150\" height=\"150\">Emily is a Canadian girl on a quest to explore the earth while trying to save it at the same time. As a student, a vegan, a traveler, an environmentalist, and a dreamer; she finds a way to make all her dreams work simultaneously. Emily writes <a href=\"http://www.airplanesandavocados.com\" target=\"_blank\" rel=\"noopener\">Airplanes and Avocados</a>, a travel and health blog, giving readers a unique insight into sustainable and healthy travel, while providing resources for young people and students to inspire their next adventure. Connect on <a href=\"http://www.instagram.com/airplanesandavocados\" target=\"_blank\" rel=\"noopener\">Instagram</a>, <a href=\"http://www.twitter.com/airplaneavocado\" target=\"_blank\" rel=\"noopener\">twitter</a>, and <a href=\"http://www.facebook.com/airplanesandavocados\" target=\"_blank\" rel=\"noopener\">Facebook</a>.</p><p></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Vancouver"}},"pageContext":{"id":"5b9629bd87be0583274911ae"}}