{"data":{"mongodbDatabaseArticles":{"id":"5b9248c687be056953db7bec","content":"<div><p>I had just been 6 months back from <a href=\"http://levels.io/reset-your-life\">traveling</a> and living from friend's couches in Amsterdam. My life at home <a href=\"/love-anxiety-and-startups\">wasn't really working out</a>. I was browsing Twitter, when somebody sent me the video of <a href=\"http://hubud.org/\">Hubud</a>, and I was pulled in again:</p> <p></p> <p>A coworking space made out of bamboo where <a href=\"http://movies.nationalgeographic.com/movies/\">National Geographic filmmakers</a> worked from? Wow.</p> <p>It was in Bali though. Wait, I despised Bali. In my head Bali was a party island full of Australians in neon tank tops I had to avoid at all costs. Something like an even worse version of <a href=\"/koh-phangan-is-the-disneyland-of-partying/\">Koh Phangan</a>. I wanted to avoid seeing any more neon tank tops.</p> <img src=\"/wp-content/uploads/2014/07/Neon_Tank_Top_Promo_new-e1464556575188.jpg\" alt=\"Neon_Tank_Top_Promo_new\" width=\"3582\" height=\"1008\" class=\"alignnone size-full wp-image-6339 responsively-lazy\"> <p>I did my research and it seemed like the image I had of Bali though, the beach party scene, it was true. That was Bali too. But that was just in the south of the island in a place called Kuta. Okay, just avoid Kuta at all cost I thought.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"4606ec8a2777bfb7469fe060dd6b53fd\"><img src=\"/wp-content/uploads/2014/11/4606ec8a2777bfb7469fe060dd6b53fd-1024x475.jpeg\" alt=\"4606ec8a2777bfb7469fe060dd6b53fd\"> <p>So that bamboo coworking space that was awesome? Where was that? In fact, Hubud was located in Ubud. And Ubud was a hippie village in the center of the island:</p> <img src=\"/wp-content/uploads/2014/07/BaliMap.jpg\" alt=\"BaliMap\" width=\"1197\" height=\"730\" class=\"alignnone size-full wp-image-6341 responsively-lazy\"> <p>A little higher in altitude and a little breezier too. Ubud, a place where people with mid-life crises come to find themselves. That was pretty fitting as I was just in an <a href=\"/love-anxiety-and-startups\">existential crisis</a> myself.</p> <h3>Let's go</h3> <p>I made a small stop in Bangkok where I stayed in an airport hotel. It was a nice transition.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247483.jpg\" alt=\"photo44036811243247483\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6404 responsively-lazy\"> <p>I literally just ate fried rice, swam lanes in the pool and had breakfast by the side of the river. It felt fun being back in Bangkok after 6 months away. I felt home here immediately.</p> <img src=\"/wp-content/uploads/2014/07/Bali-Airport-Lounge-5.jpg\" alt=\"Bali-Airport-Lounge-5\" width=\"700\" height=\"525\" class=\"alignnone size-full wp-image-6342 responsively-lazy\"> <p>Then I made my way to Bali, I landed in Denpasar, Bali's very modern airport and took a taxi to my hotel.</p> <img src=\"/wp-content/uploads/2014/07/DSCN19551-e1464559143629.jpg\" alt=\"DSCN19551\" width=\"3918\" height=\"1894\" class=\"alignnone size-full wp-image-6343 responsively-lazy\"> <p>The taxi driver was friendly and more so than Thai, most of the Indonesians spoke pretty good English. Whereas the average Thai, well they really don't speak a word of English really.</p> <h2>Coffee isn't coffee</h2> <p>My driver kept asking me \"you want some coffee?\", after a long flight, I was like, HELL YEAH I DO, so I answered \"sure, let's get some takeaway coffee\". I'd expect my driver to stop at the next gas station and we'd get some. Instead nothing happened for an hour. I was like \"how about that coffee, huh?\". He's like \"yeah! in 30 minutes\". So 30 minutes later we park in front of the jungle. He says, \"coffee here, go in to the jungle\".</p> <p>I'm like, those Indonesian gas stations are deep into the jungle, that must be a cultural thing, but hey cool, why not.</p> <p>I say, \"sure you wait here, and I'll get two okay?\", my driver nods.</p> <p>I walk into the jungle, and there's a big wooden gate that says COFFEE. They must really love their coffee here, because they call their entire gas station after it. I follow a path, and meet lots of people clothed in traditional Indonesian clothes. They lead me to a table. There's 3 guys and 2 girls now pouring me my coffee:</p> <img src=\"/wp-content/uploads/2014/07/coffee_luwak2.jpg\" alt=\"coffee_luwak2\" width=\"700\" height=\"380\" class=\"alignnone size-full wp-image-6344 responsively-lazy\"> <p>I'm like \"no no, you don't get it, I need my takeaway coffee!\". They get it and get me a bag of coffee. They see it's real Indonesian coffee. I'm like, \"no like in a cup\".</p> <p>Then it hits me. This is a coffee farm, and this is not a gas station. On the way to my hotel after a long flight, I'm suddenly on a coffee tour. I get furious and run out.</p> <p>Back at my driver, I tell him \"what the fuck, that's not takeaway coffee\". I'm angry because just 15 minutes into my arrival in Bali, someone has been trying to scam me with a stupid tour. As much as it's a funny communication problem, it's also ridiculous that the taxi that your own hotel sent you and you paid for, is trying to upsell you WHILE your bags are in the car with a 2 hour long coffee tour. It's not really okay.</p> <p>That kinda set the tone for the tourist parts of Bali. They're full of sleazy sales people that are trying to make you pay for stupid overpriced tourist shit you don't want. The real locals are cool. But many just want to do whatever to make money off of you. You get good at detecting and avoiding them though :)</p> <h3>Arriving in Ubud</h3> <p>I booked a cute little hotel room in the Indraprastha Homestay in the center of Ubud, well just outside the tourist center I think. Ubud is tiny, it literally consists of two vertical roads and one horizontal road on top:</p> <img src=\"/wp-content/uploads/2014/07/Screenshot-2016-05-30-00.02.09.png\" alt=\"Screenshot 2016-05-30 00.02.09\" width=\"2216\" height=\"1660\" class=\"alignnone size-full wp-image-6345 responsively-lazy\"> <p>The one horizontal road on top is called Jalan Raya (or Ubud Main Road), here's where most tourists go and stay. The left vertical one is Jalan Monkey Forest, this street is very clean and pretty hip. Then there's the right vertical road which is called Jalan Hanoman. This one has broken sidewalks and it's generally a bit less developed, but a lot more real. I stayed there. There's also little cute streets between those two too like the connecting Jalan Dewi Sita, they have lots of little restaurants (or Warung's).</p> <p>Yes, Jalan means road. Smarty pants!</p> <h2>My home</h2> <p>I checked into my hotel. Indraprastha was like a big patch of land, with walls around it, some dogs and chickens in it, and then it looked kinda like a temple complex.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247477.jpg\" alt=\"photo44036811243247477\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6397 responsively-lazy\"> <p>But every temple was a house or hotel room. I got my room, put my stuff down, showered, and then looked out over my balcony. It's insane how many animals you hear here.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247478.jpg\" alt=\"photo44036811243247478\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6396 responsively-lazy\"> <p>Bali is like a constant pretty crazy loud zoo. It's relaxing though. Waking up in Bali must be one of the best wake up experiences I've ever had:</p> <p></p> <p>The roosters will gradually wake you up from 7, and then they go full on reggeaton loudness war blasting around 11. Then you add the street dogs barking and yes you'll be awake! It's cool inside my room (yay, aircon!). I get out of bed and open my balcony doors. There's a soft breeze and it's already warming up.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247443.jpg\" alt=\"photo44036811243247443\" width=\"1280\" height=\"1280\" class=\"alignnone size-full wp-image-6370 responsively-lazy\"> <p>I have breakfast on my balcony (which is pancakes, WHY?! give me real Indonesian food!) and then have a shower. Pack my backpack and walk out. On my little daily stroll to the coworking space, Hubud, I see lots of stuff.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247452.jpg\" alt=\"photo44036811243247452\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6361 responsively-lazy\"> <p>I started to explore and the first thing I wanted to see was <a href=\"//hubud.org/\">Hubud</a>. That mysterious bamboo coworking space. It was just a 5 minute walk from the middle of Jalan Hanoman to Hubud. They're opposite the Monkey Forest, which is, well, a jungle park full of monkeys. The monkeys get pretty crazy and they go outside the park too. They generally don't bite, but they will fuck around with you. </p> <p>When I was walking next to the park once with my takeaway coffee (yes I found a real one this time), a monkey stopped in front of me and started screeching loudly. SKREEEEAAAACHWHRKEAEHEARRRHRR$*##*&amp;, then it jumped at me and slapped my coffee out of my hand. I was stunned, but everyone else (especially the locals) around me laughed it off.</p> <h2>My first day at Hubud</h2> <p>Hubud is even more impressive than the video. It's indeed all bamboo. </p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247479.jpg\" alt=\"photo44036811243247479\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6395 responsively-lazy\"> <p>There's an incredibly relaxed vibe here. Again it's beautiful people. They look healthy. They're all kinda working on their laptops and lounging around.</p> <p></p> <p>Nobody shouts. People whisper and they're nice. Everybody smiles. It's just really a very nice vibe.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247445-1.jpg\" alt=\"photo44036811243247445\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6399 responsively-lazy\"> <p>The view at Hubud is incredible too.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247447-1.jpg\" alt=\"photo44036811243247447\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6398 responsively-lazy\"> <p>In Hubud, I do some work and meet Vitto. He's the manager of Hubud. Indonesian. And by sheer miracle, he speaks Dutch as he studied there. I have no idea where to eat, so Vitto and his friends bring me to a local warung:</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247444.jpg\" alt=\"photo44036811243247444\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6369 responsively-lazy\"> <p>The next day in Hubud, I sit down and a guy with short blond hair looks at me, takes his headphones off and says he recognizes me: LEVELS! \"I read <a href=\"/hong-kong-new-york-of-the-east/\">your post about Hong Kong</a>\". WOW! His name is <a href=\"//twitter.com/arnasgold\">Arnas</a> and he's a UX designer. That day we go eat and drink at <a href=\"http://theonionco.com/\">The Onion</a>, a restaurant/bar where I meet Arnas's friend <a href=\"//twitter.com/bluddyholly_\">Kintan</a> and others.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247450.jpg\" alt=\"photo44036811243247450\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6363 responsively-lazy\"> <p>The Onion is where we meet up a lot. It's like a mellow open air bar run by a super cool Malaysian guy. It's walkable from Hubud, so it's the spot after work to hang out and chill:</p> <img src=\"/wp-content/uploads/2014/07/Onion-Collective-01-1.jpg\" alt=\"Onion Collective 01 (1)\" width=\"580\" height=\"370\" class=\"alignnone size-full wp-image-6393 responsively-lazy\"> <h2>My road trip</h2> <p>Everyone at the Onion tells me they are going on a trip to the north of Bali this week, to a tiny rustic place called Amed, in the north of Bali. I'm usually a no-sayer to these things, I don't know why, maybe cause I only met these people 2 days, haha! But I say YES. Next day we meetup and go.</p> <img src=\"/wp-content/uploads/2014/07/500px-Bali-Amed-Map.png\" alt=\"500px-Bali-Amed-Map\" width=\"500\" height=\"284\" class=\"alignnone size-full wp-image-6296 responsively-lazy\"> <p>We book a hotel there, and around noon we leave from Hubud by car. Bali is BIG. It's a few hours drive to get just from the bottom to the top of the island.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247476.jpg\" alt=\"photo44036811243247476\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6380 responsively-lazy\"> <p>I'm still amazed I just arrived here a few days ago and now I'm in a car with cool people who want to go on a fun road trip. The ease of making friends here is pretty great. Obviously friends is a big word.</p> <p>We arrive and check in but the hotel says they don't have any rooms anymore. But we did book our rooms. What follows is a weird stand off outside on the tiled steps up to the bungalows between our Indonesian friends, the Indonesian hotel staff, and me and the other Westerners looking on. Nothing happens though after we sit for 15 minutes. So I start to get angry. Politely though. Kinda fake acting angry. But it works. Suddenly they bring us to a neighboring villa resort with. Well. A gigantic villa with pool:</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247473.jpg\" alt=\"photo44036811243247473\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6381 responsively-lazy\"> <p>We never booked this. This would be way too expensive. But we got it. There's 4 bedrooms, a living room, a huge kitchen, lots of bathrooms, an open-air shower tiled with fractals:</p> <p>And a huge balcony overlooking the Northern coast of Bali. It's pretty much an MTV Cribs house.</p> <p>I learn that this is how things work in Bali. You have to get fake angry at shit all the time. Otherwise nothing gets done by the local Balinese. Or you just get scammed. Sorry not sorry but it's true.</p> <p></p> <p>We jump into the pool, have food and drinks. We have a personal chef that cooks us breakfast, lunch and dinner and whatever else we want. It's insane.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247470.jpg\" alt=\"photo44036811243247470\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6382 responsively-lazy\"> <p>We fly my drone.</p> <p>[insert Drone video here]</p> <p>It turns out there's lots more people from Hubud here, and in the evening we all visit a reggae bar on the beach.</p> <img src=\"/wp-content/uploads/2014/07/IMG_5530.jpg\" alt=\"IMG_5530\" width=\"720\" height=\"340\" class=\"alignnone size-full wp-image-6384 responsively-lazy\"> <p>I look up and I can see the milky way, kinda like this:</p> <img src=\"/wp-content/uploads/2014/07/original.jpg\" alt=\"original\" width=\"2045\" height=\"1150\" class=\"alignnone size-full wp-image-6383 responsively-lazy\"> <p>This is pretty great.</p> <p>It's like 20 cool kids (and older people too) dancing on a beach and talking under the stars. If this is perfection, it's pretty fucking perfect.</p> <h2>Hippies, neohippies and yoga-bunnies</h2> <p>Ubud consists of a peculiar mix of Balinese locals:</p> <img src=\"/wp-content/uploads/2014/07/Bali_0720a.jpg\" alt=\"Bali_0720a\" width=\"3504\" height=\"2336\" class=\"alignnone size-full wp-image-6352 responsively-lazy\"> <p>Hippies:</p> <img src=\"/wp-content/uploads/2014/07/63-bliss-c.jpg\" alt=\"63-bliss-c\" width=\"838\" height=\"557\" class=\"alignnone size-full wp-image-6300 responsively-lazy\"> <p>Tech-enabled neo-hippies:</p> <img src=\"/wp-content/uploads/2014/07/02-hubud-corporate-01.jpg\" alt=\"02-hubud-corporate-01\" width=\"800\" height=\"534\" class=\"alignnone size-full wp-image-6353 responsively-lazy\"> <p>And LOTS of girls doing yoga:</p> <img src=\"/wp-content/uploads/2014/07/yoga-skinny-girls_updog-1.jpg\" alt=\"yoga-skinny-girls_updog\" width=\"700\" height=\"435\" class=\"alignnone size-full wp-image-6351 responsively-lazy\"> <p>There's even a steampunk scene in Ubud and they have a whole cafe dedicated to them called <a href=\"http://www.kismetbali.com/\">Kismet</a>:</p> <img src=\"/wp-content/uploads/2014/07/shop-e1464566565825.png\" alt=\"shop\" width=\"794\" height=\"588\" class=\"alignnone size-full wp-image-6302 responsively-lazy\"> <p>And everyone and everything there looks kinda like this:</p> <img src=\"/wp-content/uploads/2014/07/Steampunk-Clothing.jpeg\" alt=\"Steampunk-Clothing\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-6301 responsively-lazy\"> <p>I love how it's possible this stuff exists. All these subcultures can just live on an island on the other side of the world and thrive. That's really cool.</p> <h2>Voodoo energy</h2> <p>I left Holland because I was in a kind of <a href=\"/love-anxiety-and-startups/\">weird mental state after traveling</a>. And I thought maybe traveling again would resolve it.</p> <p>If you're like that, Bali becomes even more interesting. I could feel a definite strong kind of energy in the air. It's hard to wrap your head around. But there's a vibe. The island has a voodoo-eey feel to it, especially at night. Actually the whole island reminds me of Monkey Island 1:</p> <a href=\"//www.youtube.com/watch?v=yiNxwjZ0_zM\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/11/voodoolady.png\"></a> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/11/monkey024.jpg\"> <p>The Balinese traditional music that's played doesn't help with the voodoo vibes, at all. It's Gamelan:</p> <p></p> <p>It sounded dark....and somewhat evil-ly to me. As <a href=\"//en.wikipedia.org/wiki/Gamelan\">Wikipedia describes</a>:</p> <blockquote><p> \"Certain pieces are also believed to possess magic powers, and can be used to ward off evil spirits.\" </p></blockquote> <p>Ah! I wasn't far off. Probably trying to out-evil those evil spirits, aye?!</p> <p>There's ornaments everywhere with angry looking monsters on the sides of buildings:</p> <img src=\"/wp-content/uploads/2014/07/29B-net_publication-400.jpg\" alt=\"29B--net_publication--400\" width=\"386\" height=\"400\" class=\"alignnone size-full wp-image-6354 responsively-lazy\"> <p>There's regular parades, again with that Gamelan music, to keep away the bad spirits:</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247453.jpg\" alt=\"photo44036811243247453\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6360 responsively-lazy\"> <p>And every day they light little pieces of incense wrapped in green leaves and put it outside to sacrifice to the gods. The leaves get eaten by dogs though. Does that mean the dogs are the gods? Oh shit the opposite of dog IS GOD. WHAT DOES THIS INFORMATION MEAN?</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247455.jpg\" alt=\"photo44036811243247455\" width=\"1280\" height=\"930\" class=\"alignnone size-full wp-image-6372 responsively-lazy\"> <p>And then there's every Balinese who tells you stuff like how they just moved to their friend's house because their own house has been taken over by a ghost. And their house has to be \"de-ghosted\". Or when you're on the back of motorcycle taxi driver and the guy starts honking wildly at night. You ask him, \"why?\". And he tells you this area is filled with evil spirits of the dead because it's close to a cemetery. And he needs to scare them away.</p> <p>Or that time when you want to rent an Airbnb in the middle of a rice field that's suspiciously cheap:</p> <img src=\"/wp-content/uploads/2014/07/ubud-dgf.png\" alt=\"ubud-dgf\" width=\"838\" height=\"325\" class=\"alignnone size-full wp-image-6355 responsively-lazy\"> <p>And the Balinese tell you \"that's because only foreigners live there\". You ask \"why?\". Because \"a house in the middle of a rice field attracts evil spirits\". Oh shit.</p> <p>Yup. Did I tell you I wasn't that mentally stable already? Hahaha, evil spirits DO NOT HELP THANKS.</p> <h2>Spirits and spirituality</h2> <p>Now, this is also why Bali attracts all these free-thinking new-age spiritual people. Because there's a definite connection I can see between these two worlds.</p> <p>They're people without the limiting framework of society. That makes them incredibly interesting. But also very often, very lost.</p> <p>They also all wear a necklace like this, haha:</p> <img src=\"/wp-content/uploads/2014/07/Screenshot-2016-05-29-15.29.15.png\" alt=\"Screenshot 2016-05-29 15.29.15\" width=\"1132\" height=\"798\" class=\"alignnone size-full wp-image-6303 responsively-lazy\"> <h2>So, everyone is lost</h2> <p>It took me a few weeks to realize that mostly everyone in Ubud is lost in some way or the other.</p> <p>And that's why the cliche of <a href=\"//www.youtube.com/watch?v=mjay5vgIwt4\">\"Eat, Pray, Love\"</a> was valid.</p> <p>People come to Bali after their break-up, mental breakdown, mid-life crisis, burn out or just when they feel <a href=\"/generation-y-feels-lost/\">\"lost\"</a>. And everyone staying here for a long time who isn't lost yet, has <a href=\"/traveling-makes-feel-lost/\">high odds of becoming it</a>.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247451.jpg\" alt=\"photo44036811243247451\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6362 responsively-lazy\"> <p>I spent a lot of my time with Graecie, from Jakarta. She had come to Bali for no reason other than \"I'm so lost\". It became a running joke with all of us in Hubud. She didn't know who she was, what she wanted to do with her life. And honestly, being in Ubud, it only made her more lost. We talked endless about life into the night. And it felt nice to meet someone else as lost as me.</p> <p>I'd say it's great to be in Bali for awhile if your life hits you the wrong way, but be sure to get out after a month Because it's probably only going to make your more lost.</p> <p>But isn't being lost in life also just being open-minded? You lose any framework of judgement and just accept everything as is? I think so. In that respect, being lost can be a good thing.</p> <p>That's why Bali is so open minded.</p> <p>I was invited to go to villas where they had 10-people weekend orgies with mushrooms and LSD (I passed this one, too afraid of drugs, also orgies). There were girls who told me they wanted to show me my tantric erogenous energy zones, naked (not going to say what happened next). I mean, what happens if you put lots of beautiful sexy people open to anything together on an island. Surprise, surprise! SEX!</p> <p>But it wasn't tacky. Definitely not in Ubud. I know I just said orgies. Still! Hooking up here felt romantic. Spiritual. Like lots of holiday loves. I mean, there was palm trees! This island radiated spiritual love.</p> <p>I also noticed a strong current of openness to gender fluidity and bisexuality here. There was boyish girls, girlish boys and people experimented here with identity.</p> <p>If anything, it was my own prejudice, mental frameworks and judgement of other people that I became aware off here. And I quickly got rid off it.</p> <h2>Island food</h2> <p>Balinese and Indonesian food is probably my favorite food ever next to Thai. It's very similar to Malaysian. And if you visit an authentic real Warung (Indonesian word for restaurant), it's very cheap (and good) too.</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247442.jpg\" alt=\"photo44036811243247442\" width=\"732\" height=\"1280\" class=\"alignnone size-full wp-image-6371 responsively-lazy\"> <p>Then there's also LOTS of raw, vegan, vegetarian, organic and generally very healthy food around in Ubud. This stuff is pricey as it's for foreigners, but it's good too. On my way to work, I passed a place called Kafe, where everything was organic:</p> <img src=\"/wp-content/uploads/2014/07/kafe3.jpg\" alt=\"kafe3\" width=\"1504\" height=\"1000\" class=\"alignnone size-full wp-image-6310 responsively-lazy\"> <p><a href=\"http://hubud.org/\">Hubud</a> for example had its own raw food cafeteria. Very expensive, but definitely nice and healthy food.</p> <h2>Mystery houses on top of mountains with massages</h2> <p>At Hubud, I met Sevi. That was his nickname. A Spanish guy and he came from Sevilla. That's why he was called Sevi. He was a visual artist and he did visuals for the local techno nights. We hung out and we both wanted to get a massage. He said he knew a place. He got his motorcycle, which was a huge off-road dirt bike and told me to jump on the back.</p> <p>I just knew this guy for 15 minutes and know we were driving out of Ubud, in the dark, up this mountain range. I had no idea what was going to happen.</p> <p>It was a long ride and then suddenly we were in a pitch black field full of palm trees and nothingness. Sevi said \"it's around here\". We walk around and I hear dogs barking. There's a little shed and we get in. Suddenly we're in paradise. It's a complex of buildings and the interior is stone pebbles and mystical. Very mystical. We end up in a circular bowl room with two beds and get an oil massage. In the background I hear the sounds of Bali's night. </p> <p>I've been here a week. This is all so weird.</p> <h2>Hubud</h2> <p>I get back to Hubud. I've only been here a week but I know everybody. There's social dynamics like crazy here. We gossip and laugh with each other. It feels like <a href=\"//www.youtube.com/watch?v=dkX8J-FKndE\">Breakfast Club</a>, but on an island.</p> <p><strong>All these lost kids, the so-called \"millenials\", dropping in and out of a bamboo building doing internet stuff, and just doing whatever they want. Not following traditional paths (at least for now), but choosing their own. It's magical.</strong></p> <p>Unfortunately, after just two weeks, it's time for me to go (for now). It was fun and I was quite productive too.</p> <p>I've also been working on my next startup from here (as part of my <a href=\"/12-startups-12-months/\">12 startups in 12 months</a> project):</p> <img src=\"/wp-content/uploads/2014/07/photo44036811243247449.jpg\" alt=\"photo44036811243247449\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-6364 responsively-lazy\"> <p>I got a tweet that I'm invited to pitch one of my startups to <a href=\"//twitter.com/davemcclure\">Dave McClure</a> in Manila, to potentially get venture capital:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">Congrats <a href=\"//twitter.com/levelsio\">@levelsio</a> <a href=\"//twitter.com/getbooky\">@Getbooky</a> ! You were selected to speed date with <a href=\"//twitter.com/geeksonaplane\">@geeksonaplane</a> geeks on July 24 <a href=\"//twitter.com/hashtag/Manila?src=hash\">#Manila</a> Will you attend? :) rsvp email</p> <p>&#8212; Geeks on a Beach (@GeeksOnABeach) <a href=\"//twitter.com/GeeksOnABeach/status/490161774650339328\">July 18, 2014</a></p></blockquote> <p></p> <p><a href=\"/manila\" class=\"broken_link\"><strong>It'll be my first visit to the Philippines, yay! &#187;</strong></a></p> <p>[Draft written in 2014, Edited 2016-02-23, Published 2016-05-29]<br> [This was posted 2016-05-30, based on my travel notes from 2014-07, I'll be back posting more based on my old travel notes in the next few months until I have my blog updated to today's trips again]</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Bali is the magical voodoo spirit island of Asia"}},"pageContext":{"id":"5b9248c687be056953db7bec"}}