{"data":{"mongodbDatabaseArticles":{"id":"5b95ee1a87be0583274900ca","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">What Things Are Not Cheap in Thailand?</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-13007\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/Not-Cheap-in-Thailand-Header2-1000px1.jpg?resize=998%2C561&amp;ssl=1\" alt=\"What things are not cheap in Thailand?\" width=\"998\" height=\"561\"></p>\n<p>We love&#160;that Thailand is among the world&#8217;s most affordable countries to travel and live in, and it certainly allows us to live comfortably on much less than we did back home. But all things are not cheap in Thailand and many people are lead to believe this (as we once were). Saying so is&#160;both&#160;inaccurate and deceptive. So here&#8217;s a look at Thailand&#8217;s more expensive side.</p>\n<p>Cheap rent? Yup. Inexpensive food? You got it. Affordable medical care? You betcha. There are tons of budget-friendly aspects about Thailand, which makes it&#160;such a popular place to travel to and live in as well as a hot&#160;topic for people to write home&#160;about.</p>\n<p>Although these three key components to basic healthy living can be very affordable in Thailand, there are&#160;far more to life&#8217;s expenses than where you sleep, what you consume on a daily basis, and how you&#160;care for your body. This is what many of Thailand&#8217;s visitors who blog or vlog fail to mention and why sharing such an incomplete snapshot of their monthly expenses irks the heck out of us.&#160;</p>\n<p>Time and time again we come across blog posts, videos, or online articles through&#160;popular traveling websites where the author talks&#160;about living in Thailand for just a few hundred dollars a month. In fact, we recently stumbled across an article like this and it had us shaking our heads. It&#8217;s actually what inspired us to write this post.</p>\n<p>&#8220;My rent is 150 USD per month and I spend 5 USD on food each day. I spend the rest on transportation and treating myself to massages a few times a week. See, I can live in [fill in blank with random Thai city] for 400 USD per month!&#8221;&#160;End itemized expenditure.</p>\n<p>We kid you not.</p>\n<p>You don&#8217;t say?! You failed to mention your electricity bill. What about laundry, whether you do it at a coined machine or drop it off at the cleaners? Bottled water? Adult beverages and entertainment? That replacement backpack you so desperately need? You&#8217;ve also failed to mention the cost of grown-up responsibilities such as visa expenses (the visa itself plus the transportation costs to do a border run), a one month&#8217;s security deposit at your new apartment, or the cost of a new bicycle tire or motorbike helmet.</p>\n<p>Anyhow, too many people believe that Thailand is dirt cheap across the board when it&#8217;s not.&#160;We cannot stress enough that things are not&#160;cheap in Thailand all the time. Here&#8217;s more on we&#8217;re talking about:</p>\n<h2><p id=\"Electronics\"><p>Electronics</p></p></h2>\n<p>Angela lost her iPhone in Bangkok the first day we moved to Thailand. The story had something to do with&#160;a cab driver who couldn&#8217;t find our hotel, having to pee like a racehorse, and leaping from the taxi&#160;without noticing the&#160;soon-to-be orphaned phone in the back seat.</p>\n<p>Unfortunately, she went awhile without a replacement. That&#8217;s because a quick look at an iPhone 4 back in 2013 was about 500 USD. There was no discounted price for signing up for a new cell phone plan as there is in the US, either!&#160;In fact, the other day we were looking at the new Samsung Galaxy 6, and it&#8217;s over 700 USD. Wowzers.&#160;</p>\n<p>TVs and computers are just as expensive and don&#8217;t even get us started on batteries or memory cards. On a recent equipment overhaul, we realized that extra batteries and memory cards for our new camera cost us nearly twice as much in Thailand as they&#160;did back home! And the strangest thing was that some of the items were even stamped &#8220;Made in Thailand.&#8221;</p>\n<p>As far as smaller single-voltage electronics go, we&#8217;ve had success finding cheaper versions at the markets or small mom and pop stores. We&#8217;ve reluctantly purchased an electric razor at Robinson (a big modern department store) for nearly 1,500 baht (43 USD) because it was the first one we had seen in weeks after our arrival. Months later we found a better, cheaper model at the bottom floor of a Big C for less than 500 baht (14 USD). Even so,&#160;we&#8217;ve&#160;purchased&#160;electric razors for less than 20 USD back in the States, so it wasn&#8217;t much of a&#160;bargain.</p>\n<h2><p id=\"Vehicles\"><p>Vehicles</p></p></h2>\n<p>Cars are expensive in Thailand and it doesn&#8217;t help that all the popular models are imported. The cost of a new basic model Honda Civic is 778,000 baht (24,698 USD) while the median income of a Thai citizen&#160;with a bachelor&#8217;s degree is 804,950 baht (25,554). Unfortunately, the average yearly Thai salary is <a href=\"http://www.averagesalarysurvey.com/article/average-salary-in-thailand/01181229.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">267,750 baht</a>&#160;(8,500 USD). It&#8217;s easy to see why motorbikes are a popular alternative to cars. It was the case for&#160;us!</p>\n<p>Even renting a car in Thailand is nearly ten times more expensive than renting a motorbike. On a short-term contract, you can usually get&#160;a 125cc bike for 150 to 200 baht per day. A car usually goes for around 1,200 to 1,500 baht per day. That&#8217;s a price swing of 5.70 USD to 43 USD!</p>\n<h2><p id=\"Furniture\"><p>Furniture</p></p></h2>\n<p>After signing a lease on a&#160;<a title=\"Our $500 Per Month Townhouse in Chiang Mai\" href=\"https://www.tielandtothailand.com/townhouse-in-chiang-mai/\">partially furnished townhouse</a>, we had assumed that if our rent was a quarter of what we were paying back in the US, surely the furniture would be around that same 25% price point. Wrong.</p>\n<p>About a dozen stores later, we just couldn&#8217;t swing the money for 21,000 baht (600 USD) couch and the 3,000 baht (86 USD) for each bar stool. That&#8217;s more than two month&#8217;s rent! So we reluctantly stuck with the sparse Thai-styled furniture that came with the townhouse.</p>\n<h2><p id=\"Alcohol\"><p>Alcohol</p></p></h2>\n<p>The local beer and liquor are&#160;especially cheap and we shamefully admit drinking them&#160;on a typical night out. Unfortunately, the few local beer brands (Chang, Singha, and Leo) are&#160;generally similar (all light pale lagers) and the local whiskey rum is pretty rough going down. When we want something different, we pay out our noses.</p>\n<p>Imported liquor, wine, and beer are actually just as pricey as back home, if not a little more because of import taxes. After awhile, it&#8217;s difficult to justify spending 150 baht on a Thai dinner for two and then turn around and drop 900 baht on six weakly poured cocktails.&#160;We&#8217;d rather just share a bottle set of local Sangsom rum and soda water and mix it ourselves for 200 baht. Or go for&#160;a 100&#160;baht (2.85 USD) 630 mL bottle of Leo instead of a&#160;200 baht (5.70 USD) 568 mL pint of Guinness.</p>\n<h2><p id=\"Bottled_Products\"><p>Bottled Products</p></p></h2>\n<p>Shampoo, body wash, deodorant, lotion, bug spray, dish soap, bathroom cleaner&#8230;keeping yourself and your house clean and smelling good costs just about the same as it did before. Sure, some of the generic or Thai brands are more&#160;affordable and there are selections of cheap but low-quality products. But again, it&#8217;s not as if a bottle of laundry detergent or face lotion costs 20% of what it did back home.</p>\n<h2><p id=\"Western_Food\"><p>Western Food</p></p></h2>\n<p>When we first moved to Thailand, we were happy to see that the major cities served&#160;familiar&#160;Western&#160;food. At first we didn&#8217;t&#160;mind spending 250 baht (7 USD) on a single serve&#160;pizza or 150 baht (4.30 USD) on a burger and fries, because&#160;for once it was cheaper here in Thailand.</p>\n<p>But when we got over the novelty and compared it to the&#160;price of Thai food &#8211; good Thai food &#8211; and realized we were paying five or six times more for a plate of mediocre spaghetti, it made us think twice how much we were spending.</p>\n<p>And as far as groceries go, we are thrilled to have several Western grocery stores in Chiang Mai with access to foods like&#160;hummus, beef stock, tortillas, and Greek yogurt. However, the <a href=\"https://www.tielandtothailand.com/cost-grocery-shopping-thailand/\" target=\"_blank\" rel=\"noopener noreferrer\">price difference in groceries</a> between what we spend at our local market (around 300 baht or 8.60 USD) three times a week and what we spend on our current twice-a-month trip to our favorite international grocery store&#160;(4,000 baht or about 115 USD) is&#160;quite a bit!</p>\n<h2><p id=\"Western_Clothing\"><p>Western Clothing</p></p></h2>\n<p>If you&#8217;re big busted or bellied, long-legged, or have larger than average feet,&#160;you will pay much more for quality clothing and shoes that fit you. That&#8217;s because (at least from our experience) most of the larger sizes are imported brands found at the modern malls. Some of the extra large sizes don&#8217;t even exist in Thai clothes!</p>\n<p>Shorter slimmer people will have luck finding cheap (yet again, low quality) clothes in Thai markets for 150 to 300 baht, but it get&#8217;s old when the hems start unraveling or buttons pop off after a few washes. You get what you pay for, and that&#8217;s just the case with good quality Western-sized clothes. So get ready to dish out 1,000+ baht for a new pair of pants, a new dress, or a nice shirt.</p>\n<h2><p id=\"Visas\"><p>Visas</p></p></h2>\n<p>Visa services, applications, and visa maintenance (such as extensions or expenses related to border runs) are all necessary evils and the price of them adds up. In fact, just the other day we applied for extra pages in our passports at the US Consulate and they were a whopping 82 USD per&#160;passport. For some stinkin&#8217;&#160;paper!</p>\n<p>It&#8217;s easy to overlook this expenditure because it only rears its ugly head once every few months, or if you&#8217;re lucky once a year, but it can&#8217;t be ignored as part of your budget.</p>\n<h2><p id=\"Things_Are_Not_Cheap_in_Thailand8230_At_Least_Not_Always\"><p>Things Are Not Cheap in Thailand&#8230; At Least, Not Always</p></p></h2>\n<p>We could go on about other things like some traveling expenses, kitchen appliances, or tuition at international schools, but we think you get the point.</p>\n<p>On the flip side, not everyone who lives in Thailand has to&#160;or wants to&#160;live cheaply. There is still a market for people who are willing to pay more, so it shouldn&#8217;t come as a surprise to learn that&#160;all&#160;things are not cheap in Thailand.</p>\n<p>Realistically, a portion of your monthly expenses will go to expensive items, some of which are either sudden necessities&#160;or&#160;emergencies. Don&#8217;t feed into this &#8220;live like a king for $500 per month&#8221; hogwash&#160;that continues to circulate on the web. If your common sense tells you it sounds too good to live comfortably and happily off a few hundred bucks a month, it probably is.</p>\n<p>&#8595;&#160;PIN THIS POST FOR LATER&#160;&#160;&#8595;</p>\n<p><img class=\"aligncenter size-full wp-image-14359\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/ThingNotCheap-Pinterest.jpg?resize=384%2C561&amp;ssl=1\" alt=\"What things are not cheap in Thailand? You may be surprised to hear that some things are expense! | Tieland to Thailand\" width=\"384\" height=\"561\"></p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"What Things Are Not Cheap in Thailand?"}},"pageContext":{"id":"5b95ee1a87be0583274900ca"}}