{"data":{"mongodbDatabaseArticles":{"id":"5b95ea1e87be05832748ff81","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/2018/ios_connecting.jpg\" alt=\"a view of the island of ios\">Posted: 05/25/2010 | May 25th, 2010</p><p>A few weeks from now, I turn one year closer to 30. It&#8217;s a reality that isn&#8217;t sitting well with me.</p><p>At the beginning of the year, I decided I&#8217;d spend the <a href=\"https://nomadicmatt.com/travel-guides/europe-travel-tips/\" rel=\"noopener\" target=\"_blank\">summer in Europe</a>, with most of my time spent on <a href=\"https://nomadicmatt.com/travel-guides/greece-travel-tips/ios/\" rel=\"noopener\" target=\"_blank\">the island of Ios</a> in Greece. During the summer months, the island becomes a haven for young backpackers seeking to soak up the sun, water, and the suds. I knew there wouldn&#8217;t be another chance to do this pre-30. It was time to do it now, before I became that &#8220;dirty old backpacker.&#8221;</p><p>But like all the best-laid plans, this one fell through. I have to return to the US in June to speak at TBEX, cutting my summer trip in half. Now there will be no spending the <a href=\"https://nomadicmatt.com/travel-guides/greece-travel-tips/\" rel=\"noopener\" target=\"_blank\">summer in Greece</a> enjoying my &#8220;pre-30&#8221; crisis. My trip to the Greek islands will only last a few weeks before I move on to <a href=\"https://nomadicmatt.com/travel-guides/italy-travel-tips/\" rel=\"noopener\" target=\"_blank\">Italy</a>, Hungary, and <a href=\"https://nomadicmatt.com/travel-guides/sweden-travel-tips/\" rel=\"noopener\" target=\"_blank\">Sweden</a>. Something had to be cut.</p><p>So, heavy heart in hand, I arrived in Ios more than two weeks ago to stay for four nights. I stayed six. Then, leaving for <a href=\"https://nomadicmatt.com/travel-guides/greece-travel-tips/santorini/\" rel=\"noopener\" target=\"_blank\">Santorini</a>, I ended up returning two days later. I missed Ios too much. I stayed for another week before I left for Paros and <a href=\"https://nomadicmatt.com/travel-guides/greece-travel-tips/mykonos/\" rel=\"noopener\" target=\"_blank\">Mykonos</a>. Now I&#8217;m contemplating spending my last two days in Greece back on Ios.</p><p>I often talk about what travel is and what it means. What does it mean to travel? To backpack? <a href=\"https://nomadicmatt.com/travel-blogs/is-this-really-travel/\" rel=\"noopener\" target=\"_blank\">Is one form better than the other</a>?</p><p>Travel doesn&#8217;t fit into a box. It&#8217;s a lot of things. It&#8217;s more than seeing a place or a style of travel. But one thing that permeates all discussions about the nature of travel is that, at the end of the day, travel is about making connections. Not only with places, but with people, too.</p><p><img src=\"https://media.nomadicmatt.com/2018/ios_connecting2.jpg\" alt=\"a view of the island of ios\"></p><p>Ios is quite beautiful, with a picturesque town, great beaches, and historic terraced cliffs. But there&#8217;s nothing really special about the island itself. There are more <a href=\"https://nomadicmatt.com/travel-blogs/the-greek-islands/\" rel=\"noopener\" target=\"_blank\">beautiful islands in Greece</a>. And, really, I prefer my islands to have more palm trees, jungle, and tropical fish.</p><p>While there&#8217;s something for everyone on Ios, its main draw is still the partying, beaches, and crowds. I came for that atmosphere, but I stayed because of the connections I made with the people. <a href=\"https://nomadicmatt.com/travel-blogs/chasing-ghosts-again/\" rel=\"noopener\" target=\"_blank\">I&#8217;m pulled back there</a> because of those connections.</p><p>Arriving pre-season before the crowds, I made friends with the owners of empty bars and restaurants. George at the Greek restaurant the Nest taught me some Greek. Alex from Blue Note Bar introduced me to the variety of Greek alcohol. Many nights, Demetri and Nicos from Slammers discussed the sad state of Greek politics with me over ouzo. When you arrive so early in the season, there aren&#8217;t many tourists other than those looking for work. So you bond and chat because it&#8217;s only you, not a rotating door of people every three days. And sometimes, you just click.</p><p><img src=\"https://media.nomadicmatt.com/2018/ios_connecting3.jpg\" alt=\"sunset on Ios\"></p><p><a href=\"https://nomadicmatt.com/travel-blogs/finding-life-long-friendships/\" rel=\"noopener\" target=\"_blank\">You meet a lot of people when you travel</a>. Faces and names begin to blur after a while. You become friends on Facebook, but you rarely ever see each other again. I&#8217;ve met thousands of people on the road, but only a handful of people whose weddings I&#8217;ll attend and babies I&#8217;ll meet. It becomes a rare occurrence when you meet people you connect with on a deeper level. It happened to me when I lived on the Thai island of Ko Lipe in 2006, where, four years later, all of us were having Christmas together. It happened on Haat Rin in 2007, where, two years later, I attended the wedding of my Australian friends. It happened <a href=\"https://nomadicmatt.com/travel-blogs/the-flying-tomatoes-of-la-tomatina/\" rel=\"noopener\" target=\"_blank\">last year in Valencia</a>, when three Americans, two Australians, and one Malaysian shared a dorm room for a week and clicked so well that people asked us how, when, and <a href=\"https://nomadicmatt.com/travel-blogs/the-people-who-shaped-my-life/\" rel=\"noopener\" target=\"_blank\">where we had became such good friends</a>, given our different nationalities. &#8220;We just met three days ago,&#8221; we&#8217;d say to their astonishment.</p><p>And so again on Ios, a group of strangers came together and acted as though they&#8217;d known each other for years. Some will work the whole season on Ios. Others leave in a few weeks. Some stay half the summer. Some left before me. But all of us impacted each other in some way, and each day I see a common update on Facebook from those who have already left: &#8220;I miss Ios.&#8221;</p><p>Time is different on the road. Days feel like weeks and months like years. Two weeks on Ios felt like an eternity. When I left, people couldn&#8217;t believe I was only there two weeks. To them, and to me, it felt much longer. I don&#8217;t regret only spending two days on Santorini and Mykonos, though, because it gave me more time with friends on Ios. Travel is about the people we meet more than the places we see.</p><p>And somewhere out there, other travelers are connecting and forming bonds that will last far into their futures, too. Somewhere in the world, they too are nicknaming themselves &#8220;a family&#8221; and just watching the world go by together&#8230;<br> <img src=\"https://media.nomadicmatt.com/ios4.jpg\" alt=\"the family\" width=\"675\"></p><p><strong>Want more information on this awesome island? See my guide to <a href=\"https://nomadicmatt.com/travel-guides/greece-travel-tips/ios/\" rel=\"noopener\" target=\"_blank\">Ios</a> and find out how you can travel there.</strong></p><h4>Book Your Trip to Ios: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Ios by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://nomadicmatt.momondo.com/?utm_source=private&amp;utm_medium=affiliate&amp;utm_campaign=nomadicmatt\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Ios with <a href=\"https://www.nomadicmatt.com/travel-blogs/the-island-of-ios/\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" rel=\"noopener\" target=\"_blank\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Ios?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/travel-guides/greece-travel-tips/ios/\" target=\"_blank\" rel=\"noopener\">destination guide on Ios</a> for even more planning tips!</p><p>&#160;</p><p>Photo credit: <a href=\"https://www.flickr.com/photos/edoardotacconi/3862234243/\">3</a></p></div>","title":"Connecting on the Island of Ios in Greece: A Travel Story"}},"pageContext":{"id":"5b95ea1e87be05832748ff81"}}