{"data":{"mongodbDatabaseArticles":{"id":"5b95ee8787be0583274900e1","content":"<div><p><img class=\"aligncenter size-full wp-image-13019\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/08/Tips-for-Visiting-Thaland-for-the-First-Time-1000px.jpg?resize=998%2C635&amp;ssl=1\" alt=\"Tips for Visiting Thailand for the First Time\" width=\"998\" height=\"635\"></p>\n<p>It wasn&#8217;t that long ago (ok, 2012) that we were visiting Thailand for the first time and had boatloads of questions before our arrival. So, we put ourselves into newbie shoes, thought about what our concerns were, and wrote up a list of essential tips that you can use during your first visit. Follow this mini guide and you&#8217;ll fit right in!</p>\n<h2><p id=\"Visiting_Thailand_for_the_First_Time_Here8217s_Our_Advice\"><p>Visiting Thailand for the First Time? Here&#8217;s Our Advice</p></p></h2>\n<p>We&#8217;ve definitely experienced that silly feeling when researching a country for the very first time and realizing that we didn&#8217;t know what airport to fly into or what clothes we should pack. If you&#8217;re feeling the same way, don&#8217;t worry! We&#8217;ve&#160;got&#160;you covered. Here are introductions to the following Thailand travel topics: What to wear, food, proper etiquette, major cities, money talk, sightseeing suggestions, types of transportation, and safety. Although these have been greatly elaborated on in Thailand&#8217;s guidebooks, we&#8217;ll just give the highlights.</p>\n<p><a name=\"wear\"></a></p>\n<h2><p id=\"What_to_Wear_in_Thailand\"><p>What to Wear in Thailand</p></p></h2>\n<p></p><img class=\"wp-image-13021 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/08/wear-at-thai-temple-27-1000px.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"Thailand Travel 101: East meets West choice in attire\" width=\"1000\" height=\"666\"><p>Thailand is hot and sunny and temperatures generally range from 80 to 95 degrees Fahrenheit (27 to 35 degrees Celsius) year round. Many guidebooks recommend wearing &#8220;conservative or polite clothing&#8221; but that could mean a range of things depending on what country you&#8217;re from.</p>\n<p>Many Westerners tend to wear fewer clothes or clothing that shows skin to stay cool. On the other hand, Eastern foreigners tend to wear clothing that covers their skin and protects them from the sun&#8217;s rays. You can very often see them walking around with umbrellas. In fact, the above picture is an excellent example of East versus West preference in clothing.</p>\n<p>After observing what local Thais wear, here are our thoughts on what to wear in Thailand:</p>\n<h3><p id=\"Recommended_Attire_in_Thailand\">Recommended Attire in Thailand</p></h3>\n<ul>\n<li>Collared shirts (like polos), casual to semi-dressy button-down shirts, and Bermuda shorts are great for men. Good quality t-shirts (without offensive language or images of sex, drugs, and violence) and cargo shorts (that aren&#8217;t holey or stained) are alright, too.</li>\n<li>Ladies can wear tops that are flowy, fitted, or collared. If you wear a sleeveless shirt, double check that the shoulder straps are a few inches wide. <strong>Ladies, wear shirts that cover your cleavage. </strong> This is considered impolite dress anytime and anywhere.</li>\n<li>Comfortable flat closed-toed shoes, preferably ones that can be easily slipped on and off and cleaned of dust and grime. Flip flops and sandals are socially acceptable but closed-toe slip-ons simply keep your feet much cleaner.</li>\n<li> Skirts and shorts are definitely ok to wear and they can be fairly short as long as your derriere isn&#8217;t hanging out of the bottom. Summer dresses and bohemian-esque skirts are great. In the cooler months (November through January) wear capris, 3/4 length pants, lightweight pants, and long skirts or dresses.</li>\n<li> A very lightweight cardigan, jacket, or pashmina to protect yourself from the sun. It will also keep you warm at night, which can feel unusually cool after getting sunburned at the beach.</li>\n</ul>\n<h3><p id=\"Not_Recommended_and_Considered_Impolite\">Not Recommended and Considered Impolite</p></h3>\n<ul>\n<li> Spaghetti strap shirts and crop tops are out; wife beaters/muscle shirts/singlets are better left at home.</li>\n<li> Shirts that show your cleavage, are see-through (unless you&#8217;re wearing a camisole underneath), or that clearly reveal you aren&#8217;t wearing a bra.</li>\n<li> Beach attire unless you&#8217;re at the beach. This includes see-through cover-ups, unbuttoned shirts that show your stomach, or no shirt at all. Oh yeah, and <strong>don&#8217;t sunbathe nude.</strong></li>\n<li> Walking around barefoot. <p>Per observation, Thailand attracts many people who like to &#8220;connect with Mother Earth&#8221; and walk around barefoot. However, this is culturally unacceptable in Thailand. <strong>Please be mindful of Thai culture and wear shoes. </strong></p></li>\n</ul>\n<p>We go even further in depth in a more recent post about the<a href=\"https://www.tielandtothailand.com/what-wear-thailand-dos-donts/\"> dos and don&#8217;ts of what to wear in Thailand</a>.<br>\n<a name=\"food\"></a></p>\n<h2><p id=\"Must-Try_Thai_Food\"><p>Must-Try Thai Food</p></p></h2>\n<p></p><img class=\"wp-image-13022 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/08/All-About-Sweet-Cafe-PS-4-1000px.jpg?resize=1000%2C630&amp;ssl=1\" alt=\"Tips for Visiting Thailand for the First Time: Thai food\" width=\"1000\" height=\"630\"><p>You can breathe a sigh of relief knowing that <strong>Thais usually eat with a fork and spoon, not chopsticks!</strong> The food will be cut up into bite sized pieces so there is no need for a knife. Soups are generally served with chopsticks and a spoon.</p>\n<p>Restaurants in touristy places often tone down their food and it&#8217;s not as spicy or as rich in flavor. This can be either good news or bad news depending on your level of food adventurism and how much heat your mouth can take. We prefer the real deal!</p>\n<p><strong>Many foods have fish sauce in them, not soy sauce.</strong> While it&#8217;s fairly easy to get a vegetarian dish, it&#8217;s more difficult to go full vegan because of the fish sauce, oyster sauce, and animal-based broths.</p>\n<p>Also, many vendors use MSG. You can say &#8220;Mai sai pong-cheu-rot&#8221; which means &#8220;Do not put in MSG,&#8221; but some pre-made items (like curries and soups) cannot be changed. Also, table condiments usually include vinegar, sugar, fresh chilies in fish sauce (nahm blah prik)) or dried chilies, and a bottle of fish sauce.</p>\n<p><strong>There is more to Thai food than pad Thai.</strong> Try the following:</p>\n<ul>\n<li> If you&#8217;re in the South, try the Muslim-influenced massaman curry full of potatoes and peanuts in a rich and fragrant coconut sauce. Or dive into fried crispy whole fish with sweet and tangy tamarind sauce.</li>\n<li> If you&#8217;re in Central Thailand, go for tom yum goong, a hot and sour soup flavored with lime, lemongrass, and delicious with shrimp. Or try gaeng keeow wan. It&#8217;s a mild green curry dish with fresh basil and slices of eggplant served with steamed rice or rotee (like crepes).</li>\n<li>In the Northeast, often called Isaan (ee-sahn), try som tum, a refreshing <a href=\"https://www.tielandtothailand.com/som-tum-green-papaya-salad/\">green papaya salad</a> tossed with lime juice, coconut sugar, fish sauce, and often peanuts and a few chilies.</li>\n<li> In the North we highly recommend taste testing khao soi, a <a href=\"https://www.tielandtothailand.com/khao-soi-northern-yellow-curry-noodles/\">northern Thai yellow curry dish</a> served over egg noodles.</li>\n</ul>\n<p>As far as tipping goes, it isn&#8217;t necessary or expected at food stands or small mom and pop establishments. However, in restaurants where a server takes our order and delivers our food, we typically leave 20 baht per person. In fine dining restaurants with an attentive server, we play it by ear but tip at least 15%. Check out earlier posts of ours where we go into more depth about <a href=\"https://www.tielandtothailand.com/how-to-eat-thai-food-101/\">eating Thai food</a> and how to <a href=\"https://www.tielandtothailand.com/chiang-mai-gate-food-stalls/\">order at food stalls</a>.</p>\n<p><a name=\"etiquette\"></a></p>\n<h2><p id=\"Proper_Etiquette\"><p>Proper Etiquette</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-13023\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/08/Wat-Pan-Tao-19b-1000px.jpg?resize=1000%2C547&amp;ssl=1\" alt=\"Proper Thai etiquette: Remove shoes before entering a temple\" width=\"1000\" height=\"547\"></p>\n<p><strong>Always take your shoes off</strong> when entering someone&#8217;s house, a temple, and in some instances, a business. If you see shoes arranged beside a door&#8217;s entrance, that is your key to take yours off. If you&#8217;re not sure, default to taking them off.</p>\n<p><strong>Do not conduct yoga semi-nude or in skin tight clothing in front of temples.</strong> While it sounds silly and somewhat unbelievable, it has happened several times across southeast Asia. It is an embarrassing example of disrespectful travelers!</p>\n<p><strong>The wai is a how Thais greet each other</strong> rather than using a bow, a handshake, or a wave from afar. It is also used when saying thank you or to say goodbye, too. We <a title=\"How to Wai Properly on ThaiwithMod YouTube\" href=\"https://www.youtube.com/watch?v=tec9pCjkoxo\" target=\"_blank\" rel=\"noopener noreferrer\">wai back</a> to our Thai friends and to people we see often like our smoothie lady or the gym staff. We hope we aren&#8217;t impolite in doing so, but sometimes if an unfamiliar hotel concierge or a craft vendor wais us, if we clam up and feel shy about wai&#8217;ing back (or we simply have our hands full of bags), we will always smile, nod in acknowledgment, and say a reciprocal thank you instead.</p>\n<p><strong>Both men and women should be especially conscious of being properly covered when entering temples.</strong> Men must wear shoulder covering shirts (buttoned closed) and shorts that come to the knee but preferably pants. Women must cover their cleavage and shoulders and wear pants or skirts that are at least knee-length. A shawl is a versatile piece of clothing that can be wrapped around your waist or worn across your shoulders and chest if you are visiting a temple. In most cases is an acceptable article of clothing to wear in a temple.</p>\n\n\n\n<strong><p>NOTE:</p></strong> There is some interpretation regarding the term &#8220;knee-length.&#8221; For men, if shorts are an inch or two above the knee, it&#8217;s typically acceptable. For ladies, it&#8217;s a good idea to wear a skirt or capris that are clearly below the knee.\n\n\n\n<p><strong>Stay clean and smell fresh.</strong> Being stinky is considered impolite. (There&#8217;s that word again.) This may sound obvious, but travelers should practice good hygiene habits. Take a shower at least once a day if not twice (even if it&#8217;s a quick rinse!) and double up on the deodorant. Whatever the reason &#8211; the heat, last night&#8217;s booze fest, or the garlic and cumin in Thai cuisine &#8211; chances are you&#8217;ll be more aromatically present but not in a good way!</p>\n<p>Monks are highly respected. <strong>Keep your head below a monk as you pass by them</strong> (duck a little if you&#8217;re tall) and do not touch them (especially women). Also be aware of sitting areas that are designed to monks only; give up your seat on a bus or at the airport for a monk.</p>\n<p>It is not illegal to drink in public but there may be some restrictions on where you can drink outside such as at temples and public parks. Use good judgment and stay seated when you are drinking. <strong>It&#8217;s simply uncouth to walk around the city streets with a big Chang beer in hand.</strong></p>\n\t\t\t\t</div>","title":"Tips for Visiting Thailand for the First Time"}},"pageContext":{"id":"5b95ee8787be0583274900e1"}}