{"data":{"mongodbDatabaseArticles":{"id":"5b9248b487be056953db7bdc","content":"<div><p>Returning in Bangkok from visiting <a href=\"/visiting-koh-samui-the-island-of-paradise/\">Koh Samui</a> and <a href=\"/koh-phangan-is-the-disneyland-of-partying\">Koh Phangan</a>, I was in night-mode. I wanted to work at night but couldn't. Both of Bangkok's co-working spaces, Hubba and Launchpad, shut down at night. Even worse, pretty much everything except for bars close down at night in Bangkok, pretty small town vibes for a big city like that. I was at a loss. I couldn't really work in a hotel room every night. I took to the internets and by sheer luck I found Too Fast To Sleep scribbled on some back-alley blog. It was the ONLY 24-hour place in Bangkok. It was just around the corner as I was staying in Silom and at 10 in the evening I went there. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2728-e1374606616450-764x1024.jpg\" width=\"100%\"> <p>So here's the set-up, it's on the second floor near Sam Yam MRT Station, above some food market and it's filled with Bangkok's upper-class of university students (since they can afford this place). And it's like a coffee place with a huge glass wall with a view over the highway. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2689-1024x764.jpg\" width=\"100%\"> <p>The wooden interior gives a nice and mellow atmosphere and there's big pillows everywhere to chill on the ground with. Luckily for me there was also a big WiFi hub by my phone provider TRUE around meaning I'd have constant high-speed internet access here &#8212; free WiFi in most of Bangkok and other big Thai cities is included in your mobile phone data-plans with TRUE. Perfect!</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2734-1024x764.jpg\" width=\"100%\"> <p>In the evening everyone's really chatty and then around mid-night people start literally falling asleep on the ground. It's an Asian thing really, people just fall asleep everywhere. When I studied in South Korea, three years ago, we saw it everywhere too. People sleep on desks, floors, in the street, everywhere. The embarrassment we have of needing to sleep in private, that's something Asians do not posses. Weird thing is though that as the night progressed more and more older people started coming in and falling asleep. They all looked clean, but it started looking somewhat like a homeless shelter. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2691-1024x764.jpg\" width=\"100%\"> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2695-1024x764.jpg\" width=\"100%\"> <p>Meanwhile at around 4, I'm the only one still awake and even the staff has now fallen asleep behind the counter. And that's what makes this place so perfect for me. Everyone's asleep, so you can focus really really well here at night. I got so much work done here and coded up the first stable version of my YouTube Analytics app <a href=\"http://tubelytics.com/\">Tubelytics</a> here in May.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_2813-1024x764.jpg\" width=\"100%\"> <p>Now if you're hungry, you can go downstairs and there's that food market, and guess what, it's 24/7 too with a chain called Kho which was founded by a Thai celebrity actor &#8212; and a logo copied straight from KFC. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2749-1024x764.jpg\" width=\"100%\"><br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2686-1024x764.jpg\" width=\"100%\"> <p>They serve really good Thai street food chicken there. They've really never seen foreigners around this area, so when I ordered everyone went ballistic and what I got in the end was chicken FEET noodles. I hadn't seen this ever before and decided to just eat it anyway, but it was a little hard to chew with all the bones in the (did I say feet yet?) </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2687-e1374606636723-764x1024.jpg\" width=\"100%\"> <p>FEET! Next time better order something else!</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_2736-e1374606382916-1024x764.jpg\" width=\"100%\"> <p>All in, a perfect place to work if you need to focus at night and there's something beautiful about seeing the sun come up in the morning, shining through the huge glass wall on to the Thai that are sleeping on the pillows on the floor. Those crazy Thai.</p> <p>After staying a week more in Bangkok, <a href=\"/moving-to-chiang-mai/\">I moved on to Chiang Mai &#187;</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"The 24-Hour Coffee Place in Bangkok: Too Fast To Sleep"}},"pageContext":{"id":"5b9248b487be056953db7bdc"}}