{"data":{"mongodbDatabaseArticles":{"id":"5b95ea0487be05832748ff76","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/costoflaos2.jpg\" alt=\"Waterfalls and sunlight in Laos\"><br> Although I first visited Laos when I taught in Bangkok, I never spent much time there beyond a few visa runs to Vientiane. This year, <a href=\"https://www.nomadicmatt.com/travel-blogs/southeast-asia-itinerary/\">on my recent trip through the region</a>, I sought to change that and decided to finally explore the country, jaunting up and down its length.</p><p>Overall, I spent about three weeks in Laos. While I left with a laundry list of things I still want to see and do (Plain of Jars, I promise to see you next time!), my time there gave me an excellent insight into how much you need to travel around Laos.</p><p>I always had this image of Laos being super cheap, probably stemming from the fact that it&#8217;s less developed than its neighbors, so I just assumed it would be more affordable &#8212; a Cambodia/Vietnam-style cheapo-utopia!</p><p>I was wrong though: Laos was more expensive than I thought. Street food and bus rides are often double the price than in neighboring Thailand. The only thing that seemed cheap was the beer!</p><p>At first I thought I was doing something wrong. Was I missing something? Was I just being oblivious to super cheap Laos? Had I lost my travel ninja mojo? I try to uncover as many inexpensive ways to experience a place as possible, but Laos was leaving me stumped.</p><p>But after speaking with some local writers, I realized that I hadn&#8217;t missed anything. Laos is simply expensive when compared to its neighbors &#8212; for good reason.</p><p>Laos, a very poor and undeveloped country, is landlocked and so has to import everything, raising prices for all goods, services, and transportation (so remember that when you try to bargain that tuk-tuk driver down 20 cents!). Few things are locally produced. When combined with little domestic food production, high petrol prices, and a stalled commodities sector due to suspended projects with China, you have the recipe for a country with higher-than-average prices for the region.</p><p>While Laos will never be found on a list of expensive countries, it&#8217;s not the bargain you might expect given the region of the world it is in.</p><p><strong>How much does Laos cost?</strong><br> <img src=\"https://media.nomadicmatt.com/costoflaos1.jpg\" alt=\"gorgeous river and town in laos\"><br> I think $20-35 USD a day is a reasonable budget. This will allow you to get your own private room, eat local food, drink, and do what you want. Here are some typical prices in Laos (in Laotian Kip. 8,100 Kip = $1 USD):</p><p>Dorm room: 30,000-40,000<br> Private rooms with ensuite bathroom: 80,000-120,000<br> Boat from dock to Don Det (4,000 Islands): 15,000<br> Bungalows on Don Det: 50,000<br> Overnight buses: 150,000-200,000<br> Tuk-tuk: 30-50,000<br> Bus from Luang Prabang to Vang Vieng: 90,000-130,000<br> Shared tuk tuk to Kuang Si waterfalls (Luang Prabang): 30,000<br> Entrance fee to attractions: 15,000-25,000<br> Restaurant prices for Lao food: 20,000<br> Restaurant prices for Western food: 40,000<br> Street food: 15,000-20,000 per dish<br> Bike rentals: 15,000<br> Public toilets: 2,000-5,000<br> Sticky rice: 10,000<br> Big beer Lao: 10,000<br> Dark beer Lao: 15,000<br> Water: 3,000-8,000</p><p>Tubing in Vang Vieng: 55,000 (plus 60,000 deposit)</p><p>If you stay in dorms, eat local food from markets, drink just a little, and take the local bus between destinations, you can get by on&#160;$20 US per day. If you want your own room with A/C and hot water, look to spend closer to $30-35 per day. After that, the sky is really the limit &#8211; but it&#8217;s a low limit!</p><p>My friend Kunal visited me and &#8212; being on no budget &#8212; just spent as if money was going out of style. We worked out that even with his million meals (the guy eats like a hobbit), private rooms in hostels, transportation, activities (like tubing), and constant buying rounds of beer, he still managed to only spend $40-45 a day. If you spent like Kunal but got nice, more boutique accommodation, I would budget about $60 per day.</p><p>If you are coming here as a backpacker or moderate budget traveler, you&#8217;ll be hard pressed to really spend a lot.</p><p><strong>How to Save Money in Laos</strong><br> <img src=\"https://media.nomadicmatt.com/costoflaos3.jpg\" alt=\"sunset and mountain in laos\"><br> Though expensive relative to its neighbors, Laos is still a cheap country to visit. You have to try to spend money here.</p><p>Besides the normal &#8220;stick to the local food/transportation&#8221; common sense travel wisdom, one of the most effective ways to save money, though, is to book all your activities and transportation on your own. Don&#8217;t go through your hostel or a tour company. Most attractions are near cities and don&#8217;t require you to go with an organized group. You can either rent a motorbike or hire any number of tuk-tuk drivers.</p><p>For example, when we went to Kuang Si waterfall in Luang Prabang, most hostels wanted 60-80,000 kip for the trip. You can simply join one of the taxis from the center of town for 30,000 kip, get more time at the waterfalls, and be on your own schedule.</p><p>On the opposite side of that, my friends and I got a bus to Vientiane from the company our hostel used &#8211; one of those cater-to-tourists outfits. It was $5 more than the public bus but it was more convenient. However, we left an hour later and there were numerous stops. We would have saved time and money if we organized transportation right from the bus station.</p><p>Lastly, there is a lot of cheap accommodation to be found on the website <a href=\"https://www.agoda.com/partners/partnersearch.aspx?pcs=1&amp;cid=1560988&amp;hl=en\" rel=\"nofollow\"></a>Agoda. You&#8217;ll even find cheap guesthouses under $10 and hostel dormitory rooms listed on the website. While you can definitely wander around and find accommodation on your own, Agoda has a lot of options if you want to pre-book.</p><p>I wish I could tell you some amazing ninja ways to save money in Laos, but honestly, just stick to the local food and transportation, don&#8217;t overdo it on drinks, avoid tour operators, and use some common sense. You can&#8217;t overspend here.</p><p>Laos may not be as inexpensive as its neighbors but it is still a value country, and the prices and tips here can help you budget on your next trip there.</p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p></div>","title":"The Cost of Traveling Laos"}},"pageContext":{"id":"5b95ea0487be05832748ff76"}}