{"data":{"mongodbDatabaseArticles":{"id":"5b92396787be0583cfde67f7","content":"<div><p><strong>Germany*.</strong>As of 2007, Germany recognizes dual citizenship, but only with other countries within the EU and Switzerland. There are <a href=\"https://en.wikipedia.org/wiki/German_nationality_law#Dual_citizenship\" target=\"_blank\" rel=\"noopener noreferrer\">some exceptions</a> for those who wish to obtain dual citizenship in a non-EU country. Furthermore, in August of 2014, the German cabinet gave the go-ahead to allow young Germans to maintain dual citizenship. Historically, those with foreign-born parents had to choose between their parents&#8217; nationality and German nationality once they became an adult. The 2014 law changed that.</p>\n<p><strong>Greece.</strong>Greek citizens are allowed to maintain dual citizenships unless they request to renounce Greek citizenship. Renunciation of Greek citizenship is subject to completion of any military service requirement. It&#8217;s possible to obtain second residency in Greece and work toward citizenship, but the government won&#8217;t be on your side.</p>\n<p><strong>Hungary.</strong>Hungary offered a long-running and now-closed economic residency program that allowed wealthy Chinese to obtain Hungarian citizenship. The country allows <a href=\"http://nomadcapitalist.com/2015/05/20/how-to-get-hungarian-citizenship-by-descent-or-investment/\" target=\"_blank\" rel=\"noopener noreferrer\">citizenship by descent</a> and permits its citizens to maintain multiple nationalities.</p>\n<p><strong>Iceland.</strong>Much like Finland, Iceland overturned its ban on holding more than one citizenship in 2003 and offered those who lost Icelandic status under the old system four years to apply for reinstatement.</p>\n<p><strong>Ireland.</strong>Like Israel and Italy, Ireland allows those with Irish ancestors to claim an Irish passport. In fact, there are some 14 million Irish passports in circulation, despite the country having a much, much smaller population. Ireland does allow dual citizenship.</p>\n<p><strong>Israel.</strong>In an attempt to increase the roster of Israeli citizens and Jews with Israeli passports, Israel has a very straightforward passport program through the<a title=\"How to get second citizenship under Israel&#8217;s Law of Return\" href=\"http://nomadcapitalist.com/2014/03/11/how-to-get-second-citizenship-israel-law-of-return/\">Law of Return</a>. Israel is more than happy to allow its citizens to maintain dual nationality.</p>\n<p></p><img class=\"size-full wp-image-16470\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Italy-and-dual-citizenship.jpg\" alt=\"Italy and dual citizenship\" width=\"700\" height=\"467\"><p><strong>Italy.</strong> Italy considers anyone with Italian bloodlines an Italian citizen&#8230; even before you apply to claim an <a title=\"Top 5: Second citizenships by descent\" href=\"http://nomadcapitalist.com/2013/05/19/top-5-second-citizenship-by-descent/\">ancestral passport</a>. As long as you can prove your Italian ancestry, you can become an Italian citizen. Italy does not require you to renounce other citizenships when you follow this procedure, or when you become a naturalized citizen through residence.</p>\n<p><strong>Jamaica.</strong>According to Jamaica&#8217;s own consulate websites, the country recognizes dual citizenship.</p>\n<p><strong>Kosovo.</strong> Many Kosovars have special, recognizable Serbian passports issued from a special passport unit in Belgrade, as Serbia still does not recognize Kosovo as an independent state. Due to many Kosovars having Serbian citizenship, and even third citizenships in places they migrated to (such as Germany), Kosovo allows dual citizenship.</p>\n<p><strong>Latvia.</strong>The Baltic country recently liberalized its laws to allow Latvians to hold another nationality (or more than one). This is a great opportunity for those who obtain Latvian residency by <a title=\"How to get second residency in Latvia with real estate or business\" href=\"http://nomadcapitalist.com/2014/03/19/buy-real-estate-latvia-get-second-residency-passport/\">starting a business or investing in real estate</a>, and have the eventual goal of becoming Latvian citizens.</p>\n<p><strong>Luxembourg.</strong> The Luxembourg passport is an excellent travel document and, since 2009, the country has allowed dual citizenship.</p>\n<p><strong>Malta.</strong> Malta&#8217;s <a href=\"http://nomadcapitalist.com/2015/02/10/citizenship-malta-freedom-price-tag/\">$1 million economic citizenship program</a> allows anyone to become Maltese within one year without relinquishing their existing citizenships. This goes hand-in-hand with their favorable view on dual citizenship.</p>\n<p><strong>Mexico.</strong> A Mexican at birth may acquire other nationalities, but will always be considered Mexican by the Mexican government. Furthermore, all Mexican citizens must enter and leave the country on his or her Mexican passport. They may also be prohibited from partaking in certain investments within the country.</p>\n<p><strong>New Zealand.</strong> According to the <a href=\"https://www.dia.govt.nz/diawebsite.nsf/wpg_URL/Services-Citizenship-Dual-citizenship?OpenDocument\" target=\"_blank\" rel=\"noopener noreferrer\">New Zealand government</a>, Kiwis are entitled to maintain other citizenships without issue.</p>\n<p><strong>Nigeria.</strong> Nigerians may have more than one citizenship, despite some limited public pressure against the practice in the African country.</p>\n<p><strong>Pakistan.</strong> Due to a growing number of Pakistanis living overseas, the government now recognizes dual citizenship for Pakistani citizens under most circumstances. However, dual citizens are forbidden from certain voting rights, serving in the military, or holding any number of public offices, or even civil servant jobs. Not a bad trade-off.</p>\n<p><strong>Panama.*</strong> Technically, Panama forbids dual citizenship. In practice, however, things are a bit different. During the naturalization process, the Panamanian government will require you to take an oath that includes the renunciation of your previous citizenship. Nevertheless, many countries (including the United States) don&#8217;t recognize this oath as part of relinquishing your existing citizenship. That being said, second residence (and an eventual second passport) in Panama can <a title=\"Easy permanent residence with Panama Friendly Nations visa\" href=\"http://nomadcapitalist.com/2013/02/07/panama-residence-program-means-you-have-no-excuses-anymore/\">be obtained rather easily</a> by citizens of any of 50 &#8220;friendly nations&#8221; &#8212; namely most Western countries &#8212; making dual citizenship an important part of the country.</p>\n<p></p><img class=\"size-full wp-image-13601\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Machu-Pichu-in-Peru-where-dual-citizenship-is-allowed.jpg\" alt=\"Machu Picchu in Peru where dual citizenship is allowed\" width=\"700\" height=\"468\"><p><strong>Peru.</strong> Similar to many other Latin countries, Peru&#8217;s constitution allows citizens of other Latin countries (including Spain) who have become naturalized citizens to maintain their previous nationality. In practice, dual citizenship is allowed in many cases.</p>\n<p><strong>Philippines.</strong> Obtaining citizenship in the Philippines is nearly impossible for foreigners (although <a title=\"The easy way to get second residency in the Philippines\" href=\"http://nomadcapitalist.com/2013/04/08/the-easiest-ways-to-philippines-residency/\" target=\"_blank\" rel=\"noopener noreferrer\">residency is easy</a>), but Filipinos who obtain a second citizenship usually don&#8217;t lose their Filipino passport. If they do, however, there is a process to get it back.</p>\n<p><strong>Portugal.</strong> Portugal allows dual citizenship and also offers an easy residency program for those wishing to <a title=\"How to get Portugal residency by buying real estate\" href=\"http://nomadcapitalist.com/2013/06/04/buying-overseas-real-estate-for-a-second-residence-in-portugal/\" target=\"_blank\" rel=\"noopener noreferrer\">invest in Portuguese real estate</a>.</p>\n<p><strong>Romania.</strong> Romania does not cancel the citizenships of those who obtain a second passport elsewhere, although it does not claim responsibility for other nationalities being lost as a result of keeping Romanian citizenship. There have been cases of people who have lost their multiple nationalities after re-applying for Romanian citizenship. Furthermore, Romania has a controversial practice of granting dual citizenship to Moldovans.</p>\n<p><strong>Serbia.</strong> Located in Southeast Europe, Serbia offers one of the least known citizenship by descent programs. As such, it allows Serbians to maintain other nationalities.</p>\n<p><strong>Slovenia.</strong> Slovenia, whose passport also confers citizenship in the European Union, may forbid those becoming naturalized citizens from keeping their existing nationalities. However, it does not prohibit native Slovenians from having a second passport in most cases.</p>\n<p><strong>South Africa.</strong> Until 1995, South Africa forbade its citizens from traveling on foreign passports. A 2004 law changed that and eliminated a requirement that forced those seeking dual nationality to apply for permission. As with many other countries, South Africa requires its nationals to enter and leave the country with their South African travel documents. It is worth noting that South Africans who wish to obtain new citizenships going forward must inform the government BEFORE doing so, or else they will lose South African nationality.</p>\n<p><strong>South Korea*.</strong> South Korea, while a great country, is a rather insular culture and long forbade its citizens from having another passport. However, as of 2011, a new law allowed those who became dual nationals at birth to retain both passports if they declared their intention to remain South Korean by age 22. The law does not allow South Koreans to obtain other citizenships as adults. However, expats living in South Korea who obtain citizenship &#8212; including through the country&#8217;s <a title=\"How to get South Korea residency and a passport\" href=\"http://nomadcapitalist.com/2014/01/06/get-south-korea-residency-passport/\" target=\"_blank\" rel=\"noopener noreferrer\">immigrant investor program</a> &#8212; can retain their birth citizenship.</p>\n<p><strong>Spain.</strong> Spain requires Spanish nationals to inform the government within three years if they obtain another nationality. It makes exceptions for those individuals who are natural citizens of an Iberoamerican country, Andorra, the Philippines, Equatorial Guinea or Portugal.</p>\n<p><strong>Sweden.</strong> In 2001, Sweden abandoned a long-held policy of prohibited dual nationalities. Now, Swedish citizens may acquire other passports and foreigners applying for naturalization in Sweden may keep their existing citizenship.</p>\n<p></p><img class=\"size-full wp-image-16471\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Switzerland-and-dual-citizenship.jpg\" alt=\"Switzerland and dual citizenship\" width=\"700\" height=\"467\"><p><strong>Switzerland.</strong> An estimated 60% of Swiss citizens living abroad are dual nationals, and that&#8217;s just fine according to Switzerland. As of 1992, the country does not forbid having another passport, nor does it force naturalized Swiss citizens to relinquish their original nationality. (Although celebrities like <a title=\"Top 5: Famous people to renounce US citizenship\" href=\"http://nomadcapitalist.com/2013/12/08/top-5-famous-people-renounce-us-citizenship/\" target=\"_blank\" rel=\"noopener noreferrer\">Tina Turner</a> have obtained Swiss nationality as a means to relinquish US citizenship.)</p>\n<p><strong>Syria.</strong> Syrian citizenship is a complicated thing. You get it by being the child of a Syrian father, or a Syrian mother whose partner is of stateless or unknown origins. And obtaining Syrian citizenship is near impossible: you have to marry a Syrian and live in the country for ten years. However, Syria generally allows its citizens to have other passports, although the government itself advises that renouncing Syrian nationality is so difficult it&#8217;s best not to even bother.</p>\n<p><strong>Turkey.</strong> Turkey allows multiple nationalities, but does require those obtaining them to provide a load of documents to Turkish officials during the process. Unlike many countries, Turkey does not require dual nationals to use their Turkish passport when entering or leaving the country.</p>\n<p><strong>United Kingdom.</strong>Since the British Nationality Act of 1948, the UK does not restrict its citizens from having other nationalities. However, British Overseas Territories citizens (such as citizens of Anguilla) may lose their ability to obtain a British passport if they obtain another nationality.</p>\n<p><strong>Vanuatu.</strong> Since 2012, the Ni-Vanuatu are permitted to hold more than one passport. The rules were changed after Parliament voted in a move widely suspected to be the precursor to Vanuatu&#8217;s future <a href=\"http://nomadcapitalist.com/2015/07/15/how-to-get-second-residency-citizenship-in-vanuatu/\">economic citizenship program</a>.</p>\n<p><strong>Does the United States allow dual citizenship?</strong> In almost all circumstances, yes. You may be required to declare &#8220;other allegiances&#8221; when applying for certain government programs or a US passport, but their request is more snooping than anything else.</p>\n<p>You should be aware that taking up a foreign citizenship with the &#8220;intention&#8221; of relinquishing your US citizenship can cause you to lose US citizenship. So can fighting in a foreign military or working for a foreign government in any number of jobs.</p>\n<h1>Countries that do not allow dual citizenship</h1>\n<p><strong>Andorra.</strong> Andorrans who take up a foreign citizenship lose their Andorran nationality, but can apply to have it reinstated later if they are willing to renounce the citizenship they took up. Foreigners shouldn&#8217;t need to worry about this procedure, since becoming a naturalized citizen of Andorra takes twenty years of residence, one of the longest periods on earth.</p>\n<p><strong>Austria.</strong> Austria severely limits dual nationality in the country. This is interesting, considering there is a <a title=\"Is economic second citizenship in Austria really possible?\" href=\"http://nomadcapitalist.com/2014/05/15/economic-second-citizenship-in-austria/\">&#8220;secret&#8221; economic citizenship program</a> that allows wealthy investors to become Austrian citizens in exchange for a donation of several million dollars &#8212; so long as they can prove they are &#8220;Austrian enough&#8221;. The only exceptions to these restrictions are 1) for children born to one Austrian and one foreign parent whose country confers citizenship to children, 2) to children given foreign citizenship by virtue of being born in a foreign country (like the United States), 3) to those unable by law to renounce their existing citizenship at home, or 4) to foreign professors who receive Austrian nationality.</p>\n<p><strong>Azerbaijan.</strong> The Azeri government claims to automatically strip citizenship from those who voluntarily obtain another nationality.</p>\n<p><strong>Bahrain.</strong> While the Kingdom of Bahrain has a long tradition of awarding citizenship to expats who make a substantial contribution to the tiny Middle Eastern country, Bahrain does forbid dual nationality, except for a few Gulf state passport holders.</p>\n<p><strong>China.</strong> China technically forbids dual nationality, but many Chinese tell me enforcement of this is weak. They also mention that China considers Chinese citizens to be only Chinese, in line with the policy of most countries including the United States. China technically doesn&#8217;t recognize dual citizenship, but isn&#8217;t chasing people down, particularly as they encourage legal immigration to spread Chinese influence.</p>\n<p><strong>Djibouti.</strong> Djibouti does not recognize its citizens&#8217; ability to hold another passport, and any citizen who obtains another nationality will lose his or her Djibouti passport. Enforcement, however, is another matter.</p>\n<p><strong>El Salvador.</strong> El Salvador allows for dual citizenship, but only for those who obtained El Salvadorean nationality by birth. Naturalized citizens may not hold multiple nationalities.</p>\n<p><strong>Estonia.</strong> Although not technically allowed, plenty of Estonians hold second passports, mainly from Russia. The Estonian government may allow naturalized citizens to keep existing citizenships, or may simply not check. However, naturalized citizens who obtain another citizenship after being naturalized will lose their Estonian nationality. Native born Estonians are not subject to this provision, however, because Estonian citizenship is determined &#8220;by blood&#8221; and cannot be taken away from anyone.</p>\n<p><strong>Georgia.</strong> Georgia does not allow dual citizenship for natural born citizens, or those naturalized under normal means. It does, however, allow for dual citizenship for those naturalized by &#8220;exceptional means&#8221;.</p>\n<p><strong>India. </strong>Does India allow dual nationality? Sadly, the answer is &#8220;no&#8221;. However, due to demands from its diaspora, the country did introduce the Overseas Citizenship of India program. The program offers a document that looks like a passport, but does not serve as a substitute for a travel document, nor does it confer Indian citizenship.</p>\n<p><strong>Indonesia.</strong> While Indonesian officials are <a href=\"http://www.thejakartapost.com/news/2013/08/24/indonesia-seeing-positive-signs-dual-citizenship.html\" target=\"_blank\" rel=\"noopener noreferrer\">working to allow</a> citizens to hold multiple nationalities, no such law exists yet, and Indonesians may not hold other citizenships.</p>\n<p></p><img class=\"size-full wp-image-16473\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Japan-and-dual-citizenship.jpg\" alt=\"Japan does not allow dual citizenship\" width=\"4254\" height=\"2830\"><p><strong>Japan.</strong> Japan is one of strictest immigration countries on earth. It does not allow citizens to maintain other allegiances and forces children who hold more than one passport to choose which one they wish to retain once they become adults.</p>\n<p><strong>Kazakhstan.</strong> Kazakhstan does not allow citizens to maintain another nationality, and is one of a handful of countries that automatically cancels your citizenship if you are discovered to be a dual national.</p>\n<p><strong>Lithuania.</strong> Lithuania offers <a title=\"How to get second citizenship in Lithuania through ancestry\" href=\"http://nomadcapitalist.com/2014/03/06/get-second-citizenship-in-lithuania-ancestry/\">citizenship by descent</a> to those with Lithuanian great-grandparents, but requires all Lithuanians to choose between their citizenship and another nationality. The only exception is those with ancestors who left during times of occupation for reasons of persecution..</p>\n<p><strong>Malaysia.</strong> Although I recommend the <a title=\"Easy permanent residence in Asia: Malaysia&#8217;s investor visa program\" href=\"http://nomadcapitalist.com/2013/11/11/easy-permanent-residence-in-asia-malaysia-investor-visa-program/\">MM2H visa program</a> for residency, I cannot recommend becoming a citizen since anyone holding Malaysian citizenship is disallowed from holding any other citizenship.</p>\n<p><strong>Montenegro.</strong> While there have been talks to allow dual nationality between Serbians and Montenegrins (in light of the two countries&#8217; being one until 2006), citizens of Montenegro are forbidden to hold other citizenships and will lose their citizenship if they are naturalized elsewhere.</p>\n<p><strong>Netherlands*.</strong> In general, Dutch citizenship forbids obtaining an additional nationality. However, there are exceptions for Dutch people who obtain another citizenship at birth, or who are live in a country they hold nationality of thanks to their spouse.</p>\n<p><strong>Nepal.</strong> Nepal does not allow having another citizenship.</p>\n<p><strong>Norway.</strong> While Norway offers one of the world&#8217;s most valuable passports, it generally does not allow Norwegian citizens, or those naturalized to become Norwegian, to hold an additional citizenship. The only general exception is for those whose former countries refuse to release them from a prior citizenship.</p>\n<p><strong>Poland.</strong> Poland does not recognize its citizens who maintain other allegiances, but it tolerates the practice. However, there are cases where &#8220;exercising a second citizenship&#8221; is disallowed, such as identifying yourself to Polish authorities as a foreign citizen.</p>\n<p><strong>Saudi Arabia.</strong> Obtaining dual nationality is only permitted with the express permission of the Prime Minister.</p>\n<p><strong>Singapore.</strong>Singapore has been a much-ballyhooed second passport in the offshore world, with claims that citizenship can be obtained in as little as two years. That opportunity is no longer available. Plus, Singaporean citizenship confers mandatory military service on the citizen as well as their children. In an attempt to protect the &#8220;fabric&#8221; of their small country, Singapore aggressively forbids dual nationality.</p>\n<p><strong>Slovakia*.</strong> As part of an argument with Hungary over its citizenship by descent policies, Slovakia limits dual citizenship in many cases. It does, however, allow dual nationalities for those that obtain its passport through birth or marriage.</p>\n<p><strong>Tanzania.</strong> While some officials in the African country have <a href=\"http://www.theeastafrican.co.ke/news/Tanzanian-Assembly-rejects-dual-citizenship-in-draft-law-/-/2558/2467224/-/4vvtmfz/-/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">suggested loosening the policy</a>, Tanzanians are currently not permitted to hold dual citizenship, except in the case of women who acquire a second nationality by marrying a foreigner. The country&#8217;s Asian immigrant population is often cited as a factor for &#8220;potential disloyalty&#8221; if the citizenship rules were to be loosened.</p>\n<p></p><img class=\"size-full wp-image-16475\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/04/Thailand-and-dual-citizenship.jpg\" alt=\"Thailand does not allow dual citizenship\" width=\"700\" height=\"463\"><p><strong>Thailand.</strong>As one of the most insular and imperious countries on earth, Thailand forbids dual nationality. They are <a title=\"Is living in Thailand a bastion of freedom for expats?\" href=\"http://nomadcapitalist.com/2013/10/18/is-living-in-thailand-a-bastion-of-freedom-for-expats/\" target=\"_blank\" rel=\"noopener noreferrer\">&#8220;The Land of the Free&#8221;</a>, after all.</p>\n<p><strong>Ukraine.</strong> Currently, Ukraine does not easily allow for dual citizenship. They even <a href=\"http://rt.com/news/ukraine-dual-citizenship-jail-572/\" target=\"_blank\" rel=\"noopener noreferrer\">considered imposing prison sentences</a> of up to ten years for having dual nationality. It&#8217;s possible to have another nationality, but if the government finds out, you could be in trouble.</p>\n<p><strong>United Arab Emirates.</strong> Emirati passport holders are forbidden to maintain other citizenships. The only exception is in cases when an individual holds another citizenship from birth, but also has a father who is a UAE national and who confers citizenship upon him or her.</p>\n<p><strong>Venezuela.</strong> While children born on Venezuelan soil are entitled to Venezuelan citizenship (regardless of their parents&#8217; nationalities), dual citizenship is only possible until age 25. After that time, if an individual maintains a foreign citizenship, the Venezuelan nationality will be terminated.</p>\n</div>","title":"Which countries allow Dual Citizenship and which don’t?"}},"pageContext":{"id":"5b92396787be0583cfde67f7"}}