{"data":{"mongodbDatabaseArticles":{"id":"5b92397a87be0583cfde680c","content":"<div><p></p><img class=\"wp-image-21395 size-large\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/06/us-tax-myths-700x466.jpg\" alt=\"US tax myths\" width=\"700\" height=\"466\"><p>Dateline: Munich, Germany</p>\n<p>In the past few months, I&#8217;ve taken on more former US citizens, soon-to-be former US citizens, and overpaying US citizens than usual. These experiences have been very fulfilling for me, as I&#8217;ve been able to help these folks create legal strategies to maximize their benefits.</p>\n<p>However, I have also come across more US tax myths than usual. The people seeking my help are busy entrepreneurs who may have read blogs or seen news articles about tax issues and renunciation, but might never have actually sat down with someone to go over all of their questions.</p>\n<p>In this article, I want to address some of the most popular myths about citizenship-based taxation for expats, digital nomads, and renunciants in the United States. This article will be a &#8220;work in progress&#8221; as I add new myths as time goes on.</p>\n<p>Here are five all-too-common myths about US taxes:</p>\n<p></p>\n<h2>Myth #1: You have to renounce US citizenship to reduce taxes</h2>\n<p>I recently spoke with an entrepreneur who had been living outside of the United States for the last four years, but was still paying a decent chunk in US income taxes every year. He seemed astonished that I was able to retain US citizenship and yet still reduce my tax burden to about 1% of my global income, and he wanted to know how to do the same.</p>\n<p>This entrepreneur, who was also entitled to Canadian citizenship <a href=\"http://nomadcapitalist.com/2014/10/10/birth-tourism-countries-that-give-citizenship-by-birth/\">through his mother</a>, was weighing the idea of renouncing US citizenship in order to save on taxes. However, as is so often the case, his US tax advisor was totally clueless as to the many tax strategies available for expats and had not advised his client. Instead, this entrepreneur had overpaid by an amount well into the six figures.</p>\n<p>If you&#8217;re a US citizen entrepreneur living overseas (or willing to live overseas), chances are you can substantially reduce your US tax bill to much lower than it is now.</p>\n<p>There&#8217;s even a good chance you could pay zero.</p>\n<p>For two years in a row, I have gladly paid zero dollars and zero cents in US taxes; that&#8217;s $0 in federal income tax, $0 in state income tax, and $0 to Social Security and Medicare.</p>\n<p>This is the challenge with basing your offshore strategy on what you read in the media: you&#8217;ll probably make mistakes. While the news has indeed been buzzing with <a href=\"https://www.bloomberg.com/news/articles/2017-11-01/americans-are-renouncing-citizenship-at-a-record-pace\">record numbers of Americans renouncing their citizenship</a>, allegedly for tax reasons, the truth is that 90% of entrepreneurs I&#8217;ve met do NOT need to renounce US citizenship to enjoy the same zero tax treatment that I do. And it&#8217;s all legal.</p>\n<p>In fact, the biggest contingent of renunciants are employees and investors who do not have the same level of control over their income that business owners do.</p>\n<p>The biggest issue I see with entrepreneurs who think they need to renounce: their company is still based in the United States. By using a US legal entity, even a small business with most of its workforce offshore will leave the owner with tens of thousands of dollars in Social Security and Medicare taxes, in addition to corporate tax if the business is a C Corporation.</p>\n<p>I&#8217;ve saved more than one person from giving up their US citizenship merely by moving their company to an offshore jurisdiction and structuring their pay properly.</p>\n<h2>Myth #2: You need a complicated structure</h2>\n<p>Once you decide to move your business offshore, an endless array of options await you.</p>\n<p>Should you form a Hong Kong company, or a BVI company, or a Belize company, or a Marshall Islands company?</p>\n<p>Should you be like the &#8220;cool kid&#8221; digital nomads who are <a href=\"http://nomadcapitalist.com/2017/06/07/remote-banking-estonia-e-residency/\">raving about Estonia</a> right now?</p>\n<p>Just figuring out which country to be based in is a challenge. Moreover, the wrong decision could lead to unforeseen consequences. For example, while Estonia companies are often touted as &#8220;tax free&#8221;, they are only tax-free until you take money out&#8230; at which time you <a href=\"https://taxfoundation.org/estonia-has-most-competitive-tax-system-oecd/\" target=\"_blank\" rel=\"noopener\">must pay 20%</a>. If you believed the hype from people promoting Estonia, you could cost yourself tens if not hundreds of thousands of dollars.</p>\n<p>Choosing an overly simple structure could be a mistake; after all, the easiest things to get into are sometimes the hardest to get out of. However, creating an overly complicated structure can also be a big mistake.</p>\n<p>Chances are you don&#8217;t need two Nevis IBCs, each owned by a Belize IBC, in turn owned by a Panama foundation in order to minimize tax. In fact, these types of complicated structures can often cause problems for US citizen taxpayers. Scour the offshore blogosphere and you&#8217;ll no doubt find plenty of promoters offering these &#8220;stacked structures&#8221;.</p>\n<p>In most cases, these stacked structures do nothing but incur a lot of annual maintenance costs as the &#8220;beast&#8221; that is this mass of companies needs to be fed, from statutory agent fees to registry renewal fees.</p>\n<p>Some of these promoters are US citizens themselves and should know better, yet hide behind fake names and stock photos. Many others are simply ignorant and don&#8217;t understand US tax law. This is why it&#8217;s so important to create the most simple structure that gets the job done: extra layers of complication could cause problems with the IRS.</p>\n<p>That&#8217;s because some of the holding company structures involving stuff like billing and <a href=\"http://nomadcapitalist.com/2017/09/15/low-tax-countries-intellectual-property-ultimate-guide/\">intellectual property</a> could be classified as Subpart F income under US tax law.</p>\n<p>For example, a Belgian friend of mine recently told me how he sold his domains to an offshore company that collected &#8220;rent&#8221; for his low-tax onshore company. In addition to inviting an audit in the onshore jurisdiction, his offshore company would be required to pay tax if owned by a US citizen. Sadly, US citizens must follow their own set of rules that most offshore company formation services don&#8217;t understand.</p>\n<h2>Myth #3: A US tax exemption means you can&#8217;t hold US assets</h2>\n<p>I&#8217;ve often spoken about the <a href=\"http://nomadcapitalist.com/2017/01/18/episode-077/\">&#8220;Nomad Tax Trap&#8221;</a>, which references how many digital nomads have simply left their home countries without so much as filing a departure form and expect to never be taxed as they roam the globe. For citizens of many countries, this could lead to an audit and possible tax due. However, while Americans are often well aware of their never-ending filing requirements based on citizenship and not residency, US citizens do have a few privileges that others don&#8217;t.</p>\n<p>As there is technically no process to become <a href=\"http://nomadcapitalist.com/2016/12/19/moving-required-claim-tax-benefits/\">&#8220;tax non-resident&#8221;</a> of the United States, anyone can hold US bank accounts without creating a US tax nexus&#8230; even US citizens. While Australians, Canadians, and Brits, in particular, are usually well-advised to move their banking offshore, Americans can continue to bank in their home country.</p>\n<p>US citizens can also own US real estate, including homes for their own use. In general, the US tax system for expats is based less on &#8220;intent&#8221; and more on &#8220;physical presence&#8221; than other developed countries. That means that so long as your physical presence is mostly outside of the United States, and in some cases inside another country, you can continue to hold US assets like bank accounts and property.</p>\n<p>The same principle is true for those <a href=\"http://nomadcapitalist.com/2017/02/12/tax-problems-renounce-us-citizenship/\">renouncing US citizenship</a>.</p>\n<p>I was recently engaged by a gentleman who intends to renounce US citizenship because he is an investor and can not enjoy the same tax breaks that entrepreneurs do. He told me that he wanted to renounce as quickly as possible, but that he was afraid it would take too long to sell his US real estate.</p>\n<p>I informed him that there was no need to sell his US property because doing so was not a requirement for renunciation. In fact, every single former US citizen I&#8217;ve worked with still maintains US bank accounts and credit cards, and several still own property there. While US citizens enjoy, for example, special tax breaks <a href=\"http://www.nolo.com/legal-encyclopedia/the-250000500000-home-sale-tax-exclusion.html\" target=\"_blank\" rel=\"noopener\">when selling real estate</a>, there is nothing prohibiting non-citizens from doing business in the United States. Quite the contrary, actually; the US is home to plenty of foreign investment, and you can continue to invest there even if you give up your passport.</p>\n<p>After all, the United States is the world&#8217;s largest tax haven; it wouldn&#8217;t be if every Chinese guy with a bank account in New York <a href=\"http://nomadcapitalist.com/2016/11/13/use-us-banks-if-renounce-citizenship/\">had to pay US taxes</a>.</p>\n<h2>Myth #4: You have to live in one place overseas</h2>\n<p>This one is the opposite of the <a href=\"https://www.youtube.com/watch?v=lKKeGpKhODI\" target=\"_blank\" rel=\"noopener\">&#8220;Nomad Tax Trap&#8221;</a>: American expats who believe that, without having a permanent home overseas, they are ineligible for tax breaks. This is also untrue; the easiest way for a US citizen to claim a tax exemption on his or her income is to spend the vast majority of the time outside of the United States.</p>\n<p>Even though I do have homes in foreign countries and &#8220;bona fide&#8221; connections to another country or countries, my total absence from the United States for three years led me to claim the easiest exemption possible: the Physical Presence Test. By merely being out of the United States, I qualify for a healthy exemption on earned income, and by structuring my businesses properly, I can legally pay zero.</p>\n<p>While it&#8217;s possible to get a few extra perks by having one &#8220;bona fide residence&#8221; in a foreign country and live there most of the time, I&#8217;ve found that most US expats don&#8217;t want or need those extra perks.</p>\n<p>In fact, the United States is one of the friendlier developed countries for digital nomads. As draconian as US tax law is, you don&#8217;t need to prove your intent to leave the country or pass a domicile test as in other developed countries. All you need to do is be physically located somewhere else.</p>\n<h2>Myth #5: You can&#8217;t fix tax errors</h2>\n<p>You may understand that, as a US citizen, you may qualify for tax breaks such as the <a href=\"http://nomadcapitalist.com/2016/11/28/legally-avoid-paying-us-income-tax/\">Foreign Earned Income Exemption</a>, but you may not think that you actually do qualify. For the reasons listed above and others, many expats and nomads assume that they don&#8217;t qualify for many of the tax exemptions available to others.</p>\n<p>Recently, someone who had spent the vast majority of their time living in Europe came to me seeking help reducing his taxes. In 2016 alone, he paid nearly $80,000 in US taxes even though he lived overseas. The worst part was that he didn&#8217;t owe anything; he paid $80,000 more than was legally required. The IRS does not police tax returns for taxpayer overpayments.</p>\n<p>This is why I always recommend working with <a href=\"https://www.youtube.com/watch?v=xBgfsKM9ZN8\">an expat-focused US tax preparer</a>. Not only do you need someone knowledgeable in US tax law to create your offshore structure, but you need someone knowledgeable in international tax to file your annual returns.</p>\n<p>I&#8217;ve mentioned before how my US accountant fought me for the first year when I tried to claim the Foreign Earned Income Exemption. My accountant was from a highly reputable firm, but he had no experience with expats and wrongly believed I didn&#8217;t qualify for the exemption, even though I spent very little time in the United States that year. Had I not literally read him the law, I would have paid a lot of unnecessary taxes.</p>\n<p>The good news is that if you&#8217;ve made this mistake, there is still hope. It is possible to <a href=\"https://www.cnbc.com/2015/04/27/how-to-file-an-amended-tax-return.html\" target=\"_blank\" rel=\"noopener\">amend past tax returns</a>, especially if you have overpaid.</p>\n<p>A good accountant can review your past returns and find any errors or overpayments that can be corrected. Depending on how you filed and paid, the IRS may have to issue you a paper check in the mail, but you will get any overpayments refunded eventually.</p>\n<p>Have you encountered any of these US tax myths? What was your experience? Leave a comment below.</p>\n</div>","title":"Five US Tax Myths about expats, nomads, and renunciation"}},"pageContext":{"id":"5b92397a87be0583cfde680c"}}