{"data":{"mongodbDatabaseArticles":{"id":"5b95efab87be05832749011d","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Real Coffee is Hard to Find</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/07/coffee.jpg?ssl=1\"><img class=\"aligncenter\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/07/coffee.jpg?resize=563%2C373&amp;ssl=1\" alt=\"Coffee Thailand\" width=\"563\" height=\"373\"></a></p>\n<p>Back home, drinking coffee was part of our daily routine. Whether it came from the communal office pot during the week or was more leisurely enjoyed from our little four-cup coffee maker on Saturdays and Sundays (brewed strong with cardamom, served with sweetened condensed milk), we enjoyed having a daily cup of joe. We still find ourselves drinking coffee, but we&#8217;ve had to modify our morning coffee-making ritual a bit.</p>\n<p><strong></strong></p>\n<p>Here in Thailand, we haven&#8217;t readily found ground or whole coffee beans at the major grocery stores. We&#8217;ve also noticed that among the display of small home appliance, coffee percolators are nowhere to be found. There are plenty of microphones (karaoke, anyone?) and rice cookers, but no coffee makers. And it&#8217;s not a question of whether coffee is or is not commonly consumed in Thailand because there are cafes everywhere.</p>\n<p>Instead, what we&#8217;ve commonly found is an array of <i>instant</i> coffee and espresso. The end product smells and tastes about the same as a freshly brewed cup, (at least, to us non-coffee connoisseurs) but it certainly starts out a bit different, in form of little, black, dissolving granules. Care to have your cup o&#8217; joe with cream and sugar? You&#8217;re in luck, because there are 3-in-1 packets that included instant grounds, cream, and sugar in powdered form for your convenience. As for appliances, instead of coffee pots, there are plenty of flower-decked hot water pots and dispensers for a quick supply of boiling water.</p>\n<p>Although we miss the smell of brewing coffee, we&#8217;ve modified our morning ritual to include a one minute water boil in the hot water pot and a few spoonfuls of those dark, aromatic granules by Nescafe Red Cup in our Louboutin coffee cups. Oh, and we still do the cardamom and sweetened condensed milk, inspired by the many times we enjoyed &#8220;Thai Coffee&#8221; at Thai restaurants in Northern Virginia.</p>\n<p>Mind you, coffee shops still serve the real thing. We&#8217;ve happily watch them brew up a shot of espresso using freshly ground beans. Surprisingly, cafe drinks aren&#8217;t much less expensive than they are back in the States. An iced latte can easily run 50 to 100 baht ($1.50-$3) depending on where we go. That can be as much as a meal!</p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Real Coffee is Hard to Find"}},"pageContext":{"id":"5b95efab87be05832749011d"}}