{"data":{"mongodbDatabaseArticles":{"id":"5b921d1387be0571ac1b04f0","content":"<div><p>Last updated June 2018</p>\n<p>Your privacy is important to Nomad Capitalist Limited (herein, &#8220;Nomad&#8221;). We developed this Privacy Notice to provide you with information on how we process your personal data when you create a Nomad account, interact with our customer support specialists, visit nomadcapitalist.com or visit other Nomad websites that include a link to this Privacy Notice</p>\n<h2>Data Controller</h2>\n<p>We are Nomad, the data controllers.<br>\nIf you have any questions, You can contact Nomad at <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a><br>\nBy post: Nomad Capitalist, 2028 E Ben White Blvd #240-6003, Austin, TX 78741 United States</p>\n<h2>Your Rights</h2>\n<p>If you reside in the European Union, you have the right under the General Data Protection Regulation:<br>\n1.\tTo be informed about our processing of your personal data<br>\n2.\tTo have your personal data corrected if it is inaccurate and to have incomplete personal data completed<br>\n3.\tTo object to processing of your personal data<br>\n4.\tTo restrict of processing of your personal data<br>\n5.\tTo have your personal data erased (the &#8220;right to be forgotten&#8221;)<br>\n6.\tTo request access to your personal data and information about how we process it<br>\n7.\tTo move, copy or transfer your personal data (&#8220;data portability&#8221;)<br>\n8.\tIn relation to automated decision making, including profiling</p>\n<p>You have the right to lodge a complaint with a supervisory authority at your home country. It has enforcement powers and can investigate compliance with data protection law.</p>\n<p><b>&#8220;Personal data&#8221;</b> is information relating to an identified or identifiable natural person.<br>\nTHE TYPES OF PERSONAL DATA WE COLLECT AND USE:<br>\n&#9679;\tFull name and personal details including contact information (e.g. home and business address, email address, home/business and mobile phone numbers)<br>\n&#9679;\tFinancial information (billing address, credit card numbers, Paypal identifier, Bitcoin/Ethereum identifies, bank details)<br>\n&#9679;\tIdentity documents (passport, ID, birth certificates, tax and bank statements etc)<br>\n&#9679;\tWebsite usage data (IP, OS, browser type, usage patterns etc)<br>\n&#9679;\tCriminal records</p>\n<p>When you create a Nomad account to comment our articles, we ask you to provide your email address and name.</p>\n<p><b>Information about Other People</b>: via our websites, you can submit personal information about other people. For example, you might submit the name and e-mail address of any individual to send a Nomad and want it sent directly to the recipient, you may be required to submit the recipient&#8217;s name and address. The personal information that may be collected about other people at these pages include the recipient&#8217;s name, address, e-mail address, and telephone number. We do not use the recipient&#8217;s personal information for any other purpose unless given direct permission to do from the recipient.</p>\n<h2>Purposes and Legal Grounds:</h2>\n<p>As necessary to perform our contract with you for the service.<br>\n&#9679;\tNomad processes your personal information as necessary to perform our contract obligations with you for the service. Nomad also processes your email address for the purpose of sending you important information about your Nomad products or account, such as service status, important safety information or material changes to this Privacy Policy. The legal ground for processing your details for this purpose is <b>contract</b>.<br>\n&#9679;\tIf you provide your opt-in consent to receiving marketing information from Nomad, Nomad will also process your email address for the purpose of sending you marketing information about Nomad products. The legal ground for processing your email address for this purpose is your <b>consent</b>. You may withdraw your consent at any time by changing your preferences in your Nomad account or through the unsubscribe link at the bottom of our marketing emails.<br>\n&#9679;\tNomad also processes your email address to associate it with your Nomad account when you interact with our customer support representatives. The legal ground for this processing is our <b>legitimate interest</b> in providing quality customer support.<br>\n&#9679;\tIf you would like to comment any of articles published by Nomad, Nomad will process your name and email address to support this functionality. The legal basis for processing is your <b>consent</b>.</p>\n<h2>Transfers and Shares of Personal Data</h2>\n<p>Nomad is a global business. To offer our products and services, we may need to transfer your personal data to other Nomad companies in other countries.<br>\nWhen you create a Nomad account, add personal data in your account profile, or upload data to your Nomad account, your personal data will be collected and stored on Nomad servers in the US. Personal data regarding individuals who reside in a country in the European Economic Area or in Switzerland is controlled by Nomad.<br>\nAny transfers of personal data from Nomad companies in the European Economic Area (&#8220;EEA&#8221;) or Switzerland to Nomad are done pursuant to European Commission approved Model Contractual Clauses.<br>\nSubject to applicable data protection law we may share your personal data with:<br>\n&#9679;\tSub-contractors and other persons who help us provide our products and services<br>\n&#9679;\tOur legal and other professional advisors, including our auditors<br>\n&#9679;\tFraud prevention agencies, credit reference agencies, and debt collection agencies<br>\n&#9679;\tCourts, to comply with legal requirements, and for the administration of justice<br>\n&#9679;\tIn an emergency or to otherwise protect your vital interests<br>\n&#9679;\tAnyone else where we have your consent or as required by law </p>\n<h2>Cookies and Similar Technologies</h2>\n<p>Websites:<br>\nTo help analyze how you and other visitors navigate Nomad websites, and compile aggregate statistics about site usage and response rates, we, with assistance from third-party analytics service providers, collect certain information when you visit our site. This information includes IP address, geographic location of the device, browser type, browser language, date and time of your request, time(s) of your visit(s), page views and page elements (e.g., links) that you click. We may use cookies, pixel tags, web beacons, clear GIFs or other similar tools on our site or in our email messages to assist us in collecting and analyzing such information. We use this information to provide better, more relevant content on our site, to measure the effectiveness of advertisements, to identify and fix problems, and to improve your overall experience on our site. We may also engage one or more third-party service providers to provide online advertisements on our behalf. They may use a pixel tag or other similar technology to collect information about your visits to sites, and they may use that information to send you targeted advertisements. For more information regarding this practice and to opt-out of such collection and use of this information by our third-party service providers, please see <a href=\"https://www.networkadvertising.org/\" target=\"_blank\">Networkadvertising.org</a>.</p>\n<p>If you do not want information collected through the use of these technologies, there is a simple procedure in most browsers that allows you to automatically decline many of these technologies, or to be given the choice of declining or accepting them.<br>\nIf you reside in the European Union or other jurisdiction that requires us to obtain your consent to use cookies on our sites, then you will have an opportunity to manage your cookie preferences on the sites; except that certain cookies are required to enable core site functionality, and you cannot choose to disable those cookies.</p>\n \n\n\nFirst-party cookies\nUse of\n\n\n_cfduid\nWebsite functionality\n\n\n_gat\nGoogle Analytics\n\n\n_gid\nGoogle Analytics\n\n\n_ga\nGoogle Analytics\n\n\n<p>Here are examples of third-party providers of analytics and similar services we currently use:<br>\n<b>Analytics Services:</b><br>\n&#9679;\t<b>Google</b>: Google Analytics is used to track site statistics and user demographics, interests and behavior on websites. We also use Google Search Console to help understand how our website visitors find our website and to improve our search engine optimization. <a href=\"https://policies.google.com/privacy\" target=\"_blank\">Find out more information</a> about how this analytics information may be used, how to control the use of your information, and how to opt-out of having your data used by Google Analytics.<br>\n&#9679;\t<b>MarinOne and prft.co</b>: Usage analytics. Please visit MarinSoftware privacy policy <a href=\"http://www.marinsoftware.com/privacy/privacy-central\" target=\"_blank\">here</a></p>\n<p><b>Advertising and Marketing:</b><br>\n&#9679;\t<b>DoubleClick</b>: Advertising network byGoogle. Please visit Google privacy policies <a href=\"https://policies.google.com/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Appnexus</b>: Advertising network. Please visit Appnexus privacy policy <a href=\"https://www.appnexus.com/en/company/privacy-policy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>OpenX</b>: Advertising network. Please visit OpenX privacy policy <a href=\"https://www.openx.com/legal/privacy-policy/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Drip</b>: Online marketing tool. Please visit Drip privacy policy <a href=\"https://www.drip.com/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Rubicon</b>: Advertising network. Please visit Rubicon privacy policy <a href=\"https://rubiconproject.com/privacy-policy/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Linkedin</b>: Business focused social network. Find out more information about Linkdedin privacy policy <a href=\"https://www.linkedin.com/legal/privacy-policy\" target=\"_blank\">here</a>.</p>\n<p><b>Others:</b><br>\n&#9679;\t<b>InfusionSoft</b>: CRM system. Please visit InfusionSoft privacy policy <a href=\"https://www.infusionsoft.com/legal/privacy-policy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>WordPress and Akismet</b>: Content management system and anti-spam control from Automattic. Please visit Automattic privacy policy <a href=\"https://automattic.com/privacy-notice/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Leadpages</b>: Hosting services. Please visit Leadpages privacy policy <a href=\"https://www.leadpages.net/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Cloudflare</b>: Content delivery network. Please visit Cloudflare privacy policy <a href=\"https://www.cloudflare.com/privacypolicy/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Cookiebot</b>: Consent management. Please visit Cookiebot privacy policy <a href=\"https://www.cookiebot.com/en/privacy-policy/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>BootstrapCDN</b>: Content delivery network. Please visit BootstrapCDN privacy policy <a href=\"https://www.bootstrapcdn.com/privacy-policy/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>SurveyGizmo</b>: Market research solution. Please visit SurveryGizmo privacy policy <a href=\"https://www.surveygizmo.com/privacy/\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Twitter</b>: Social network. Please visit Twitter privacy policy <a href=\"https://twitter.com/en/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Facebook</b>: Social network. Please visit Facebook privacy policies <a href=\"https://www.facebook.com/about/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Vimeo</b>: Video hosting service. Please visit Vimeo privacy policy <a href=\"https://vimeo.com/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Youtube</b>: Video hosting service by Google. Please visit Google privacy policies <a href=\"https://policies.google.com/privacy\" target=\"_blank\">here</a><br>\n&#9679;\t<b>Wistia</b>: Video hosting service. Please visit Wistia privacy policy <a href=\"https://wistia.com/privacy\" target=\"_blank\">here</a>.</p>\n<h2>Retention of Personal Data</h2>\n<p>The following criteria are used to determine data retention periods for your personal data:<br>\n&#9679;\tWe will retain your personal data as long as your Nomad account is considered to be active.<br>\n&#9679;\tWe will retain technical information about your visits to Nomad websites for 12 months</p>\n<h2>Children</h2>\n<p>We request individuals under 18 not provide personal data to Nomad. If we learn that we have collected the personal data from a child under 18, we will take steps to delete the information as soon as possible.</p>\n<h2>Security</h2>\n<p>We have implemented measures in an effort to maintain the confidentiality of all personal information in our custody and control, including only providing access to personal information to employees and authorised service providers who require such information for the purposes described in this document.<br>\nWe maintain administrative, technical and physical safeguards in an effort to protect against unauthorised access, use, modification and disclosure of personal information in our custody and control.<br>\nTo provide you with an increased level of security online, access to your personal information on certain of our websites may be protected with a password you select.<br>\n&#9679;\tWe strongly recommend that you do not disclose your password to anyone.<br>\n&#9679;\tWe will never ask you for your password in any unsolicited communication.</p>\n<h2>Privacy Policy Updates</h2>\n<p>We may update this Privacy Policy from time to time as we add new products, as we improve our current offerings and as technologies and laws change. You can determine when this Privacy Policy was last revised by referring to the &#8220;Last updated&#8221; legend at the top of this page. Any changes will become effective upon our posting of the revised Privacy Policy.<br>\nWe will provide notice to you if these changes are material and, where required by applicable law, we will obtain your consent. This notice will be provided by email or by posting notice of the changes on the Nomad websites that link to this Privacy Policy.</p>\n</div>","title":"Privacy Policy and Cookie Policy"}},"pageContext":{"id":"5b921d1387be0571ac1b04f0"}}