{"data":{"mongodbDatabaseArticles":{"id":"5b937b3087be056953db7d33","content":"<div><p name=\"aa05\" id=\"aa05\" class=\"graf graf--p graf--leading\">In the spring of 2010, Jack was just finishing up his first year of college where he was studying film. A buddy of his mentioned a couple of guys named the Neistat Brother&#8217;s and mentioned they had an HBO series coming out the following week, actually called The Neistat Brother&#8217;s.</p><p name=\"0190\" id=\"0190\" class=\"graf graf--p graf-after--p\">After Jack watched the series, he decided that he needed to figure out how to be around these guys. So once Jack found a contact email, he emailed them and offered them a bunch of <strong class=\"markup--strong markup--p-strong\">free work;</strong> just whatever it took to be in the same room as the Neistat Brothers. And in the process, he learned a ton of skills including electrical wiring, carpentry, how to mop the floors, and I&#8217;m sure many others.</p><p name=\"75db\" id=\"75db\" class=\"graf graf--p graf-after--p\">He kept working for Casey while he was in school and by the time he graduated, was offered a job to work for him full time. If you know anything about Casey right now, this is huge. Casey has 9 million subscribers on YouTube and his reach is vast. But at that time, this wasn&#8217;t quite they case.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*754dy3EtE44J8e5NI4UO_w.png\">Graduating college and going to work for&#160;Casey<p name=\"35cd\" id=\"35cd\" class=\"graf graf--p graf-after--figure\">Casey and Matt Hackett were just building out their startup company Beme which Jack helped them build. They grew this thing from the ground up and started with just an idea and Google Glass.</p><p name=\"0740\" id=\"0740\" class=\"graf graf--p graf-after--p\">To grow the company, Casey started daily vlogging (video logging). The daily vlogs were about his life but each time he would mention Beme on the channel, the app downloads would sky rocket. It was a very effective marketing strategy.</p><p name=\"f4a2\" id=\"f4a2\" class=\"graf graf--p graf-after--p graf--trailing\">So Jack was there through this whole thing; watching Casey make videos, start daily vlogging, and just being around Casey and a talented team of people with skills that he could learn from. That is, until Beme was shut down and he got fired a couple weeks ago. But I&#8217;m going to bet that being fired from Beme might be the best thing that ever happens to Jack.</p></div>","title":"One way to change your life, learn to vlog like Jack Coyne"}},"pageContext":{"id":"5b937b3087be056953db7d33"}}