{"data":{"mongodbDatabaseArticles":{"id":"5b9382f287be056953db7e0e","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"8ce6\" id=\"8ce6\" class=\"graf graf--h3 graf--leading graf--title\">Working Remotely; Work From Where You&#160;Like</h1></p><p name=\"2b07\" id=\"2b07\" class=\"graf graf--p graf-after--figure\">Working from home or any other place that you like to work from is amazing, but at the same time it can be difficult, specially if you work from home; is easy to get distracted by other things and not be as productive as you would like to be.</p><p name=\"f2f2\" id=\"f2f2\" class=\"graf graf--p graf-after--p\">As some of you may know I work at <a href=\"https://doist.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Doist</a>, the company behind <a href=\"https://todoist.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Todoist</a>. The team behind Doist is distributed all around the world; <strong class=\"markup--strong markup--p-strong\">we work remotely</strong>. I&#8217;ve been working home for more than a year and a half now, and with this time I was able to learn and find ways to be as much productive as possible and avoid distractions.</p><p name=\"3bab\" id=\"3bab\" class=\"graf graf--p graf-after--p\">At the beginning I searched a lot about tips of how to work remotely and be as much productive as possible, but after all it depends on yourself, what works for you, because we all are different. On this article I will just share with you my experience so far and what I learned.</p><blockquote name=\"3dae\" id=\"3dae\" class=\"graf graf--blockquote graf-after--p\">This article is still a work in progress. I&#8217;ll be updating it while I learn new tips and ways to improve how I work remotely. I&#8217;ll share on Twitter when I update it, so if you want to stay up to date, <a href=\"https://twitter.com/enricenrich\" class=\"markup--anchor markup--blockquote-anchor\" rel=\"nofollow noopener\" target=\"_blank\">you can follow me; @enricenrich</a>.</blockquote><h4 name=\"7d1d\" id=\"7d1d\" class=\"graf graf--h4 graf-after--blockquote\">Feel comfortable</h4><p name=\"a8a3\" id=\"a8a3\" class=\"graf graf--p graf-after--h4\">Written the December 26, of 2015</p><p name=\"4a22\" id=\"4a22\" class=\"graf graf--p graf-after--p\">Working remotely doesn&#8217;t mean that you only work from home, it mean that you work from where you like, from where you love, from where you feel more comfortable. For me this place is at home, but for you it will maybe be a co-working space, a coffee shop, or any other place.</p><p name=\"b704\" id=\"b704\" class=\"graf graf--p graf-after--p\">For this, you&#8217;ll probably have to try different places until you find one where you feel comfortable. Or, maybe you can work from a different place depending on the day of the week. Just try.</p><p name=\"250a\" id=\"250a\" class=\"graf graf--p graf-after--p\">This is one of the most amazing things of working remotely; <strong class=\"markup--strong markup--p-strong\">you can work from whatever you want, whenever you want</strong>.</p><h4 name=\"b28d\" id=\"b28d\" class=\"graf graf--h4 graf-after--p\">Avoid distractions</h4><p name=\"9988\" id=\"9988\" class=\"graf graf--p graf-after--h4\">Written the December 26, of 2015</p><p name=\"b1f3\" id=\"b1f3\" class=\"graf graf--p graf-after--p\">I think that this depends from where you work. It&#8217;s not the same working from a co-working space where everyone goes there to work, than if you work from home. Since I work only from home, here is what I learned and what works for me to avoid distractions at home.</p><p name=\"6a2a\" id=\"6a2a\" class=\"graf graf--p graf-after--p\">1. <strong class=\"markup--strong markup--p-strong\">Don&#8217;t work near the entrance of your home</strong><br>This only works if you live with more people. Why? Because sometimes those visits aren&#8217;t for you, but for the other people that lives with you. If you don&#8217;t work near the entrance you&#8217;ll not be interrupted every time someone comes to your home.</p><p name=\"fdf0\" id=\"fdf0\" class=\"graf graf--p graf-after--p\">2. <strong class=\"markup--strong markup--p-strong\">Music, work with music</strong><br>This depends on the person; I know some people that can&#8217;t work with music, but for me it&#8217;s necessary. It helps me to isolate myself from other distractions and focus on what I&#8217;m doing.</p><h4 name=\"7935\" id=\"7935\" class=\"graf graf--h4 graf-after--p\">Create an&#160;schedule</h4><p name=\"6e9e\" id=\"6e9e\" class=\"graf graf--p graf-after--h4\">Written the December 26, of 2015</p><p name=\"2643\" id=\"2643\" class=\"graf graf--p graf-after--p\">It&#8217;s important to have an schedule so you can separate your personal stuff from your work. Obviously, working remotely makes it really easy to tweak your schedule to adapt it to special events or things that you have to do. This said, it&#8217;s important to stick to your schedule as much as possible so you set a routine on this.</p><p name=\"c937\" id=\"c937\" class=\"graf graf--p graf-after--p\">Normally, I work from 9:30 to 14:30, and from 16:00 to 19:00. But it can change depending on the amount of work I have to do, and if I have other things to do.</p></div>","title":"Working Remotely; Work From Where You Like – Enric Enrich – Medium"}},"pageContext":{"id":"5b9382f287be056953db7e0e"}}