{"data":{"mongodbDatabaseArticles":{"id":"5b937afa87be056953db7cfe","content":"<div><h3 name=\"f9f5\" id=\"f9f5\" class=\"graf graf--h3 graf--leading\"><strong class=\"markup--strong markup--h3-strong\">Thought #1&#8202;&#8212;&#8202;Don&#8217;t rush. The power of compounding, coupled with a simple investing strategy can get you far&#160;enough</strong></h3><p name=\"de69\" id=\"de69\" class=\"graf graf--p graf-after--h3\">Investing to grow your wealth needs not be difficult and complicated.</p><p name=\"f075\" id=\"f075\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I am not saying that it&#8217;s easy. I am saying that it needs not be difficult and complicated.</strong> It can be as simple as coming up with a simple investing strategy that matches your risk-reward profile and then leveraging on the power of compounding to grow your wealth.</p><p name=\"c074\" id=\"c074\" class=\"graf graf--p graf-after--p\">To fully understand my point, we have to first understand the <strong class=\"markup--strong markup--p-strong\">concept of compounding</strong>. It&#8217;s a very simple concept.</p><p name=\"214f\" id=\"214f\" class=\"graf graf--p graf-after--p\">Let&#8217;s say you invest $1 today and the annual interest is 10%. One year later, you have $1.10. Two years later, you have $1.21 instead of $1.20, as the interest that you earn in the first year will give you interest too. It&#8217;s as simple as that.</p><p name=\"b0f0\" id=\"b0f0\" class=\"graf graf--p graf-after--p\">I&#8217;m sure most of you have heard of the power of compounding. If not, let me repeat the words of one of the smartest person in history.</p><blockquote name=\"98e0\" id=\"98e0\" class=\"graf graf--pullquote graf--hasDropCapModel graf--startsWithDoubleQuote graf-after--p\">&#8220;Compound interest is the eighth wonder of the world. He who understands it, earns it&#160;&#8230; he who doesn&#8217;t&#160;&#8230; pays it.&#8221;&#8202;&#8212;&#8202;Albert&#160;Einstein</blockquote><p name=\"7878\" id=\"7878\" class=\"graf graf--p graf-after--pullquote\">So exactly how powerful compounding is in helping us to grow our wealth?</p><p name=\"6d76\" id=\"6d76\" class=\"graf graf--p graf-after--p\">Let&#8217;s do some (simple) math now. Meet Bob:</p><ul class=\"postList\"><li name=\"6d84\" id=\"6d84\" class=\"graf graf--li graf-after--p\">Bob has just graduated from university and is working as an engineer;</li><li name=\"440a\" id=\"440a\" class=\"graf graf--li graf-after--li\">Bob earns a monthly income of $3,000;</li><li name=\"a21c\" id=\"a21c\" class=\"graf graf--li graf-after--li\">Bob spends $2,000 every month, so he saves $1,000 every month, i.e. a savings rate of 33%;</li><li name=\"5844\" id=\"5844\" class=\"graf graf--li graf-after--li\">Bob invests his savings annually, i.e. he invests $12,000 every year; and</li><li name=\"9e8c\" id=\"9e8c\" class=\"graf graf--li graf-after--li\">Bob is able to predict the future. He knows that he would get an annual return of 6% on his investment amount every year.</li></ul><p name=\"ffd1\" id=\"ffd1\" class=\"graf graf--p graf-after--li\">Now let&#8217;s make a guess. After 30 years, i.e. after having put in a total of $360,000, how much would Bob have in total, assuming he reinvests all the returns/interests that he gets every year?</p><p name=\"2d75\" id=\"2d75\" class=\"graf graf--p graf-after--p\">[Make your guess now before you read on&#8230;]</p><p name=\"2bf7\" id=\"2bf7\" class=\"graf graf--p graf-after--p\">The answer is slightly over $1 million! Almost triple the amount that he puts in.</p><p name=\"4244\" id=\"4244\" class=\"graf graf--p graf-after--p\">At this point, I have a question for you. Do you think you can be like Bob, saving a fixed amount of $1,000 every month and investing the savings annually, for the next 30 years?</p><p name=\"ea5e\" id=\"ea5e\" class=\"graf graf--p graf-after--p\">If your think you can, good news for you. Assuming that you are 25 (my age) this year, you would have your first million by the age of 55. And note that I am assuming a reasonable and realistic 6% annual return and a constant saving of $1,000 only (remember that you income will go up as you grow older and progress in your career). (At this point, I would highly recommend you to quickly pull up your Microsoft Excel, plug in your own numbers based on your circumstances, and work out the results for yourself. This is crucial if you really want to understand where the power of compounding can bring you based on how much you can/are willing to put in.)</p><p name=\"5b5a\" id=\"5b5a\" class=\"graf graf--p graf-after--p\">See the power of compounding? <strong class=\"markup--strong markup--p-strong\">The power of compounding can create millionaires from average people.</strong></p><p name=\"b4e1\" id=\"b4e1\" class=\"graf graf--p graf-after--p\">And see what I mean by investing needs not be difficult? <strong class=\"markup--strong markup--p-strong\">It can be as simple as using the power of compounding, coupled with a simple investing strategy that can provide you an average annual return of 6%.</strong> The development of a strategy that gives you the annual return that you want may not be easy, but once you are done with that, what you need to do next is just to sit back and watch the power of compounding works its magic.</p><p name=\"134a\" id=\"134a\" class=\"graf graf--p graf-after--p\">You might be thinking, if it&#8217;s that easy, why isn&#8217;t everyone practising this and becoming rich?</p><p name=\"bf04\" id=\"bf04\" class=\"graf graf--p graf-after--p\">That&#8217;s because even though sitting back and letting the power of compounding works its magic is simple, it is not easy. <strong class=\"markup--strong markup--p-strong\">It is not easy because it takes time, patience and a strong belief that it works.</strong></p><p name=\"b146\" id=\"b146\" class=\"graf graf--p graf-after--p\">Compounding doesn&#8217;t happen overnight. It takes time. And when I say time, I mean a few years, a few decades, which is in fact a very long time.</p><p name=\"95f9\" id=\"95f9\" class=\"graf graf--p graf-after--p\">And during this long period of time, it&#8217;s not easy to keep your eyes set on the long-term results and stick to your initial plan, of using a simple investing strategy and the power of compounding, because it seems too simple and you can&#8217;t see the results yet.</p><p name=\"50c1\" id=\"50c1\" class=\"graf graf--p graf-after--p\">There are all sorts of things that can make you divert from your plan. For example, the results in the first few years would not be impressive and you might be thinking: &#8220;Is 6% annual return really enough to get me to where I want to be financially? My friends have been discussing about an investment opportunity that gives 50% return in 2 years. Maybe I should ask them about that and consider changing my plan. Anyway, the results that I have have been so so only thus far&#8230;&#8221;</p><p name=\"0be4\" id=\"0be4\" class=\"graf graf--p graf-after--p\">All sorts of thoughts and doubts start popping up in your mind, even though in the first place, no one says you would be see impressive results in the first few years. There is nothing wrong with your initial plan. Your initial plan says that you would achieve your first million in 30-years-time based on an annual return of 6%, not in a few years! What has changed is your own expectations.</p><p name=\"70e4\" id=\"70e4\" class=\"graf graf--p graf-after--p\">This is why I say using a simple investing strategy and the power of compounding to grow your wealth can be simple, but not easy. <strong class=\"markup--strong markup--p-strong\">You have to have the belief (and I mean strong belief) that it would work and strong control over your emotion</strong> so as to hinder the short-term noises and distractions (for e.g. get-rich-fast schemes or the next-big investment opportunity that everyone is talking about) from taking you off your original plan.</p><p name=\"918b\" id=\"918b\" class=\"graf graf--p graf-after--p\">You have to understand that as long as your investing strategy is giving you the annual return that you have put in in your spreadsheet when you formulated that strategy, even though that annual return rate suddenly &#8220;appears&#8221; low now, especially when your peers are talking about a much higher return (even though they might not have achieved them consistently for many years), you are fine. You just have to stick to your strategy and allow time for compounding to take you there.</p><blockquote name=\"5b12\" id=\"5b12\" class=\"graf graf--pullquote graf--startsWithDoubleQuote graf-after--p\">&#8220;Successful investing takes time, discipline and patience. No matter how great the talent or effort, some things just take time: You can&#8217;t produce a baby in one month by getting nine women pregnant.&#8221;&#8202;&#8212;&#8202;Warren&#160;Buffett</blockquote><p name=\"fb30\" id=\"fb30\" class=\"graf graf--p graf-after--pullquote\"><strong class=\"markup--strong markup--p-strong\">Even Warren Buffett, one of the most successful investor and richest man in the world, says that &#8220;successful investing takes time, discipline and patience&#8230; some things just take time&#8221;.</strong></p><p name=\"dcd7\" id=\"dcd7\" class=\"graf graf--p graf-after--p\">So I would suggest that, finding a simple investing strategy that matches your risk-reward profile and provides you with a good-enough return based on your investment goals, and sticking to it over time for compounding to take its effect, may be a better way to go, as compared to going after more complicated investing strategies or ideas that promise much higher returns.</p><p name=\"a97c\" id=\"a97c\" class=\"graf graf--p graf-after--p\">If you have totally no clue as to what returns to expect, here are some numbers. From 1965 to 2015 (50 years), Warren Buffett&#8217;s Berkshire Hathaway had achieved an average annual return of 21.6%, while the average annual return for the Standard &amp; Poor&#8217;s 500-stock index (a proxy for the US market), with dividends included, was 9.9%. If you think you can do better than Warren Buffett or the market (most people, including professional investors and mutual/hedge funds worldwide don&#8217;t outperform the market consistently), then go for double-digit returns. If not, then I would highly recommend you to manage your expectations and aim for more reasonable returns.</p><p name=\"8dd9\" id=\"8dd9\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Remember: Don&#8217;t rush. The power of compounding, coupled with a simple investing strategy can get you far enough.</strong></p><blockquote name=\"f2b9\" id=\"f2b9\" class=\"graf graf--pullquote graf--startsWithDoubleQuote graf-after--p graf--trailing\">&#8220;It is not necessary to do extraordinary things to get extraordinary results.&#8221;&#8202;&#8212;&#8202;Warren&#160;Buffett</blockquote></div>","title":"4 Thoughts on Personal Finance and Investing that You Have to Know in Your 20s"}},"pageContext":{"id":"5b937afa87be056953db7cfe"}}