{"data":{"mongodbDatabaseArticles":{"id":"5b93830e87be056953db7e20","content":"<div><p name=\"d863\" id=\"d863\" class=\"graf graf--p graf-after--figure\">On the mobile team, we set out in 2015 with the task of building the best app for travelers on the ground in any location in the world.</p><p name=\"dbaf\" id=\"dbaf\" class=\"graf graf--p graf-after--p\">After a year in development and another one out in the wild, we believe that our first version of <a href=\"http://www.lonelyplanet.com/guides\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Guides</a> has succeeded in its goals.</p><p name=\"8164\" id=\"8164\" class=\"graf graf--p graf-after--p\">With more than a million users and a average rating of <a href=\"https://play.google.com/store/apps/details?id=com.lonelyplanet.guides&amp;hl=en\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">4.5 stars</strong></a><strong class=\"markup--strong markup--p-strong\"> </strong>on the Android Play Store and <a href=\"https://itunes.apple.com/us/app/guides-by-lonely-planet/id1045791869?mt=8\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">4.9 stars</strong></a><strong class=\"markup--strong markup--p-strong\"> </strong>on the iOS App Store, we believe we&#8217;ve done a few things well.</p><p name=\"8e79\" id=\"8e79\" class=\"graf graf--p graf-after--p\">I would like to share some of them with all of you.</p><h3 name=\"aab0\" id=\"aab0\" class=\"graf graf--h3 graf-after--p\">Embrace limitations &amp; differences</h3><p name=\"c78e\" id=\"c78e\" class=\"graf graf--p graf-after--h3\">We are a very small team trying to change how things work at a company that&#8217;s been inspiring travelers for almost 44 years. We don&#8217;t have the capacity to take on every challenge so we&#8217;ve had to constantly pick our battles. It&#8217;s been frustrating many times but we all know that constraints stimulate creativity.</p><h4 name=\"06a8\" id=\"06a8\" class=\"graf graf--h4 graf-after--p\">Prioritize and simplify ruthlessly</h4><p name=\"0211\" id=\"0211\" class=\"graf graf--p graf-after--h4\">I can only imagine how many unneeded features, animations, libraries and architectures we would&#8217;ve built if we&#8217;d had the resources. We couldn&#8217;t so we didn&#8217;t, and as a result, the app has been reduced to its most essential, valuable features.</p><p name=\"d470\" id=\"d470\" class=\"graf graf--p graf-after--pullquote\">For every feature that we have created we have asked ourselves, does this make sense? How can we make this simpler? How can we test this? From design to development, we&#8217;ve strived to make things simpler and easier, not only because we wanted to, but also because we had to.</p><h4 name=\"bdad\" id=\"bdad\" class=\"graf graf--h4 graf-after--p\">Use tested architectures and patterns instead of experimenting</h4><p name=\"d9b5\" id=\"d9b5\" class=\"graf graf--p graf-after--h4\">When we started thinking about the architecture of the app, there was a lot of hype around <a href=\"https://www.objc.io/issues/13-architecture/viper/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">VIPER</a> and clean architectures, especially on iOS. A lot of people were starting to implement them but no one seemed to have experience with them in the longer term. We didn&#8217;t want to hold ourselves hostage to maintaining so much scaffolding, so we decided to build our app with more conventional approaches, while also avoiding common pitfalls.</p><p name=\"3f45\" id=\"3f45\" class=\"graf graf--p graf-after--p\">For instance, apps we&#8217;d built in the past often ended up with <a href=\"https://www.smashingmagazine.com/2016/05/better-architecture-for-ios-apps-model-view-controller-pattern/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Massive View Controllers</a>. To avoid that issue in Guides, we factored out all functionality that didn&#8217;t belong in them, using data controller classes to handle all the data, view models to manage the state of views, and helper classes that do things ranging from managing the user location to sending notifications or handling all of our custom font styles.<br>&#160;<br>We are very happy with the results. This simpler approach has allowed us to re-use and test code very easily, without having to write a crazy amount of boilerplate code.</p><h3 name=\"61fd\" id=\"61fd\" class=\"graf graf--h3 graf-after--p\">Make good use of our global&#160;team</h3><p name=\"bebf\" id=\"bebf\" class=\"graf graf--p graf-after--h3\">We are spread across multiple continents in cities like San Francisco, Salt Lake City, Nashville and Madrid. There are certain limitations inherent to the nature of our team, but over the years we&#8217;ve learned how to take full advantage of them and become very effective.<br>&#160;<br>One of the most positive things about being distributed across multiple time zones is that we all get our share of <a href=\"http://www.paulgraham.com/makersschedule.html\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">maker schedule</a>. Designing and programming are creative endeavors that are performed best in an interruption-free environment. I consider myself very lucky to have mornings to myself, where I can just focus on my tasks at hand without any interruptions.<br>&#160;<br>The second best thing is that by not having a lot of overlap we can pick up where the other leaves off and continue working. If I don&#8217;t finish an important task before the end of my day, somebody else can pick it up and run from there. The first thing I do when I start working is review other people&#8217;s work. So we&#8217;ve fallen into this nice pattern where we minimize interrupting each other and allow ourselves to concentrate on what we are doing.<br>&#160;<br>The tools we use are the usual suspects. GitHub is where we manage pretty much everything. Even product and design tasks take the form of GitHub issues. We use milestones to give shape to our bi-weekly sprints and issues to define tasks within them. We try to keep our issues and pull requests small and focused, so that they are easy to implement and review. If something looks like more than a day of work, we break it down into a smaller items.<br>&#160;<br>Slack is where we talk to each other. With it, we&#8217;ve pretty much removed the need to use email. It allows us to both have timely discussions, but also a timeless backlog of all the decisions that have been made along the way.</p><h3 name=\"54fd\" id=\"54fd\" class=\"graf graf--h3 graf-after--p\">Unite design &amp; development within a single&#160;team</h3><p name=\"157d\" id=\"157d\" class=\"graf graf--p graf-after--h3\">One thing that&#8217;s special about our team is how different disciplines work closely with each other. We&#8217;ve worked hard to blend the product, design and development disciplines into one team. We developers will give early and frequent feedback on design specs, and our designers will pull and run our code to give feedback as we implement the designs.</p><p name=\"890e\" id=\"890e\" class=\"graf graf--p graf-after--p\">We all participate in each other&#8217;s process, providing our perspective as early and frequently as we can, and doing so while minimizing interruptions by doing it asynchronously.</p><h3 name=\"6d99\" id=\"6d99\" class=\"graf graf--h3 graf-after--p\">Tighten feedback&#160;loops</h3><p name=\"c873\" id=\"c873\" class=\"graf graf--p graf-after--h3\">Given that we are a small team we felt like we needed to improve the speed and amount of feedback about the quality of our apps. That made us invest really early on in automated testing and a good crash reporting tool.</p><h4 name=\"ebc6\" id=\"ebc6\" class=\"graf graf--h4 graf-after--p\">Testing &amp; continuous integration</h4><p name=\"a650\" id=\"a650\" class=\"graf graf--p graf-after--h4\">For our other apps we had written a lot of UI tests but they had a couple of problems. They were really high-maintenance and didn&#8217;t expose many of the errors we wanted to catch. For Guides, we decided to go all-in with unit testing. Our architecture allows us to isolate components fairly easily, and therefore test them without much difficulty.&#160;<br>&#160;<br>When rushing to ship the 1.0 version of Guides, having to write unit tests for most of the code made it a real pain in the neck. We were going much slower than we would have otherwise and that made us feel slow and unproductive.&#160;<br>&#160;<br>However, that all changed when we shipped and started iterating on features. Thanks to having good test coverage, it is incredible the amount of confidence we have now in making changes. It&#8217;s a game changer.</p><p name=\"07ee\" id=\"07ee\" class=\"graf graf--p graf-after--p\">To run the tests we use a cloud-based continuous integration platform that executes all of them every time we push a commit to our Git repo. That allows us to keep working on other features or bugs while the tests are being executed, minimizing downtime.</p><h4 name=\"e656\" id=\"e656\" class=\"graf graf--h4 graf-after--p\">Crash reporting</h4><p name=\"5c31\" id=\"5c31\" class=\"graf graf--p graf-after--h4\">When you put your app in front of thousands of people things you never imagined start happening. Crashes and errors pour in like crazy.</p><p name=\"68a7\" id=\"68a7\" class=\"graf graf--p graf-after--p\">Having a good tool that collects them all and organizes them by type of crash is one of the most important tools to invest in. It allows you to quickly determine the most outstanding issues so you can focus on those.</p><h4 name=\"a43d\" id=\"a43d\" class=\"graf graf--h4 graf-after--p\">Direct feedback channels with&#160;users</h4><p name=\"fc1c\" id=\"fc1c\" class=\"graf graf--p graf-after--h4\">We have multiple channels of communication with users such as <a href=\"https://www.helpshift.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Helpshift</a>, <a href=\"https://www.zendesk.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Zendesk</a> and <a href=\"https://docs.google.com/forms/u/0/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Google Forms</a>. We encourage people to give us feedback continually as they navigate the app.</p><p name=\"a7a7\" id=\"a7a7\" class=\"graf graf--p graf-after--p\">We personally review each request and respond appropriately. This keeps us grounded and in contact with our users&#8217; needs and wants.</p><p name=\"338f\" id=\"338f\" class=\"graf graf--p graf-after--p\">One more thing that we&#8217;ve done is hook App and Play Store reviews into Slack using <a href=\"https://appfigures.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">AppFigures</a>. It posts every review we get to a channel so we are on top of everything people say about our app.</p><h4 name=\"eab6\" id=\"eab6\" class=\"graf graf--h4 graf-after--p\">Travel a lot and use our own&#160;app</h4><p name=\"2f27\" id=\"2f27\" class=\"graf graf--p graf-after--h4\">Not only do we take feedback from our users, but our team is made of avid travelers and during the past two years, <a href=\"http://www.lonelyplanet.com/careers/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">we&#8217;ve traveled to 25+ cities that we have in the app</a>, forcing us to use it like real tourists.</p><p name=\"01bd\" id=\"01bd\" class=\"graf graf--p graf-after--p\">That has allowed us to surface tons of issues and recognize new opportunities for the app. In fact, many of the current features of the app have come from using it ourselves.</p></div>","title":"3 remote developers, 1 million happy users – Lonely Planet product – Medium"}},"pageContext":{"id":"5b93830e87be056953db7e20"}}