{"data":{"mongodbDatabaseArticles":{"id":"5b9248b087be056953db7bd8","content":"<div><p>For the last year, me and many people around me with startups and online businesses have been working hard to automate the daily tasks that keep our companies running. With an abundance of web APIs, cheap VPS servers and simple scripting languages available, it has finally become possible to automate most of our tasks.</p> <p>I've been flabbergasted by how well it works. I never would have thought most of my work could be automated. With a simple server, some scripts run by cron jobs, I've decreased my workload for my main business from ~50 hours per week to just ~5 hours per week, while I deliver twice the work. So that's about 5% (5h/50h/2x) of my original workload.</p> <p>A few of us still have some minor tasks that can't be automated yet, and we've hired people for that (mostly remotely to save costs).</p> <h2>Robots now run our business</h2> <p>We now have great businesses which mostly run itself. Our jobs are done by robot scripts in server farms all over the world. Every second of the day, our robots watch YouTube videos, scout Facebook pages for leads, write and reply to personal emails with basic A.I. &amp; <a href=\"http://en.wikipedia.org/wiki/Markov_chain\">Markov-chains</a>, monitor our websites, download video, music and images to transcode them and upload them elsewhere. Every little task you can think of that you can do on a computer, can probably be automated with a few scripts on a server.</p> <p>While the robots are working for us and money is flowing in, we get free time to work on new projects and having more leisure time.</p> <p>But now, after a few months, something odd has started to happen to all of us.</p> <h2>But what's left to do?</h2> <p>We've been sending each other messages how we're all kinda starting feel a bit down. And the culprit is quite clear. This is what happens when there's nothing for you to do anymore. </p> <p>While I had always thought about how to automate, I never thought about what would happen to myself when I'd actually do it.</p> <p>When you're fired from your job, you become unemployed and you get the same feeling. And it's a valid feeling since you want to be active and have a purpose. But we're not fired, we're still making money. It's just that the are robots doing our jobs now. So our mind can't grapple with that. It thinks we're slacking off. People like us identify ourselves by the things we've made. And if there's nothing to do anymore, we start feeling empty.</p> <h2>A peek into the future</h2> <p>I'm obviously dramatizing this a little bit. Right now, there's still new projects to start and new stuff to find a purpose from. But this feeling does give us a little peek into the future.</p> <p>We know <a href=\"/automation-will-kill-the-consumptionproduction-cycle/\">everything will be automated</a>. But we've hardly grappled with the questions what we'd do in a time like that. With total satisfaction, no daily tasks and everybody having <a href=\"/with-jobs-gone-will-robot-owners-pay-peoples-income/\">food on the table</a>, what will most of our time be spent on? Relationships? Arts? Study?</p> <p>Sure, but will we get the same satisfaction from those as actually working? It's a cultural meme for people to say they hate work, but do they really? Doesn't work give us purpose? What if there's nothing left to do? Staring right into that void doesn't just bore me though, it scares me to death.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How Automation Left Us Feeling Empty"}},"pageContext":{"id":"5b9248b087be056953db7bd8"}}