{"data":{"mongodbDatabaseArticles":{"id":"5b937b3787be056953db7d3a","content":"<div><h1 name=\"06e4\" id=\"06e4\" class=\"graf graf--h3 graf--leading graf--title\">The &#8216;digital nomad&#8217; is the modern&#160;hobo</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*rsuOXdv_wfUCvoCVFZflIA.png\"><p name=\"0f3d\" id=\"0f3d\" class=\"graf graf--p graf-after--figure\">Recently, we&#8217;ve seen the rise of what is euphemistically known as the &#8216;<a href=\"https://en.wikipedia.org/wiki/Digital_nomad\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">digital nomad</a>&#8217;. I propose we call them by what they really are: digital hobos. Or, really, let&#8217;s just call them hobos, since the only significant difference between the hobos of the early 20th century and today&#8217;s &#8216;digital nomads&#8217; is the tech. Instead of a bindle they have laptops, but the driving motivation is the same: coping with an economy that no longer makes sense.</p><p name=\"285c\" id=\"285c\" class=\"graf graf--p graf-after--p\">Let&#8217;s be clear, though, they are hobos in the traditional sense of the word. Hobos aren&#8217;t lazy or unmotivated. They work. In the hierarchy of transience the hobo is perhaps the noblest of them all. A tramp works only when he has to, and a bum never works, but a hobo is ready to work and is always on the lookout for the next gig.</p><p name=\"9f18\" id=\"9f18\" class=\"graf graf--p graf-after--p\">The digital hobo travels for the same reason analog hobos did: because staying put doesn&#8217;t make sense economically or psychologically; leases are a liability when work is so sporadic, and it&#8217;s easier to maintain hope when there&#8217;s always another place to go that might be better. They work when they can, but instead of calling it desperation they call it &#8216;freelancing&#8217;. A hobo of the last century taking shelter in a widow&#8217;s attic while he works for his keep would be just as happy to call his life &#8216;nomadic&#8217; for the same reason people do now: a simple need to hide the tragedy of their life circumstances.</p><p name=\"1692\" id=\"1692\" class=\"graf graf--p graf-after--p\">Each individual involved in this new trend of working trancience tends to think they&#8217;re making sensible decisions based on the specifics of their situation. However, observed from a distance and in aggregate, all those individual situations form a mass movement driven not by specific life circumstances but by grand economic sea-changes. When a movement is noticed its members are named, so we had the birth of hobos back then. Today we have a variety of terms to label the various participants of the new system of vulnerability and exploitation in the US desperation economy; terms like &#8216;van life&#8217; and &#8216;gig economy&#8217; and &#8216;digital nomad&#8217; are all neologisms driven by the same deleterious society-spanning forces.</p><p name=\"f899\" id=\"f899\" class=\"graf graf--p graf-after--p\">These new movements are not actually new, or rather the only thing new about them is the internet. Whereas before a young couple who decided it was best to live in their car were isolated and ashamed, now they can reframe their desperate acts of survival as something more intentional and noble via social media. The digital hobo can project themselves as heroic and enterprising, rather than as frightened and alone.</p><p name=\"218e\" id=\"218e\" class=\"graf graf--p graf-after--p\">The tragedy of this reframing is it prevents them from properly grieving the loss or, at best, indefinite delay of things critical to the human experience, things like: daily physical contact with friends and family, a loving and supportive community, a home of their own, and the general feeling of security that comes from a stable life. This is what digital hobos leave behind. The total of that loss makes it impossible to believe they wouldn&#8217;t do things differently if they had the chance, so their apparent choice isn&#8217;t much of a choice at all. It&#8217;s a choice in the same way one mine choose to surrender their wallet to a mugger when the alternative is to get stabbed; it&#8217;s the best of the available options at the time, but that doesn&#8217;t make someone happy with the outcome.</p><p name=\"cce4\" id=\"cce4\" class=\"graf graf--p graf-after--p graf--trailing\">To tally all those losses would be to admit the magnitude of the problem. No one wants to believe they&#8217;re in trouble. They especially do not want to recognize that they&#8217;re stuck in a troubled economy that was designed to make them fail and from which they cannot hope to escape, at least not by themselves.</p></div>","title":"The 'digital nomad' is the modern hobo – WEG Pub – Medium"}},"pageContext":{"id":"5b937b3787be056953db7d3a"}}