{"data":{"mongodbDatabaseArticles":{"id":"5b95eae987be05832748ffe1","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/pretentioustraveler.jpg\" alt=\"a pretentious traveler\"><br> Nothing irks me more than people disparaging people&#8217;s travel choices. I don&#8217;t get why people do it. The whole &#8220;traveler vs. tourist&#8221; argument, talking about what makes someone a &#8220;real traveler,&#8221; and making fun of people&#8217;s routes&#160;&#8212;&#160;people waste so much energy trying to lift themselves up above others. Isn&#8217;t travel supposed to make you open-minded?</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/i-do-this-for-me/\">I do this for me.</a> This is all my journey. I&#8217;m not in a race for the most countries visited, street stalls eaten at, or festivals attended. I do what makes me happy, <a href=\"https://www.nomadicmatt.com/travel-blogs/overrated-and-cheesy-tourist-activities/\">even if it&#8217;s some &#8220;touristy&#8221; destination</a>.</p><p>There isn&#8217;t a single &#8220;authentic&#8221; version of travel. Getting off the beaten path, finding some hidden island, or living with some guy in a yurt in Mongolia don&#8217;t make someone a better traveler than anyone else. It just means your itinerary and experience were different.</p><p>I&#8217;ve been riled up about this for quite some time and decided to make a video about this subject. Here&#8217;s how I really feel and what I think you should do when you meet a pretentious, judgmental traveler (also notice the new introduction! Spiffy, huh?):</p><p><br> (Want more travel videos? <a href=\"http://www.youtube.com/nomadicmatt\">Subscribe to my YouTube channel&#160;here and get free videos!</a>)</p><p>So go where you want. Do what you want. <a href=\"https://www.nomadicmatt.com/travel-blogs/there-is-no-such-thing-as-must-see/\">See what you want</a>. Eat where you want. Maybe I&#8217;ll disagree, maybe I&#8217;ll try to get you to do something else, but, as Sheryl Crow said, if it makes you happy, it can&#8217;t be that bad &#8212;&#160;and at the end of the day, I&#8217;m just happy you left the house. That&#8217;s all I care about.</p><p>The next time someone starts harping on your travel choices or giving you grief, turn the conversation around on them. Tell them part of being a traveler is being open-minded and if they can&#8217;t respect your choice, the conversation is over. Call them out on their crap.</p><p>And then walk away.</p><p>It&#8217;s your trip. Don&#8217;t let people ruin it.</p></div>","title":"Why Pretentious Travelers Suck (And What I Do About Them)"}},"pageContext":{"id":"5b95eae987be05832748ffe1"}}