{"data":{"mongodbDatabaseArticles":{"id":"5b9248ad87be056953db7bd5","content":"<div><p>It was late November. I had flown out of <a href=\"/bootstrapping-startup-thailand/\">Bangkok</a> into <a href=\"/why-i-want-to-live-in-singapore/\">Singapore</a> to pickup my new pre-ordered iPhone 5S. Four weeks of Singapore and without any iPhone (cancelled due to Chinese demand), I wanted to get back to Thailand. Meanwhile though, Bangkok had become a total shitstorm. It suddenly saw itself in the midst of a <a href=\"http://www.theguardian.com/world/2013/nov/29/thai-protesters-bangkok-army-compound\">government coupe</a> that could at some point turn into a civil war. Apart from being potentially dangerous, it'd be no place to work with all the protests going on. With all options off the table, I decided to fly to Hong Kong and retreat into safety.</p> <h2>Magic at the YesInn</h2> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/2013-05-12150648_zps5495fd751.jpg\"><br> For the first two weeks I shared a 9-people dorm at the <a></a><p>For the first two weeks I shared a 9-people dorm at the <a href=\"http://www.yesinn.com/cwb/e_yesinncwb_aboutus.htm\">YesInn in Causeway Bay</a> , I normally don't sleep in dorms, and was very reluctant to do so, but since the cheapest clean private room in Hong Kong I could find was HKD 500 or EUR 50, I had no choice. The dorm cost me about HKD 250 or EUR 25. That gets you about 5 private rooms in Chiang Mai.</p><p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/hk2.jpg\"> <p>To be fair, I didn't really sleep. There was too much going on in the 9-people dorm but it was hard to be annoyed about it. Everyone I met in this place was just too sympathetic, friendly and interesting to be annoyed about when they would enter the dorm and put the lights on at 4AM at night and start partying. The first week I was in a room with 3 Indians from Bangalore. Now India isn't my favorite country for a lot of reasons and to say I had some prejudice about Indians would be an understatement. It's not politically correct to say, but a lot of people have. It's such a completely different country and culture than any other in the world, that there's bound to be a cultural clash.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-e1390532829290-1024x768.jpg\"> <p>But these guys were fun, they were 16 to 24 year old upper-class rich Indians here to party. The first night they told me about how 6000 years ago the Indians had already developed an airplane called \"the Vimana Flying Machine\", and how Adolf Hilter had visited India to get the blueprints for it to build the V2 rockets that in the end would put America on the moon. All I could say to that was, \"allllrightt\". With the Indians, every night became crazier than the last one. When they were calling a Chinese prostitute but couldn't speak Chinese, they asked the Japanese guy in the room to be there translator (he spoke some Chinese). Imagine the situation of having a 16-year old kid telling a Japanese guy where to meet with a Chinese prostitute. When he then suggested he'd take her into the dorm, I told them they just reached my limit. I'm a fun guy but there's not gonna be no prostitutes in my dorm room.</p> <p>But again it was hard to get angry about it. These boys were just having fun.</p> <p>When I tried to get some work done in the lobby, it was just as impossible as trying to sleep in the dorm. Everyone would ask me who I was, what I was doing here and we'd have endless discussions until in the middle of the night.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/hkhostel.jpg\"> <p>It must have been the Christmas spirit, since after a week, we already had a close-knit group of 10 people composed of Japanese, Koreans, Chinese, French, Italians to hang around with. It felt really really cool and only something I can remember being in elementary school. Everyone was sweet and cool and interested in each other and the group was full of distinct characters.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/1497714_1404839669759265_111373370_n.jpg\"><br> Xi and Yoshi <p>Xi and Yoshi</p><p>There was Yoshi, the Japanese fashion stylist who would travel around to buy up vintage clothes and sell them back in Osaka. There was Reinald, the French architect who had just come from the Philippines, where he slept in the slums and had \"the best time of his life\". There was Stefano, the friendly Italian with an always runny nose and thick accent.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"1460215_1399131080330124_2071498764_n\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/1460215_1399131080330124_2071498764_n.jpg\" alt=\"1460215_1399131080330124_2071498764_n\"> <p>There was Xi, the photo model from Beijing. For just a few days, Xi and I fell in love with each other until I found out she had a husband and a child back in Beijing. Haha, wow! Nothing even happened but that short moment though felt like x-mas-love-magic. It could only be more romantic, if she said goodbye in chalk:</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/1511233_1404965379746694_1026123836_n.jpg\"> <p>I've stayed in so many hostels in my life, but this hostel had that magic spark about it and it's one of those moments that's so weird and cool, you want to just stay in there forever.</p> <h2>Working remotely from Hong Kong</h2> <p>Giving up on working from the hostels, I'd tried to find some places outside. I quickly discovered that remote working \"on the cheap\" was simply impossible here. The co-working spaces here were <a href=\"http://www.sharedesk.net/spaces/view/2595/office8/\">around HKD 300 or EUR 30 per day</a>. That would amount to EUR 900/m which is simply not sustainable for me and would get you an entire office in any other city. So, less ideally, I simply worked from Starbucks shops. Luckily, they are literally everywhere in Hong Kong and relatively cheap. A Starbucks tea is HKD 25 or EUR 2.50, which is a good price to be able to get some work done and with two drinks amounts to HKD 50 or EUR 5 for a day of work. That's alright. There's not really a lot of other coffee shops than Starbucks though. So Starbucks it was.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-4-1024x768.jpg\"><br> An improvised street-side shrine <h2>Hong Kong's internet can be crazy fast, if you manage to get it</h2> <p>An improvised street-side shrine</p><p>So how was the internet? Well, it's hard to come by useful WiFi in Hong Kong. Like most Asian cities, there's loads of WiFi networks around but they're exclusive to mobile carrier subscribers. The WiFi at coffee shops is non-existent or useless. For example, the WiFi at Starbucks is limited to 20 (!) minutes. Who is ever going to get anything finished in 20 minutes. It's a joke. There's a way out though. Get yourself a pre-paid sim by One2Free (run by carrier CSL, available at the 1010 shop in the Departure hall of the airport) and you've got yourself a blazing fast connection that can pass broadband speeds. If you tether that mobile connection to your laptop, it means you have wireless broadband internet on your laptop anywhere in Hong Kong. YOu can literally download and upload at 1 megabyte per second. That's awesome. It's even faster than Thailand's brilliant TRUE 3G. Here's the speeds:</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"50%\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/3211087225.png\" width=\"50%\"> <p>In my hotel in TST (the <a href=\"http://www.starguesthouse.com.hk/\">Lee Guarden Guest House</a>), the internet was literally the fastest I've ever had in my life. I managed to upload a 1GB video file to YouTube in 4 minutes (multiple times), that's 4 megabytes per second! So potentially, I think HK has the fastest internet in Asia.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/IMG_0075-e1389579237608-768x1024.jpg\"> <h2>Hong Kong is expensive</h2> <p>Hong Kong is relatively pricey and I'd say on par with most big metropolitan cities like New York and London. Hostel and hotel prices and housing rent prices are ridiculously high. Hong Kong has serious issues with <a href=\"http://web.archive.org/web/20140216024931/http:/www.alsosprachanalyst.com:80/politics-society/the-future-of-hong-kong-real-estate-tycoons-and-monopoly.html\">real estate being owned by just a few</a> which pushes prices up. And that makes every room in Hong Kong just really really small. From hotels to condos, it's all tiny and cramped.</p> <p>However, apart from rent, prices were alright. A normal dinner will set you back HKD 60 or EUR 6. It must be the British influence because portion sizes were about double of normal Asian standards. Where in Thailand the same portion would cost you THB 100 or EUR 2.50. So HK is about double. So food is relatively cheap! Getting around the city with the MTR was also do-able with most trips costing HKD 5 or EUR 0.50. Taxis started at 20 HKD or EUR 2. Which was also perfectly fine.</p> <h2>Hong Kong's food is...Chinese</h2> <p>I have to be honest here. Chinese food is just not my favorite. Like Vietnamese, a lot of it is noodles, noodles, noodles. Although you have other options like Dim Sum, the (cheap) staple food is noodles. Luckily though, there's a lot of other options. You won't find them on the main streets though. The thing is that rent prices are too expensive, so you'll only see clothing shops in the main streets. Walk into any side alley of the main street and you'll discover the hidden secret restaurants of Hong Kong. There's Korean, Thai, Japanese and any other Asian food you crave for.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-6-e1390535771424-1024x768.jpg\"><br> Wai and me at the Korean barbeque in Koreatown, HK <h2>Pay now!</h2> <p>Wai and me at the Korean barbeque in Koreatown, HK</p><p>Then there was one big thing every traveler I met was annoyed by. The Hongkongnese want you to pay IMMEDIATELY for everything. You order food, you get the food and the bill, and before even having had one bite, you're expected to pay for it. I'd extend my hotel every morning with one day and every single day I'd get a note under my door that they insisted on me paying the cost of the night immediately. There's no space for keeping a tab here. To most people, it comes across as extremely rude. Although I know it's just a cultural thing. Actually I think it's a Chinese thing as I saw the same happening a few times in Singapore with a waiter shouting at someone PAY NOW PAY NOW!</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/hong-kong-by-levelsio-2.gif\"> <h2>Y PPL WALK SO SLOW?</h2> <p>The center of Hong Kong is crowded like crazy. The sidewalks are unusable as they're so filled with people and most of the times I'd simply take the road to skip the crowds and get to my destination. Then there's the serious issue that Hongkongnese have a tendency to walk at speeds of baby turtles. This was confirmed to me by Hongkongnese too. They walk so slow that multiple times, I was doing a slow-motion walk impression behind them. WHY? I DON'T KNOW, IT'S CULTURE!</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-5-1024x768.jpg\"> <h2>Bacteria, runny noses and air pollution</h2> <p>Since the city of Hong Kong is so densely populated, it's easy to spread bacteria around and all of us (me and my friends) catched a cold at some point. It's unavoidable. You'll see everyone around you either coughing or with a runny nose. It took about two days going from Singapore's hot climate to Hong Kong's freezing one (during December) to get me ill. Except for mild food poisoning in Singapore, I hadn't actually been ill from bacteria/viruses yet. After a few days, I learnt that I wasn't necessarily ill from the germs though:</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/IMG_10761.png\"> <p>I was having a constant runny nose from the pollution. Air pollution can be <a href=\"http://aqicn.org/city/hongkong/\">crazy unhealthy on Hong Kong island</a>. That's mostly because of mainland China's factories blowing their fumes over the city though. I couldn't get rid of my runny nose and nasty cough until I finally flew out of Hong Kong. That's shit, because I'd love to live here, but I wouldn't be able to like this.</p> <h2>Hong Kong's underground scenes</h2> <p>I was walking around my hostel and by sheer randomness, I met a girl on the street named Olivier. She was putting up flyers for a club night, or so I thought. After asking what it was in turned out to be a metal night. We met up later and she introduced me into the underground metal scene of Hong Kong which was super cool.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/IMG_0190-1024x576.png\"><br> Olivier interviewing metal bands <p>Olivier interviewing metal bands</p><p>I met a lot of people that were famous in metal both Hong Kong and mainland China. And heard about the metal bands of their friends that were actually still fighting against the Chinese government and for multiple times were actually banned by the government. That's what metal is about and something you don't hear in the West anymore.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-1-1024x768.jpg\"><br> Hong Kong's metal kids <p>Hong Kong's metal kids</p><p>Metal was supposed to be about \"fuck the system\", and it's not been that in the West for ages, well, don't worry, it's doing just that in the East.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-2-e1390533917522-1024x768.jpg\"><br> More of Hong Kong's metal kids and me :) <p>More of Hong Kong's metal kids and me :)</p><p>I finished this crazy night by dancing the traditional Waltz on traditional Chinese music. What better way to symbolize Hong Kong? Oh this is getting quite cheesy, right?</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/photo-1024x576.png\"> <p>Hong Kong has more than just metal though as my friend Wai told me about the Drum &amp; Bass and Dub scene here which is also healthy here. Obviously, the UK's electronic music sound is big here too due to the colonial British connection.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/01/hong-kong-by-levelsio-31.gif\"> <h2>The Hongkongnese vs. the mainland Chinese</h2> <p>Under Hong Kong's skin, there's an incredible amount of tension built up. See, the Hongkongnese are ethnically Chinese but they don't feel connected to China at all. With the handover in 1997 (now already 16 years ago), the Chinese government has been slowly taking over power in the city-state. That's resulted in a city that, according to the people in Hong Kong, is now governed by a puppet government run from Beijing. This puppet government is trying to assimilate Hong Kong into China and change its laws to align with mainland China.</p> <p>It's not just politics though. There's now also an influx of mainland Chinese moving into Hong Kong. For most Hongkongnese, it feels like they are being overrun by people that may look like them, but on the inside are completely different. Most of the people in Hong Kong feel culturally more sophisticated than them and I can see why. The mainland Chinese are often very rural people that only recently flocked to the cities while Hongkongnese have been living in the city for over a century. The difference is obvious.</p> <p>This is not the first time I've heard this though. The native Singaporese complain all the time about getting overrun by mainland Chinese these days. Although, Singapore has the advantage China doesn't actually have governing power over them, like with Hong Kong.</p> <p>Just now, new tensions sprung up in the form of <a href=\"http://www.usnews.com/opinion/blogs/world-report/2014/01/02/protests-signal-rising-tensions-between-hong-kong-and-mainland-china\" class=\"broken_link\">protests against mainland Chinese's</a> rule over Hong Kong. Which is funny, since I just fled Bangkok from the protests.</p> <p>It's an interesting dilemma though, you can't really stop the juggernaut that is China from taking over Hong Kong. And it's their legal right to do so as well. For the Hongkongnese it means though that it's the slow end of their culture. They can't ever win this match. They can only hope China becomes more free before they are sucked completely into it.</p> <p>It's an interesting thing though, if you look from a distance, you'd just call everybody Chinese. But there's extreme nuanced differences and tensions you discover when you zoom into areas. Am I being captain obvious? For sure!</p> <h2>Conclusion</h2> <p>Hong Kong is bustling and crowded, creative and grimey, vibrant and mental and so big you can lose yourself in parts of the city for days or weeks. It's got a level of sophistication in its culture of music and arts, which is unlike anywhere in Asia. It's got underground scenes of any music style you think of. The old cliche that it's a mix of East and West simply is true. It carries the sophisticated underground subcultures of the West, filled up with the traditional cultures of the East. And that makes Hong Kong a very very special place.</p> <p>For me, Hong Kong is the New York of the East.</p> <p><a href=\"/nye-2014-hong-kong/\">On the tail end of my trip, we ended up celebrating New Year's Eve in Hong Kong, which was a blast... &#187;</a></p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I ended up in Hong Kong (or my adventures in the New York of the East)"}},"pageContext":{"id":"5b9248ad87be056953db7bd5"}}