{"data":{"mongodbDatabaseArticles":{"id":"5b95ee4787be0583274900d3","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Five Things to Get Used to in Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/07/Things-to-get-used-to-in-Thailand.jpg?ssl=1\"><img class=\"aligncenter size-full wp-image-6335\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/07/Things-to-get-used-to-in-Thailand.jpg?resize=563%2C615&amp;ssl=1\" alt=\"things to get used to\" width=\"563\" height=\"615\"></a></p>\n<p>Whether they are due to environmental, economical, or transportation factors, we just have to laugh! &#160;Here are some things to get used to shortly after moving from Tieland to Thailand.</p>\n<p><strong></strong></p>\n<h2><p id=\"Five_Things_To_Get_Used_to_in_Thailand\"><p>Five Things To Get Used to in Thailand</p></p></h2>\n<p>&#160;</p>\n<h3><p id=\"01_Don8217t_Bother_Styling_Your_Hair\"><p>01 &#160;</p>Don&#8217;t Bother Styling Your Hair</p></h3>\n<p>Guys and gals, this applies to everyone. Don&#8217;t spend too much time on doing your hair for the day &#8211; gelled, pomaded, braided, bunned, whatever &#8211; because it&#8217;s going to get messed up after putting on a helmet. And because I&#8217;m a safety freak and won&#8217;t go anywhere without a helmet, I have resorted to only a handful of hairstyles, mostly ones that take all of five seconds to do, or at the very least, can be easily touch up after pulling my helmet off. Pinterest, love of my life, your cute hair style ideas are of no use to me now. &#160;Chris broke down and just started shaving his head to make things easier&#8230;and cooler.</p>\n<h3><p id=\"02_The_Soles_of_Your_Feet_Will_Always_Be_Dirty\"><p>02 &#160;</p>The Soles of Your Feet Will Always Be Dirty</p></h3>\n<p><b></b>Invest in a pair of house slippers! Between the lack of carpets and rugs &#8220;catching&#8221; dirt, walking barefoot in the house (wearing socks is too hot), dust particles settling in from the open windows (especially during the smoky season), and having residual dirt from walking around outside (unless you wear full-coverage shoes), our feet are always dirty. Our short-term solution is to keep a washrag nearby, but we still need those&#160;pair of house slippers!</p>\n<h3><p id=\"03_Good_Luck_Getting_That_Large_Object_Home_on_Your_Motorbike\"><p>03 &#160;</p>Good Luck Getting That Large Object Home on Your Motorbike!</p></h3>\n<p>So far we&#8217;ve been able to handle several larger shopping sprees to the local Tesco (aka, Super Wal-Mart) thanks to the large under-the-seat storage area in our motorbike. However, as the passenger, I have to hold on to purchases that don&#8217;t fit. I am proud to say that I&#8217;ve ridden on the back of our bike while carrying a mop and a broom during one trip, a dish drying rack during another trip, and my biggest accomplishment has been holding onto a 17 gallon trashcan. On the freeway. Yes, you just saw a little white girl riding&#160;Thai style.</p>\n<h3><p id=\"04_The_Mosquitoes_Will_Find_You\"><p>04 &#160;</p>The Mosquitoes <i>Will Find You</i></p></h3>\n<p>Our dreams of having a BBQ and sitting outside during the evenings were kind of shot when we realized that mosquitoes are everywhere. After moving out of our 6th floor studio apartment at <a href=\"https://www.tielandtothailand.com/apartment-at-ban-jed-yod/\">Ban Jed Yod</a> (where the mosquitoes didn&#8217;t find us), we have&#160;the opposite experience at our ground level townhouse, both outside <i>and</i> inside. As a result, we have a freshly stocked arsenal of bug spray, those little smelling candles/spiral bug repellent things, and a zapper bat!</p>\n<h3><p id=\"05_Western_Food_is_Expensive\"><p>05 &#160;</p>Western Food is Expensive</p></h3>\n<p>There is a big price difference in Western food compared to Thai food. Although American food is inexpensive compared to back home (say, $5 for a cheeseburger, side of fries, and a drink at a sit down restaurant), a $1 plate of Thai street food fits the budget much more nicely! We find ourselves most often getting dinner from Thai street food vendors and spending only $4 (120 baht) total for dinner, where as before we spent closer to $15 (500 baht). Now that we&#8217;ve settled in, we treat ourselves to western food only every once in a while. Hey, freshly stir-fried chicken and veggies is healthier than a pizza anyways!</p>\n<p>If you plan on moving out of your home country to a place completely new there will definitely be things to get used to. &#160;Most likely the things you thought would be hard to deal with won&#8217;t be, and the things you never thought about will sneak up to get you. &#160;It reality, it&#8217;s all part of the adventure, so we just take it all in stride and adjust.</p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Five Things to Get Used to in Thailand"}},"pageContext":{"id":"5b95ee4787be0583274900d3"}}