{"data":{"mongodbDatabaseArticles":{"id":"5b93833087be056953db7e37","content":"<div><h3 name=\"e3f0\" id=\"e3f0\" class=\"graf graf--h3 graf--leading\">Working asynchronously</h3><p name=\"6fcb\" id=\"6fcb\" class=\"graf graf--p graf-after--h3\">Our team is mainly based on the East Coast, with some of us in the UK and others in San Francisco. Because of timezones, our days are significantly staggered. I start around 9.30am in London while Roberta, in Toronto, will come online about 1pm my time. When Kathy in San Francisco wakes up, we only have about two hours together for us to discuss issues, projects, milestones and blockers before it&#8217;s the end of my day and we lose quorum.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*McO25Ayf4vaDjd-QzbSWKQ.jpeg\"><p name=\"5edc\" id=\"5edc\" class=\"graf graf--p graf-after--figure\">This means we have to optimize our precious two hours together and make the most of them every day. It also means that we need to be able to work without depending on each other being available to answer our bugging questions.</p><h4 name=\"a18d\" id=\"a18d\" class=\"graf graf--h4 graf-after--p\">Predictable meetings</h4><p name=\"0603\" id=\"0603\" class=\"graf graf--p graf-after--h4\">Predictable meetings help so much with making the most of our time. We have lots of 1:1s, daily project and team stand-ups at scheduled times every week. This means we know when we&#8217;re likely to be distracted or otherwise engaged and we can plan around it.<br>&#160;<br>Taking my calendar as an example, you can see how meetings are bundled around the 4&#8211;6pm span and don&#8217;t really stray from that.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*UsgsfS8efFZgu_7-MJALXQ.png\"><h4 name=\"ebc4\" id=\"ebc4\" class=\"graf graf--h4 graf-after--figure\">Chat &gt;&#160;meetings</h4><p name=\"1a4e\" id=\"1a4e\" class=\"graf graf--p graf-after--h4\">We try and avoid meetings where chat would suffice. In an office, it&#8217;s easier to go ahead and tap someone on the shoulder than tap out a series of messages on Slack but working remotely the opposite is true. Using this model we only spend time in meetings we really need to be in.</p><p name=\"3e60\" id=\"3e60\" class=\"graf graf--p graf-after--p\">At times, however, discussions warrant the increased conversational bandwidth of a video call. We try to remain cognizant of when this is the best path forward.</p><h4 name=\"a51d\" id=\"a51d\" class=\"graf graf--h4 graf-after--p\">Respecting each other&#8217;s&#160;time</h4><p name=\"fedd\" id=\"fedd\" class=\"graf graf--p graf-after--h4 graf--trailing\">Everyone has to be mindful about the timezones we&#8217;re all in and the working hours we like to keep. We use Google Calendar internally which has settings that let you define your working hours and gives a stern notice to anyone trying to invite you to a midnight standup.</p></div>","title":"Making remote work – Salesforce UX – Medium"}},"pageContext":{"id":"5b93833087be056953db7e37"}}