{"data":{"mongodbDatabaseArticles":{"id":"5b962a0687be0583274911c9","content":"<div><p>Whether or not to get a filtered water bottle for India travel is something I am asked about at least once a week &#8211; and it&#8217;s asked in my <a href=\"https://www.facebook.com/groups/Indiatraveltips/\">India travel tips Facebook group</a> often. I thought I&#8217;d go ahead and address it in a blog post so all the information is here in one place for you! I lived and traveled in India since 2012 and I never used a filtered water bottle.</p><p>When traveling, I would buy bottled water (20 INR around $1) or if I was in a nice tourist-friendly restaurant, I would drink filtered water (served free). While bottled water is the safest choice, many people either 1. don&#8217;t trust it or 2. want to do something more environmentally friendly, especially in India where there is a trash problem.</p><p><img class=\"alignnone size-full wp-image-27378\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/08/Goa-India-Hippie-in-Heels-41.jpg?resize=683%2C1024&amp;ssl=1\" alt=\"\" width=\"683\" height=\"1024\"></p><p><img class=\"alignnone size-full wp-image-27721\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/06/Goa-Hippie-in-Heels-Mapusa-66.jpg?resize=683%2C1024&amp;ssl=1\" alt=\"Where to Next? My Upcoming Travel Plans for Summer/Fall '18\" width=\"683\" height=\"1024\"></p><p><img class=\"alignnone size-full wp-image-27719\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/06/Goa-Hippie-in-Heels-Mapusa-6.jpg?resize=1024%2C683&amp;ssl=1\" alt=\"Where to Next? My Upcoming Travel Plans for Summer/Fall '18\" width=\"1024\" height=\"683\"></p><h3>FAQ about water in India:</h3><ol><li>Can you drink the tap water? No, never.</li><li>Do locals drink tap water? Some do, yes. I would say the majority of the population does not have access to filtered or bottled water.</li><li>Do people get sick from the water? Yes, I know multiple people who have had typhoid in India. A reader messaged me that she got dysentery due to drinking &#8220;filtered&#8221; water in India. Many people I know get giardia from the water and get extemely sick for months.</li><li>Can you drink bottled water? Yes, you can safely drink bottled water. People say to check that the lid is truly sealed when you buy it, but don&#8217;t stress, in six years, I&#8217;ve never had an issue with &#8220;scam&#8221; bottled water.</li><li>Can you drink the filtered water restaurants offer? I do. The only time I wouldn&#8217;t is at a roadside &#8220;dhabba&#8221; or basically, a place that doesn&#8217;t look clean, is very rural, or is not used to tourists. Although filters are used in places that serve filtered water to Western tourists or Indian tourists, you don&#8217;t know that the filter has been serviced and is working properly. If you&#8217;re nervous, bottled is, of course, your safest option.</li><li>Do they recycle empty plastic bottles if I use them? Some places do, in fact, even some slums have big recycling centers but it&#8217;s likely they just end up piled up in a landfill or burnt on the side of the road.</li><li>What are the best brands of bottled water? I drink them all. Bisleri, Kinley, Aquafina, Himalaya, Baileys, and more are brands you&#8217;ll encounter.</li><li>Is bottled water expensive? No. It is around 30 cents (USD). for a big 1 liter bottle. If you are somewhere for a while, you can buy a 5-liter jug for just over $1.</li><li>My Indian friends drink the filtered&#160;water in all the small restaurants we go to and say I should too, should I? No. While they cannot become immune to diseases like typhoid, locals can build up a tolerance to bacteria that can make you very sick. So, even if they tell you they drink the water at this place for years and never get sick &#8211; the same rules do not apply to you.</li><li>Can I have food that has ice in it? If you are at a nice place or one that caters toward western tourists, the ice will be filtered water. Street food will not use filtered water: that goes for lassi, pani puri, and literally anything else with water in it. If you&#8217;re unsure you can always ask if it&#8217;s filtered water.</li><li>Can I brush my teeth with the tap water? I do. Some don&#8217;t. Definitely just up to you!</li><li>Can I drink from a stream in the mountains? No. Just don&#8217;t drink natural water from the source in India. As one reader told me, she did this and when she had a throat infection later, learned there was a power plant upstream.</li></ol><p><img class=\"alignnone size-full wp-image-27583\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/05/Moving-from-Goa-5.jpg?resize=768%2C1024&amp;ssl=1\" alt=\"leaving india\" width=\"768\" height=\"1024\"></p><p>Read more: For tips on eating street food and healthy food in India, <a href=\"https://hippie-inheels.com/tips-on-eating-street-food-in-india-not-sick/\">check out this article</a> which will help keep you from getting <a href=\"https://hippie-inheels.com/ask-me-anything-how-do-you-avoid-delhi-belly/\">Delhi belly in India</a>! <a href=\"https://hippie-inheels.com/how-in-shape-do-you-need-to-be-to-travel-india/\">This article</a> will talk about how in shape you need to be to travel to India.</p><p><img class=\"alignnone size-full wp-image-27722\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/06/Goa-Hippie-in-Heels-Mapusa-65.jpg?resize=683%2C1024&amp;ssl=1\" alt=\"Where to Next? My Upcoming Travel Plans for Summer/Fall '18\" width=\"683\" height=\"1024\"></p><p><img class=\"alignnone size-full wp-image-27722\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/06/Goa-Hippie-in-Heels-Mapusa-65.jpg?resize=683%2C1024&amp;ssl=1\" alt=\"Where to Next? My Upcoming Travel Plans for Summer/Fall '18\" width=\"683\" height=\"1024\"></p><h1>Options for a filtered water bottle for India travel</h1><p>If you would rather bring a filtered water bottle, usually the biggest concern is if the bottle will clean the water enough to make sure you won&#8217;t get sick. It&#8217;s important to bring a good quality bottle is this is the route you decide to take. Filtered bottles do NOT clean water completely in most cases. The water could have heavy metals in it (lead, arsenic, cadmium, mercury, fluoride, nitrate, iron, insecticides and surfactants) which is also sometimes found in bottled water or viruses. Most are known for cleaning out the bacteria down to 1 or 2%. Bottled water in India is often kept at hot temperatures in the sun which could cause it&#8217;s own problems.</p><p>There are four brands that readers of Hippie in Heels swear by and they are mentioned over and over in my Facebook group when new members ask. More try it, and then tell about their experiences. It seems like any of these would be a good choice based on reader reviews. I&#8217;ll put the basics about them and prices so you can compare.</p><h2>Sawyer</h2><ul class=\"a-unordered-list a-vertical a-spacing-none\"><li><p class=\"a-list-item\">34-ounce BPA free water bottle with 0.1 Micron absolute hollow fiber membrane inline filter</p></li><li><p class=\"a-list-item\">Removes 99.99999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9999% of all protozoa, such as giardia and cryptosporidium</p></li><li><p class=\"a-list-item\">Designed to have a high flow rate for easy access to fresh, clean water; easily field maintainable</p></li></ul><blockquote><p>&#8220;I&#8217;ve spent two years as a Peace Corps Volunteer in Uganda, East Africa. We were issued Sawyer&#160;filters&#160;and they work fantastically! I&#8217;m planning to travel India with my mini-Sawyer.&#8221; -Sage Morgan</p></blockquote><h2>SteriPEN</h2><ul class=\"a-unordered-list a-vertical a-spacing-none\"><li><p class=\"a-list-item\">UV light destroys germs&#8217; ability to reproduce and make you sick; The SteriPEN destroys over 99.9% of bacteria, viruses, and protozoa</p></li><li><p class=\"a-list-item\">Battery Life: Up to 50 treatments per charge and 300 charge discharge cycles; This is equivalent to 15,000 liters</p></li><li><p class=\"a-list-item\">Simple OLED display shows everything you need to know &#8211; treatment, lamp, and battery status; USB rechargeable from a computer, wall, or solar panel</p></li><li><p class=\"a-list-item\">Water Quality Association: SteriPEN tested and certified by WQA against US EPA Microbiological Water Purifier Standard</p></li></ul><blockquote><p>&#8220;I have this and it&#8217;s amazing! Purifies 1L of&#160;waterin 90 seconds and it&#8217;s USB. Yay for saving the planet! I&#8217;ve been using it for 5.5 months around India and Asia and it hasn&#8217;t failed me yet! Yes, some filters only rid bacteria and not viruses, but there are exceptions and the Steripen is a great example of one of them!&#8221;&#160; -Courtney Gonsky</p></blockquote><h2>LifeStraw</h2><ul class=\"a-unordered-list a-vertical a-spacing-none\"><li><p class=\"a-list-item\">Award-winning LifeStraw hollow fiber membrane water filter removes bacteria and protozoa from lakes, streams to ensure safe, clean drinking water</p></li><li><p class=\"a-list-item\">2-stage activated carbon filter reduces odor, chlorine and leaves zero aftertaste</p></li><li><p class=\"a-list-item\">Removes 99.9999% of waterborne bacteria, and 99.9% of waterborne protozoan parasites without chemicals, iodine or batteries</p></li><li><p class=\"a-list-item\">Durable, 23-ounce, leak-proof bottle made of BPA-free Tritan and features a food-grade silicone mouthpiece; replacement filters available separately</p></li></ul><blockquote><p>&#8220;I purchased a Lifestraw water bottle and have actually tested it in a mucky puddle and I was surprised at how fresh the water tasted. I&#8217;m off to India in few days and this for me is a must&#8221; &#8211; Julia Webber</p></blockquote><h2>Water To Go</h2><ul class=\"a-unordered-list a-vertical a-spacing-none\"><li class=\"showHiddenFeatureBullets\"><p class=\"a-list-item\">Unique Water-to-Go filter technology eliminates over 99.9% of all Bacteria, Viruses, Chlorine, Fluoride and Heavy Metals such as Lead to give you safe, healthy, clean drinking water</p></li><li class=\"showHiddenFeatureBullets\"><p class=\"a-list-item\">50cl capacity and weighs 98g (with filter in)</p></li><li class=\"showHiddenFeatureBullets\"><p class=\"a-list-item\">BPAFree Ergonomically designed with Textured grip area</p></li><li class=\"showHiddenFeatureBullets\"><p class=\"a-list-item\">Timer indicating when to change your filter which is effective for 130 Litres which is roughly 3 full bottles per day for 2 months.</p></li></ul><blockquote><p>&#8220;We have bottles from&#160;water&#160;to go. You can put any&#160;water&#160;in them and the&#160;filters&#160;remove everything.&#8221; -Wendy McLean</p></blockquote><p>Probiotics and <a class=\"easyazon-link\" href=\"https://www.amazon.com/Natures-Way-Activated-Charcoal-Packaging/dp/B0006LCQ4Q?tag=Hipinhee-20\" rel=\"nofollow\" target=\"_blank\">activated charcoal tablets</a> are other things many people swear by. I personally have not tried them. You can buy them cheap on Amazon if it&#8217;s something you&#8217;re interested in.</p><h3>PIN these tips on if you need a filtered water bottle for India travel:</h3><p><img class=\"alignnone size-full wp-image-27876\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/07/FITLERED-WATER-BOTTLE-INDIA.jpg?resize=735%2C1102&amp;ssl=1\" alt=\"Do You Need a Filtered Water Bottle For India Travel?\" width=\"735\" height=\"1102\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Do You Need a Filtered Water Bottle For India Travel?"}},"pageContext":{"id":"5b962a0687be0583274911c9"}}