{"data":{"mongodbDatabaseArticles":{"id":"5b96296e87be05832749118e","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What I was up to other than here:</h2><ul><li>Ok, so I haven&#8217;t actually worked in a while because I had my friend Britani in town&#8230; but I did see that Hippie in Heels was mentioned in a blog post about <a href=\"http://blog.theholidaze.com/2014/12/best-new-travel-blogs-november/\" target=\"_blank\">best blogs of November</a> by the Holidaze.</li></ul><h1>Now your story,</h1><p>You know how some people&#8217;s guilty pleasures are the Kardashians? I think it&#8217;s because secretly we love watching other people&#8217;s drama and thank god we&#8217;re not involved.</p><p>Well, one of my guilty pleasures (other than the Kardashians) is watching Indian people fight.</p><p>Is that weird? Probably. Hindi is an aggressive language in my opinion. People here talk loud and sometimes you think you&#8217;re being yelled at when you are not- especially on the phone!</p><p>I have a recycled SIM so people call and have the wrong number pretty often and I&#8217;ll say, &#8220;you have the wrong number&#8221;. Then they go crazy yelling in Hindi and it&#8217;s so funny because I know they aren&#8217;t yelling. They&#8217;re probably just asking, what are you talking about, where is Rajesh? Why are you answering Rajesh&#8217;s phone? Or whatever.</p><p>If they&#8217;re this loud in general, imagine when they are actually mad!</p><p>One time that there&#8217;s almost always a little fight is on planes that are delayed. Flight attendant&#8217;s vs. passengers, which leads to passenger against passenger.</p><p>Then there&#8217;s the fights between the two people who crashed on the road.. they each have 20 strangers fighting on their behalf while the police officer strokes his mustache and taps his bamboo stick wondering who he should smack with it.</p><p>Lately, listening to women at the market fight has been intriguing me and I want to know what it&#8217;s about so bad! I think it&#8217;s stealing each other&#8217;s customers&#8230; This is why I want to learn Hindi (at least one of the reasons)! But I suppose they are arguing in Konkani anyways.</p><p>I think watching fighting in India is like watching a Spanish soap opera when everyone starts joining in on the fight. I understand a few naughty words and laugh at the name-calling but can never quite figure out what&#8217;s making people so mad.</p><p>PLEASE take a second to watch part of this!! It&#8217;s so funny. Start at&#160;3 minutes&#8230; omgsh love it. &#8220;How dare you say I take money!!&#8221;</p><p class=\"video-shortcode\"><p class=\"embed-youtube\"></p></p><h1>This is India!</h1><p>feature image of fields from <a href=\"https://www.flickr.com/photos/spisharam/2359695612\" target=\"_blank\">flickr</a></p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on&#160;<a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>,&#160;<a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>,&#160;<a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a>&#160;&amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! 28"}},"pageContext":{"id":"5b96296e87be05832749118e"}}