{"data":{"mongodbDatabaseArticles":{"id":"5b96299787be05832749119a","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature the luxury side of an awesome city.&#160;Guest bloggers will&#160;share about either their hometown or a town they are expat in and know very deeply so that you get a guide straight from a local.&#160;&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Kiev</h1><p class=\"p1\"><b><i>Tell us a little about&#160; yourself and tell us why you&#8217;re an expert on luxury travel in Kyiv, Ukraine.</i></b></p><p class=\"p3\">I&#8217;m a video travel blogger focused on capturing the stories and personalities of people and places wherever I go. After spending six months in Kyiv I had the opportunity to experience luxury travel on every level, including a warm welcome as a foreigner. I fell in love with the city and am excited to share my discoveries with you!</p><p class=\"p1\"><b><i>What makes </i></b><b><i>Kyiv</i></b><b><i> a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p3\">Kyiv&#8217;s foreign reputation doesn&#8217;t scream luxury, so I was really surprised at how on trend the cafes, restaurants, bars, salons and activities were, and all really inexpensive, so you can do things you might not ordinarily be able to afford. It&#8217;s one of the oldest cities in Eastern Europe so there&#8217;s rich history to be discovered. To top it all, the people were some of the sweetest I&#8217;ve ever met.</p><p class=\"p3\"><img class=\"aligncenter size-full wp-image-18234\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Kyiv-3.jpg?resize=420%2C560&amp;ssl=1\" alt=\"luxury guide to kiev\" width=\"420\" height=\"560\"></p><p class=\"p1\"><b><i>What 5 star hotel is the best in Kiev?</i></b></p><p class=\"p3\">I stayed at a combination of Radisson Blu and Airbnb and felt pretty well taken care of, but the most glamorous hotels in Kyiv are considered to be: </p><p class=\"p3\"> Near major historical and cultural sights, with panoramic views from the terrace, a spa, gym and swimming pool.</p><p class=\"p3\"> Elegance, world-class facilities and amazing views over the river. Located in Podil, one of the most trendy areas.</p><p class=\"p3\"> This is one of the most sought after hotels in Kyiv, especially if you want to be near the main embassies and government agencies. If you are a fan of culture, the National Opera House is nearby.</p><p class=\"p1\"><b><i>What about boutique hotels in Kiev, of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p3\">I haven&#8217;t tried it yet, but <a href=\"http://tidd.ly/fac5f5c4\"><strong>Hotel Vozdvyzhensk</strong></a> has the perfect location next to my favourite street, Andrievsky Descent, in Podil. Rooms are said to be small but cute and comfortable.</p><p class=\"p3\"><img class=\"aligncenter size-full wp-image-18237\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Kyiv-16.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to kiev\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Are there any fun activities for the adventurous traveler in Kiev?</i></b></p><ul><li class=\"p3\"><p class=\"s1\">Kyiv &#8211; Pechersk Lavra &#8211; Caves Monastery </p></li></ul><p class=\"p3\"> This is a special monastery and church complex with underground tunnels that were unlike any I have seen before. Kyiv&#8217;s Orthodox churches are real gems, whether you are religious or not. Visiting the churches is also educational because it holds a lot of Kyiv&#8217;s history. </p><ul><li class=\"p3\"><p class=\"s1\">Mezhyhirya&#160;Park</p></li></ul><p class=\"p3\">This &#8220;Museum of Corruption&#8221; is the residence of Ukraine&#8217;s former President, displaying his luxurious lifestyle. After he abandoned the estate during the 2014 revolution, it opened to the public. It includes an automobile museum, a golf course, ostrich farm, dog kennel, numerous fountains, man made lakes, a helicopter pad and a small church.</p><p class=\"p1\"><b><i>Where are the best hangouts during the day in Kiev?</i></b></p><ul><li class=\"p3\"><p class=\"s1\">Druzi Caf&#233; </p></li></ul><p class=\"p3\"> This is a cozy place which you and your friends can stay at when in Kyiv. The ambiance is very homely and staff are super friendly. The atmosphere is quite relaxed if you want to take a breather from your day tours.</p><p class=\"p3\"><img class=\"aligncenter size-full wp-image-18236\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Kyiv-11.jpg?resize=560%2C560&amp;ssl=1\" alt=\"luxury guide to kiev\" width=\"560\" height=\"560\"></p><ul><li class=\"p3\"><p class=\"s1\">Mariyinsky&#160;Park</p></li></ul><p class=\"p3\">This 130-year old park in the Pechersk neighborhood is beautiful in summer or winter. </p><ul><li class=\"p3\"><p class=\"s1\">Hydropark</p></li></ul><p class=\"p3\">I am dying to come back to Kyiv in summer, and when I do, would like to try Hydropark. There is an outdoor gym, boat and kiddie rides. Plus you can enjoy the beach and get a tan. Many people come to relax and get a tan by the water.</p><p class=\"p1\"><b><i>If you have a big date night, what are the most delicious restaurants in Kyiv and what are their best dishes?</i></b></p><p class=\"p3\">&#160;There are different good restaurants in Kyiv as it could cater to whatever your taste pallet would desire. </p><ul><li class=\"p3\"><p class=\"s1\">Kanapa</p></li></ul><p class=\"p3\">If you want to taste high quality Ukrainian cuisine then I recommend visiting Kanapa. It has a sophisticated interior and all their ingredients are grown from their own farm. A must-try is their borsch served in a giant head of cabbage.</p><p class=\"p3\"><img class=\"aligncenter size-full wp-image-18235\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Kyiv-5.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to kiev\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Let&#8217;s talk desserts in Kiev- what place makes the best?</i></b></p><ul><li class=\"p3\"><p class=\"s1\">Honey</p></li></ul><p class=\"p3\">A nice little caf&#233; that offers a variety of desserts from simple treats to tasty macarons. Also keep your eyes open for markets &#8211; you&#8217;ll find all kinds of treats on offer.</p><p class=\"p1\"><b><i>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers in Kiev?</i></b></p><ul><li class=\"p3\"><p class=\"s1\">Atelier 1</p></li></ul><p class=\"p3\">Atelier 1 is one of the few concept-stores in Kiev. It&#8217;s located in heart of the city, just a few minutes away from the ancient market of Bessarabka. They offer different designer clothes and also has a perfume section. One attraction here is the place offers clothes made by local Ukrainian designers and provides them their own corner to showcase their designs.</p><ul><li class=\"p3\"><p class=\"s1\">Kachorovska Atelier</p></li></ul><p class=\"p3\">The trendiest place in Podil to shop for custom-made shoes. While you shop you can also have a delicious light lunch or coffee, prepared by the nicest barista and baker in town. </p><p class=\"p1\"><b><i>What are a couple of the best salons and spas in Kyiv?</i></b></p><ul><li class=\"p3\"><p class=\"s1\">Touch day spa</p></li></ul><p class=\"p3\">With its relaxing atmosphere and very friendly, accommodating staff,&#160; relaxation bliss is guaranteed.</p><ul><li class=\"p3\"><p class=\"s1\">G-Bar</p></li></ul><p class=\"p3\">The most fun place to get your hair or nails done before an event. You can also rent an outfit and book a photoshoot. </p><p class=\"p1\"><b><i>Time for a great sunset view&#8230; where would you go?</i></b></p><p class=\"p3\">One of the joys of Kyiv is discovering all the beautiful viewpoints. Try catching the views from the Motherland monument, Saint Sophia Cathedral or the People&#8217;s Friendship Arch.&#160;</p><p class=\"p1\"><strong>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot. </strong></p><ul><li class=\"p3\"><p class=\"s1\">Alchemist Bar</p></li></ul><p class=\"p3\">A cocktail bar located in the university quarter (where it&#8217;s easy to bar hop). The bartenders are really friendly and the cozy atmosphere makes it easy to meet people.</p><ul><li class=\"p3\"><p class=\"s1\">Paravoz</p></li></ul><p class=\"p3\">This is a unique venue located in the basement of a cinema specializing in cocktails. It gets really full in the evenings, so you may want to consider coming early. Side note: I spotted singer Jamala, the Ukrainian Eurovision winner here and was too shy to say hi, but she smiled at me!</p><ul><li class=\"p3\"><p class=\"s1\">Pink Freud</p></li></ul><p class=\"p3\">Again, a cocktail place. This one is located in Podil and is a good spot to grab a table with friends.</p><p class=\"p3\">I can think of even more good bars in Kyiv&#8230;but I&#8217;d better stop there.</p><p class=\"p3\"><img class=\"aligncenter size-full wp-image-18233\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Kyiv-1.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to kiev\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>If you end the night at a fancy club, which one do you head towards? </i></b></p><p class=\"p3\">I didn&#8217;t do a lot of clubbing in Kyiv, but some of the more upscale clubs in town include: </p><ul><li class=\"p3\"><p class=\"s1\">Arena Entertainment Complex &amp; Night Club</p></li></ul><p class=\"p3\">It is a large entertainment complex favoured by both locals and foreigners. It&#8217;s the main venue for major concerts as well. They offer a number of different bars, so there&#8217;s something to suit everyone&#8217;s style.</p><ul><li class=\"p3\"><p class=\"s1\">Caribbean Club </p></li></ul><p class=\"p3\">The majority of the crowd here is foreigner, but it was recommended to me by locals as a fancy with reasonably priced food and drinks.</p><p><img class=\"size-full wp-image-13912 alignleft\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/02/luxury-guide-to-lisbon2.jpg?resize=150%2C150&amp;ssl=1\" alt=\"luxury guide to lisbon2\" width=\"150\" height=\"150\">Dalia is the video blogger on the <i>Getting Close to </i>travel series. When she&#8217;s not capturing people&#8217;s stories, making random friends in the street or editing footage from her&#160;travels, you&#8217;ll find her&#160;trying to save the world doing multimedia and communications work for international organizations. You can follow her adventures at <a href=\"http://gettingcloseto.com\">gettingcloseto.com</a>.</p><p>&#160;</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Kiev"}},"pageContext":{"id":"5b96299787be05832749119a"}}