{"data":{"mongodbDatabaseArticles":{"id":"5b93831587be056953db7e26","content":"<div><h1 name=\"644d\" id=\"644d\" class=\"graf graf--h3 graf--leading graf--title\">Documenting Decisions in a Remote&#160;Team</h1><p name=\"78b8\" id=\"78b8\" class=\"graf graf--p graf-after--h3\">One of the questions I hear most about our globally distributed team at Buffer is &#8220;how do you document decisions&#8221;? In a remote team, a more intentional method of making and documenting decisions is needed to help everyone stay in the loop. I believe being intentional about sharing decisions increases the quality of decision making and builds stronger alignment for all types of teams, too.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*oizuL5VWpusDY5L7KxONKQ.jpeg\">Photo by <a href=\"https://unsplash.com/photos/pSjwUXBMnlc?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" class=\"markup--anchor markup--figure-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Jonathan Simcoe</a> on&#160;<a href=\"https://unsplash.com/?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" class=\"markup--anchor markup--figure-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Unsplash</a><h4 name=\"4f8d\" id=\"4f8d\" class=\"graf graf--h4 graf-after--figure\">1. Clarify the&#160;decision</h4><p name=\"2a63\" id=\"2a63\" class=\"graf graf--p graf-after--h4\">If you have a nebulous problem statement, it&#8217;ll be really hard to pin point what, if anything, was decided. It&#8217;s then much harder to communicate that. To communicate decisions effectively, you need a clear statement of what that decision is. This is important for all good decision making&#8202;&#8212;&#8202;shared context is hard to build and being vague about what a decision is really hurts this.</p><h4 name=\"36c6\" id=\"36c6\" class=\"graf graf--h4 graf-after--p\">2. Decide &amp; Share the Decision&#160;Makers</h4><p name=\"735f\" id=\"735f\" class=\"graf graf--p graf-after--h4\">For a simple decision, it&#8217;s key to identify who the decision maker is: the person who will make the decision (and be accountable). For a more complex decision, doing a <a href=\"https://en.wikipedia.org/wiki/Responsibility_assignment_matrix\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">RACI</strong></a> responsibility assignment matrix works really well. The &#8220;responsible&#8221; person, or decision maker, is who should be communicating the decision. Without knowing who this is, you end up with a bystander effect where everyone participates in the decision, but no-one takes ownership of a) ensuring a decision is reached and b) communicating the decision.</p><p name=\"4664\" id=\"4664\" class=\"graf graf--p graf-after--p\">Having a document like a <strong class=\"markup--strong markup--p-strong\">Google Doc</strong> or <strong class=\"markup--strong markup--p-strong\">Dropbox Paper</strong> to record what the decision is, and who the decision makers are, is really helpful, especially to reference later on too.</p><h4 name=\"ed61\" id=\"ed61\" class=\"graf graf--h4 graf-after--p\">3. Share <strong class=\"markup--strong markup--h4-strong\">That</strong> the Decision will&#160;Happen</h4><p name=\"5432\" id=\"5432\" class=\"graf graf--p graf-after--h4\">For bigger decisions, it&#8217;s really helpful to share ahead what decision is being made, and by whom. This can be lightweight&#8202;&#8212;&#8202;a point on a meeting agenda (make sure to share your meeting notes!) or a quick email. It doesn&#8217;t need to be a lengthy process, but knowing ahead of time that a certain decision will be made helps people start to process it. This type of repetition happens naturally in co-located teams when people chat. In remote teams, sharing a quick heads up helps everyone be on the same page.</p><h4 name=\"f828\" id=\"f828\" class=\"graf graf--h4 graf-after--p\">4. Document the&#160;Decision</h4><p name=\"67f5\" id=\"67f5\" class=\"graf graf--p graf-after--h4\">Once your decision is made, in whatever format you&#8217;re using (via a meeting or as a conclusion from some research), you need to ensure two things. 1) Your decision is <strong class=\"markup--strong markup--p-strong\">communicated</strong> and 2) There&#8217;s a <strong class=\"markup--strong markup--p-strong\">record</strong> of that decision that can be accessed later.</p><p name=\"7624\" id=\"7624\" class=\"graf graf--p graf-after--p\">To share word of the decision, at Buffer we use <strong class=\"markup--strong markup--p-strong\">email</strong> for smaller updates, or a <strong class=\"markup--strong markup--p-strong\">Discourse</strong> announcement for larger decisions. This is shared to the widest group of people who it may effect&#8202;&#8212;&#8202;so for example, a decision that directly affects product engineers, but could be of interest to someone outside product (e.g. a devops team), might be shared to all engineers. By this stage, it&#8217;s not out of the blue: people have heard that the decision is being made, and they know by whom. They might have even seen that decision be made in a meeting or followed along on your document. So, by the time the decision is shared in a follow-up, it&#8217;s much easier to retain.</p><p name=\"b733\" id=\"b733\" class=\"graf graf--p graf-after--p\">Lastly, recording your decision&#8202;&#8212;&#8202;do any docs or workflows need to change? If so, update them promptly. Will this affect how teams work for the future? Then you&#8217;ll need to update your team handbook/wiki. Do you just need a record that is more find-able than Email? It&#8217;s handy to share your <strong class=\"markup--strong markup--p-strong\">Dropbox Paper/Google Drive doc</strong>, put it in an appropriate folder, and link to that in a team <strong class=\"markup--strong markup--p-strong\">&#8220;what happened this week&#8221; roundup</strong>. If you&#8217;re not doing those and your team could be more on the same page, this might be what&#8217;s missing.</p><p name=\"6ce3\" id=\"6ce3\" class=\"graf graf--p graf-after--p\">It&#8217;s really important not to share decisions via <strong class=\"markup--strong markup--p-strong\">Slack</strong> only. It&#8217;s so easy for Slack messages to get lost in a sea of other chatter, and people coming online later can easily miss it. It also creates a lot of stress if people need to &#8220;read Slack&#8221; every day before they start work, just in case they miss an important decision. So, if you&#8217;re posting a decision to Slack, make sure you follow up in a more asynchronous medium, too.</p><h4 name=\"522f\" id=\"522f\" class=\"graf graf--h4 graf-after--p\">But this all takes So. Damn.&#160;Long.</h4><p name=\"ba7e\" id=\"ba7e\" class=\"graf graf--p graf-after--h4 graf--trailing\">Yes. But it&#8217;s tremendously less time and effort than having your team not know what&#8217;s going on. Constantly putting out fires, re-doing work, and repairing relationships because people weren&#8217;t on the same page is far more time consuming than communicating intentionally.</p></div>","title":"Documenting Decisions in a Remote Team – Katie Womersley – Medium"}},"pageContext":{"id":"5b93831587be056953db7e26"}}