{"data":{"mongodbDatabaseArticles":{"id":"5b92488987be056953db7bb1","content":"<div><p>Two years ago, I was in Bali and I met one of the most inspiring people in my life: <a href=\"http://twitter.com/flowen_nl\">Lowen</a>.</p> <img src=\"/wp-content/uploads/2017/04/photo6330339730956330962.jpg\" alt=\"\" width=\"2560\" height=\"1707\" class=\"alignnone size-full wp-image-7668 responsively-lazy\"> <p>He's Dutch. And I'm Dutch. And in Europe we do party drugs. Especially in the last few years. We've both quit. But it's kinda normal if you've ever lived (and partied) there.</p> <p>There's a lot of stuff you can learn from it though. For example, on psychedelic mushrooms I learnt how to separate all my good thoughts and bad thoughts and put the bad thoughts in a big giant soap bubble and push the bubble away. That exercise still works for me now.</p> <p>Lowen had his own story. And I think about this whenever I get especially anxious about life.</p> <h2>Bad trip</h2> <p>He was at party at <a href=\"http://amsterdam-dance-event.nl/\">ADE</a> with friends. Dutch nightclubs are not like the ones in the rest of the world where they play this happy electro trash:</p> <p></p> <p>(yes Hardwell is Dutch, that makes it all the more ironic, we don't play it, you do America, you do)</p> <p>In clubs in Holland, dance music is in fact dark AF, kinda like Berlin clubs: they're pitch black and instead of Hardwell they play <a href=\"//www.youtube.com/watch?v=uskxAfGkQpI#t=1m22s\">really really dark techno</a> (no not the techno you know in America, sorry USA).</p> <p></p> <p>Then they took Ketamin. That's horse tranquilizer. But humans use it as a party drug. Haha, yes really.</p> <p>He accidentally took a little too much. And when it kicked in, he went into a really fucking bad trip.</p> <p>Now if you're in a bad trip, on drugs, it's kinda hard cause once you're in it, you have to pretty much just keep going until this stuff wears off. There's no real exit strategy here. And if you took too much, this bad trip is going to take a long time.</p> <p>He didn't feel his arms and legs anymore. And you know when you fall asleep and you suddenly wake up falling? He was stuck in this too, but endlessly. Then there was the hundreds of strange people looking and laughing at him. It was one big evil shitshow.</p> <p>And it just went from a bad trip to the worst trip of his life. Imagine being stuck for infinity in a prison that is worse than the fire of hell. That's where Lowen was:</p> <p><a href=\"http://collection.imamuseum.org/artwork/79340/\"><img src=\"/wp-content/uploads/2017/04/Q4s9y2z.jpg\" alt=\"\" width=\"3164\" height=\"2584\" class=\"alignnone size-full wp-image-7654 responsively-lazy\"></a><br> <i>\"Christ in Limbo\" by Follower of Hieronymus Bosch (Dutch (must have been on some Ketamine too, huh), 1450-1516)</i></p> <p>Right there then, it comes down to mental prowess. How much can you control your mind to stay positive even though you're looking into hell itself? He kept slowly coming out and then he was sucked back into this bad trip. But he figured something. If he just focused only his breath he was able to lift himself from this hell hole. He made a mantra that he repeated to himself:</p> <blockquote><p>Just. Breathe.</p></blockquote> <p>Now that's going to sound terribly cheesy. I get it. This is \"one of those posts\" right? But we're in a bad psychedelic trip here.</p> <p>Regulating his breath gives him one point of focus. Away from bad thoughts and onto this one thing. This is the same concept as why meditation works. That one point of focus. But it goes further. Telling yourself to just breathe works because that's really all you need to do in life (to some extent of course). Everything else can be dismissed as not an immediate priority. Yes there's shit in your life, we all have it. There's ALWAYS stuff. But nothing is as immediately important as breathing. If you don't, you'll die within minutes. Nothing else really matters.</p> <p>It worked for Lowen. He was able to get out of hell itself and stabilize his psychedelic trip again. And he turned it into a relatively positive one, as much as possible after what happened before.</p> <p>So whenever I can't deal with life itself, whenever I get anxious or depressed. I just tell myself what Lowen told himself when he was stuck in an infinite hell fire. All you have to do is:</p> <blockquote><p>Just. Breathe.</p></blockquote> <p>Because nothing else really matters.</p> <img src=\"/wp-content/uploads/2017/04/77157dc3909f6fb0cba85f4f156cbb63.jpg\" alt=\"\" width=\"960\" height=\"638\" class=\"alignnone size-full wp-image-7655 responsively-lazy\"> <p>IANAL IANAD IANAP</p> <p>(P.S. Lowen asked me to show you his art so here's his <a href=\"//instagram.com/flowen_nl/\">Instagram</a> and <a href=\"//flowen.nl/\">website</a>)</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Just. Breathe."}},"pageContext":{"id":"5b92488987be056953db7bb1"}}