{"data":{"mongodbDatabaseArticles":{"id":"5b937ad987be056953db7cdb","content":"<div><p name=\"a0d5\" id=\"a0d5\" class=\"graf graf--p graf--leading\"><strong class=\"markup--strong markup--p-strong\">Then, one day, something happened that finally made me realize that I. WAS. DONE.</strong></p><p name=\"83b7\" id=\"83b7\" class=\"graf graf--p graf-after--p\">I watched someone overdose on the sidewalk one early afternoon, tons of people walking by without offering help, seeing if he was okay, NOTHING. I didn&#8217;t have a cell phone, and I had given my Narcan kit to another friend the night before since he uses needles (I have never shot up, I am terrified of needles).</p><p name=\"c6bb\" id=\"c6bb\" class=\"graf graf--p graf-after--p\">I screamed and shouted for someone to call 9/11. I ran down the street asking every single junkie and person if they had a kit on them. Tears streaming down my face the whole time.</p><p name=\"5301\" id=\"5301\" class=\"graf graf--p graf-after--p\">I ran back to this man, someone had called 9/11 and was standing watch over him, but I watched him closely&#8202;&#8212;&#8202;he was foaming at the mouth, he was suffocating, turning purple all over, and there was NOTHING that I could do.</p><p name=\"f229\" id=\"f229\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I have never felt so fucking useless or guilty in my entire life.</strong> <strong class=\"markup--strong markup--p-strong\">If I had kept my Narcan kit, I could have had a chance of saving his life.</strong></p><p name=\"1ed2\" id=\"1ed2\" class=\"graf graf--p graf-after--p\">By the time the EMT&#8217;s showed up, it was already too late. <strong class=\"markup--strong markup--p-strong\">I had watched this man die, along with my heart shattering, my mind going in spirals, and tears pouring down my face.</strong></p><blockquote name=\"e5ed\" id=\"e5ed\" class=\"graf graf--pullquote graf-after--p\"><strong class=\"markup--strong markup--pullquote-strong\">I felt it in this moment&#8202;&#8212;&#8202;that I was finished.</strong></blockquote><p name=\"fd95\" id=\"fd95\" class=\"graf graf--p graf-after--pullquote\">I knew if I didn&#8217;t get the FUCK out of Vancouver, and fast, <strong class=\"markup--strong markup--p-strong\">that it was only a matter of time, maybe even just days, before that would be my body, lying stiff on the ground in some random alley</strong>, turning blue and pale, the life just slipping from my soul.</p><p name=\"7482\" id=\"7482\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Nickie talked me into going back to Buffalo, going to rehab (I had insurance in the US, but not in Canada), and ultimately being by my support system&#8202;&#8212;&#8202;my family. I talked to my family, and they thought it was a smart decision.</strong></p><p name=\"beae\" id=\"beae\" class=\"graf graf--p graf-after--p\">I agreed to, reluctantly. I bought my plane ticket for a few days later. I knew my only chance was to escape that place, and get somewhere safe. The addict within still wanted me to stay and feed the habit, tricking me into thinking I could somehow make it work.</p><p name=\"e239\" id=\"e239\" class=\"graf graf--p graf-after--p graf--trailing\">I still had 2 days left in Vancouver, and I was living in a homeless shelter right down the street from Hastings St. aka Skid Row.</p></div>","title":"On Being An Entrepreneur, A Digital Nomad, and a Heroin Addict — Part 1"}},"pageContext":{"id":"5b937ad987be056953db7cdb"}}