{"data":{"mongodbDatabaseArticles":{"id":"5b962b9987be0583274911df","content":"<div><p><b>I was kindly given a newbie-blogger award by <a href=\"http://innocentnomad.com/\" target=\"_blank\">Emily at Innocent Nomads.</a></b></p><p>It reminds me of when my 6th grade basketball coach gave me &#8216;Most Improved&#8217; at the end of the year. It was saying I had been terrible, and I wasn&#8217;t sure if I wanted to laugh or cry. This award isn&#8217;t bad though, because they aren&#8217;t saying I&#8217;m bad, just that I&#8217;m new. (Let&#8217;s hope). The biggest perk is it connects me with other bloggers, and I get to give the next award out!&#160;I could never have been a teacher because I always play favorites. I was meant to give out an award at some point, so this is exciting.</p><p>Unlike a chain emails I&#8217;ve never passed on, I am happy to send this award on to other newbie travel bloggers. The rules &#160;of the Liebster Award state technically they should <i>have less than 200 twitter followers</i>, which I did when I received this. &#160;I&#8217;m just a little behind on getting this post up.</p><h2><b>So, I have been given 10 questions to answer, and after I do, I&#8217;ll make up 10 questions for the newbie&#8217;s that I choose.</b></h2><p>&#160;</p><p>Here are the questions that <a href=\"http://innocentnomad.com\" target=\"_blank\">Emily</a> sent me:</p><p><b>1. How many languages do you speak or do you ever learn some of the language of the country you are visiting? </b></p><p>I obviously speak English, and I can speak Spanish a little bit. Considering how many years I studied it, I should know a lot more! I&#8217;ve been in India on and off almost a year, and I haven&#8217;t learned much- there are MANY languages, not just Hindi. Many of my Indian friends don&#8217;t even know Hindi.</p><p><b>2. What country are you visiting next?</b></p><p>I am meant to go to Austria with my boyfriend to visit his dad in Vienna over Christmas.</p><p><b>3. What is the first thing you pack (not counting your passport or underpants)?</b></p><p>Contacts. I always say I&#8217;m at a disadvantage if my plane crashes and I&#8217;m stuck on an island. My contacts will dry up, I wont have extras, my glasses will break, and I wont see a polar bear coming after me. Then I&#8217;m dead.&#160; Or I&#8217;m watching too many re-runs of Lost on TATA Sky India.</p><p><b>4. Do you prefer to travel solo or with friends?</b></p><p>It&#8217;s equal. I have to have a mix of both. Maybe every other trip should be alone.</p><p><b>5. Do you prefer hostels or hotels?</b></p><p>Hotels. Of course! Hostels are cool for budgeting but I would never choose to stay in one instead of a private lush room, even if it means I won&#8217;t make any friends.</p><p><b>6. What is your best or favourite travel tip?</b></p><p>In general, my favorite tips to give are on packing. I&#8217;ve become really good at it. I always remind people to pack things they would wear at home, not something from an REI catalog. I also love to give solo female travelers tips on safety, especially here in India.</p><p><b>7. If you could live in any country and never leave, where would it be and why?</b></p><p>Tricky&#8230; I live in India now and have no plans of leaving. But if I had to pick somewhere else, it would be Mexico. Rural Mexico. I went last year with my boyfriend and it was unbelievable. The food, the cowboys, the cartel&#8230; it was like a movie. Full of beauty and empty of tourists.</p><p><b>8. How spontaneous are your trips?</b></p><p>Nowadays they are very spontaneous. Last night friends called from Bangalore saying come to a music festival for a few days, then we&#8217;ll bus down to the beach. Two minutes later flights were booked. It&#8217;s a little difficult, because with blogging now I do need to do some research ahead of time to be fair to my readers.</p><p><b>9. If you could sit next to one person on a plane, who would it be (dead or alive)?</b></p><p>Someone really skinny so I could have more room&#8230; No, it would probably be my grandma who I keep telling I want to take to Alaska. She&#8217;s my number one supporter when it comes to adventuring. You probably thought I&#8217;d say Leo Dicaprio or Ryan Reynolds, but then if I fall asleep in my curled up little ball and drool a little, I&#8217;d only embarrass myself.</p><p><b>10. Name your top three favourite blogs!</b></p><ol><li><a title=\"young adventuress\" href=\"http://youngadventuress.com/\" target=\"_blank\">Liz at Young Adventuress</a>. She&#8217;s funny, real with her readers, and seems like someone you&#8217;d want to travel with (not just read about).</li><li><a href=\"http://www.alexinwanderland.com/\" target=\"_blank\">Alex at Alex in Wanderland.</a> She&#8217;s the first travel blog I found, and I was hooked. She is a talented writer and photographer, focusing a lot of diving and beach life!</li><li><a href=\"http://the-shooting-star.com/\" target=\"_blank\">Shivya at The Shooting Star</a>. She&#8217;s an Indian blogger here and I love her site as a reference when I&#8217;m looking for a nice getaway. I also love that she inspires girls to travel India solo.</li></ol><p>&#160;</p><h1><strong>Here are the rules for the nominees:</strong></h1><ol><li>.&#160;&#160;&#160; Thank the person who nominated you and link back up to his/her blog.</li><li>.&#160;&#160;&#160; Answer the 10 questions which are given to you by the nominator.</li><li>.&#160;&#160;&#160; Nominate other bloggers for the award who have less than 200 followers.</li><li>.&#160;&#160;&#160; Create 10 questions for your nominees to answer</li></ol><p>Let the nominees know that they have been nominated by going to their blog and notifying them.</p><p><strong>These blogs I&#8217;ve recently found, are fairly new, and I follow. My nominees are:</strong></p><p>Drew @ <a href=\"http://thehungrypartier.com/\" target=\"_blank\">the hungry partier</a></p><p>Kristian and Kinda @ <a href=\"http://thehungrypartier.com/\" target=\"_blank\">the travel chicks</a></p><p>Auston and David @ <a href=\"http://www.twobadtourists.com/\" target=\"_blank\">two bad tourists</a></p><p>Megan @ n<a href=\"http://nomadicmegan.wordpress.com/\" target=\"_blank\">omadic megan</a></p><p>&#160;</p><h1><strong>Now for your questions! I&#8217;m not making them too serious because I want this to be fun, and I want your readers to enjoy the answers!</strong></h1><p>1. Have you fallen in love abroad (for more than 2 days?)</p><p>2. What do you ALWAYS pack that&#8217;s just nonsensical?</p><p>3. Where&#8217;s the place you&#8217;ve gotten lost the most?</p><p>4. If you could change nationalities for a day (of somewhere you&#8217;ve visited) which would you choose?</p><p>5. Have you ever spent more than double your budget?</p><p>6. What&#8217;s the thing you miss the most while you travel- that makes you homesick when you think about it?</p><p>7. Where&#8217;s the craziest parties you&#8217;ve been to?</p><p>8. What&#8217;s the strangest food you&#8217;ve eaten abroad?</p><p>9. What tourist destination have you seen that was a complete disappointment?</p><p>10. What travel tips would you tell your readers if you could only give them one?</p><p>11. Name your top 3 travel blogs! (yeah, this is more than 10, sorry!)</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on <a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>, <a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>, <a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a> &amp; <a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Hippie In Heels"}},"pageContext":{"id":"5b962b9987be0583274911df"}}