{"data":{"mongodbDatabaseArticles":{"id":"5b937b1887be056953db7d1b","content":"<div><h3 name=\"1ffb\" id=\"1ffb\" class=\"graf graf--h3 graf--leading\">The 3 most valuable things I&#8217;ve learned on the&#160;way</h3><p name=\"ebab\" id=\"ebab\" class=\"graf graf--p graf-after--h3\">Making money is a thing, but what we learn and who we become by doing so matters way more. In this way, starting this business was quite intense and steep, in the beginning.</p><p name=\"d97a\" id=\"d97a\" class=\"graf graf--p graf-after--p\">Yet, the 3 most valuable things I&#8217;ve learned are not about this business itself, but more about the mindset I developed.</p><h4 name=\"eb67\" id=\"eb67\" class=\"graf graf--h4 graf-after--p\">#1&#8202;&#8212;&#8202;I can make money, and I am ok with&#160;this</h4><p name=\"44d8\" id=\"44d8\" class=\"graf graf--p graf-after--h4\">You know when you try to do something for months/years, and you finally manage to do it. The next time you try again, it will only be a matter of days/weeks before you do it, right?</p><p name=\"3e53\" id=\"3e53\" class=\"graf graf--p graf-after--p\">It&#8217;s the same here. I discovered that it&#8217;s possible to make money by myself at a scale I never experienced before. And I also discovered that people who do so aren&#8217;t so different than me. They just do things that bring them those results.</p><p name=\"3943\" id=\"3943\" class=\"graf graf--p graf-after--p\">Whatever you&#8217;re doing, when you start from 0 and reach $750,000 in sales within a year, doing something you had no clue about before you google it and start taking action, you unlock something in your brain that makes you realize: &#8220;fuck, it&#8217;s actually possible!&#8221;.</p><p name=\"e647\" id=\"e647\" class=\"graf graf--p graf-after--p\">Moreover, you open your mind wider, you connect with people doing the same numbers (and more), you consider more opportunities and you realize that whatever you achieved, you can do it again, and you can also do way better in the future.</p><h4 name=\"1f0c\" id=\"1f0c\" class=\"graf graf--h4 graf-after--p\">#2&#8202;&#8212;&#8202;Hustling is over&#160;rated</h4><p name=\"8139\" id=\"8139\" class=\"graf graf--p graf-after--h4\">I&#8217;m a big fan of <a href=\"https://medium.com/@garyvee\" class=\"markup--user markup--p-user\" target=\"_blank\">Gary Vaynerchuk</a>, and I love his messages about hustling. Yet I only watch 5min of his videos when I need an extra boost of motivation to get something done.</p><p name=\"8630\" id=\"8630\" class=\"graf graf--p graf-after--p\">Eventually, this all-in thing about hustling hard, and working 10 days a week / 50h a day is the dumbest thing to do once you start &#8220;making it&#8221;.</p><p name=\"db50\" id=\"db50\" class=\"graf graf--p graf-after--p\">Once the business is running (aka, is profitable), what you need is not to work more, but to work smarter. There is millions of ways to be busy, work and doing things on the business. It doesn&#8217;t mean they are the one you should do.</p><p name=\"8290\" id=\"8290\" class=\"graf graf--p graf-after--p\">At some point, the business needs more vision, and the execution has to be outsourced. The business needs to be led by someone who can work smarter, not longer.</p><p name=\"457c\" id=\"457c\" class=\"graf graf--p graf-after--p\">Clarity and quality over quantity.</p><p name=\"f4df\" id=\"f4df\" class=\"graf graf--p graf-after--p\">I totally missed this point during most of the past 11 months.</p><h4 name=\"77fa\" id=\"77fa\" class=\"graf graf--h4 graf-after--p\">#3&#8202;&#8212;&#8202;Being wrong is not &#8220;fine&#8221;, it&#8217;s a necessity</h4><p name=\"565d\" id=\"565d\" class=\"graf graf--p graf-after--h4\">In this kind of business, it&#8217;s all about testing. You test the products, you test the audiences, you test new methods.</p><p name=\"a8e1\" id=\"a8e1\" class=\"graf graf--p graf-after--p\">There are some basic principles that make sense to follow. But for the rest, the more you test, the more you have different results. And the more you learn from those results, the more you understand what works.</p><p name=\"485a\" id=\"485a\" class=\"graf graf--p graf-after--p\">Moreover, as most of the time you&#8217;ll be wrong, being wrong is what brings the most interesting insights. It gives you so much data that you can use to decide what it the next action that you should take.</p><p name=\"0f9c\" id=\"0f9c\" class=\"graf graf--p graf-after--p graf--trailing\"><strong class=\"markup--strong markup--p-strong\">being wrong more often = having more data = taking better decisions afterward</strong></p></div>","title":"11 months & $750,000 later, I decided to close my drop shipping business. Here’s why."}},"pageContext":{"id":"5b937b1887be056953db7d1b"}}