{"data":{"mongodbDatabaseArticles":{"id":"5b95ea5d87be05832748ff9e","content":"<div><p> </p><p><img src=\"https://nomadicmatt.s3.amazonaws.com/europesafe1.jpg\" alt=\"riot police in Erope\"><br> Thanks to a few high-profile terrorist attacks and riots across Europe and ongoing media coverage of things that are only ever bad, I&#8217;ve gotten a number of emails asking me if Europe is safe to visit.</p><p>The questions are always the same:</p><p>&#8220;Is the likelihood of a terrorist attack high? What about the refugees? Are there riots everywhere? Is it dangerous?&#8221;</p><p>(At the end of May, <a href=\"https://www.nomadicmatt.com/travel-blogs/tours-2017/\" target=\"_blank\">I&#8217;m running a tour through Paris and Amsterdam</a>. A lot of people have expressed interest but seem to have the same worry: &#8220;I&#8217;d love to go but I&#8217;m not sure it&#8217;s safe after seeing the news.&#8221;)</p><p>As I went around the country on a recent speaking tour, I found this concern was greater and more persistent than I realized. While I had been meaning to write about this subject soon(ish), the recent attack in Sweden has made me finally put pen to paper and declare:</p><p><strong>Europe is safe to visit.</strong></p><p>Let me explain why I say this.</p><p>&#8220;If it bleeds, it leads,&#8221; and the media have done a good job of painting Europe in a negative light. Something happens, they pick up the story and run with it, and it gets amplified and sensationalized. A politician uses it as &#8220;proof&#8221; of his larger point, it gets amplified again, and then suddenly, a whole continent looks like it&#8217;s dangerous and engulfed in flame. (I&#8217;m not saying what happened isn&#8217;t newsworthy, but we all know 24/7 coverage creates this echo chamber.)</p><p>People also end up extrapolating from sensational coverage and assume that what they read is the only thing going on. It&#8217;s how biases are formed. It&#8217;s why people who have never been to France think &#8220;they all hate Americans&#8221; or &#8220;the French are all rude.&#8221; Or why many Americans still think Colombia is this dangerous narco-state they heard about throughout the 1980s. Once engrained, these mistaken perceptions are hard to change. (And it&#8217;s not just Americans who do this. Every country around the world has conceptions about all the others!)</p><p>Combined with all the fake news on the web and how people only seem to absorb that which confirms their preconceptions, it&#8217;s easy to see why Europe looks bad.</p><p>This is what is happening now. Europe is no more dangerous (probably even less so) than any city in the US &#8220;(certainly in terms of <a href=\"http://www.npr.org/sections/goatsandsoda/2015/12/07/458815891/the-u-s-is-a-world-leader-in-gun-deaths\" target=\"_blank\">gun violence</a>&#8221;)&#8230;or anywhere else in the world. In terms of terrorism (Islamic or otherwise), <a href=\"http://www.datagraver.com/case/people-killed-by-terrorism-per-year-in-western-europe-1970-2015\" target=\"_blank\">Europe is far safer than it has historically been</a>.</p><p>Consider this too: While <a href=\"https://en.wikipedia.org/wiki/Terrorism_in_Europe\" target=\"_blank\">612 people were killed by terrorists in Europe</a> from 2004 through 2016 and <a href=\"https://www.newamerica.org/in-depth/terrorism-in-america/what-threat-united-states-today/#the-threat-is-not-existential\" target=\"_blank\">95 Americans have died in domestic terrorist attacks</a> since 9/11 (350 globally), every year <a href=\"http://www.cnn.com/2017/01/30/politics/immigration-stats-by-the-numbers-trnd/\" target=\"_blank\">37,000 people die in car accidents</a> in the US. More people die from gun violence, heart disease, and plethora of other things than terrorists. Over 700 Americans die in their bathtub each year! (<a href=\"http://www.worldatlas.com/articles/the-global-terrorism-index-countries-most-affected-by-terrorist-attacks.html\" target=\"_blank\">And the most terror prone country in Europe? Russia</a>).</p><p>I go to Europe multiple times every year and can tell you that, as a tourist, you are not in any greater danger than you were years ago.</p><p>I was just in Paris, roaming the city and staying in the outskirts, and I didn&#8217;t even notice the refugee &#8220;crisis&#8221; that permeates the news.</p><p>&#8220;But I saw those awful riots in France!&#8221; you say.</p><p>Well, Paris&#8212;and France as a whole&#8212;has a long history of protests and riots. While I am not here to start a debate on French integration, the fact is that France has always had an issue integrating immigrants into French society. This has been a source of friction for decades and sometimes erupts into riots, especially in the housing developments on the outskirts of Paris. This is nothing new; the news media are only making it seem like something new because they are trying to tie it to the current refugee situation. There are no roving bands of youths in central Paris and no &#8220;no-go zones&#8221; in the city!</p><p>Before that, I was in Malta, Ireland, and London. I was in Sweden last fall. I can&#8217;t say I noticed anything out of the ordinary in any of these places.</p><p>Recent attacks in Paris, <a href=\"http://www.npr.org/sections/thetwo-way/2016/12/19/506191996/truck-drives-through-christmas-market-crowd-in-germany\" target=\"_blank\">Germany</a>, <a href=\"https://www.nytimes.com/2017/03/22/world/europe/uk-westminster-parliament-shooting.html\" target=\"_blank\">London</a>, <a href=\"http://www.cnn.com/2017/04/11/europe/stockholm-terror-attack-rakhmat-akilov/\" target=\"_blank\">Stockholm</a>, and elsewhere have made authorities more vigilant, and you will see more armed police officers and security at airports and in the streets. But it is no different than NYC after 9/11, London after the tube bombing, or really any city in the modern age. The truth is, statistically, you&#8217;re more likely to get hurt in your bathtub or hit by a bus than die in a terrorist attack. The odds of your being killed in an attack in France are less than &#8220;<a href=\"http://www.independent.co.uk/voices/nice-attack-do-you-feel-like-youre-more-likely-than-ever-to-be-hit-by-a-terror-attack-this-is-why-a7140396.html\" target=\"_blank\">two ten-thousandths of one per cent</a>.&#8221;</p><p>I am not denying that there is a heightened terrorist threat or that we shouldn&#8217;t be more vigilant. The use of trucks in attacks is scary, and you never know when the next one might happen.</p><p>Terrorism makes us afraid of the unknown. It causes an irrational fear that makes us see danger around every corner.</p><p>For me, it&#8217;s like flying. I&#8217;m terrified of flying even though I know it&#8217;s statistically unlikely I will be in a plane crash (a 1 in 11 million chance). That doesn&#8217;t stop me from thinking that every noise I hear means the engine is failing, every bump means death, and plane I get on is going to crash. I know I&#8217;ll be fine &#8212; but I&#8217;m still scared, especially after I see news of a plane crash. Why? Because if the plane goes down, I&#8217;m probably dead. So while the chance of a crash is small, the chance of me not making it is very high.</p><p>In my opinion, our view of terrorist attacks is the same. If we we&#8217;re involved in one, the chance of being hurt is high. We know rationally the chance of being in one is small, but after coverage of an attack, we can&#8217;t stop thinking &#8220;we&#8217;re next.&#8221;</p><p>But you also never know when you could be in a mass shooting, bus accident, car crash, or lightning strike here at home. We&#8217;re petrified of being in a terrorist attack, but we hardly ever give any thought to getting in a car or the bathtub.</p><p>Yes, we must remain vigilant. Yes, we must keep an eye out. But to change your plans because something may happen is crazy. You might as well not drive a car then&#8230;or eat a burger. (And of course, my irrational fear doesn&#8217;t stop me from flying frequently.)</p><p><a href=\"http://www.wendyperrin.com/7-keys-traveling-without-fear-despite-terrorist-attacks/\" target=\"_blank\">As fellow writer Wendy Perrin said</a>, &#8220;Is it virtually certain that there will be another terrorist attack in Europe in the next 12 months? Yes. Does that translate into a high degree of risk for the individual traveler to Europe? No.&#8221;</p><p>Terrorist attacks are rare (this is the first time Stockholm has seen an attack since 2010). The now-endless media coverage when something happens and the fact that is all we hear about make it seem like they are more common than they really are. Since pretty much only the negative things make the news, we assume that that&#8217;s the only thing happening.</p><p>Europe is not burning. It&#8217;s not the dangerous place the news has made it out to be. It&#8217;s highly unlikely you&#8217;re going to end up in a terrorist attack or the middle of a riot. You are far more likely to get hurt on the way to the airport than in your destination.</p><p>I can&#8217;t guarantee nothing will happen, but I can say that the chance of something happening to you is so slim that if you&#8217;re afraid of that, then you better be afraid of everything else too!</p><p>I get that emotion makes human being irrational but don&#8217;t live your life in fear of what might happen. If you do, the terrorists win, you lose out on living your life, and we live in a state of perpetual fear and anxiety of those around us.</p><p>And that&#8217;s no way to live. Visit Europe. It&#8217;s safe. Be vigilant and careful but be even more so in the bathtub as you get ready or the car on the way to the airport. Those places are really scary!</p><p></p><p id=\"om-brq027uh9rh6olkusuwr-holder\"></p><p>Photo credit: <a href=\"https://www.flickr.com/photos/mac_ivan/11295452946/in/photolist-4Tksx2-qmn66N-dYT5sG-8dAurW-adf5d-7cvRUn-9S2ZLd-acuWPt-adf7t-8dAmbU-qt6XUT-aEmdwq-eG5yR6-5UwBVi-aG6sHB-4ro6S7-7KHKku-adf9r-8dAtkC-deGphs-d8xxPN-eN2DQu-abxYvA-id99CJ-hNSyCr-b8kxUH-eN2ZZd-8dBSdq-4ro5my-nxea54-adc99-eovnWb-eMQLY6-9nw9My-eMQLrB-CmkLR-bz53jK-4mF8yg-adf6u-5jNntt-adf49-2Y7qNc-9SpjRx-8dAqC9-cXJ5Q-adf8B-at8xwp-cXJ6m-72aLXx-adf4H\">1</a></p></div>","title":"Is Europe Safe to Visit Right Now?"}},"pageContext":{"id":"5b95ea5d87be05832748ff9e"}}