{"data":{"mongodbDatabaseArticles":{"id":"5b95ea1087be05832748ff7c","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/2018/philippines.jpg\" alt=\"traditional boat in the Philippines \"><br> Updated: 05/22/18 | May 22nd, 2018</p><p>Today&#8217;s guest post comes from Will Hatton from <a href=\"https://www.thebrokebackpacker.com/\" rel=\"noopener\" target=\"_blank\">The Broke Backpacker</a>. He&#8217;s an adventurer and location independent entrepreneur who has spent a great deal of time in the Philippines. Sadly, I&#8217;ve only been to the Philippines once and it was just for a very short period of time. But it&#8217;s such a wonderful place that I want to feature more on this site so I invited Will to share his experiences on how to travel the country on a budget.</p><p>The Philippines is one of the most incredible <a href=\"https://www.nomadicmatt.com/travel-blogs/ten-budget-destinations/\" rel=\"noopener\" target=\"_blank\">budget travel destinations</a> in the world due to its perfect white-sand beaches, enchanting seas, mesmerizing sunsets, friendly locals, and relaxed, tropical vibes.</p><p>I&#8217;ve been lucky enough to travel through the Philippines multiple times and have spent nearly six months exploring this amazing corner of the world. The country has everything, from towering volcanoes and pristine coral reefs to lush jungles, underground rivers, mammoth caves, and some of the most enchanting waterfalls in the world. You can snorkel around WWII wrecks, camp out in the jungle, and head deep within the earth through limestone cave systems.</p><p>And, on top of it all, The Philippines is ridiculously cheap!</p><p>Rum is cheaper than most soft drinks, and delicious Filipino foods like lumpias (fried spring rolls) or pancit (fried noodles), or halo-halo dessert (ice shavings, condensed milk, small chunks of sweet boiled kidney beans, coconut gel, and tapioca) are often less than a dollar. You can <a href=\"http://www.thebrokebackpacker.com/best-camping-hammocks/\" rel=\"noopener\" target=\"_blank\">sleep in a hammock</a> for less than five dollars a night in many hostels (or for free if you simply set up on the beach).</p><p>The Philippines is a country you can travel on for as little as $20 USD a day if you&#8217;re doing it on a broke-backpacker budget &#8212; and it&#8217;s possible to travel much cheaper than that if you really push it by hitchhiking and camping. Obviously, your budget can balloon, especially if you&#8217;re staying at luxurious beachfront resorts, eating out at fancy restaurants, and taking expensive tours.</p><p><img src=\"https://media.nomadicmatt.com/2018/philippines3.jpg\" alt=\"the countryside in the Philippines \"></p><p>Here are some typical costs for backpacking the Philippines in 2018:</p><ul><li><strong>Dorm bed in a hostel:</strong> $5&#8211;7 USD per night</li><li><strong>Public ferry ride:</strong> $4&#8211;6 USD per ride</li><li><strong>Jeepney ride:</strong> 20&#8211;50 cents</li><li><strong>Street food:</strong> $1&#8211;3 USD</li><li><strong>Restaurant meals:</strong> $4&#8211;6 USD</li><li><strong>Long-distance bus:</strong> $8&#8211;10 USD</li><li><strong>Domestic flight:</strong> $40&#8211;70 USD</li><li><strong>Local beer:</strong> $1&#8211;2 USD</li><li><strong>1.5L bottle of water:</strong> 75 cents</li><li><strong>Island-hopping:</strong> $14&#8211;25 USD</li><li><strong>Diving with whale sharks:</strong> $25 USD</li></ul><p><strong>Accommodation</strong> &#8211; Posh backpacker hostels can be pretty expensive in the Philippines, setting you back as much as $18 a night for a dorm bed. Luckily, there&#8217;s plenty of budget accommodation available once you are out of Manila; for example, you can find dorm beds for as little as $5 a night in Palawan. Most hostels include patchy Wi-Fi and air conditioning. Local guesthouses and shacks on the beach are even cheaper than hostels; you can sometimes score a shack for just $2 a night.</p><p><strong>Food and drink</strong> &#8211; Street food can cost as little as $1 for a plate of tasty mystery meat. If you decide to eat in tourist-centric restaurants, prices will be higher with meals costing between $5 &#8211; $20 in most tourist-aimed restaurants. In Manila and other posh parts of the Philippines, you can end up spending a lot on food and drink, especially on a night out, so try to pregame (drink some beers on the street) before heading out for a night on the town. A coconut, for that inevitable hangover, will cost less than a dollar.</p><p><strong>Transportation</strong> &#8211; Flights can quickly eat into your budget, so it&#8217;s best to stick to ferries if you are long on time but short on cash. There are pretty decent long-distance buses running across some of the bigger islands, such as Luzon, but inevitably you&#8217;ll end up on a ferry&#8230; It&#8217;s simply the only way to get to many of the islands.</p><p><strong>Activities</strong> &#8211; The Philippines is one of the cheapest places in the world to learn to dive; a dive can set you back as little as $25 in some places. Snorkeling is even cheaper; you can hire snorkeling gear for $3&#8211;5 a pop on many beaches.</p><p>How much it costs to travel in The Philippines really depends on your travel style and where you go. Manila (especially) and Boracay are significantly more expensive than other parts of The Philippines and once you are out of the tourist hot-spots it&#8217;s relatively easy to thrive on a budget of $35 a day.</p><p>$35 a day will enable you to stay in a decent shared room if you&#8217;re splitting the cost with a buddy or a comfortable dorm in a cool hostel if you&#8217;re on your own. You&#8217;ll have plenty left over to eat in decent restaurants three times a day, get around by Uber and drink some beers in the evening.</p><p>You can go high or lower than that depending on how cheap (or expensive) you want to get with your accommodation, how much you drink, and how many Western meals you consume.</p><h3>How to Save Money in the Philippines</h3><p><img src=\"https://media.nomadicmatt.com/2018/philippines1.jpg\" alt=\"traditional boat in the Philippines \"><br> The country is already super cheap to visit but that doesn&#8217;t mean there aren&#8217;t ways to cut your expenses even further without sacrificing too much comfort or local experiences.</p><p><strong>Stay with locals</strong> &#8211;<a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-crush-it-on-couchsurfing/\" rel=\"noopener\" target=\"_blank\"> Couchsurfing is very popular in the Philippines</a>, and it&#8217;s a great way to meet people and save on accommodation costs. If you don&#8217;t fancy Couchsurfing, stay at a locally run guesthouse; they are often cheaper than hostels.</p><p><strong>Keep an eye out for Air Asia sales</strong> &#8211; Air Asia is one of the cheapest airlines servicing The Philippines and has fairly frequent sales where you can snap up cheaper than normal fares &#8211; it&#8217;s worth signing up to the Air Asia newsletter to be kept in the loop on these so that you can pre-book all your internal Philippines flights next time there is a sale.</p><p><strong>Buddy up</strong> &#8211; Most of the best activities are a lot cheaper if you can get a group together to split the cost.</p><p><strong>Hitchhike</strong> &#8211; <a href=\"https://www.thebrokebackpacker.com/hitchhiking-101-backpackers-tips/\" rel=\"noopener\" target=\"_blank\">Hitchhiking</a> is also pretty popular in the Philippines and a fantastic way to meet new people, have an adventure, and save some money at the same time. Hitchhiking does carry a certain degree of risk in every country but, in my opinion, The Philippines is one of the safer countries in the world to stick out your thumb. The big risk is drunk drivers so if you think somebody has had a few too many, don&#8217;t get in the car with them. (<strong>Matt says:</strong> I don&#8217;t know enough about the Philippines to say if this is also good for women too. Maybe some with experience can comment!)</p><p><strong>Stick to food locals eat</strong> &#8211; There are plenty of tourist-trap restaurants that are very expensive. Avoid these and follow the locals &#8212; they know where the best value and tastiest food is! I like to ask hostel and guesthouse staff where they themselves like to eat &#8211; this is a great way to find hole in the wall restaurants aimed at local Filipinos with cheap pricing.</p><p><strong>Camp</strong> &#8211; If you&#8217;re really on a budget, I recommend taking a tent; there are lots of epic places to camp, and nobody will mind. You can camp for free on many beaches in The Philippines and plenty of hostels will also let you pitch in their garden when they have one if you&#8217;re buying drinks at their bar.</p><p></p><h3>General Travel Tips for the Philippines</h3><p><img src=\"https://media.nomadicmatt.com/2018/philippines6.jpg\" alt=\"busy Manila\"><br> <strong>Avoid Manila</strong> &#8211; Manila hasn&#8217;t got much to offer other than traffic, scams, pollution, poverty, expensive hotels, and midget wrestling. Your time in the Philippines is better spent elsewhere.</p><p>Unfortunately, it&#8217;s pretty hard to completely avoid Manila, as most flights around go through it. However, you can avoid scams while stopping over in Manila. The main scam concerns transportation to a different terminal in the airport and when leaving the airport.</p><p>If you have arrived at a particular terminal but fly out of another, use the free shuttle bus that runs throughout the airport.</p><p>There are no metered taxis in the arrivals section, only private transfers. This is where the majority of travelers get ripped off, as they jump into a car without thinking, overlooking the exchange rate and how much it will actually cost. It&#8217;s the Philippines, so it&#8217;s going to be cheap, right? Wrong. When I first arrived in the Philippines, I very nearly ended up paying $50 USD for a private transfer to my hostel in downtown Manila! Thankfully, I knew the exchange rate and how ridiculous that was so I didn&#8217;t use that taxi and instead caught a metered taxi.</p><p>If you&#8217;re trying to get downtown, take a public metered taxi on the departure level instead. The lines are usually quite long, but they tend to go fast, as there are tons of cabs in Manila. Just make sure that you take into consideration peak-hour traffic. Manila is one of the most congested cities in the world; sometimes a ten-minute ride can take up to two hours. So avoid the 5pm&#8211;10pm crazy rush hour(s) and plan accordingly.</p><p><strong>Expect your flights to be delayed</strong> &#8211; I took about seven domestic flights and not one of them was on time. The weather can be a tad unforeseeable, especially during typhoon season. So expect delays and canceled or postponed flights in the wet season, which is from May to October.</p><p><strong>Bring sunscreen</strong> &#8211;  Sunscreen is three times more expensive in the Philippines as locals don&#8217;t wear it, therefore they charge an arm and a leg to tourists who desperately need some protection from the sun.</p><p><strong>&#8220;What do you mean the ATM is out of money?&#8221;</strong> &#8211; My thoughts exactly. You should have seen the look on my face when I arrived in El Nido with no money and couldn&#8217;t get cash out. I had to wait two days until they restocked the ATM machine, and the line was huge! Apparently, it&#8217;s quite normal for it to run out of cash, as it&#8217;s the only one in town in this popular tourist destination. Moral of the story: always carry some spare USD or PHP with you in case the ATMs run out of money or you visit a small town, like Port Barton, where there are no ATMs.</p><p><strong>Wi-Fi connections are limited</strong> &#8211; Wi-Fi in the Philippines is similar to finding a needle in a haystack. Your chances are pretty damn slim, especially if it&#8217;s raining. If you rely on the internet, the Philippines will be a nice vacation for you &#8212; away from the online world. What internet is available, moreover, is slow and sporadic. If you&#8217;re visiting remote parts of the country, don&#8217;t count on being connected at all. Your best bet is to purchase pocket Wi-Fi &#8212; the best provider I found was Globe.</p><p><strong>Get away from the tourist crowds</strong> &#8211; If you really want an authentic Philippines experience, venture away from the typical tourist spots and backpacker meccas. Holiday hotspots like Boracay and El Nido are amazing, but it&#8217;s the less touristy places like Sagada, Port Barton, and Siargao that give you a glimpse of real Filipino culture, traditions, and ways of life.</p><p><img src=\"https://media.nomadicmatt.com/2018/philippine4.jpg\" alt=\"mounds in the Philippines\"></p><p><strong>Use Uber</strong> &#8211; Uber has now come to the Philippines and is a much cheaper way to get around cities than by taxi! In general, an Uber will cost you 30% less than catching a taxi.</p><p><strong>Bring a portable battery</strong> &#8211; When you head away from tourist hotspots and major population centers, you may struggle to find reliable electricity. If you are hiking in Sagada or Kalinga, it&#8217;s well worth bringing a portable battery charger to keep your phone and camera charged up!</p><p></p>*****<p>The Philippines is still one of <a href=\"https://www.nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\" rel=\"noopener\" target=\"_blank\">Southeast Asia&#8217;s</a> best-kept secrets and many backpackers don&#8217;t make it here. My time in the Philippines was truly memorable, I met a lot of incredible people, was blessed with a Kalinga tattoo by a living legend and had my first proper experience snorkeling. I hope to return to this epic land in the near future and take to the high seas, with rum supplies aplenty, to explore isolated islands by boat. The Philippines is my favorite country in all of Southeast Asia. Get there before the secret is out and the backpacker hordes descend!</p><p>Adventurer and vagabond, entrepreneur, and hustler, Will has been backpacking around the world for a decade and likes to explore truly wild places. He spends a fair chunk of time in Pakistan leading adventure tours; the rest of the time he is on the road or living in Thailand with his wife. He blogs about budget travel and online entrepreneurship at <a href=\"https://www.thebrokebackpacker.com/\" rel=\"noopener\" target=\"_blank\">The Broke Backpacker</a> and enjoys a cheeky smoke, a good book, and a perfect sunset to round off the day.</p><p></p><p id=\"om-a8koomv9upg2hyfzh0ce-holder\"></p></div>","title":"How to Visit the Philippines on a Budget in 2018: Prices & Ways to Save"}},"pageContext":{"id":"5b95ea1087be05832748ff7c"}}