{"data":{"mongodbDatabaseArticles":{"id":"5b95ea3487be05832748ff8c","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/khaosokjungle.jpg\" alt=\"a water fall in khao sok park, thailand\"><br> Updated: 07/07/18 | July 7th, 2018</p><p>Located in the south of Thailand, Khao Sok National Park has always held my imagination. It&#8217;s constantly rated as one of the best parks in Thailand, with amazing trekking, camping, limestone karsts, cooling rivers, and a beautiful lake. <a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\" rel=\"noopener\" target=\"_blank\">Ever since I&#8217;ve been coming to Thailand</a>, I&#8217;ve been trying to visit Khao Sok, but the road bends in mysterious ways, and for one reason or the other, I&#8217;ve never been able to make it.</p><p>But this time, I used my visiting friends and my job as &#8220;tour guide&#8221; as the excuse I needed to finally push myself to this park. And I&#8217;m glad I did &#8212;&#160;I&#8217;ve been to many wonderful national parks in Thailand, but this is one of the best.</p><p>I spent three days surrounded by dense jungle, animals, and cooling air. The highlight of my trip was the day-long jungle trek I took. Starting out late in the morning (9:30), my friends and I met our guide, bought our park entrance tickets, and drove to the far end of the park. Instead of doubling back on the main trail, we would explore another trail, hike 400 meters to see some giant flowers, head toward a waterfall, eat lunch, and then walk back to the main park entrance.</p><p>It all seemed easy enough. I envisioned a well-worn trail and a mildly strenuous day hike. We were doing 11 km in the jungle, so it wouldn&#8217;t be a cake walk, but I didn&#8217;t anticipate that this trek would be much of a challenge, especially since the last half was on the park&#8217;s main road.</p><p>I was wrong.</p><p>Very wrong.</p><p>This hike was stressful, challenging, leech-infested, and exhilarating all at the same time.</p><p>It started out easy enough &#8212;&#160;we hiked 400 meters to visit giant parasitic flowers, which attach themselves to vines, then&#160;sap the life from them to grow. After nine&#160;months, they blossom, spray their seed throughout the jungle, and die within four&#160;days. However, while in bloom, the flowers are a sight to see.</p><p><img src=\"https://media.nomadicmatt.com/khaosok3.jpg\" alt=\"red flower that kills vines\"></p><p>The hike to the top wasn&#8217;t very tough. The trail was well worn&#160;and&#160;had amazing vistas from which to view the surrounding jungles, and I didn&#8217;t break much of a sweat. On the way up, we caught sight of a troop of gibbons making their way through the treetops. Gibbons in Khao Sok are rare to see, so&#160;it was quite amazing, especially since I love monkeys, though they moved too quickly to be photographed. By the time I clicked my camera, they had moved on, so instead of fruitlessly capturing a photo, I just watched them in their glory.</p><p>When we got to the top, our guide told us we would hike down to the waterfall. I assumed he meant we would be heading down another trail.</p><p>Again, I was wrong.</p><p>Our trail had opened up at the top of the waterfall and our guide looked at us. &#8220;OK, we&#8217;ll eat lunch, but first we have to get down. It will be no problem. We have ropes, and I go first.&#8221;</p><p><img title=\"It's long way down!\" src=\"https://media.nomadicmatt.com/khaosok7.jpg\" alt=\"pool at the base of the waterfall\"></p><p>My friends and I looked at each other hesitantly. To get to the base of the waterfall, we were going to have to embrace our inner Indiana Jones to rappel down the side. As you may know, heights make me extremely uncomfortable, and I opted to go down last as I worked up the courage to never look down.</p><p>However, we didn&#8217;t encounter too many steep drop-offs, and soon I was vying to the lead the way. We would rappel down ropes. When there was no rope to guide us, we scaled the rocky sides of the waterfall, holding on to vines as we made our way down to the base.</p><p><img title=\"My friend, Jesse, looking weary over our journey down\" src=\"https://media.nomadicmatt.com/khaosok6.jpg\" alt=\"Looking out over a waterfall in Khao Sok\"></p><p>But the waterfall was not the worst of it. After lunch, we had to hike downriver, following the river, which sounds pretty simple. Walking along a river bed is normally not a challenge, but not here. There was no trail or easy path. Sometimes we had to walk on large, wet rocks, climb up the narrow embankment, or scale down vines again when the river became impassable.</p><p>And the leeches only made it worse. By the time I walked out of Khao Sok, I had taken seven leeches off my legs, and a few even found their way onto my arms. Luckily, unlike the leeches in northern Thailand, most of these leeches were small and easy to grab off. Unfortunately, my friend didn&#8217;t notice one until the end, which by then had enlarged so much, it left a scar on his foot.</p><p><img src=\"https://media.nomadicmatt.com/khaosok5.jpg\" alt=\"Hiking through the riverbed in Khao Sok\"></p><p>After the river and subsequent leech removal (cue <a href=\"http://www.imdb.com/title/tt0362270/\" rel=\"noopener\" target=\"_blank\">The Life Aquatic</a> jokes), we were in the home stretch &#8212;&#160;it was now an easy walk through a bamboo forest back to the park entrance. On our way out of the park we were given a farewell by another troop of monkeys. These weren&#8217;t gibbons&#160;(I forget their proper name), but they jumped around for a while, playing in the trees, and gave&#160;us one last exciting thing to remember.</p><p>When it was all said and done, our hike had lasted a little over eight&#160;hours. Back at my guesthouse, I took the hottest shower of my life, scrubbed myself clean, and collapsed on my bed.</p><p><img src=\"https://media.nomadicmatt.com/khaosok4.jpg\" alt=\"Waterfall in Khao Sok Park\"></p><p>Though tiring, this jungle trek was the most exciting in my recent memory. I left Khao Sok with a sense of rawness. Here the lack of people and trails let you feel as if you are exploring the jungle for the first time. I love the moments when you travel that make you feel as if you have unearthed a hidden gem. As though you had found somewhere or someplace long forgotten by man. That may not be the case, but that sense of wonderment, adventure, and exploration are what drive me on my travels.</p><p>And in Khao Sok, it was just me, the jungle, and that sense of adventure.</p><p>But I could have done without the leeches.</p><p><strong>Logistics</strong></p><ul><li>You can get to the park via Surant Thani or Phuket. Most hotels will offer you private transportation for 2,000 baht, though you can hire a taxi from Surant Thani for around 1,700 baht and from Phuket for 2,800 baht. If you are with a group of four,&#160;this can be a good deal as it&#8217;s much quicker and far easier.</li><li>If you go by public bus, the minibus is 240 baht each way from Surant Thani town and 320 baht from Phuket. It will drop you off on the main road leading up to the park. You&#8217;ll have to walk the rest of the way.</li><li>The park entrance fee is 300 baht.</li><li>Hiring a guide from one of the tour operators or guesthouses (very recommended due to the lack of marked trails) costs 600 baht for half day and 1,200 baht for full day. Night hiking is 600 baht for 6 pm till 9 pm.</li><li>There is only one ATM in town.</li><li>You can find cheap guest houses for 300 baht per night with very basic accommodation and cold showers. Rooms get better at around 600 baht per night and luxurious around 1,400 baht per night.&#160;Tents available for rent from 250 baht for 2 people or 300 baht for 4 people. Accessories cost per person; pillow 10 baht, blanket 10 baht, sleeping bag 30 baht, sheet 20 baht.</li></ul><h3>Get the In-Depth Budget Guide to Thailand!</h3><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\" rel=\"noopener\" target=\"_blank\"><img src=\"https://nomadicmatt.com/wp-content/uploads/2016/09/cover_thailand_2016-2.png\" alt=\"Nomadic Matt's Guide to Thailand\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\" rel=\"noopener\" target=\"_blank\">Click here to learn more and get started.</a></p><h4>Book Your Trip to Khao Sok National Park: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Thailand by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Thailand with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Thailand?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener\">destination guide on Thailand</a> for even more planning tips!</p><p>&#160;</p><p>Photo credits: <a href=\"https://www.flickr.com/photos/mesec/26673686450/\" target=\"_blank\" rel=\"noopener\">1</a></p></div>","title":"Jungle Trekking in Khao Sok, Thailand: A Complete Visitor's Guide"}},"pageContext":{"id":"5b95ea3487be05832748ff8c"}}