{"data":{"mongodbDatabaseArticles":{"id":"5b921d1787be0571ac1b04f3","content":"<div><h1>Second Residency in Tax-Free Countries</h1>\n<p>These countries have zero income tax, plain and simple. That means you may not even need to bother filing a tax return. Tax planning becomes so much easier when the rate is simply zero; no ifs, ands, or buts.</p>\n<h2>The Bahamas</h2>\n<p></p><img class=\"wp-image-5863 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2013/05/bahamas-no-income-tax.jpg\" alt=\"tax-free countries-bahamas\" width=\"700\" height=\"466\"><p>The Bahamas has no income tax, choosing to earn its money from tourism. With so many cruise ships, it&#8217;s easy to see why they can afford to be a tax-free country. Hence, residents of the Bahamas pay zero tax on money they earn anywhere in the world.</p>\n<p>Want to become a Bahamas resident? The government application fee for temporary residence, which is renewable annually, is a mere $1,000. If you plan to settle in and stay a while, purchasing $250,000 in real estate will get you longer term residence or even permanent residence. The country prioritizes investment and rewards wealth. And in case you thought The Bahamas was some banana republic, its passport is actually one of the 25 best in the world with limited access to the United States.</p>\n<h2>British Virgin Islands</h2>\n<p></p><img class=\"wp-image-24289 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/virgin-islands.jpg\" alt=\"tax-free-countries-virgin-islands\" width=\"700\" height=\"467\"><p>We joke around Nomad HQ that BVI is made up entirely of sexy, sophisticated words: &#8220;British&#8221;, &#8220;Virgin&#8221;, and &#8220;Islands&#8221;. While getting a work permit in the BVI can be rather bureaucratic, obtaining a residence visa as a self-sufficient person can be quite easy; the process takes less than a month in most cases if you qualify. You only need to provide bank statements showing you can afford to support yourself, and to pay a $1,000 surety bond.</p>\n<p>However, the BVI only allows several dozen new temporary residents each year. It may be a tax-free country, but it&#8217;s not a big place. Obtaining permanent residence requires twenty years of almost non-stop living in the BVI, and as it&#8217;s not a sovereign nation, citizenship is difficult as well.</p>\n<h2>Brunei</h2>\n<p></p><img class=\"wp-image-24280 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/brunei.jpg\" alt=\"tax-free-countries-brunei\" width=\"700\" height=\"467\"><p>The Sultan of Brunei has so much money he doesn&#8217;t really need investors to immigrate to his sultanate. However, with a large enough investment, you can obtain residence or permanent resident status in his tiny country nestled in the Borneo part of Malaysia &#8212; though I wouldn&#8217;t recommend it.</p>\n<p>Among countries with no income tax, Brunei isn&#8217;t exactly a free country. When I was there several years ago, I met an expat woman who was actively afraid to even be seen with me for fear of the police. Most immigration is based on being married to a Brunei citizen, but there are exceptions for investors that are rather nebulous.</p>\n<h2>The Cayman Islands</h2>\n<p></p><img class=\"wp-image-24281 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/cayman-island.jpg\" alt=\"tax-free-countries-cayman-islands\" width=\"700\" height=\"467\"><p>The crown jewel of the Caribbean offshore world, the Cayman Islands don&#8217;t appeal to the middle class. Just as Cayman financial authorities have gone to great lengths to make incorporating into their country expensive, immigrating there requires some serious cash as well. Specifically, if you want to live on Grand Cayman, you must have an annual income of roughly $145,000 and make an investment of $600,000 into real estate or Cayman Island companies. Those requirements are nearly halved if you want to live on one of the smaller, less flashy islands like Cayman Brac.</p>\n<p>After eight years of residence in the Cayman Islands, you can apply for permanent residence. If you&#8217;re looking for a flashy place to live and a beachfront villa, the Caymans may be a great choice; consider them the Monaco of the Caribbean. However, with recently increased investment requirements, it&#8217;s certainly not cheap.</p>\n<h2>Monaco</h2>\n<p></p><img class=\"wp-image-10814 size-large\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/04/monaco-real-estate-bankrupt-governments-700x467.jpeg\" alt=\"tax-free-countries-monaco\" width=\"700\" height=\"467\"><p>Talk about sex appeal and sophistication; Monaco oozes it. The European principality &#8211; bordering France and Italy &#8211; is part of the gorgeous French Riviera, and is well connected by train, airplane, and helicopter to the rest of Europe. It&#8217;s the perfect zero-tax residency if you prefer European glamour to island living, and you&#8217;ll be in the company of some of the wealthiest people on earth. Just make sure you like living in Monaco, because you&#8217;ll need to actually spend time there to maintain your residence permit.</p>\n<p>Monaco requires that prospective residents deposit &#8364;500,000 in a Monaco bank and purchase at least &#8364;500,000 in Monaco real estate. Of course, you&#8217;ll need a lot of luck to even find a parking space for that price. The government has also been cracking down on residents buying tiny studios in an effort to weed out low-quality &#8220;paper residents&#8221;, which means that practically speaking you&#8217;ll need to spend several million dollars just to get in.</p>\n<h2>Turks and Caicos Islands</h2>\n<p></p><img class=\"wp-image-24287 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/turks-and-caicos.jpg\" alt=\"tax-free-countries-turks-caicos\" width=\"700\" height=\"467\"><p>The rogue of the British Overseas Territories, Turks and Caicos unveiled an economic residency program that offers quick residence permits to foreigners who either spend at least $300,000 building a new home or remodeling a distressed property, or who invest at least $750,000 in a company majority-owned by locals.</p>\n<p>Turks and Caicos is a less expensive option than the Cayman Islands or British Virgin Islands &#8211; also part of a modern British empire &#8211; but you could just as easily buy citizenship in St. Kitts and Nevis and live there tax free. For the same price, you get real estate and a passport in a sovereign country.</p>\n<h2>Vanuatu</h2>\n<p></p><img class=\"wp-image-24288 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/vanuatu.jpg\" alt=\"tax-free-countries-vanuatu\" width=\"700\" height=\"467\"><p>One of the few tax-free countries where obtaining second citizenship is possible, Vanuatu offers a very straightforward residency program that rewards those who invest more. Foreigners can invest about $89,000 for a one-year residence visa, renewable annually. Invest more and you&#8217;ll get three, five, ten, or even fifteen years. Having personally been to Vanuatu, I&#8217;ve seen how straightforward the residence process is if you know what you&#8217;re doing.</p>\n<p>Government fees for Vanuatu residence are a bit higher than I&#8217;d expect from them, but considering the low investment and the variety of interesting property investments there, it&#8217;s worth considering if you crave island life in the South Pacific. <a href=\"http://nomadcapitalist.com/2015/07/15/how-to-get-second-residency-citizenship-in-vanuatu/\">Learn more about Vanuatu residency here.</a></p>\n<h1>Second Residency in Low-Tax Countries</h1>\n<p>These countries tax the local source income of citizens and foreigners alike. Much as I dislike tax, if it is to be done, I have to admit that it&#8217;s the fairest way of doing things. Money earned from activity in a country is taxed there, while overseas income having nothing to do with the place is not.</p>\n<p>If you are going to become a resident of one of these low tax countries, you should make sure that any income you earn overseas or remit into the country isn&#8217;t taxable as local source income; consult a tax advisor.</p>\n<h2>Anguilla</h2>\n<p></p><img class=\"wp-image-24279 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/anguilla.jpg\" alt=\"tax-free-countries-anguilla\" width=\"700\" height=\"467\"><p>A British Overseas Territory in the Caribbean&#8217;s Lesser Antilles, Anguilla is a small player in the world of <a href=\"http://nomadcapitalist.com/offshore-trust/\">offshore trusts</a> and offshore banking. Anguilla also offers retirees who purchase property and provide bank statements as evidence of self-sufficiency to obtain a residence permit.</p>\n<h2>Costa Rica</h2>\n<p></p><img class=\"wp-image-24282 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/costa-rica.jpg\" alt=\"tax-free-countries-costa-rica\" width=\"700\" height=\"467\"><p>Costa Rica has long been the second residency of choice for American retirees and investor expats. The requirements have become more stringent in recent years, but anyone with $2,500 in monthly income they bring into Costa Rica can become a resident. Plenty of US and Canadian expats love living on &#8220;Tico time&#8221;. Costa Rica isn&#8217;t exactly my favorite place, and it has become highly bureaucratic, but if you enjoy sandy beaches or tropical jungles, it may be worth considering. You can even get a tax ID number and file a zero-tax return every year to keep your home country off your back.</p>\n<p>It turns out that the key differentiating factor for success is having a good local attorney. Of my friends who have established Costa Rica residency, those with competent attorneys got their residence in about six months rather than two years for those &#8220;going it alone&#8221;.</p>\n<h2>Georgia</h2>\n<p></p><img class=\"wp-image-16405 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/04/Georgia-offshore-real-estate-investments.png\" alt=\"tax-free-countries-georgia\" width=\"700\" height=\"467\"><p>One of the most underrated countries on Earth, Georgia is fast becoming one of the <a href=\"http://nomadcapitalist.com/2014/12/03/georgia-one-capitalist-countries-world/\" target=\"_blank\" rel=\"noopener noreferrer\">world&#8217;s most free economies</a>. The pro-business government slashed the number of taxes from 21 to six and now to five, and rates decreased each year for awhile. Income earned outside of Georgia is not taxed in Georgia, although you may need to provide proof of any bank deposits within the country. You can also obtain tax residency if needed.</p>\n<p>Georgia offers almost all foreigners a 360-day tourist visa, and anyone can open a Georgia company or <a href=\"http://nomadcapitalist.com/2017/07/24/second-residencies-real-estate/\">buy real estate</a> in order to qualify for residence. If you do invest in Georgia, you can utilize the country&#8217;s new Estonia-based tax model which is basically one of the tax-free countries where taxes are only paid on distributions.</p>\n<h2>Gibraltar</h2>\n<p></p><img class=\"wp-image-12338 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/tax-free-countries-second-residency-gibraltar.jpg\" alt=\"tax-free countries Gibraltar residence visas\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>If you have around $3 million, you may be eligible to become a resident of Gibraltar. Residents under the territory&#8217;s investor-friendly Category 2 visa pay a maximum tax of approximately &#163;29,000 per year in exchange for permission to reside on the tip of the Mediterranean. Similar to London&#8217;s &#8220;non dom&#8221; program, Category 2 residents can escape Gibraltar&#8217;s progressive tax rates. While you won&#8217;t pay $0, you will have residency in a highly respected European jurisdiction for a predictable flat price.</p>\n<h2></h2>\n<h2></h2>\n<h2>Guatemala</h2>\n<p></p><img class=\"wp-image-24283 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/guatemala.jpg\" alt=\"tax-free-countries-guatemala\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>If you crave the adventure of Mayan ruins and a life in Central America, Guatemala is one of four countries in the region that offer territorial taxation. Obtaining residence in Guatemala is easy if you can show proof of $1,000 monthly income, although you must be willing to live there a good part of the time or they&#8217;ll cancel your visa. If you are willing to live in Guatemala full-time, it&#8217;s possible to get citizenship after five years.</p>\n<p>&#160;</p>\n<h2>Macau</h2>\n<p></p><img class=\"wp-image-24285 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/macao.jpg\" alt=\"tax-free-countries-macao\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>While often belittled as a dodgy gambling outpost in the shadow of Hong Kong, Macau is an enigmatic and fascinating place. Just one hour from Hong Kong by boat, the special administrative region of China features a few excellent banks, as well as zero tax on foreign earnings. Foreign investors can obtain residency by investing 3 million Macau patacas, or roughly $375,000 into the country. However, because Macau is technically part of China&#8217;s &#8220;one country, two systems&#8221; policy, it is essentially impossible to obtain citizenship there.</p>\n<p>&#160;</p>\n<h2>Malaysia</h2>\n<p></p><img class=\"wp-image-6090 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/03/malaysia-no-capital-gains-tax.jpg\" alt=\"tax-free-countries-malaysia\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Malaysia is one of the most underrated second residency programs on earth, especially for entrepreneurs and investors who want to live in Asia full-time, but can&#8217;t afford Singapore. Malaysia&#8217;s &#8220;My Second Home&#8221; (or MM2H) program is extremely straightforward and doesn&#8217;t require much help from anyone to get. If you&#8217;re under 50 years old, you&#8217;ll need to show proof of $2,300 monthly income and deposit approximately $70,000 at today&#8217;s exchange rates into a Malaysian bank. You won&#8217;t be able to touch your money for ten years, or until you cancel the visa, unless you decide to buy real estate. If you&#8217;re over 50 years old, the bank deposit is cut in half. <a href=\"http://nomadcapitalist.com/2013/11/11/easy-permanent-residence-in-asia-malaysia-investor-visa-program/\">Learn more about residency in Malaysia</a>.</p>\n<p>&#160;</p>\n<h2>Nicaragua</h2>\n<p></p><img class=\"wp-image-24286 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/09/Nicaragua2.jpg\" alt=\"tax-free-countries-nicaragua\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>I&#8217;ve called Nicaragua &#8220;the next Costa Rica&#8221; as it becomes more open and more affordable than its southern neighbor. From the beaches of San Juan del Sur to the colonial charm of Grenada, Nicaragua is a great place to have a second residency&#8230; if you actually want to live there. Obtaining Nicaraguan residency is extremely easy and only requires proof of income &#8212; generally about $750 per month &#8212; but you need to live there for six months each year or else your residence permit, and your territorial tax benefits, will expire.</p>\n<p>&#160;</p>\n<h2>Panama</h2>\n<p></p><img class=\"wp-image-5684 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2013/02/panama-beach.jpg\" alt=\"tax-free-countries-panama\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Panama has some of Latin America&#8217;s <a href=\"http://www.nomadcapitalist.com/offshore-banking/\">strongest offshore banks</a> and has become an open country for immigration, especially for citizens of Western countries. For these citizens, Panama&#8217;s Friendly Nations visa program offers instant permanent residence with a low bank deposit of $5,000 and one &#8220;economic tie&#8221;, usually a Panamanian company or the title deed to real estate. <a href=\"http://nomadcapitalist.com/second-passport/panama/\">Learn more about residency in Panama</a>.</p>\n<p>&#160;</p>\n<h2>Paraguay</h2>\n<p></p><img class=\"wp-image-3882\" src=\"http://nomadcapitalist.com/wp-content/uploads/2013/11/most-livable-cities-asuncion.jpg\" alt=\"tax-free-countries-paraguay\" width=\"700\" height=\"462\"><p>&#160;</p>\n<p>Paraguay is well-known as a <a href=\"http://nomadcapitalist.com/2015/03/25/where-is-the-cheapest-place-to-buy-citizenship/\">cheap second passport program</a>, allowing foreigners to obtain instant permanent residence with a mere $5,200 bank deposit, and citizenship in three years. However, Paraguay also makes for an attractive second residency with the potential to get a passport later. Taxes on local source income are quite low at just 10%, and foreign source income is typically not taxed. <a href=\"http://nomadcapitalist.com/second-passport/paraguay/\">Learn more about residency in Paraguay</a>.</p>\n<p>&#160;</p>\n<h2>Singapore</h2>\n<p></p><img class=\"wp-image-8181 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/08/singapore-total-economic-freedom.jpg\" alt=\"tax-free-countries-singapore\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Singapore is no tax haven for entrepreneurs; not only is a company in Singapore far more costly to start and maintain than its <a href=\"http://nomadcapitalist.com/offshore-company/hong-kong/\">Hong Kong counterpart</a>, but tax rates are 0-17% on corporate profits and a flat 20% on the high personal salary you&#8217;ll be required to take if you want residency in Singapore as part of the deal. In short, an active business owner living in Singapore would pay at least $20-25,000 a year for the privilege. On the other hand, investors with around $4 million to invest can move to Singapore and enjoy no tax on bank interest, capital gains, or foreign profits. <a href=\"http://nomadcapitalist.com/2015/07/31/how-to-get-singapore-citizenship-pr/\">Learn more about residency in Singapore.</a></p>\n<p>&#160;</p>\n<h2>What about Hong Kong?</h2>\n<p></p><img class=\"wp-image-11930 size-large\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/08/Depositphotos_24277519_original-1-699x467.jpg\" alt=\"tax-free-countries-hong-kong\" width=\"699\" height=\"467\"><p>&#160;</p>\n<p>You might be asking, &#8220;what about second residency in Hong Kong?&#8221; Hong Kong is still an excellent flag to plant for some entrepreneurs, although I recommend it less these days, especially as Hong Kong banks have become impossible. However, Hong Kong is not the easy second residency it once was.</p>\n<p>Hong Kong recently <a href=\"http://www.immd.gov.hk/eng/services/visas/capital_investment_entrant_scheme.html\" target=\"_blank\" rel=\"noopener noreferrer\">&#8220;suspended&#8221;</a> its Capital Investment Scheme which allowed anyone to plunk US$1.29 million in a bank or brokerage account and live in Hong Kong. However, I&#8217;ll bet you almost anything it will not return&#8230; ever. Quite simply, Hong Kong doesn&#8217;t need you to live there; they&#8217;re doing perfectly well with the mega-millionaires already there.</p>\n<p>Now, it&#8217;s still possible to obtain second residency in Hong Kong by starting a business and opening a physical office there, but that will put you on the hook for Hong Kong taxes, reasonable as they are.</p>\n<p>If you&#8217;re looking for a second residency and aren&#8217;t sure where to start, I&#8217;m offering a concierge service to help you determine the best options for your specific situation. <a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\">Click here</a> if you could use help deciding which of dozens of residency programs is the best fit for you, or want a professional to navigate the path to your second citizenship.</p>\n</div>","title":"18 tax-free countries where you can get second residency"}},"pageContext":{"id":"5b921d1787be0571ac1b04f3"}}