{"data":{"mongodbDatabaseArticles":{"id":"5b93838887be056953db7e5c","content":"<div><h4 name=\"52c3\" id=\"52c3\" class=\"graf graf--h4 graf--leading graf--kicker\">Get Shift Done: Management</h4><h1 name=\"8758\" id=\"8758\" class=\"graf graf--h3 graf-after--h4 graf--title\">Why I Only Work&#160;Remotely</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*n-RV1WLO6v0NdyvZ0LBvnA.jpeg\"><p name=\"90ed\" id=\"90ed\" class=\"graf graf--p graf-after--figure\">Building software for startups is a huge challenge. Not because writing the software itself is that hard, but most startups have managed to create the least optimal places to do work. In my 10+ years of experience as a software engineer at startups, I cannot trust employers to provide me with an adequate work environment, and this holds me back from doing the best possible work for them. I am an ambitious, driven individual, and I want nothing more than to provide the places I work with my <strong class=\"markup--strong markup--p-strong\">best possible output</strong>. I will give whatever company I am working at 100%. Most of the places I have worked have done a great job at preventing me from doing this. That&#8217;s why from here on out, I am taking a stand and drawing a line in the sand. Henceforth I will only work in a &#8220;remote&#8221; arrangement.</p><h4 name=\"2b7a\" id=\"2b7a\" class=\"graf graf--h4 graf-after--p\">Open offices</h4><p name=\"3fa3\" id=\"3fa3\" class=\"graf graf--p graf-after--h4\">Most startups nowadays are obsessed with the open office environment, and it&#8217;s nearly impossible to find companies that do not implement this type of layout. They&#8217;ll claim it&#8217;s because they want an &#8220;open and transparent culture&#8221; (myth busted*), but if you know anything about the subject, you&#8217;ll know this is the <a href=\"http://www.newyorker.com/business/currency/the-open-office-trap\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">worst possible setup for actual work</a>, and doesn&#8217;t improve communication or culture. You don&#8217;t have to look far to find plenty of research on the subject- and quite frankly, there is simply no debate here. There is no evidence to support the hypothesis that open office layouts foster a more collaborative environment. Of course, office managers, CEO&#8217;s and founders selectively ignore the mountain of evidence which disproves this hypothesis. This is one of the real tragedies of the startup world. It&#8217;s hard to estimate how many startups are being held back by the obsession and group think around the open office environment. There is also the cost to the mental health of the employees who are subjected to these mad houses every day. As the startup scene continues to ingest, chew up, and spit out/burn out young talent, there is very little by way of wisdom in the scene to help push back on issues like this. In the words of <a href=\"https://twitter.com/dhh/status/671953192947736576\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">DHH</a>: &#8220;The open office plan is a tyrant of interruption, a deep loss of privacy, and the death of productivity&#8221;</p><h4 name=\"c936\" id=\"c936\" class=\"graf graf--h4 graf-after--p\">Work Hours</h4><p name=\"ebbb\" id=\"ebbb\" class=\"graf graf--p graf-after--h4\">I am a night owl. You can tell me I have to have my butt in a chair within your line of sight at 8 or 9am, but that is very wasteful. You are wasting my time and yours. I am not a morning person. I will start being very effective around 11am and I really get going in the afternoon/evening. If you force <strong class=\"markup--strong markup--p-strong\">your</strong> preferred hours onto me, both employer and employee lose. You get less output out of me! Here&#8217;s the cycle when I&#8217;m forced to be in a chair in your office at 9am:</p><ul class=\"postList\"><li name=\"94b9\" id=\"94b9\" class=\"graf graf--li graf-after--p\">I force myself to be up early and rush to work, feeling ill prepared</li><li name=\"7f2d\" id=\"7f2d\" class=\"graf graf--li graf-after--li\">I try to focus and be effective in the morning, but struggle and the day is off to a bad start, killing my mood and momentum</li><li name=\"9bee\" id=\"9bee\" class=\"graf graf--li graf-after--li\">I&#8217;m tired in the afternoon and cannot work effectively at my peak work time. I drink tons of coffee trying to kickstart my productivity</li><li name=\"6096\" id=\"6096\" class=\"graf graf--li graf-after--li\">I go home when I&#8217;m finally starting to get going</li><li name=\"4d4a\" id=\"4d4a\" class=\"graf graf--li graf-after--li\">I am restless in bed and can&#8217;t sleep because I drank too much coffee and I&#8217;m worried about getting up early</li><li name=\"a48f\" id=\"a48f\" class=\"graf graf--li graf-after--li\">By the end of the week I am tired, frustrated, angry, and disappointed with my performance</li></ul><p name=\"09fa\" id=\"09fa\" class=\"graf graf--p graf-after--li\">It&#8217;s a vicious cycle which has been hugely detrimental to my mental health and well being. This is another area where the science is very clear: there are morning people and there are night owls. You should accept your employees for who they are and optimize for their abilities. I am a night owl, always have been, always will be. I am done trying to work in the mornings&#8202;&#8212;&#8202;it is a waste of time as I am not effective and make more mistakes when I try to work at this time. I will only consider arrangements where I can control my work hours. This does not mean that I am lazy or a slacker. Far from it&#8202;&#8212;&#8202;I am frustrated that I cannot work at my peak productivity and I will not accept anything less than that from now on.</p><h4 name=\"e6d8\" id=\"e6d8\" class=\"graf graf--h4 graf-after--p\">Butts in seats thinking vs&#160;ROWE</h4><p name=\"eac6\" id=\"eac6\" class=\"graf graf--p graf-after--h4\"><a href=\"https://en.wikipedia.org/wiki/ROWE\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">ROWE</a> (results only work environment) is a fantastic framework that needs to be adopted in places employing knowledge workers. You should be measuring the output of your workers, not the amount of time you can see them sitting in your office. I refuse to work in a place with such a cynical view of their employees. If you really think your employees will not be working if you cannot look over their shoulder to check, you have the wrong way of looking at the relationship with your employees (especially at a startup). You should be hiring people who are engaged by their work and believe in the company&#8217;s mission. If people slack off when you aren&#8217;t watching them, your company has a disease, and you have discovered a symptom. You cannot treat this symptom and expect the disease to be cured. More on this later (Remove the safety nets and let the bad actors fail).</p><p name=\"d458\" id=\"d458\" class=\"graf graf--p graf-after--p\">In the case of working from home/remote work, some employees do not do their best work from home, or simply don&#8217;t like it. That is fine&#8202;&#8212;&#8202;but you should trust your employees and treat them like adults. Let them make the call for themselves. Remove the training wheels and let them fail. If they cannot succeed in a hands off environment, do you really think babysitting them is going to work?</p><blockquote name=\"cd9a\" id=\"cd9a\" class=\"graf graf--blockquote graf-after--p\">Culture doesn&#8217;t grow because of an unblinking gaze by a manager with direct line of sight over his underlings. Quite the contrary.</blockquote><h4 name=\"e025\" id=\"e025\" class=\"graf graf--h4 graf-after--blockquote\">Remove the safety nets and let the bad actors&#160;fail</h4><p name=\"ec3c\" id=\"ec3c\" class=\"graf graf--p graf-after--h4\">In &#8220;<a href=\"https://medium.com/@yanismydj/introduce-process-only-as-a-last-resort-21bd25e53eb#.t064k3p7h\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Introduce Process Only As A Last Resort</a>&#8221;, we look at how process often times helps the bad and hurts the good. Bad actors in an organization will figure out what the rules and the process are and follow them to a letter. Then they&#8217;ll find a way to slack off within these boundaries. Even if we wanted to, we can&#8217;t write a rule that will magically make people engaged. We have to compel them by building a workplace they love and can do great, meaningful work in. Without tons of rules and process, it becomes very obvious who cares about the organization and who does not, thanks to the <strong class=\"markup--strong markup--p-strong\">lack</strong> of rules &amp; process and not because of them. It&#8217;s the same reason that communism does not work nearly as well as capitalism&#8202;&#8212;&#8202;things work best when you give people freedom as individual actors.</p><p name=\"72fa\" id=\"72fa\" class=\"graf graf--p graf-after--p\">If you are looking at your employees through the lens of &#8220;I can&#8217;t give these people freedom and autonomy to do work in the best way they see fit:&#8221; You should consider finding different people for your organization instead of pursuing an authoritarian regime.</p><p name=\"b4a4\" id=\"b4a4\" class=\"graf graf--p graf-after--p graf--trailing\">In summary, I pride myself on being a great employee. I want to do great, meaningful work. I want to make an impact. I want to be part of a team that does great things. I love writing great software and I want to do it with fantastic people. It seems that I&#8217;ve reached a turning point in my life where I&#8217;ve realized that in order to do these things, I need to open a new chapter and set new boundaries in the work arrangements I can accept.</p></div>","title":"Why I Only Work Remotely – NewCo Shift – Medium"}},"pageContext":{"id":"5b93838887be056953db7e5c"}}