{"data":{"mongodbDatabaseArticles":{"id":"5b9248a587be056953db7bcd","content":"<div><p><strong>Update: </strong> Thailand's immigration has stated <a href=\"http://asiancorrespondent.com/125980/thai-immigration-officials-say-digital-nomads-ok-to-work-on-tourist-visas/\">\"People working remotely or running online businesses in Thailand can legally work there on tourist visas\"</a>.</p> <p><a href=\"//twitter.com/jonmyers\">Jon Myers</a> just tweeted me that in the last 24 hours, Thailand's immigration police has begun <a href=\"http://www.johnnyfd.com/2014/09/live-updates-immigration-crackdown-in.html\">rounding up foreigners</a> working from <a href=\"/co-working-spaces-in-chiang-mai-punspace/\">PunSpace in Chiang Mai</a>, checking their visas and detaining them. Digital nomad <a href=\"http://www.johnnyfd.com/2014/09/live-updates-immigration-crackdown-in.html\">Johnny FD</a> is detained too and reporting live about it on on his blog.</p> <p>I've heard from many people that <a href=\"http://nomadlist.io/\">Nomad List</a> is having some effect on the city now. With Chiang Mai being #1 on the list, there's now an influx of new people relocating to Chiang Mai.</p> <h2>The law is lagging behind technology</h2> <p>Working visas are there to protect local workers from their jobs being taken away by foreigners. But the stuff people build in Chiang Mai are not taking away Thai jobs at all. They're not even targeting Thailand as market. The people working there are freelancers or people building their own companies and startups, many focused on a worldwide market. The law is simply lagging behind the technological developments.</p> <h2>Thailand can be a legal remote working hub</h2> <p>Thailand has been at the center of the remote work and digital nomad community. It should see this as an opportunity instead of a problem. It's in a position to become one of the first legal hubs for remote workers.</p> <h2>Nomads should be taxed</h2> <p>I've said it before, nomads should be taxed. Find a construction where they can pay for the infrastructure they use. While still making it possible for them to stay short-term and not have to register everywhere and fill out 12 forms. I'd say make them pay a monthly flat amount to work legally. Like ~USD 300.</p> <h2>Caution</h2> <p>Everyone thinking of working remotely in any third-world country should always be cautious. To work without a working visa is a legal grey area so stuff like this can happen. Right now, you DO need a working/business visa for most countries. I don't agree with that but until governments catch up that's just the way it is. If you don't want to take the risk of being detained, it's very important to make sure your legal situation is in order BEFORE you board your plane.</p> <p>I've added this warning on <a href=\"http://nomadlist.io/\">Nomad List</a> to inform people:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screenshot 2014-10-02 01.09.00\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-02-01.09.00-1024x67.png\" alt=\"Screenshot 2014-10-02 01.09.00\"> <p><strong>Update:</strong> <a href=\"http://www.techinasia.com/digital-nomads-chased-out-of-punspace/\">Tech In Asia</a> reports Thai authorities say they weren't targeting digital nomads in particular, but just making sure everyone was having their passports on them. That seems like a face saving argument. Other people mentioned to me this was planned for at least a month. I think they were surprised by the amount of bad PR this got. Not a good time for bad PR with Thai tourism down due to the coup either. </p> <p>Time to get your act together, Thailand.</p> <p>(Picture by <a href=\"http://www.johnnyfd.com/2014/09/live-updates-immigration-crackdown-in.html\">Johnny FD</a>)</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"On Thailand’s immigration police targeting digital nomads"}},"pageContext":{"id":"5b9248a587be056953db7bcd"}}