{"data":{"mongodbDatabaseArticles":{"id":"5b9248cb87be056953db7bf4","content":"<div><p><strong>You can <a href=\"http://hashtagnomads.com/\">sign up</a> to the #nomads community <a href=\"http://hashtagnomads.com/\">here</a></strong></p> <p>The hardest part of startups these days is not building the product or app. It's getting people to actually use what you built. One of the goals of me launching <a href=\"/12-startups-12-months\">12 startups in 12 months</a> was to find out how exactly do you do that?</p> <p>Well, press coverage is one (this is what I got for <a href=\"/product-hunt-hacker-news-number-one/\">Nomad List's launch</a>):</p> <p><a href=\"/product-hunt-hacker-news-number-one/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-30-02.41.31-1024x291.png\"></a></p> <p>That results in these kinda spikes:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-29-20.30.38-1024x249.png\"> <p>But then those users slowly leave again and that tail you see slopes downwards. So how do you make them stick? One way is to try and create a community around your product's audience. If you do that, you can keep bringing them back.</p> <h2>What's a community</h2> <p>A community doesn't have to be as concrete as you think it is. It doesn't have to be a forum, discussion board or comments section. Or a social network. It doesn't even have to be on your own site. It can be very informal. </p> <p>A great example of that, and one we've all witnessed this year, has been <a href=\"http://twitter.com/rrhoover\">Ryan</a> when building <a href=\"http://producthunt.com/\">Product Hunt</a>. It's been talked a lot before, but it came down to Ryan personally engaging with Product Hunt's users on Twitter and inviting product makers when their products appeared on the site:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/antoinesco\">@antoinesco</a> <a href=\"//twitter.com/lixpen\">@lixpen</a> just gave you access to comment. Feel free to join the convo, Anton :)</p> <p>&#8212; Ryan Hoover (@rrhoover) <a href=\"//twitter.com/rrhoover/status/453366040471171073\">April 8, 2014</a></p></blockquote> <p></p> <h2>Creating a following</h2> <p>It might also just happen organically. While trying to get press coverage for my products this year, <a href=\"//www.techinasia.com/12-startups-in-12-months-how-this-digital-nomad-doing-it/\">a few </a><a href=\"http://www.wired.com/2014/08/12-startups-in-12-months\">articles</a> were focused disproportionally on how I worked remotely. I knew I needed a <a href=\"http://rocketship.fm/episodes/ep-66-pieter-levels\">narrative</a> to get press coverage, so I happily embraced this fact. In turn, that gave me a following of people into remote working. </p> <p>You can turn a following like this into a community. The advantage to a community is that it sticks a lot longer than press coverage. And if you keep your community engaged, and they remain interested in what you're doing, it'll stick. And that community can be turned into users for whatever product you want to push at that moment. That's the magic of it.</p> <h2>Let's try it</h2> <p>When I <a href=\"/product-hunt-hacker-news-number-one/\">launched</a> <a href=\"http://nomadlist.io/\">Nomad List</a>, I finally had a product to cater to this audience too. The site shows people the <a href=\"http://nomadlist.io/\">best cities to live</a> and <a href=\"http://nomadlist.io/\">work remotely</a> based on metrics such as cost of living, internet speed and weather. The idea is that with increased mobility and jobs going online, more people will start moving around to optimize their life quality.</p> <p><a href=\"http://nomadlist.io/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2010/10/Screenshot-2014-10-26-18.11.47-1024x479.png\"></a><br> <a href=\"http://nomadlist.io/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2010/10/Screenshot-2014-10-30-01.55.46-1024x485.png\"></a></p> <p>I wanted to try and build a community around this product's audience. I knew all these people were out there, as they tweeted and emailed me daily. But they weren't connected to each other yet.</p> <p>So I set up a <a href=\"http://slack.com/\">Slack</a> chat. On purpose, I tried to keep the Nomad List branding very subtle, using only the logo for it but calling it <a href=\"http://j.mp/nomadslack\">#nomads</a> instead. The community was for the site's target audience (e.g. digital nomads and people that wanted to be) and not necessarily the site's current users. To make sure the community was of value, I used a top-down approach where I first invited other people that were authorities in the remote community already but were connected to me too and knew Nomad List. People like <a href=\"http://twitter.com/superamit\">Amit Gupta</a> who runs a remote startup called <a href=\"http://photojojo.com/\">Photojojo</a>, <a href=\"//twitter.com/JohnONolan\">John 'O Nolan</a> who built blogging platform <a href=\"http://tryghost.org/\">Ghost</a> remotely and <a href=\"//twitter.com/JamesSLock\">James Seymour-Lock</a> who co-founded remote design agency <a href=\"http://simpleasmilk.com/\">Simple As Milk</a>.</p> <p>We tested it out for a few weeks, and when it seemed to work I slowly started rolling it out to the public, inviting more people every week.</p> <p>Then a month later I wanted to launch it, so I tweeted it out. And to make it attractive, I added a nice picture too:</p> <a href=\"http://j.mp/nomadslack\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2010/10/B09-mYNCEAAm65H.png-large.png\"></a> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/hashtag/nomads?src=hash\">#nomads</a> on Slack is open to new members until midnight EST, sign up at <a href=\"http://t.co/i0AeeUIUBU\">http://t.co/i0AeeUIUBU</a> ! <a href=\"http://t.co/8QIQA1fula\">pic.twitter.com/8QIQA1fula</a></p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/526778881877889024\">October 27, 2014</a></p></blockquote> <p></p> <p>Since Slack requires you to invite people manually, I linked it to a sign up form on <a href=\"http://typeform.com/\">TypeForm</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-30-00.59.36-1024x518.png\"> <p>I've written more about how I <a href=\"/slack-typeform-auto-invite-sign-ups/\">connected the Typeform to Slack</a>.</p> <h2>The result</h2> <p>What happened then is pretty amazing. I couldn't keep up with sending out invites as sign ups kept coming in and the Slack channels started filling up with people.</p> <p>Conversations naturally ordered themselves around different cities. Like #chiang-mai where people chatted about the coffee scene:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-30-00.10.38-1024x586.png\"> <p>And #bali on the island's coworking and startup scene:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-30-00.10.57-1024x591.png\"> <p>And the main channel #nomads, where everybody joins:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-30-00.11.27-1024x591.png\"> <p>The channel also spurred derivatives on other platforms, like a <a href=\"http://sqwiggle.com/\">Sqwiggle room</a> for nomads to co-work together and an impromptu video chat that famous nomad <a href=\"http://twitter.com/heyalexej\">Alexej</a> created:</p> <a href=\"//appear.in/digitalnomads\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/xScreenshot-2014-10-30-00.41.30-1024x534.jpg\"></a> <p>In just 24 hours, we reached 300+ members and 5,000+ messages were sent:</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"B1E45sqCMAAbUsZ.jpg-large\"></p><img src=\"/wp-content/uploads/2014/10/B1E45sqCMAAbUsZ.jpg-large.jpg\" alt=\"B1E45sqCMAAbUsZ.jpg-large\"> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-30-01.09.50-1024x615.png\"> <p>I was then contacted by <a href=\"http://www.reddit.com/user/v4o\" class=\"broken_link\">v4o</a> who was running his own chat channel for nomads called <a href=\"http://www.reddit.com/r/digitalnomad/comments/2jz73d/join_the_nomad_network_a_free_chatroom_for/\">NomadNet</a>. Since #nomads was growing faster, he told everybody there to join #nomads instead, which was very kind!</p> <p>A few days later, I made it into an actual product by building a quick landing page at <a href=\"http://hashtagnomads.com/\">hashtagnomads.com</a>:</p> <a href=\"http://hashtagnomads.com/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-31-04.09.20-1024x589.png\"></a> <p>I submitted this page to Product Hunt and Hacker News.</p> <a href=\"http://www.producthunt.com/posts/nomads\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/10/Screenshot-2014-10-31-05.57.15-1024x337.png\"></a> <p>Where it managed to pass by Microsoft's wearable <a href=\"http://www.microsoft.com/microsoft-band/en-us\">Band</a>! Wow :)</p> <p>This added a lot more tech people interested in nomadism and pushed the community to 500+ members. Obvious question: quantity != quality, how do you keep the user base of quality? I think it helps that I seeded it with the right type of people from the start.</p> <p><strong>Update 2014/12:</strong> We're almost at 1,500 users now and we've had our occasional spammers, predatory HR recruiters come in to the chat. To put an artificial limit on the chat's growth and keep these people out, I've added a $15 to $25 price (depending on how popular the chat is) for <a href=\"http://hashtagnomads.com/sign-up\">new sign ups</a>.</p> <h2>The future is not bromads</h2> <p>I've put a lot of effort to seed the community with people that are aware of sexism to create a gender-positive community. This isn't some politically correct ploy. I want everybody to become a nomad and to do that the community needs to be highly inclusive, non-threatening and inviting to everybody.</p> <p>There's been many previous attempts at building communities around digital nomads and location independent work. The thing is that many have been male-dominated and sexist (e.g. not nomads but bromads). I wanted this community to be about the future people that will become nomads. For me that's talented creatives like developers, designers, artists and startup founders, of any gender. And it seems like that's what it is now. That's what people from Hacker News and Product Hunt are too. And hopefully I can keep it that audience.</p> <p>To help with this I've tried my best to appoint a diverse group of moderators and admins:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/11/Screenshot-2014-11-24-14.19.22.png\"> <h2>Why is this fun</h2> <p>This is fun for a few reasons. Having my target audience for <a href=\"http://nomadlist.io/\">Nomad List</a> (and future products I want to build for nomads) engaged in a chat community allows me to see exactly what they talk about, what their problems are, interact with them and ask what they want to see built and ask for user feedback when I build products. It's a free user focus group. </p> <p>And then when I do build something new I can instantly launch it through there and have people using it and give feedback.</p> <h2>And then it all went IN REAL LIFE (IRL)</h2> <p>In just a week, the chat community has spawned a lot more. In many city channels, people were talking about meeting up with other nomads for drinks. To get more nomads in there, I made these official Nomad List meetups.</p> <p>The first one, organized by the awesome <a href=\"//twitter.com/DavidNagy\">David Nagy</a>, just happened in <a href=\"http://facebook.com/events/303539389848490/\" target=\"_new\">Berlin</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/11/mhas-1024x683.jpg\"> <a href=\"http://facebook.com/nomadlist/events\" target=\"_new\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/11/10703942_348802708624910_8365893291899530012_o-1024x768.jpg\"></a> <p>Since then, we have meetups planned in <a href=\"//www.facebook.com/events/637253813067914/?fref=ts\">Montreal</a>, Chiang Mai, Phuket, Hong Kong and Bali. People can sign up to organize their own Nomad List <a href=\"http://nomadlist.io/meetups\">digital nomad meetup</a>.</p> <img src=\"/wp-content/uploads/2014/11/meetups-1024x860.png\" alt=\"meetups\" width=\"640\" height=\"537\" class=\"alignnone size-large wp-image-3958 responsively-lazy\"> <p>It's just ridiculously crazy awesome to see that I can do this stuff which has real PHYSICAL impact while I can try and build a business next to it. And it goes both ways. The community and meetups have an actual function, and they're also a natural form of marketing for Nomad List and other products I'll be building for nomads.</p> <h2>Conclusion</h2> <p>Creating an engaging community around your product from day one is essential nowadays. You can do that on your site, or in your app, but you can also do it on other platforms, like <a href=\"http://twitter.com/\">Twitter</a> or <a href=\"http://slack.com/\">Slack</a>. Or even in real life, by letting people organize meetups. It not only helps your own product's engagement, it can also be good for real-time user research and launching new products or features to your audience.</p> <p>A community doesn't have to be completely tied to your brand. In this case, it's an informal community for nomads very loosely tied to <a href=\"http://nomadlist.io/\">Nomad List</a>.</p> <p>And it doesn't just help you, it helps people too.</p> <p>Even if everything fails business-wise, at least I know once in my life I contributed to pushing a movement I believed in forward. That's death-bed pride shit ^o^</p> <p>So....remember that tail for <a href=\"http://nomadlist.io/\">Nomad List's</a> users? Yeah, it goes up again! Yay yay ^o^</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2010/10/Screenshot-2014-10-30-02.18.59-1024x209.png\"> <p>You can <a href=\"http://hashtagnomads.com/\">sign up</a> to #nomads <a href=\"http://hashtagnomads.com/\">here</a>.</p>    <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How to successfully build a community around your startup"}},"pageContext":{"id":"5b9248cb87be056953db7bf4"}}