{"data":{"mongodbDatabaseArticles":{"id":"5b95ea7f87be05832748ffaf","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/cinqueterreit2.jpg\" alt=\"Cinque Terre view\"><br> I first came to Italy in 2006. It was one of the first stops on my just-begun round-the-world adventure. Italy was everything I thought it would be and more. If there was a country that lived up to the hype, it was Italy.</p><p><a href=\"https://www.nomadicmatt.com/travel-guides/italy-travel-tips/\">Backpacking around Italy</a>, I spent most of my time in the north. Whenever I tryied to get farther south, I always found an excuse to stay somewhere longer, and I never made it farther than Rome before previous plans dragged me north again towards Austria.</p><p>As the years went by, I often thought about returning. The wine, the food, the unexplored places. Italy called to me. This year I finally decided there&#8217;d been enough thinking and needed to be more doing. This summer&#8217;s return to Europe would include Italy.</p><p>More importantly, this trip would include southern Italy, the place I could never quite seem to get to last time. But this time, it turned out I couldn&#8217;t quite get there again.</p><p>My plan was to come into the south via Greece and work my way north to Rome. But that changed when G Adventures offered me a tour through northern Italy. Starting in Venice, the trip would take through the Cinque Terre, Florence and, finally, Rome. Eager to do the tour, I changed my plans and headed to Venice.</p><p><img src=\"https://media.nomadicmatt.com/florenceit.jpg\" alt=\"Florence view\"></p><p>While the tour used local transportation, local hotels, and had a mix of personal time and group activities, the trip moved too quickly for me. I like to spend more time in places than the few days we had in each destination. But the tour wasn&#8217;t for me. It was for the others who booked the trip. I was just an add-on. The others on the trip had a limited time in Italy, so for them, the trip was perfect.</p><p>While the trip wasn&#8217;t the south, it gave me a chance to rediscover all the cities I&#8217;d visited years back. In Venice, I met up with travel writer Lara Dunston, who I interviewed years back. She brought me to some local markets and introduced me to a restaurateur, who gave a lesson on Venice seafood and picking fish at the market. I got to marvel at the buildings and explore areas without tourist menus, where prices drop in half and crowds don&#8217;t get in your way. My first visit to Venice left me with a lukewarm impression, but seeing it again a second left me realizing just how wonderful the city really is.</p><p><img src=\"https://media.nomadicmatt.com/veniceit.jpg\" alt=\"Cinque Terre view\"></p><p>In Florence, a Twitter follower of mine gave me a market tour. I learned all about the local meats, wine, cheese, and spices. I even bought myself an old bottle of wine to celebrate someday in the distant future. I went to bars devoid of tourists, final-ly explored the Uffizi (overrated), and wandered streets far away from the center. I revisited my favorite gelato place so many times, they knew my name before I left.</p><p>In the Cinque Terre, I hiked the hard trails I missed the first time. I explored the places I loved before, ate at some restau-rants, and played guide to some of my tour group members. The Cinque Terre is one of the most beautiful places on Earth and if I could live anywhere in Italy, it just might be there.</p><p><img src=\"https://media.nomadicmatt.com/cinqueterreit.jpg\" alt=\"Cinque Terre view\"></p><p>In Rome, I saw the Sistine Chapel, went underground, finally found some sushi, and visited my favorite spot, Trastevere. Instead of racing from site to site, I relaxed and hung out. I walked around and relaxed. I have fond memories of my first time in Rome. I was with good friends and sometimes you remember places so well because of who you&#8217;re with. I wasn&#8217;t with them this time, and Rome drew me into it.</p><p>Coming back to Italy allowed me to explore below the surfaces I only scratched the first time. And that&#8217;s the beauty of returning to places you&#8217;ve been before. It gives you a chance to get a deeper sense of the place and culture. We often race to new destinations, thinking only of the places we haven&#8217;t been without considering the places we already have. Coming back to northern Italy wasn&#8217;t part of the plan, but sometimes it&#8217;s when you skip the plan that things work out.</p><p>And southern Italy? Well, I made it to Naples and <a href=\"https://www.nomadicmatt.com/travel-blogs/visiting-pompeii/\">Pompeii</a>, but that&#8217;s another story&#8230;</p><p><strong>For more information, visit my page on <a href=\"https://www.nomadicmatt.com/travel-guides/europe-travel-tips/\">backpacking Europe</a> or my guide to <a href=\"https://www.nomadicmatt.com/travel-guides/italy-travel-tips/\">Italy</a>.</strong></p></div>","title":"Rediscovering Italy"}},"pageContext":{"id":"5b95ea7f87be05832748ffaf"}}