{"data":{"mongodbDatabaseArticles":{"id":"5b95efa787be05832749011c","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">How to Find a Doctor as an Expat</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-21382\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/08/Finding-a-Doctor-as-an-Expat.png?resize=1000%2C545&amp;ssl=1\" alt=\"Finding a Doctor as an Expat\" width=\"1000\" height=\"545\"></p>\n<p>If you are looking for a family doctor or GP as an expat, there are several steps you can take to find a suitable medical professional for your needs.</p>\n<p>It is usually best to register with a doctor in your new country before the need to visit the doctor arises.</p>\n<h2><p id=\"Finding_an_Expat_Doctor_Where_to_Start\">Finding an Expat Doctor | Where to Start</p></h2>\n<p><strong>Human Resources (HR)</strong><br>\nIf your HR department provided you with relocation help, they may have a list of local doctors which are commonly used by expats and information on what you need to access them.</p>\n<p><strong>Embassy website</strong><br>\nMany embassy websites have a list of local doctors that are likely to speak your own language or a language you may be familiar with.</p>\n<p><strong>Other expats</strong><br>\nIf you have met other expats in your new location, ask them for advice or a recommendation for a doctor to get the help you need. They may have visited some of the physicians you have heard about.</p>\n<p><strong>Colleagues</strong><br>\nThis could be especially useful if you want to find a doctor close to the office you can access from work.</p>\n<p><strong>Expat forums</strong><br>\nIf sourcing the information needed to find a doctor is proving tricky or if you are in a particularly isolated location, try posting on an expat forum. Expats who have lived there before or who live close to you may be able to help.<br>\nThe process of finding a doctor may vary from country to country, so below we outlined the steps for some popular expat destinations.</p>\n<h2><p id=\"How_to_find_a_doctor_as_an_expat_in_France\">How to find a doctor as an expat in France</p></h2>\n<p>To access day-to-day healthcare in France, you must ensure you are registered in the French Social Security System. Your new employer may do this for you but ultimately it is your responsibility, so double check yourself.</p>\n<p>The <a href=\"https://www.ameli.fr/assure/english-pages\" target=\"_blank\" rel=\"nofollow noopener\">l&#8217;Assurance Maladie</a> should be your first port of call to find a family doctor (m&#233;decin traitant). Once you have chosen a suitable doctor, you need to register to access repayments of medical costs by providing the URSSAF (Unions de recouvrement des cotisations de S&#233;curit&#233; sociale et d&#8217;Allocations familiales) with several documents. Once the registration process is complete, you should receive a green card (carte vert) which is your state health insurance card. If this doesn&#8217;t happen within a few weeks, you will need to follow up as it isn&#8217;t always automatically issued.</p>\n<h2><p id=\"How_to_find_a_doctor_as_an_expat_in_Singapore\">How to find a doctor as an expat in Singapore</p></h2>\n<p>When you are looking for a family physician (the local term for a GP or family doctor) in Singapore, you must decide whether you want to see a public or private doctor. Private doctors are favored by 80% of residents in Singapore who attend one of over 1,000 private medical clinics across the city. To find one in your neighborhood, there is a search engine provided by the Singapore Medical Council that is useful. Check online or ask neighbors for a recommendation on which one to attend. The standard of medical care in Singapore is very high across the board. It will be a case of finding a practitioner that you like and trust, which may be trial and error. To book an appointment, you will need your Foreign Identification Number or passport number. Find out more about healthcare in Singapore with our <a href=\"https://www.allianzworldwidecare.com/en/support/health-and-wellness/national-healthcare-systems/healthcare-in-singapore/\" target=\"_blank\" rel=\"nofollow noopener\">detailed guide to healthcare in Singapore</a>.</p>\n<h2><p id=\"How_to_find_a_GP_as_an_expat_in_England\">How to find a GP as an expat in England</p></h2>\n<p>To access medical treatment in England you need to register with a family doctor known as a General Practitioner (GP). You can find a list of GP services on the NHS website. This is a good place to start to identify doctors in your area. Many practices will have online reviews that you can use to see if it could suit you and your needs.</p>\n<p>A GP may refuse to register you for one of two reasons:</p>\n<ol>\n<li>The practice has no capacity for new patients</li>\n<li>You do not live within the catchment area of the practice</li>\n</ol>\n<p>You may have to wait to see a GP if you are accessing their services through the NHS. Find more information on healthcare in England.</p>\n<p>You may have to wait to see a GP if you are accessing their services through the NHS.</p>\n<p>Don&#8217;t forget to look after your health if something more serious happens with <a href=\"https://www.allianzworldwidecare.com/en/international-individual-health-insurance/who-we-help/professionals/expat-health-insurance/\" target=\"_blank\" rel=\"noopener\">expat international health insurance</a>.</p>\n<p>Disclosure: This post is sponsored by Allianz Care.&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"How to Find a Doctor as an Expat"}},"pageContext":{"id":"5b95efa787be05832749011c"}}