{"data":{"mongodbDatabaseArticles":{"id":"5b937ae987be056953db7ced","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"9185\" id=\"9185\" class=\"graf graf--h3 graf--leading graf--title\">How I Got My Start Working Remotely and Turned Into Full Time Digital&#160;Nomad</h1></p><p name=\"f811\" id=\"f811\" class=\"graf graf--p graf-after--figure\">By Hailley Griffis</p><p name=\"ee97\" id=\"ee97\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--p\">I remember the first time I met an exchange student. I was 14 and living in a town of 300 people, she had just come to Canada from France and my best friend was her host family, but they didn&#8217;t speak French and she didn&#8217;t speak English.</p><p name=\"863c\" id=\"863c\" class=\"graf graf--p graf-after--p\">She quickly ended up spending time at my house so I could help translate. That&#8217;s the first time I realized <strong class=\"markup--strong markup--p-strong\">you can leave your country</strong> and I&#8217;ve been heavily committed to doing just that since then.</p><p name=\"fa01\" id=\"fa01\" class=\"graf graf--p graf-after--p\">I proceeded to convince my parents to let me go on exchange to Hamburg, Germany when I was 16 and I&#8217;ve had the travel bug ever since.</p><p name=\"a250\" id=\"a250\" class=\"graf graf--p graf-after--p\">Fast forward to today, I&#8217;m working full-time 100% of the time remotely in my dream job and sometimes I have to stop and really think through how any of this happened.</p><p name=\"c530\" id=\"c530\" class=\"graf graf--p graf-after--p\">So how did I go from enjoying exploring the world to finding a job that let me live my nomadic lifestyle? I&#8217;ve narrowed it down to three key things I did to get here and would love to share them with you.</p><h4 name=\"1eef\" id=\"1eef\" class=\"graf graf--h4 graf-after--p\">1. I Chose Remote Over Stability</h4><p name=\"5732\" id=\"5732\" class=\"graf graf--p graf-after--h4\">To start, this might sound a little insane, but I chose remote over everything else, including a stable salary with amazing benefits. When I graduated University, I had two job offers right out of the door, both wonderful. I asked both of them if I could work remotely. You see, I&#8217;d booked this one way ticket to Colombia and was determined to not have to come back to an office.</p><p name=\"fcb6\" id=\"fcb6\" class=\"graf graf--p graf-after--p\">Both companies politely declined my request to be their only remote worker so I was left with a few options.</p><blockquote name=\"e65c\" id=\"e65c\" class=\"graf graf--blockquote graf-after--p\">1. Choose stability and a normal job with benefits</blockquote><blockquote name=\"28c2\" id=\"28c2\" class=\"graf graf--blockquote graf-after--blockquote\">2. Run off to Colombia and freelance to keep my dream of remote work alive</blockquote><p name=\"7725\" id=\"7725\" class=\"graf graf--p graf-after--blockquote\">I&#8217;m sure I could have come up with more options, but I was quite sold on the second one, so I sold most of my belongings, packed up a bag and headed to Colombia. Building a freelance business isn&#8217;t easy but I managed to secure some really awesome clients. Mostly through sites like Elance (now <a href=\"http://www.upwork.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Upwork</a>) and word of mouth. <a href=\"https://medium.com/@Nomadpass/22-of-the-best-remote-job-resources-eeabbc4991ab#.bm6x1w1o6\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Check out Nomad Pass&#8217; 22 of the Best Remote Job Resources to get you out of the office and on the road.</a></p><p name=\"eaa7\" id=\"eaa7\" class=\"graf graf--p graf-after--p\">To read a bit more on this: <a href=\"http://www.huffingtonpost.com/hailley-griffis/why-i-turned-down-2-fullt_b_6282718.html\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Why I Turned Down Two Job Offers Out of University To Freelance And Travel</a></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*gzqOovlSrTZpfAI-wMNeiw.png\"><h4 name=\"fd13\" id=\"fd13\" class=\"graf graf--h4 graf-after--figure\">2. I Pushed Employers To Think About Remote&#160;Options</h4><p name=\"2535\" id=\"2535\" class=\"graf graf--p graf-after--h4\">When I did go back to having a more normal job, I was in Silicon Valley working for a startup. Trying to get as much high tech, relevant experience in my field as I could. Most startups are still figuring out workplace culture, remote practices and about a million other things.</p><p name=\"10ba\" id=\"10ba\" class=\"graf graf--p graf-after--p\">I was super lucky to have a flexible workplace in the sense that once a week we could all work from home, and if something came up with my family, the team understood and let me work remote for a week or so while I went back to help out.</p><p name=\"92aa\" id=\"92aa\" class=\"graf graf--p graf-after--p\">At places where remote work wasn&#8217;t yet being talked about as an option long-term (a few months) or short term (a few days / weeks per year) I would step up to start those conversations and see if it&#8217;s something that is a good fit for the team because it&#8217;s a priority for me. I requested to work remotely for a few weeks from Iceland, and while I was comfortable communicating primarily through video tools and chat tools my work was still new to all of this.</p><p name=\"10e6\" id=\"10e6\" class=\"graf graf--p graf-after--p\">They ended up implementing a remote work policy of one week per quarter, which is super awesome! It was inspiring to see a company go from not having guidelines here to really thinking through why they did things and how remote culture might fit in.</p><p name=\"9a17\" id=\"9a17\" class=\"graf graf--p graf-after--p\">When most of the team is in person, it&#8217;s also hard to coordinate with one remote person. I took advantage of the one week per quarter and enjoyed it endlessly. I&#8217;m most productive when working from home in my own environment and I&#8217;ve always known this about myself.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*EPXTeRhthrMZD_elXMMdmw.png\"><h4 name=\"5351\" id=\"5351\" class=\"graf graf--h4 graf-after--figure\">3. I Focused My Job Hunt on Remote&#160;Work</h4><p name=\"31c4\" id=\"31c4\" class=\"graf graf--p graf-after--h4\">Knowing that remote was always going to be a huge priority for me, I focused on finding a place that was closer to 100% remote in my next role.</p><p name=\"b286\" id=\"b286\" class=\"graf graf--p graf-after--p\">There are some great websites like remotive.io that feature only remote positions that I kept a keen eye on. I ended up coming across a posting that Buffer was looking for someone with just my skill set, it felt like the perfect fit!</p><p name=\"e188\" id=\"e188\" class=\"graf graf--p graf-after--p\">I&#8217;d been following <a href=\"https://medium.com/u/245d5483fb27\" class=\"markup--user markup--p-user\" target=\"_blank\">Buffer</a> for years now and I&#8217;ve always admired their workplace practices and <a href=\"http://www.slideshare.net/Bufferapp/buffer-culture-06-with-a-change-to-be-a-no-ego-doer\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">company values</a>. The whole team is remote and have been fully-distributed since nearly the beginning of Buffer. The amazing thing here is that because the whole team is remote, there isn&#8217;t a divide between employees that are in an office versus employees that are remote, which can be a tough challenge for remote workers. At Buffer gets the same perks and this creates such a positive work culture.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*85q-XQ5RGIvxq-k9kMy8qw.png\"><h4 name=\"df27\" id=\"df27\" class=\"graf graf--h4 graf-after--figure\">Some Fun Being a Digital&#160;Nomad</h4><p name=\"7991\" id=\"7991\" class=\"graf graf--p graf-after--h4\">Shortly after starting at Buffer, I graduated from the probation period or <a href=\"https://open.buffer.com/inside-buffer-bootcamp/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Buffer Bootcamp</a>. The same week, I dropped my things off in Canada and started traveling.</p><p name=\"aec3\" id=\"aec3\" class=\"graf graf--p graf-after--p\">With no real agenda in mind,<strong class=\"markup--strong markup--p-strong\"> I started showing up in places where I had friends, or a vague interest in exploring</strong>. I spent three weeks split between the Czech Republic (<a href=\"https://medium.com/the-nomad-chronicles/a-mini-guide-to-working-remote-in-prague-d74fc98eebac#.i68jk4cjo\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Prague</a> and a few other cities) and Vienna, Austria. Then I went back to Colombia. I had the chance to work for two weeks from Whitehorse, Yukon. The most northern point I&#8217;d ever been in Canada and as I write this post, I&#8217;m working from London, UK.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*CEmCWRFi4SWbDDkKUYqdKA.png\"><p name=\"f55a\" id=\"f55a\" class=\"graf graf--p graf-after--figure graf--trailing\">I recently decided to make Toronto my home base so I&#8217;m really looking forward to having my own space again and creating a great community in the city, while balancing it with a healthy dose of continued travel. &#128521;</p></div>","title":"How I Got My Start Working Remotely and Turned Into Full Time Digital Nomad"}},"pageContext":{"id":"5b937ae987be056953db7ced"}}