{"data":{"mongodbDatabaseArticles":{"id":"5b95ee0887be0583274900c6","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Lessons Learned After Living in Chiang Mai for Three Years</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-15759\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/03/Living-in-Chiang-Mai-Header-.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Lessons Learned After Living in Chiang Mai for Three Years\" width=\"1000\" height=\"550\"><br>\nThis week marks us living in Chiang Mai for three years. The&#160;city has certainly changed since we first arrived as has our perception of it. In lieu of this anniversary, we&#8217;ve put together some lessons we&#8217;ve learned since moving here. They aren&#8217;t the conventional takeaways about self-improvement or inner reflection but&#160;instead the&#160;things we&#8217;ve learned about the Thai town we call home.</p>\n<h2><p id=\"It8217s_not_worth_living_in_Chiang_Mai_during_the_smoky_season\"><p>It&#8217;s not worth living in Chiang Mai during the smoky season</p></p></h2>\n<p>We moved to Chiang Mai in March 2013 near the peak of the hot, smoky season and couldn&#8217;t have cared less about the air quality. Neither of us have respiratory-related health issues and since we were so excited to finally be in Chiang Mai, we didn&#8217;t give much thought to the air pollution.</p>\n<p>Four smoky seasons later, we both agree that <a href=\"https://www.tielandtothailand.com/chiang-mai-smoky-season/\">Chiang Mai&#8217;s smoky season is ugly, dusty, and completely unhealthy</a>. <strong>The skies are a hazy yellow, on the worst days we cough and suffer through nasal drip (TMI?)</strong>, and our belongings are covered by a thin film of soot and dirt both outside and inside the house. It&#8217;s bothersome enough that each year we talk about uprooting ourselves from Chiang Mai and moving away for a month or two. We&#8217;ve actually already had friends who&#8217;ve permanently moved south specifically to get away from the smog.</p>\n<p>And with all that said, the 2016 smoky season has been the the worst we&#8217;ve experienced so far!</p>\n<h2><p id=\"Chiang_Mai8217s_expat_scene_is_more_than_sexpats\"><p>Chiang Mai&#8217;s expat scene is more than sexpats</p></p></h2>\n<p>Before we were living in Chiang Mai, we got the impression that the expat demographics were almost entirely older, single European&#160;men. And even recently&#160;we&#8217;ve read articles by travel bloggers who&#8217;ve stayed in Chiang Mai for a month or two and described Chiang Mai as a haven for retired white guys shacking up with young Thai women.</p>\n<p>Sure, we were overly aware of&#160;this when we first moved here, but that&#8217;s because that&#8217;s all that anyone talked about online! <strong>Come to find out, the city&#8217;s expat demographics go way beyond that particular stereotype.</strong> There are plenty of non-Thai couples (like us!) and families from Canada, Japan, Korea, Great Britain, Australia, and South Africa;&#160;small pairs or groups of entrepreneurs; and a lot of single women of all ages.</p>\n<p>People are flocking to this town not just because it&#8217;s a place to retire affordably&#160;but to become teachers, to start up brick and mortar&#160;or online businesses, to do missionary and volunteer work, or to&#160;go&#160;on sabbatical. And even if a farang man is with a Thai lady, it&#8217;s not for us to judge. They may be in a healthy, genuine relationship!</p>\n<h2><p id=\"Rainy_season_is_beautiful\"><p>Rainy season is beautiful</p></p></h2>\n<p>We assumed that the wet&#160;season would be our least favorite season and envisioned relentless rainshowers that ranged from nonstop drizzles to&#160;heavy thunderstorms every single day. And since we owned a motorbike instead of a car, we&#160;dreaded the thought of driving anywhere. We were not looking forward to being stuck inside our house from June to October!</p>\n<p>It turns out that Chiang Mai&#8217;s daily rainshowers last about two hours a day and usually appear in the mid to late afternoon. It&#8217;s nothing like what we experienced at home- when the forecast said rain, it&#8217;d rain all day. If we&#8217;re out driving and it starts raining in Chiang Mai, we stop and put on our heavy duty ponchos we keep under our motorbike seat. Other than our shins and feet getting wet, it not that big of an inconvenience to drive in the rain since we don&#8217;t go far or fast around the Old City Moat.</p>\n<p><strong>We&#8217;re happy to admit that we look forward to this time of year.</strong> The color of the sky and land are so intensely blue and green and make for amazing photos. There are also noticeably fewer tourists in town (scared away by the hype over rainy season), so it&#8217;s safer to drive and it&#8217;s more pleasant to go into town without being smothered by crowds.</p>\n<h2><p id=\"You_CAN8217T_live_like_a_king_for_500_per_month\"><p>You CAN&#8217;T live like a king for $500 per month</p></p></h2>\n<p>It&#8217;s challenging to live&#160;comfortably on 500 USD per month in Chiang Mai, let alone like a king. This idea continues to circle around the internet and mislead aspiring expats, making it one of our biggest pet peeves.</p>\n<p><strong>To be completely honest, we&#8217;ve tried living in Chiang Mai as a couple on 1,000 USD per month and it sucked.&#160;</strong>On a budget like&#160;that we could only afford the essentials &#8211;&#160;rent, utilities, produce purchased from Thai markets to cook at home or street stall meals, and cheap clothing and home goods from Thai markets. We had little&#160;money left over for socializing or drinking (well, only the local rum and beer), traveling beyond&#160;short&#160;day trips, eating Western food more than once or twice a week (or buying Western anything for that matter), or emergency expenses.</p>\n<p>Although it&#8217;s possible to survive on 500 USD a month, you definitely&#160;<a href=\"https://www.tielandtothailand.com/cant-recommend-living-on-usd500-per-month-in-chiang-mai/\">can&#8217;t live like a king for $500 a month</a>! As we came to terms with our budget, we can agree that it&#8217;s possible for a single person (baby mama not included) to live comfortably&#160;on about 1,000 USD.</p>\n<h2><p id=\"Chiang_Mai_has_almost_everything_you_need\"><p>Chiang Mai has almost everything you need</p></p></h2>\n<p>There are hospitals, shopping malls, and international schools. As in way more than one. There are European&#160;restaurants galore and several international grocery stores. There are clinics and pharmacies, legal services, dentists, eye doctors, and specialists in maternity care.&#160;There are stores that sell health supplements and special healthcare and grooming products, clothes that fit larger, taller people, home decor, and big plushy furniture. There are incredible electronic shops and major home appliance stores. Basically, you can find almost anything you need (or at least a suitable replacement) in Chiang Mai.</p>\n<p>Here are a few examples of things we later proved ourselves wrong simply because we hadn&#8217;t been looking in the right places:</p>\n<p>1. We could hardly find freshly brewed coffee and we went months without seeing coffee beans. We were convinced that Chiang Mai only sold packets of instant coffee! We have since been proved very wrong as <a href=\"http://www.paperplanesblog.com/50-of-the-best-cafes-in-chiang-mai/\" target=\"_blank\" rel=\"noopener noreferrer\">there are countless coffee shops in Chiang Mai</a> selling fresh espresso drinks and whole and ground coffee beans.</p>\n<p>2. We spent far too much on things like bed sheets and new single voltage electronics at the big Westernized department store. We later found completely suitable alternatives for about a fifth the price at Thai markets (that we were too scared to go into before).</p>\n<p>3. We had written about&#160;<a href=\"https://www.tielandtothailand.com/ten-things-were-glad-we-brought/\">10 Things We&#8217;re Glad We Brought</a>. We eventually found everything on that list in Chiang Mai during our first year here, even down to the Old Bay (a seasoning used in Chesapeake Bay region on America&#8217;s east coast).</p>\n<p>If you can&#8217;t find it in Chiang Mai, take an hour and twenty-minute flight to Bangkok. Whatever you&#8217;re trying to find is there.</p>\n<h2><p id=\"Your_head_will_explode_after_looking_for_help_from_online_forums\"><p>Your head will explode after looking for help from online forums</p></p></h2>\n<p>Yes, we too scoured the online forums before moving here. Later we turned to Facebook groups for more. <strong>To get to the good bits of information, one must dig through opinionated remarks, trolling, and slander.</strong> The constant trash talking from&#160;<a href=\"https://www.tielandtothailand.com/8-rotten-ways-bad-expat-in-thailand/\">bitter expats</a>&#160;and the answers that are regularly&#160;off topic, incomplete, or judgmental&#160;ultimately devalue the forums and make them hardly worth the effort to read. The times that we&#8217;ve stuck it out to find out what we&#8217;ve needed, &#160;we have to a few deep breaths to clear our minds and calm down afterward. Jokingly we sometimes feel like we need a beer or a glass of wine!</p>\n\n\n\n<strong><p>FUN FACT:</p></strong> These forums and Facebook groups are what ultimately inspired us to become the blog we are today and eventually set up the <strong><a href=\"https://www.tielandtothailand.com/membership-info/\">Thailand Expat Academy</a></strong>. After feeling misinformed and frustrated one too many times, we figured we could offer concise, complete, and generally opinion-free information for&#160;expats who had the same questions and curiosities as we do.\n\n\n\n<h2><p id=\"Chiang_Mai8217s_cool_seasonis_actually_freezing_at_night\"><p>Chiang Mai&#8217;s cool season&#160;is actually freezing at night</p></p></h2>\n<p>Ok, maybe not literally 32&#8304;F (0&#8304;C) freezing but in the months of December, January, and February, nights can get surprisingly cold!&#160;Sadly, people die in Chiang Mai after particularly cold nights. We were shocked when we first learned this. How was that&#160;possible if&#160;the nightly temperatures hovered only around 55&#8304;F (13&#8304;C) during that time of year?</p>\n<p>While it may sound like the perfect evening&#160;temperature to&#160;some people (admittedly we thought that was a bit chilly&#160;but certainly not cold),<strong> it&#8217;s a lot different when your body has&#160;acclimated to Chiang Mai&#8217;s daytime temperature of 90&#8304;F (32&#8304;C) or higher</strong>. Plus if it&#8217;s&#160;55&#8304;F outside, it&#8217;s nearly 55&#8304;F inside&#160;the house, too. That&#8217;s because&#160;apartments, condos, and houses here don&#8217;t have proper insulation. Based on what we&#8217;ve seen at construction sites and from what we can tell about our own house, walls are constructed using a single layer of concrete or wood.</p>\n<p>If you&#8217;re living in a Thai style house then it&#8217;s really&#160;cold. These types of houses stay cool based on&#160;a&#160;design that allows cross breezes along the ceiling. Sure, it&#8217;s great on hot days, but it allows cold winter air to pool&#160;into the house at night. Oh, and houses aren&#8217;t equipped with heaters (and definitely not fireplaces), and neither are cars.&#160;Combined with the lack the proper cold-weather clothing, this time of year is&#160;actually pretty miserable!</p>\n<h2><p id=\"We_learn_a_lot_from_other_Chiang_Mai_blogs\"><p>We learn a lot from other Chiang Mai blogs</p></p></h2>\n<p>Chiang Mai continues to surprise us. Thanks to other blogs and travel websites, we continue to stumble across fun things to do and places to visit in and around Chiang Mai. <strong>We also enjoy reading blog posts written by people who are living in Chiang Mai</strong> and are sharing&#160;their experiences about working, volunteering, or simply exploring Thai life. Their articles&#160;come off as honest and fresh and it reminds us when we had those same thoughts and feelings.</p>\n<p>Sometimes we read posts about Chiang Mai with caution simply because this city is&#160;written about so often and people tend to describe it in extremes. They either express their frustrations or infatuations after only living here for a few weeks and they make&#160;broad stroked implications that all of Chiang Mai is like that.</p>\n<p>Ahhh, now&#160;we sound like disgruntled, know-it-all old time expats! To be fair, we&#8217;ve looked back on some of our oldest blog posts and cringed at some of the things we&#8217;ve said. We admit to using the wrong terminology, screwing&#160;up facts, or simply coming across as naive. It really came down to two things: we hadn&#8217;t had enough time to explore and experience Chiang Mai to draw unbiased conclusions and we hadn&#8217;t met enough expats who shared their own experiences and tips so that we had a well-rounded, representative perception of the city.</p>\n<h2><p id=\"Chiang_Mai_isn8217t_pet-friendly\"><p>Chiang Mai isn&#8217;t pet-friendly</p></p></h2>\n<p>We had wrongly assumed that the pet culture in Thailand would be the same as it was in the USA. From our own experience and what we&#8217;ve gathered from most of our friends who own pets here, <a href=\"https://www.tielandtothailand.com/thailand-pet-friendly/\">Chiang Mai is not pet friendly</a>.<strong>&#160;If you have a little foofoo dog it&#8217;ll be generally ok (we think every we know can agree on that) but if you want to have a cat or a big dog, you&#8217;ll be SOL.</strong></p>\n<p>Teeny tiny dog breeds (Chihuahuas, Pugs, Pomeranians, Maltese, Miniature Poodles, Terriers) are very popular in Chiang Mai and you can guarantee that your pup will be coddled and coo&#8217;ed over by the Thai community. &#160;There are plenty of shops selling itty bitty collars and jackets and booties and small bags and cans of dog food.&#160;But what about big dogs? Large bags of dog food and big&#160;supplies and heavy duty toys are&#160;nearly impossible to find. There is also a severe street dog problem in Chiang Mai, making it difficult to safely walk your dog no matter what their size is.</p>\n<p>As for cats, Thais generally don&#8217;t like them. We have been told very matter-of-factly on more than one occasion that they are &#8216;dirty.&#8217; It was hard to swallow at first but now we understand why: the vast majority of cats in Chiang Mai are feral, so the only ones you see are the ragtag, slinky little demons that let loose nightmarish howls at night, leave &#8216;kitty cookies&#8217; in fenced-in yards, and mark their territory like dogs do.&#160;We brought our cat from the USA and it&#8217;s been difficult to finding a place to live that allows felines indoors, probably because Thai cats really are pretty icky.</p>\n<p>That&#8217;s not to say you shouldn&#8217;t bring your beloved cat or dog to Thailand, but it means there will be limitations and some hangups regarding pet care, pet safety, and living situations.</p>\n<h2><p id=\"What8217s_in_store_for_us_in_the_future\"><p>What&#8217;s in store for us in the future?</p></p></h2>\n<p>Who knows what we&#8217;ll be doing this time next year or even three years from now. But at the moment, we&#8217;re happy here and love that Chiang Mai is our home and has turned into a hub that allows us to easily travel to other parts of Thailand and Southeast Asia.</p>\n<p>&#8595; PIN THIS POST FOR LATER &#8595;</p>\n<p><img class=\"aligncenter size-full wp-image-15763\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/03/Living-in-Chiang-Mai-Pinterest.jpg?resize=500%2C833&amp;ssl=1\" alt=\"Not your conventional lessons learned about self-improvement or inner reflections. This is about what we've learned after living in Chiang Mai, Thailand | Tieland to Thailand\" width=\"500\" height=\"833\"></p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Lessons Learned After Living in Chiang Mai for Three Years"}},"pageContext":{"id":"5b95ee0887be0583274900c6"}}