{"data":{"mongodbDatabaseArticles":{"id":"5b9382f687be056953db7e11","content":"<div><h1 name=\"0ccf\" id=\"0ccf\" class=\"graf graf--h3 graf--leading graf--title\">How we Build and Sustain a Remote&#160;Team</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*m0qGNEXlg4s8zV9Ekg7twg.jpeg\"><p name=\"0990\" id=\"0990\" class=\"graf graf--p graf-after--figure\">The terms &#8220;remote team&#8221; or &#8220;distributed team&#8221; have become familiar concepts in the startup world. Entrepreneurs realize nowadays there&#8217;s <a href=\"https://open.buffer.com/no-office/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">no need to invest in offices</a> (especially in overpriced tech and talent hubs), but rather <a href=\"http://blog.sketchfab.com/post/91763526774/the-future-of-work-is-already-here\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">let people work when and where they are the most happy and productive</a> in places that are key for the business.</p><p name=\"5f4a\" id=\"5f4a\" class=\"graf graf--p graf-after--p\">I believe that letting people choose their &#8220;happy place&#8221; instead of holding them to a fixed location or working hours can produce a huge boost in their productivity and creativity, but most of all, it has the power to keep them fulfilled and happy in the long run. We all have a life outside of our work and we want to make most of it. Our inner happiness often comes from people and places around us and fuels our passion for work.</p><p name=\"e6a9\" id=\"e6a9\" class=\"graf graf--p graf-after--p\">Sean Kim put it perfectly: &#8220;By adopting a culture of trust and respect, you&#8217;re empowering individuals to not just show up, but to show results&#8221;.</p><p name=\"bc6c\" id=\"bc6c\" class=\"graf graf--p graf-after--p\">As of September 2015,<a href=\"https://open.buffer.com/the-50-teammates-milestone-buffers-september-investors-report/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"> Buffer has more than 50 people on board</a> who are fully distributed across different timezones. They <a href=\"https://open.buffer.com/working-across-multiple-time-zones-tools-strategies-help-us-connect/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">communicate with each other using a set of collaboration tools</a> that bring them closer together.</p><p name=\"ff84\" id=\"ff84\" class=\"graf graf--p graf-after--p\">At Piktochart, we&#8217;ve only just gotten acquainted with this concept as we&#8217;ve introduced Customer Success and Community Evangelist roles&#8202;&#8212;&#8202;after successfully sustaining a remote team of Customer Delight agents&#8202;&#8212;&#8202;based outside our HQ in Penang, Malaysia.</p><p name=\"2dde\" id=\"2dde\" class=\"graf graf--p graf-after--p\">We needed people to be closer to the majority of our customers, operating in their timezone, and building relationships face-to-face. We were also fishing for new talents which has become a challenging task in our corner of Malaysia.</p><p name=\"0c2e\" id=\"0c2e\" class=\"graf graf--p graf-after--p\">We&#8217;ve realized that we all need personal and frequent interaction to keep each other motivated and focused. We&#8217;re new at this, and it&#8217;s a huge challenge, so it&#8217;s essential to provide people with the right mindset from the start, as well as the proper <a href=\"https://www.groovehq.com/blog/remote-team-tools\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">tools to keep their spirits high and help them stay productive</a> on a daily basis.</p><h4 name=\"0b8e\" id=\"0b8e\" class=\"graf graf--h4 graf-after--p\">Make sure to bring the right people on&#160;board</h4><p name=\"0399\" id=\"0399\" class=\"graf graf--p graf-after--h4\">When I interview people for our marketing team, I look for that special sparkle, for something that will tell me this person loves what they do and believes in our product. Getting passionate people on board who <a href=\"http://piktochart.com/our-values/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">agree with your values</a> is the key to long-lasting relationships, which are especially important to cultivate over long distance.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*-n5zpAVuVc5c17NRgKxHSw.png\"><p name=\"5850\" id=\"5850\" class=\"graf graf--p graf-after--figure\">It does help to recruit people with prior remote work experience, though. They will already have developed good working habits and will have the proper motivation and self-discipline necessary for working remotely.</p><p name=\"98e2\" id=\"98e2\" class=\"graf graf--p graf-after--p\">Regardless of whether someone has worked this way before or not, I make sure potential candidates have a can-do and positive attitude, are able to make their own decisions, and have the spirit of an entrepreneur. You need people who will stay focused on tasks and goals, who are able to take initiatives, and see the big picture. This is far more important than sticking to fixed working hours.</p><h4 name=\"5dea\" id=\"5dea\" class=\"graf graf--h4 graf-after--p\">Onboard them&#160;well</h4><p name=\"34fb\" id=\"34fb\" class=\"graf graf--p graf-after--h4\">Even the most independent people with entrepreneurial attitudes need guidance at first. You need to make sure that they are not lost and know exactly what&#8217;s expected of them. We like to give people a little push now and then, but otherwise we let them grow into their roles by taking the path they&#8217;re most comfortable with, while sticking to the company OKR&#8217;s we help them set. You might think of:</p><ul class=\"postList\"><li name=\"3942\" id=\"3942\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Onboarding documents</strong> - We create a clear and simple document with a welcome message, list of tasks and a set of tools and tips with a bunch of links that can help executing those tasks. It helps new people get off the ground and feel more organized from the start.</li><li name=\"bec2\" id=\"bec2\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Onboarding face-to-face</strong> - Even when someone is located across the world, we try to fly our new team members in for a month to work alongside their new team, learn how we operate but most of all, to experience our company culture which is the hardest thing to convey over distance.</li></ul><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*A30PkfIqwhEBNGV8WXUVrw.jpeg\"><h4 name=\"020e\" id=\"020e\" class=\"graf graf--h4 graf-after--figure\">Involve them in what&#8217;s happening in the&#160;company</h4><p name=\"0561\" id=\"0561\" class=\"graf graf--p graf-after--h4\">It&#8217;s hard for those working remotely to feel the company&#8217;s atmosphere, so we try to involve people in what&#8217;s happening in the office.</p><p name=\"dbf4\" id=\"dbf4\" class=\"graf graf--p graf-after--p\">We recently started recording our weekly Monday Morning Meetings (MMM&#8217;s), where we talk about important updates, introduce new projects and go through every project scrum. We also provide recordings of our Wednesday Presentations where two random team members present on various fun or educational topics of their interest&#8202;&#8212;&#8202;how to train your dog, how to be more productive or how to brew a perfect coffee, etc.</p><p name=\"ad31\" id=\"ad31\" class=\"graf graf--p graf-after--p\">Recordings are then uploaded to YouTube or Google Docs and posted on our remote-team Slack channel for all of to access. Additionally, we stream our monthly company event, WebCamp and other events or conferences we attend <a href=\"http://piktochart.com/build-community-with-periscope/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">directly on Twitter via the Periscope app</a>. It helps immensely in making people feel like they are part of the team, and gives them an opportunity to live the moment with others.</p><h4 name=\"ec88\" id=\"ec88\" class=\"graf graf--h4 graf-after--p\">Equip yourself with the right&#160;tools</h4><p name=\"b286\" id=\"b286\" class=\"graf graf--p graf-after--h4\">Technology is in our favour. We have numerous apps at our disposal that help us with time and project management. Often it becomes challenging to choose just one and I end up using several of them to manage my to-do lists and communication over multiple time zones. Every team and company has their own set of tools that work for them, but for us, these make up the core:</p><ul class=\"postList\"><li name=\"da29\" id=\"da29\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Slack</strong>&#8202;&#8212;&#8202;This is where everything happens. We have several channels for projects, teams or events where we discuss everything or ramble about nothing in particular (we even have a channel dedicated to puns!)</li><li name=\"9ad0\" id=\"9ad0\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Google Docs&#8202;</strong>&#8212;&#8202;We produce a huge amount of content, and here&#8217;s where we keep everything that matters organized neatly by teams and projects. Everyone can proofread and provide their take on drafts. It&#8217;s so much fun to work together on the same piece of content at the same time when you&#8217;re in a completely different country!</li><li name=\"5818\" id=\"5818\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Trello</strong>&#8202;&#8212;&#8202;This is where all of our Kanban projects sit, and where we organize our tasks into boards and action items. For instance we have one <a href=\"http://piktochart.com/organize-blog-calendar/\" class=\"markup--anchor markup--li-anchor\" rel=\"nofollow noopener\" target=\"_blank\">dedicated board to content marketing</a> where we store ideas, guidelines and move posts along the editorial funnel. The goal is to provide transparency on what everyone is working on and be able to manage individual tasks efficiently.</li><li name=\"8a00\" id=\"8a00\" class=\"graf graf--li graf-after--li\"><a href=\"http://www.fioapp.co/\" class=\"markup--anchor markup--li-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--li-strong\">Fio App</strong></a><strong class=\"markup--strong markup--li-strong\">&#8202;</strong>&#8212;&#8202;Folks at FIO say: &#8220;Scattered across endless lands and open oceans, time zones are problematic&#8221;. Damn right. Piktochart&#8217;s marketing team is scattered across five different time zones and the distance is felt, but apps like FIO help us be mindful about each other&#8217;s working times and realize when the best time for communication is.</li></ul><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*3XXG9qF5VSVdXcFdZ8Ylvg.png\"><h4 name=\"702b\" id=\"702b\" class=\"graf graf--h4 graf-after--figure\">Develop a Habit of Regular Communication</h4><p name=\"406a\" id=\"406a\" class=\"graf graf--p graf-after--h4\">When you don&#8217;t communicate regularly, you quickly lose touch and feel disconnected. That&#8217;s why it&#8217;s important to maintain:</p><ul class=\"postList\"><li name=\"dfee\" id=\"dfee\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Daily scrums </strong>-<strong class=\"markup--strong markup--li-strong\"> </strong>all team members list what they worked on the previous day, what they are working on today, and what their bottlenecks are. All via Slack which we recently integrated with <a href=\"https://statushero.com/\" class=\"markup--anchor markup--li-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Status Hero</a>. Everyone checks in during their morning and has a report from the team waiting in the evening. When some of us wake up on the other side of the globe, it&#8217;s great to see what others are up to and to provide feedback where necessary.</li><li name=\"8f65\" id=\"8f65\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Weekly face to face phone calls</strong> -<strong class=\"markup--strong markup--li-strong\"> </strong>We&#8217;ve noticed that people tend to avoid face to face interaction as time passes. That&#8217;s why we try to have regular follow-up calls where we actually see each other, rather than just communicate solely through text or audio calls.</li><li name=\"2d2a\" id=\"2d2a\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Monthly one-on-ones and team meetings</strong> -<strong class=\"markup--strong markup--li-strong\"> </strong>As a team leader guiding my team from a distance, I try to organize and make the most out of our monthly 1-on-1&#8217;s. That&#8217;s the time we make sure to turn on our cameras and discuss everything that presents a potential challenge. It keeps relationships fresh! We also hold a monthly marketing team meeting via Google Hangouts. Everyone goes through their scrum and updates the rest of the team on what&#8217;s coming up. That&#8217;s the ideal moment to identify areas where we could team up and collaborate between each other (or to hold a spontaneous jam session).</li></ul><h4 name=\"cfe5\" id=\"cfe5\" class=\"graf graf--h4 graf-after--li\">Invest in proper team&#160;building</h4><p name=\"ead0\" id=\"ead0\" class=\"graf graf--p graf-after--h4\">Nothing brings people closer together like a face-to-face company meeting. With more and more remote team members on board, we&#8217;ve invested in proper time together this year and flew people in for a company trip in Australia. We took some time off and focused on building relationships. Having met my teammates face to face for the first time helped me understand them better and made our daily collaboration much more enjoyable and successful.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*EKB8Miu7Q15M8AmqBjrCQQ.jpeg\"><p name=\"e3de\" id=\"e3de\" class=\"graf graf--p graf-after--figure\">Much like maintaining a long-distance relationship, managing remote teams is not an easy task. But with proper tools and working habits, you can build a team of happy and passionate people who value their freedom. They&#8217;ll develop ideal work-life balance which will translate into an awesome product.</p><p name=\"03a4\" id=\"03a4\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">How do you manage remote teams? What are your favorite apps to boost productivity and improve communication between time zones? What challenges do you face and how do you approach them?</strong></p><p name=\"71e1\" id=\"71e1\" class=\"graf graf--p graf-after--p graf--trailing\">This article was originally published <a href=\"https://www.linkedin.com/pulse/how-we-build-sustain-remote-team-marta-olszewska\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">here</a>.</p></div>","title":"How we Build and Sustain a Remote Team – This Publication is Moved – Medium"}},"pageContext":{"id":"5b9382f687be056953db7e11"}}