{"data":{"mongodbDatabaseArticles":{"id":"5b9624f187be058327490f43","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">152 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p>Richard McColl is a freelance journalist and author based in Bogota, Colombia. He is currently pursuing a PhD and also runs a small hotel,&#160;<a href=\"http://www.lacasaamarillamompos.com/\" target=\"_blank\">La Casa Amarilla</a>, in colonial Mompos. His podcasts &#8220;Colombia Calling&#8221; can be downloaded on&#160;<a href=\"https://itunes.apple.com/cr/podcast/colombia-calling-living-working/id657800894?mt=2\" target=\"_blank\">iTunes</a>&#160;and&#160;<a href=\"http://www.stitcher.com/podcast/colombia-calling-living-and-working-in-colombia\" target=\"_blank\">Stitcher</a>. After my recent trip to Colombia I was able to catch up with Richard who talks about Mompos, opening a hotel, and how tourism in the country has changed over the past 10 years.</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-RDqKL72/0/690x690/i-RDqKL72.jpg\" alt=\"richard mccoll\" width=\"690\" height=\"460\"></p>\n<p><strong>Richard, how did you end up in Colombia?</strong></p>\n<p>It seems like a long time ago that I decided to move to <a href=\"https://foxnomad.com/countries/colombia-travel-information/\">Colombia</a>! I moved here full time in 2007 after almost 6 years of freelance writing, guiding and organizing social projects all over Latin America. I had come here to Colombia on a few occasions before, once with the environmental NGO <a href=\"https://www.worldwildlife.org/\">World Wildlife Fund</a> (WWF) to report on the state of the communities on the Pacific Coast and write about the mangroves. It was quite the adventure at a time when this region of Colombia truly was off-limits and I guess I was left with a real feeling of affection towards the people. Something about Colombia always kept drawing me back here and finally after working and traveling in every country in the region, I decided to go about getting my journalist visa and make my move here permanent.</p>\n<p><strong>What changes have you noticed in the time you&#8217;ve been in Colombia?</strong></p>\n<p>Colombia has most definitely changed since I moved here in 2007. There has been a huge increase in tourism. Back in the day, if you saw another foreigner in the street you would stop to chat with them so infrequent was this occurrence, now, you cannot swing a cat without seeing or hearing another gringo in some parts of town! Of course this is a direct result of increased and improved <a href=\"https://foxnomad.com/category/travel/security/\">security</a> in many regions of the country&#8230; and of course perceived improvements in security. Colombia was an unknown destination for obvious and justifiable reasons, now it seems to be a fashionable destination.</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-79qD2Jn/0/690x690/i-79qD2Jn.jpg\" alt=\"La Casa Amarilla mompos\" width=\"690\" height=\"460\"></p>\n<p><strong>What type of traveler would Mompos interest most?</strong></p>\n<p>Mompos is not for everyone, I&#8217;ll be the first to admit this. It is an adventure because it still represents an older and more forgotten Colombia where a colonial town &#8211; which still belongs to the locals unlike a city such as Cartagena &#8211; maintains its authenticity and atmosphere. If you are interested in architecture, history and nature &#160;&#8211; as we are located in the middle of a huge wetland filled with bird-life &#8211; then this is the place for you. This is not a destination which will overwhelm you with activities to tick off on a list but if you want to soak up an original feeling, wander through an open-air museum, perhaps shop for locally made jewelry and enjoy somewhere where you feel as if you are the only tourist and a pioneer, then Mompos should be on your list.</p>\n<p><strong>Many tourists don&#8217;t seem to know about Mompos, why do you think that is?</strong></p>\n<p>Mompos doesn&#8217;t appeal to everyone nor is it part of the &#8220;first wave&#8221; of destinations to visit in Colombia. As it is quite far away &#8211; which is an attraction for some travelers &#8211; can be off-putting. It is still very much a pueblo in that it&#8217;s a small town and the tourist infrastructure is in its infancy really. Mompos is not ready for a huge wave of tourism either, it needs to come in measured fashion so as to protect what is here and provide an economic stimulus for the town without being damaging.</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-cgdVHj5/0/690x690/i-cgdVHj5.jpg\" alt=\"la casa amarilla mompos colombia\" width=\"690\" height=\"460\"></p>\n<p><strong>What are some of the easiest ways to get to Mompos from Bogota and Medellin?</strong></p>\n<p>The best way in my opinion is to fly from Bogota or Medellin to the airport of Corozal. From here you can catch a car to Magangue and cross the river to Mompos from there.</p>\n<p><strong>Many travelers are often heard saying they want to open a hostel/hotel but few actually do. How did <a href=\"https://www.booking.com/hotel/co/la-casa-amarilla.html?aid=886993\">La Casa Amarilla</a> go from idea to reality?</strong></p>\n<p>Yes, moving from the chatter about opening an establishment to actually doing so is a big step. In my experience, I actually just bought a wreck of a colonial house before having the idea of opening a <a href=\"https://foxnomad.com/category/travel/lodging/\">hostel</a>. I just wanted to restore a house. It then became evident that in order to do so and to maintain the house the building needed to generate an income since the upkeep of a colonial house in the tropics is expensive. Now, we are no longer a hostel but a very good mid-range hotel with only 10 rooms and catering to people from all over the world and from all walks of life. Also, in Mompos I had to go about changing the idea that people had here of what an international tourist really wanted, there was no real understanding of the market&#8230;it has been a long but rewarding process.</p>\n<a href=\"https://foxnomad.com/2017/10/31/osprey-daylite-daypack-review-road-tested-1-year-heavy-use/\" target=\"_self\" rel=\"nofollow\" class=\"IRPP_button\"><p class=\"ctaButton\">RELATED</p><p class=\"postTitle\">Osprey Daylite Daypack Review: Road Tested After 1 Year Of Heavy Use</p><p class=\"postImageUrl\"></p></a><p></p>\n<p><strong>How would you recommend someone plan a trip around Colombia, including Mompos on the itinerary?</strong></p>\n<p>Colombia is blessed with so much to see and this can also be her downfall. So, it kind of depends on how much time you have and what you want to get out of your trip. If you only have a week or two then my recommendation is to focus on some small areas and to fly in between cities to save time. If you have longer then you have more options open to you.</p>\n<blockquote><p>As there are now direct flights from the U.S. to Cartagena and Barranquilla on the Caribbean coast, the options for discovering some of the north coast are quite ample. You could go to Cartagena for its sophistication, Mompos for forgotten Colombia, up to Santa Marta and Tayrona Park for beaches, beyond into Minca for nature and then circle back to Cartagena for your flight.</p></blockquote><p>Or if you want to head first to Bogota and then go North, then why not follow a colonial route of Colombia. You could go from Bogota to Villa de Leyva, to San Gil and Barichara, on to Mompos and then to Cartagena. This way you cover half of the country. Of course, don&#8217;t write off Southern Colombia either. Bogota, San Agustin, the Coffee Zone, Popayan and Cali are well worthwhile too!</p>\n<p>Thank you very much Richard for taking the time to share your knowledge about Mompos and traveling in Colombia. You can hear more about what Richard&#8217;s advice from all around Colombia on his podcast &#8220;Colombia Calling&#8221; which you can find on&#160;<a href=\"https://itunes.apple.com/cr/podcast/colombia-calling-living-working/id657800894?mt=2\" target=\"_blank\">iTunes</a>&#160;and&#160;<a href=\"http://www.stitcher.com/podcast/colombia-calling-living-and-working-in-colombia\" target=\"_blank\">Stitcher</a>.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Journalist Richard McColl Talks About Colombia’s Forgotten City, Mompos"}},"pageContext":{"id":"5b9624f187be058327490f43"}}