{"data":{"mongodbDatabaseArticles":{"id":"5b95f4db87be058327490138","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">10 American Habits We Lost After Moving to Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-13001\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/07/American-Habits-Lost-Header-1000px.jpg?resize=998%2C626&amp;ssl=1\" alt=\"10 American Habits We Lost After Moving to Thailand\" width=\"998\" height=\"626\">We did a little reflecting on our life abroad and&#160;realized that there are definitely some American habits we lost after moving to Thailand. From being more low key and flexible to not taking life so seriously, we&#8217;ve thought back to how Thai culture has rubbed off on us, and you know what, it&#160;hasn&#8217;t been&#160;a bad thing!</p>\n<h2><p id=\"01_nbspHaving_High_Restaurant_Service_Expectations\"><p>01 &#160;</p>Having High Restaurant Service Expectations</p></h2>\n<p>We&#8217;ve both worked in restaurants when we were younger, so that&#8217;s definitely contributed to our forgiving attitude when we eat out and treating waitstaff with respect and patience. <strong>In Thailand, our patience has grown even more because&#160;we no longer expect the attentive service like we had growing up in America.</strong></p>\n<p>Service? Yes. But good service? No.</p>\n<p>We&#8217;ve learned that:</p>\n<ul>\n<li><p>Food arrives at the table when it&#8217;s finished being made in the kitchen. That means there is really no timing difference between an appetizer and an entr&#233;e. And sometimes <p>people may be taking the last bites of their meals while others are just getting theirs.</p></p></li>\n<li><p>We don&#8217;t expect our servers to tend to our table after our food is delivered. If an order&#160;isn&#8217;t right, if we&#8217;re missing a side or condiment, or if we need a refill, we catch our server&#8217;s eye and call them over. The check is only delivered when we ask for it or if the place is closing.</p></li>\n<li><p>Special requests to the menu are acknowledged but are either completely ignored (even though our server is nodding their head and say they understand us) or it comes out wrong. Once we ordered a cheeseburger but the menu only offered hamburgers. What we got was a bun with a slice of cheese without a&#160;burger &#8211; no joke!</p></li>\n</ul>\n<p>And you know what? We&#8217;ve learned that it&#8217;s not a big deal!&#160;</p>\n<h2><p id=\"02_nbspRelying_on_Big_Brother_Warnings_to_Keep_Us_Safe\"><p>02 &#160;</p>Relying on Big Brother Warnings to Keep Us Safe</p></h2>\n<p>Caution: Wet Floor signs in clear view after someone mopped the tiled entrance of a hotel? Nope.</p>\n<p>Guard rails on steep trails, foot paths, or overhangs on cliffs? Not really.</p>\n<p>Red tape or warning signs around crumbling sidewalks or two foot wide uncovered man holes?&#160;Nada.</p>\n<p>We do admit seeing a Caution: Hard Hat Area&#160;sign where construction was being performed. Yeah, several times, actually.</p>\n<p>At first we were startled to see such lack of warning signs in Thailand. How could people properly function in society without being spoon fed safety warnings?! But the longer we lived here, the more refreshing it was.<strong>&#160;</strong>One can argue that<strong> Thai citizens and&#160;foreigners&#160;are expected to open their eyes and&#160;take responsibility for their own actions.</strong></p>\n<p>And you know what? Using common sense works!</p>\n<p>To this day, no one we know&#160;has&#160;gotten hurt by their own lack of awareness and tried suing the life blood from the company or property where the accident happened. Americans, take a hint!</p>\n<h2><p id=\"03_nbspDepending_on_a_Car_and_All_the_Road_Rules\"><p>03 &#160;</p>Depending on a Car and All the Road Rules</p></h2>\n<p>Owning a motorbike and using it as the main vehicle seems to be pretty common in Thailand but&#160;oh-not-so-much in the USA. We jumped on that bandwagon and&#160;<strong>traded in our car for a&#160;motorbike</strong> since the weather is motorcycle friendly year round and we don&#8217;t have to drive hundreds of miles a week anymore. We also walk more and use public transportation such as&#160;trains,&#160;buses, and songthaews that are plentiful in many Thai towns.</p>\n<p>Yes, we&#8217;ve given up car-related luxuries like being able to listen to the radio, cool off with air conditioning, protect ourselves from the rain and sun, style our hair without fear of it matting from a helmet, and having&#160;plenty of trunk space for groceries.</p>\n<p>On the flip side, we think it&#8217;s pretty great keeping our expenses down (we could afford to buy our bike in cash and now spend less than 1,000 baht per month on gas), we love being able to zip through long lines of traffic, plus park wherever we want.</p>\n<p>As far as road rules, we&#8217;re still safety nuts and wear our helmet when riding around on our motorbike. We also carry with us our Thai driver licenses and motorbike registration/green book if we&#8217;re pulled over.</p>\n<p>But beyond that,<strong> we&#8217;ve learned to <a title=\"Driving Tips in Thailand\" href=\"https://www.tielandtothailand.com/driving-tips-thailand/\">drive like the locals do</a>. </strong>Strictly abiding by road rules is<strong>&#160;</strong>definitely one of those American habits we lost after moving to Thailand. Sometimes it&#8217;s actually safer to break conventional road&#160;rules and just go with the flow of traffic.</p>\n<h2><p id=\"04_nbspWearing_Shoes_Indoors\"><p>04 &#160;</p>Wearing Shoes Indoors</p></h2>\n<p>In Thailand we wear our shoes in most&#160;buildings, but<strong> we always remove our shoes when entering someone&#8217;s house and leave&#160;them at the entrance. Always.&#160;</strong></p>\n<p>In fact, our shoe purchases are based around whether they are easy to slide on and off. Buh-bye laces!</p>\n<p>Now a days we have an inner battle when someone says &#8220;Oh, it&#8217;s ok if you leave your shoes on&#8221; and they proceed to walk into their house wearing shoes. Gah!</p>\n<p>We just can&#8217;t do it and default to taking off our shoes. In fact, if there&#8217;s carpet, we&#8217;re downright squeamish at the idea of wearing shoes inside because of how filthy the soles are.</p>\n<h2><p id=\"05_nbspBeing_Carefree_in_the_Sun\"><p>05 &#160;</p>Being Carefree in the Sun</p></h2>\n<p>In America, golden bronzed skin is often seen as the symbol of having leisure time and vacation money. In Thailand, untanned skin is preferred. Combined with the fact that we&#8217;re just about to hit our 30&#8217;s and can see evidence of those infamous fine lines, we&#8217;re more conscious of sun exposure.</p>\n<p>Often we wear sunblock or make it a point to stand in the shade.<strong> Sometimes we wear long sleeves or light jackets in the blazing sun so we don&#8217;t burn, even if it&#8217;s over 100 degrees. Angela goes nowhere without her umbrella.</strong> What we used to think was silly when people walked around under an umbrella on a&#160;non-rainy day, we now think is very practical. We prefer that small circle of shade to the burning Thai sun.</p>\n<p>We don&#8217;t go as far as slathering on whitening lotion on our skin, though, which is all too common in Thailand.</p>\n<h2><p id=\"06_nbspLiving_a_Fast_Paced_Life\"><p>06 &#160;</p>Living a Fast Paced Life</p></h2>\n<p>Life has slowed down a lot in Thailand! We were both type A personalities back in the US with a go-go-go mentality but now we have much more laid back attitudes. It&#8217;s because we&#160;have a&#160;flexible schedule (blogging and freelancing at home sure beats long commutes and 40+ hour work weeks in an office) and&#160;the Thai mai bpen rai attitude has rubbed off on us, too.</p>\n<p><strong>With an open schedule, we aren&#8217;t pressured to do anything. This means leisurely taking care of adult responsibilities and errands, but it also means we don&#8217;t feel the need pack our weekends full of activities, either.</strong></p>\n<p>We welcome our time to relax, too. Before, Angela thought that an hour and a half of yoga class was boring and a waste of time. She&#8217;d prefer 30 minutes of intense cardio or weightlifting instead. There was no room in her schedule to indulge in relaxing! Now she looks forwards to a mentally and physically relaxing yoga session and feels great afterwards.</p>\n<h2><p id=\"07_nbspBeing_On_Time\"><p>07 &#160;</p>Being On Time</p></h2>\n<p>About that&#8230;</p>\n<p><strong>We are no longer punctual and don&#8217;t expect others to be on time either.</strong> Meeting friends for coffee or lunch? Even if we arrive 15 minutes late and our friends aren&#8217;t there, we don&#8217;t stress about it just wait patiently until they arrive. It used to be we would get a slew of texts or calls if we were two minutes late. Now we&#8217;re on Thai time.</p>\n<p>And what if we&#8217;re going to a caf&#233; or restaurant that advertises its opening time at 8:30am, but it&#8217;s 9:00am and the lights are still off? While we might be a bit irritated because we can&#8217;t get our morning caffeine fix, we would simply try again on another day at a later time. In America, the attitude would be more along the lines of: &#8220;How dare they not open on time. That&#8217;s unprofessional. We ain&#8217;t never coming here again!&#8221;</p>\n<p>There are times where it is important to be on time in Thailand, such as catching the bus or a flight, because those still leave on schedule. We can&#8217;t get too lax!</p>\n<h2><p id=\"08_nbspPaying_with_Credit_Cards\"><p>08 &#160;</p>Paying with Credit Cards</p></h2>\n<p>Thailand is a cash-based society. So aside from&#160;whipping out credit cards to make a rare purchase at a major grocery store or mall, <strong>we had to get comfortable with handling paper money and coins.</strong></p>\n<p>That meant recognizing the new currency (and heaven forbid not handing over a 1,000 baht bill&#160;instead of a 100 baht bill), picking through coins in our wallet while people queued up behind us, and correctly doing mental math, typically in Thai, in our head for the correct amount or change.</p>\n<p>It also meant planning ahead for an evening out or other expenditures and asking ourselves, &#8220;Do we have enough cash on us or do we need to swing by the ATM? Do we have enough money at all, or do we need to wait until next week when we have more funds?&#8221;</p>\n<p>After paying off all of our debt before moving to Thailand and then adjusting to a pay-as-you-go lifestyle, we prefer this because&#160;it helps us stay debt free. It sure beats spending beyond our means and racking up credit card debt.</p>\n<h2><p id=\"09_nbspNeedlessly_Spending_Money\"><p>09 &#160;</p>Needlessly Spending Money</p></h2>\n<p>We have better control over our spending habits. Without the constant bombardment of commercials (none here on our English channels or on Netflix), magazine advertisements, or radio commercials (we can&#8217;t listen to any on our motorcycle), we don&#8217;t feel the urge to buy the latest gadget or service.</p>\n<p>We&#8217;ve also scaled way back on impulse buying. It used to be that we&#8217;d buy a bottle of wine or six pack of microbrew on our commute home. Or a few plants for our deck during an afternoon shopping spree. Or a 55 inch flat screen TV. You know, just &#8216;cuz.&#160;This is one of those&#160;American habits we lost after moving to Thailand and don&#8217;t regret it one bit.</p>\n<p>Most of all, after spending over six months selling our belongings and whittling everything down to two checked bags and a carry-on each before moving to Thailand, we still have a lingering fear of collecting too much junk and having to do it all over again. <strong>Before we buy anything, we usually ask ourselves if we would feel like selling it later? The answer is almost always &#8220;No.&#8221;&#160;</strong></p>\n<h2><p id=\"10_nbspRelying_on_Modern_Day_Appliances_for_Domestic_Chores\"><p>10 &#160;</p>Relying on Modern Day Appliances for Domestic Chores</p></h2>\n<p>We don&#8217;t own a dishwasher, a garbage disposal, a clothes dryer, or an onsite water filter. <strong>We also don&#8217;t have all of those fancy dancy kitchen appliances that are in most American households.</strong></p>\n<p>We hand wash our dishes and are careful to keep the sink strainer in place so food bits don&#8217;t clog the pipes. It&#8217;s not as convenient,&#160;but at least we&#8217;re thankful that the kitchen is inside our house since that is not often the case in traditional Thai houses and even some apartments.</p>\n<p>We line dry our clothes because we don&#8217;t have a clothes dryer. And while we prefer the smell of sun dried laundry, we&#8217;ve learned that clothes fade faster if left out in the direct sun and they definitely stretch out without the high heat of a dryer to shrink them back into shape. You should see the size of some of our ankle socks! We also have to schedule our laundry around the weather and can&#8217;t do it on rainy or cool days or else we have to bring the drying rack inside and point our floor fan on it.</p>\n<p>One thing that&#8217;s tedious is planning ahead making sure there&#8217;s enough drinking water in the morning after a night out or enough cooking water after we&#8217;ve settled in for the evening&#160;and want to cook rice or pasta.</p>\n<p>And as far as kitchen appliances like toasters, blenders, coffee makers, or food processors, we don&#8217;t have any of these. Since we have no idea how long we will be living in Thailand or even how long we&#8217;ll be in the same house or apartment, we rather not have to deal with boxing them up and shipping them every time we move. Toast is overrated and we use a small French press, anyways.</p>\n<h2><p id=\"We_Don8217t_Regret_thenbspAmerican_Habits_We_Lost_After_Moving_to_Thailand\"><p>We Don&#8217;t Regret the&#160;American Habits We Lost After Moving to Thailand</p></p></h2>\n<p>So some of our habits reflect some sacrifice on our part, but mostly we think our experiences have been positive and character building. We think the biggest change we&#8217;ve seen in ourselves&#160;is being more patient and allowing ourselves to relax. No matter where you are from in the world, we think everyone could use a little more patience and relaxation in their lives, don&#8217;t you think so?</p>\n<p>&#8595;&#160;PIN THIS POST FOR LATER&#160;&#160;&#8595;</p>\n<p><img class=\"aligncenter size-full wp-image-14354\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/07/American-Habits-Pinterest.jpg?resize=471%2C624&amp;ssl=1\" alt=\"A look at ten American habits we lost after moving to Thailand. Life is quite different on the other side of the world! | Tieland to Thailand\" width=\"471\" height=\"624\"><br>\n&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"10 American Habits We Lost After Moving to Thailand"}},"pageContext":{"id":"5b95f4db87be058327490138"}}