{"data":{"mongodbDatabaseArticles":{"id":"5b92489187be056953db7bba","content":"<blockquote><p>@ 2h32m03s</p><p>Dan Bilzerian on <a href=\"//en.wikipedia.org/wiki/Hedonic_treadmill\">hedonic adaptation</a></p><p> <strong>Dan Bilzerian:</strong> The sweet is never as sweet without the bitter.</p> <p>I have an interesting outlook on that because I've bought pleasure for so long.</p> <p>You can't buy happiness. You can buy pleasure though.</p> <p>A lot of people will say \"oh money isn't happiness but money can buy you a boat, and a boat will make you happy\".</p> <p>When I was 16, my dream car was a Mustang Cobra. So if I got a Mustang Cobra, I would have been at a 10.</p> <p>But, a Ferrari would also bring me to a 10, but you can't get higher than a 10.</p> <p>Let's just say, I got a Ferrari when I was 16, and now we flash forward and I graduate college and my dad gives me a BMW M5. </p> <p>If I had the Ferrari, now I'll be at a 7. Because I'm stepping down on the car. But if I had the Mustang Cobra, now I'm going to an M5, I'll be back at a 10.</p> <p>It's the same car, you're the same person, you're at the same spot in life, the only difference is your perspective because of your previous experience.</p> <p><strong>When people ask why rich people aren't as happy, I just think it's because they've upped the bar so far that only the best things satisfy them.</strong></p> <p>When I got out of bootcamp, I went to Outback Steakhouse, I am at a 10.</p> <p>Now if I go to the best restaurant in the world, I might be at a 6 or 7. I'm just satisfied. I got 3 chefs, I eat the best food all the time. That doesn't make me happy anmore.</p> <p>If somebody bought me a Lamborghini, I'd be \"whatever\". I've had them, I don't care.</p> <p>But if you give it to a guy off the street, he'd be at a 10.</p> <img src=\"/wp-content/uploads/2016/10/marginal-happiness-money-graph.png\" alt=\"marginal-happiness-money-graph\" width=\"302\" height=\"251\" class=\"alignnone size-full wp-image-7212 responsively-lazy\"> <p><strong>So I can't buy happiness anymore. I've bought everything that I ever wanted. There's not really anything I want anymore.</strong></p> <p>If you gave me a regular car, and put me in a regular hotel, I would be below the normal level. Whereas a normal person, would be happy to be on a vacation.</p> <p>That has some correlation. A guy that wins the lottery, a year later he is statistically less happy than a guy that got his leg amputated, a year prior.</p> <p><strong>Joe Rogan:</strong> That's interesting. It's also what are you trying to do. There are a lot of people who are trying to get rich because they think once they'll be rich, they'll be happy. They think that that's going to give them this thing that they've always been missing. So they've been working hard, busting their ass, and they look at all these other people.</p> <p><strong>You land your private jet, you drive your Bentley to the club. You want to be that guy.</strong></p> <p>But once you're that guy, that doesn't mean anything anymore.</p> <p>So for a lot of people, there's this emptiness. There's nothing left to chase. There's nothing else to do. And your life is just about possessions and upping the ante. And now I gotta get a yacht. And now I gotta get the biggest yacht. And now I need to buy an island. Trying to find something to fill that void because you've sort of set your life up to chase these material goals, instead of to try to find out what actually does make you happy.</p> <p><strong>Dan:</strong> Yeah, you have to have goals. <strong>You gotta be climbing the mountain. Because at the end of the day, climbing the mountain is far more satisfying than being at the top of the mountain.</strong></p> <p><strong>Joe:</strong> Isn't that weird though? That's not what we've ever been taught.</p> <p><strong>Dan:</strong> Well, it's counter intuitive. My dad told me \"it's better to give than receive\". From the time you're a little kid, you get something, you're happy. You get a boat, you're happy. If I have this bike, I'll be happy. And it's true and it works. But there's a point, and you almost have to get really rich to understand that, you have to buy all that shit, okay I got it all, it made me happy. But it's temporary. That's where I differentiate the happiness and the pleasure. You can buy the pleasure, but the pleasure is so much shorter lived.</p> <p><strong>Joe:</strong> I had a conversation with someone about this recently where I was saying that material posessions, once you have enough money to basically acquire anything you want, they don't mean anything anymore. You can enjoy them when you have them but if you lose them, it's not really that big of a deal. If you get an Escalade car, and a meteor hits your Escalade. You get out there. And you think \"oh just get another Escalade\". There's a bunch of them. It's no big deal. But if that was all you had, and you had to save to get that Escalade. And you kept it clean and it got by a meteor, you'd be devastated.</p> <p>Once you have achieved this level of success where material possessions don't mean anything anymore then you can ask \"waht do I enjoy?\". Camaraderie, friendship, creativity. What is it that I'm actually chasing? Because I remember talking to this Buddhist monk, I went to all these different religions, for this TV show. And I interviewed all these different people and asked them \"what is it about your religion that is the best?\". And the Buddhist guy was saying that sex and all these material possessions, they possess you. And to be completely free, you have to be abstinent. And free of material possessions. And I said \"why?\". What if you achieve a level of success where you don't worry about those things anymore. And they don't contain you. They don't hold you. You're not a prisoner of them. Because you're really not worried about them. If all you had was this one thing and that one thing was taken from you that would be devastating. And that's what this is based on. But what if you had unlimited resources? If you were Richard Branson or someone like you? It's not an issue. Then those material possessions no longer posses you. This guy didn't wanna look at it that way. He didn't wanna think that was ever an option. I said you don't think it's an option because you don't think it's possible for you to ever achieve that level of material possession.</p> <p><strong>Dan:</strong> And that's kind of a thing, I feel you have to get to that place to understand it.</p> <p><strong>Joe:</strong> 99.9% of people listening to this are never going to make a fraction of the amount of money you've earned.</p> <p><strong>Dan:</strong> But in some ways that's a blessing because they're going to have a lifetime of being able to buy that pleasure too because of that. Because if you start on this lower run, then all those little purchases, you're enjoying them. <strong>Their baseline is just lower.</strong></p> <p><strong>Joe:</strong> They get a new fishing rod, they're pumped.</p> <p><strong>Dan:</strong> Exactly. And when that wears off, they're going to get a new reel. And then a new depth finder. It's the little stuff, if that makes them happy. Then that's okay. </p></blockquote>  ","title":"“I can’t buy happiness anymore. I’ve bought everything that I ever wanted. There’s not really anything I want anymore.”"}},"pageContext":{"id":"5b92489187be056953db7bba"}}