{"data":{"mongodbDatabaseArticles":{"id":"5b92489c87be056953db7bc4","content":"<div><p>[ THIS IS A DRAFT, DON'T SHARE PLEASE, 2017-08-06 ] </p> <p>TL;DR<br> This was a hard blog post to write. Because it's full of love and hate for this gigantic city.</p> <p> I love LA's internationalness and it's diversity. It's literally the entire world packed into one city. There's every cutlure you can think of and they'll have their own food and identity going here. </p> <p> Then there's the size of it which makes everything difficult. There's the wannabe aspect of the city with everyone taht comes here wanting to become succesful (because they have to pay their bills). Which means mostly everyone is obsessed with themselves. And that makes it a very lonely place.</p> <h2>Los Angeles is not a city</h2> <p> Strap in because this will get confusing quickly.</p> <img src=\"/wp-content/uploads/2017/08/950px-LA_County_Incorporated_Areas_Los_Angeles_highlighted.svg_.png\" alt=\"\" width=\"950\" height=\"780\" class=\"alignnone size-full wp-image-8079 responsively-lazy\"> <p> Los Angeles County (the giant somewhat square-y box) is a county in the state of California with a population of almost 10 million people. Los Angeles County has a city in it called, yes, the City of Los Angeles (depicted in red), which has about 4 million people in it. The City of Los Angeles in turn has 80 districts and neighborhoods, a lot of which used to be towns of their own but were incorporated into LA over time.</p> <p> LA is 12,305 sq. km (or 4,750 sq. miles). To compare, I'm from the Netherlands which is just 3x the size of LA! This means LA is so gigantic, it's ridiculous to even consider it as one city. Formally it is a city, but it just isn't in any practical sense. And that right there is the biggest mistake people make when visiting LA. This is what people talk about when they talk about the cliche'd \"LA sprawl\".</p> <p> But I think that's bullshit. You don't talk about the Netherlands' giant sprawl. It's just because it's a giant area that people have called a city.</p> <h2>So if it's not a city, what is it then?</h2> <p> Well, it's a collection of \"areas\" really, each with about 100,000 to 500,000 people living there. And each has a completely different cultural identity. I'd roughly divide LA up into:</p> <a href=\"//hoodmaps.com/los-angeles\"><img src=\"/wp-content/uploads/2017/08/Screenshot-2017-08-06-19.27.08.png\" alt=\"\" width=\"2940\" height=\"1636\" class=\"alignnone size-full wp-image-8076 responsively-lazy\"></a> <p> - Venice (next to Santa Monica)<br> - Hollywood<br> - Beverly Hills<br> - West Hollywood (or locals say We-Ho)<br> - Silverlake / Echo Park (hipsters)<br> - Inglewood (near airport)<br> - Central LA / Koreatown<br> - Downtown LA (business district)<br> - South LA</p> <h2>Cost of living</h2> <p> Expensive AF<br> $2,000 rent</p> <h2>Weather</h2> <p> Nice all-year round, maybe a bit too hot</p> <h2>Smog</h2> <p> ?</p> <h2>Social life</h2> <p> When I arrived here, I tried meeting as much people as possible and get some social life going. I can tell you, this has been quite a struggle. So much so that I've pretty much given up on having a social life in LA. And I'm not the only one.</p> <p> There's a few reason that interact into one of the most challenging places to get a social life going.</p> <h3>The \"LA monologues\"</h3> <p> See, the people that come to LA and live here are a certain breed. And I'm going to heavily generalize here but, generally the people I met in LA were very, very fascinated by themselves. I'd have breakfast, lunch, dinner or drinks with them and it was mostly them talking about them. A lot.</p> <p> I became somewhat fascinated by this. I'd try to participate in the (one-on-one) conversation and share my reaction to them, my view point, my story. And it'd be a short confirmation \"ah yes, okay\" and then a fast continuation of their previous monologue. I'm generally an extravert but here I was forced into introvercy.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">SHIT THAT'S WHAT I DID &#128561;</p> <p>&#8212; Adriana Vecc @ &#127482;&#127480; (@AdrianaVecc) <a href=\"//twitter.com/AdrianaVecc/status/891808150533226496\">July 30, 2017</a></p></blockquote> <p></p> <p> It wasn't just me though. I'd be having coffee somewhere and look around and there'd be a young customer just unloading their entire life onto a politely nodding barista who probably wanted to GTFO.</p> <p> Surely, it was a gradient. There was extremely self-obsessed people and lesser self-obsessed people and a few exceptions. But generally, this kept happening.</p> <p> I was in shock. Because this wasn't an American thing so much: I had just been in New York City for a month. In NYC, people were so curious about me that they'd be asking questions about where I was from, what I was doing here and the questions wouldn't stop. And we'd talk until the early hours asking each other questions. You know, asking questions? Interest in other people than yourself. HEY LA!</p> <p> NYC was dialogues.</p> <p> LA was monologues.</p> <p> Repetitive monologues too. All the time. You'd meet people for a second time and they'd tell the same stories again. It's as if everyone had about 4 stories, and half of them were sales pitches for their own ego and they'd just repeat them to every stranger, friend, partner, dog, cat or fish. It was a fucking shit show. It became so bad that from my 4th week I just stopped meeting people altogether and became a total recluse.</p> <p> I was done.</p> <h3>Everywhere is a one-hour drive</h3> <p> All in all, building anything that resembled a social life here was gonna be hard. And it wasn't just the people with their monologues that made it hard. LA had some fundamental problems that were related to it being called a city when it wasn't really a city.</p> <p> After a few weeks here, I'd made friends (or well acquintances) all over in Highland Park, Silverlake, Koreatown, West Hollywood, Downtown LA, Venice and Santa Monica. The problem was, whenever we'd organize to hang out in a group, it'd be 1 to 2 hour drives to just get somewhere. </p> <img src=\"/wp-content/uploads/2017/08/Screenshot-2017-08-06-19.42.11.png\" alt=\"\" width=\"2918\" height=\"1498\" class=\"alignnone size-full wp-image-8077 responsively-lazy\"> <p> Therefore, the cost in \"time\" of hanging out became quite expensive. So people just didn't hang out. We tried a lot. It became me driving places for an hour or more at a time. To then hang out somewhere for a few hours and then drive back for another hour or two (during rush hour).</p> <p> This was getting tedious. And people would just flake. I started flaking too. Added too that was that LA people will smile and say \"yes\" to any invite but then often not actually show up. </p> <p>To make friends you need two important things: proximity and repetition. That means you need to have people near you and you need to repeatedly see them in multiple occasions to establish some kind of relationship. LA failed miserably in exactly these two requirements. Nobody was proximate to each other, and with everyone being flakey AF there was no sense of repetition either.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">In general It&#8217;s very hard to make friends (by EU standards) in Southern CA. After 6mo in SD, me and my gf made 3 friends. All from EU lol</p> <p>&#8212; Michal Ptacek (@ptacekmi) <a href=\"//twitter.com/ptacekmi/status/892579991572983808\">August 2, 2017</a></p></blockquote> <p></p> <p>Oh LA &#175;\\_(&#12484;)_/&#175; what are you doing to me.</p> <h3>No alcohol</h3> <p> Now, in many cities, meeting people revolves around gatherings at night. That means bars, clubs, house parties and generally settings where people drink alcohol. What surprised me about LA, is that so many people here don't really drink alcohol. So I tried to figure out why? Was it the health-concious vibe of wannabe stars?</p> <p> Again, it was due to LA's size. If we meet for cocktails in a bar in the east part of LA, I then have to drive back home later to Central LA because there's no real public transport available. So I might have one cocktail or two max because I don't want to be driving under influence of alcohol (or anything else). That's a very good reason. But it limits the traditional social setting. So people will quit after two drinks. I'm not such a staunch supporter of weekly alcohol anyway, so maybe this was good. But the reality was it'd limit the \"social lubrication\" aspect that alcohol brought to meet people.</p> <p> Luckily, I definitely saw Uber and Lyft are slowly having an effect on LA's culture in this respect. Angelino's are selling their cars and switching to these apps. TODO</p> <h3>Work never stops</h3> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">well if you have $5000/month mortgage and lease 3 family cars there is probably no choice :D</p> <p>&#8212; Michal Ptacek (@ptacekmi) <a href=\"//twitter.com/ptacekmi/status/892582213530796033\">August 2, 2017</a></p></blockquote> <p></p> <p> The other problem was due to LA's cost of living, it's one of the most expensive places to live in the world with rents averaging $2,000/month. So for people to live here, they have to pay a lot of money on rent and food (okay, mostly rent). That means that to make this money, they'd have to work a lot. And a lot of the people I met here were obviously creatives and freelancers. Exactly people that don't work normal hours and don't really have a limit to how much they work.</p> <p> All in all, that means people really don't have a lot of time to hang out socially in LA. And if everything here is about work, it means that any social event becomes somewhat of a potential work event. That means lunches are for networking, dinners are for networking, pool parties are for networking, roof top clubs are for networking. Yes, these parties you see on Instagram in LA are great, but many are hired beautiful people in pools for celebrities and businesses. Aesthetics is work and work is aesthetics. And work never stops. Because mostly everyone is here to get succesful. How else are you going to pay that rent? The vicious cycle.</p> <p> I started connecting the dots. Maybe they talked about themselves so much because everything was a networking event and they were selling themselves. Ah...jackpot! </p> <h2>Diversity (TODO)</h2> <p> The flipside of having such a big city is that if you have so many different areas in one place, all these areas have their own identity. And that's where LA has something that no other city can come close to. Diversity.</p> <p> As much as LA is obsessed with itself, this also means people are very proud of their own identity. And they like to keep it.</p> <p> The greatest example of this is Koreatown, where I stayed for a few weeks. It's 40,000 Korean-Americans of which most were born in Korea. It's a total mindfuck as it's roughly 20 by 40 blocks of mostly Korean people, Korean signs, Korean businesses, Korean churches, Korean hospitals, Korean food, Korean coffee shops and Korean cars. It's even more a mindfuck if you actually been to South Korea, and it literally just looks the same. From the nouveau artifical looking buildings to the giant Korean alphabet pasted on to everywhere to old Korean men in parking lots having a cigarette at 2 AM. It's Seoul. Pretty much.</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">&#9989; Yes, does seem like &#127472;&#127479;Korea here! CHECK! <a href=\"//t.co/1pJ66BOye1\">pic.twitter.com/1pJ66BOye1</a></p> <p>&#8212; Pieter Levels (@levelsio) <a href=\"//twitter.com/levelsio/status/883880831781019648\">July 9, 2017</a></p></blockquote> <p> </p> <p> You then walk south east from Koreatown into the edge of Downtown LA and you'll end up in what's pretty much Mexico. It's Mexican people, Mexican food, Mexican cars, Mexican laundromats, Mexican street art, Mexican cafes, Mexican churches and Mexican dentists. The complete mindfuck happens if you're in between Koreatown and this area:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">On the edge of &#127472;&#127479;Koreatown and &#127474;&#127485;Mexican LA and it's so weird (and great) to see this <a href=\"//t.co/NF4lvghEib\">pic.twitter.com/NF4lvghEib</a></p> <p>&#8212; Pieter Levels (@levelsio) <a href=\"//twitter.com/levelsio/status/886761150553116672\">July 17, 2017</a></p></blockquote> <p> </p> <p> Actually most of LA is Hispanic. The biggest majority are Mexican (1.2 million) but 800,000 Hispanics are from other countries.</p> <img src=\"/wp-content/uploads/2017/08/original-1.jpg\" alt=\"\" width=\"1272\" height=\"697\" class=\"alignnone size-full wp-image-8075 responsively-lazy\"> <p> If you then walk north, okay who am I kidding, you take an Uber north and you end up in Silver Lake, which is now almost completely hipster beards. </p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">&#9989;YES, this is MOST DEFINITELY &#127877;\"hipster mecca\" &#128514; I've seen &#127877;beards, &#127912;wall art, &#127877;beards, &#9749;&#65039;&#127868;latte's,&#127877;beards, &#127867;craft beer and &#127877;beards &#9989;&#9989;&#9989;&#9989; <a href=\"//t.co/ZlA6LbIPsK\">pic.twitter.com/ZlA6LbIPsK</a></p> <p>&#8212; Pieter Levels (@levelsio) <a href=\"//twitter.com/levelsio/status/883894869407576065\">July 9, 2017</a></p></blockquote> <p> </p> <h2>Recommendations</h2> <p>TODO<br> so what i recommend, pick ONE area to stay in for a month or longer. don't hop around. pick a place like silver lake, echo park, koreatown, west hollywood or venice depending on your personality. DON'T move around. stick there. try to make friends THERE. deal with that area as if it's the city you live in. you're allowed to make weekend trips to other \"cities\" in LA that are an hour away. but stay in your area so you get to know it and make friends. if you spend your time spread over the ENTIRITY of LA it will just be pain. it would take a decade of living in all these places, and you'd still have no idea how LA would work. it's simply too big. if you stick to one place you'll be happier because your cafe, work, lunch, bar, club, gym etc. are all there, so you have a base to meet people in repetitive proximity (important).</p> <h2>Conclusion</h2> <p>For all its faults, LA is so easy to hate. It takes effort to love this place. And the worst is, LA won't come out and try to make you love it. LA doesn't care about you. Actually nobody in LA cares about you. LA is a city of extraverts. A city of people that talk too much about themselves and can't listen. But that's just how they roll. </p> <p>LA people make other people care about them by showing how much they care about themselves. It's no wonder Hollywood is here. Celebrities do that for their job!</p> <p>So coming here and thinking LA is going to embrace you and take you out and make you happy. Nope. But if you fight for it and put time in (and I think you need to be here for 6 months at least to get even a little somewhere), I think you'll start to see how much it has to offer. It takes time and I think it takes longer than the time I was here (a month or so). It's the city quintessential of America's philosophy, it's where everyone comes from outside, and they're all there with a goal. Whatever that goal is. And in that way it's a lot more welcoming than any other place. A foreigner in the Netherlands, Sweden or Japan will hardly ever be accepted as a real local. But anyone can be a local in LA. Everyone's import here. And that's really amazing.<br> TODO</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"If you put the entire world in one city, you get Los Angeles"}},"pageContext":{"id":"5b92489c87be056953db7bc4"}}