{"data":{"mongodbDatabaseArticles":{"id":"5b95ea3d87be05832748ff90","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/flashpackingnow001.jpg\" alt=\"Man working on a laptop\">Posted: 02/04/2016 | February 4th, 2016</p><p>Flashpacking is a term used to describe backpackers who upscale their travels. They travel with a backpack but they stay in nicer digs, carry fancy electronics, tend to be a bit older, have a bit more money to spend, and don&#8217;t cook in hostels every day. They are backpackers with means. This distinction has been around for a few years and, as I&#8217;ve traveled around this past year, I think is totally meaningless. In fact, I believe we have all morphed into a &#8220;flashpacker.&#8221; The old way of travel &#8211; a backpack, <a href=\"http://forums.nomadicmatt.com/topic/883-whats-the-best-budget-travel-destination/\">a few bucks</a>, and a worn guidebook is well behind us.</p><p>When I first started traveling in 2006, I hardly ever saw someone with a cell phone and barely a few people with an <a href=\"https://nomadicmatt.com/travel-blogs/best-travel-cameras-gear/\" rel=\"noopener\" target=\"_blank\">SLR camera</a> and never with a laptop. Hostels had computers but hardly any had Wi-Fi. Eighteen months later when I traveled Australia after <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/\" rel=\"noopener\" target=\"_blank\">living in Thailand</a>, I noticed a lot of travelers had phones, some hostels had Wi-Fi but few had computers.</p><p>Now everywhere I go, I see mobile phones, Wi-Fi available, netbooks, and SLR cameras. And I see expensive phones, too. I&#8217;m amazed at the number of people with <a href=\"https://nomadicmatt.com/travel-blogs/smartphones-for-travel/\" rel=\"noopener\" target=\"_blank\">smartphones, iPhones, and Blackberries</a>. Moreover, there are a lot of people carrying MacBooks and expensive PCs &#8211; it&#8217;s not just netbooks travelers have. In short, backpackers are much more wired today than they used to be.</p><p>The nature of backpacking has totally changed and it&#8217;s not going back. This isn&#8217;t a good or bad thing but just a reflection of our connected and different times. Walk into an Internet caf&#233; or a hostel and take a look at the computers. Everyone is on Facebook. Facebook is as ubiquitous on the road as it is back home. Also, it&#8217;s typical that I&#8217;m not the only one laboring over <a href=\"https://nomadicmatt.com/travel-blogs/travel-technology/\" rel=\"noopener\" target=\"_blank\">my laptop</a> in the hostel common room.</p><p>Back in the &#8220;real world,&#8221; people are <a href=\"https://nomadicmatt.com/travel-blogs/travel-technology-gear/\" rel=\"noopener\" target=\"_blank\">used to being digitally connected</a>. We&#8217;re used to having our cameras and our phones taking pictures. What used to be expensive and inconvenient on the road (and, thus only available to &#8220;flashpackers&#8221;) is now cheap and easy for all.</p><p><img src=\"https://media.nomadicmatt.com/flashpackingnow002.jpg\" alt=\"A laptop in a fancy office\"><br> As I sit and write this post, I am in my hostel&#8217;s common area. It&#8217;s dinner time and the place is full. Next door, on the leather couches in the common room are <a href=\"https://nomadicmatt.com/travel-blogs/technology-ruined-travel-experience/\" rel=\"noopener\" target=\"_blank\">five backpackers on computers</a>. In the kitchen and around me are backpackers not in the cheapest clothes available but wearing name brands like Diesel and Armani. A girl just walked through carrying a hairdryer on the way to her room. This is not your parent&#8217;s backpacker crowd.</p><p>Hostels have upscaled in response to this and as this has become widespread, we expect it to be standard. But while that is a change, the biggest thing I have noticed is not about style but about behavior. I&#8217;ve noticed a dramatically changed notion of security. Back when I started traveling, people had PacSafes and took great pains to keep their stuff locked up. Now, I see people leaving phones on their beds, iPods plugged in while they are out, and bags unlocked. When I first started traveling with a laptop, I brought it out in secret. I was always afraid someone would take it. Now, I sit in my bed typing away. People just don&#8217;t seem as worried as they used to be.</p><p>Moreover, now that backpackers seem to have some extra money, there is a whole network of backpacker services looking to help them spend it. Travelers seem to be taking more tours, more hop-on/hop-off buses, and staying at nicer and more expensive accommodation. They are looking for the backpacking experience with all the ease of a prepaid holiday. In New Zealand, I&#8217;d say about 75% of travelers use one of the backpacker buses. In Europe, I&#8217;ve noticed more and more travelers flying between destinations. In Asia, more tours are springing up for young travelers.</p><p>I don&#8217;t see this freight train stopping anytime soon. I suspect as common as iPods are today, computers will be tomorrow. But the rising affluence of most travelers means that even those who are &#8220;broke&#8221; will still carry their toys and comforts on the road with them. For me, that&#8217;s OK so long as once in a while they unplug, take out the iPod, and interact with the destination they spent so long saving to interact with.</p><p><strong>Update 2016:</strong> I was right! Nowadays everyone has at least one smart device on them when they travel. High-tech cameras are everywhere. Hostels everywhere are like mini-hotels now and woe to the establishment that doesn&#8217;t have Wi-Fi. That freight train didn&#8217;t stop. The term Flashpackers went out of style shortly after I wrote this post because, it turned out, we all became flashpackers. Flashpacking is just what backpacking is these days!</p><p><strong>Related articles:</strong></p><p>&#160;</p><h3>How to Travel the World on $50 a Day</h3><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\"><img class=\"\" src=\"https://media.nomadicmatt.com/bookimages/howtotraveltheworld_v3cover.jpg\" alt=\"conquering mountains: solo female travel by kristin addis\" width=\"200\" height=\"273\"></a>My New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences. <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"Are We All Flashpackers Now?"}},"pageContext":{"id":"5b95ea3d87be05832748ff90"}}