{"data":{"mongodbDatabaseArticles":{"id":"5b95ef2487be05832749010b","content":"<div><h2><p id=\"If_you8217ve_visited_Bangkok_before_or_prefer_something_a_little_less_touristy8230\"><p>If you&#8217;ve visited Bangkok before or prefer something a little less touristy&#8230;</p></p></h2>\n<p>&#8230;then try out these markets for some independent exploration. These are also free to visit (no entrance fees!) and you can count on being one of few foreigners there:</p>\n<h3><p id=\"Chinatown8217s_Talat_Noi_and_Sampeng_Lane\"><p>Chinatown&#8217;s Talat Noi and Sampeng Lane</p></p></h3>\n<p>Chinatown is MASSIVE, so it&#8217;s a little misleading when guidebooks recommend going there without mentioning a specific area. Otherwise, you waste precious time wandering down streets that may have&#160;little going on. We visited Talat Noi and Sampeng Lane in one trip (thanks to this detailed <a href=\"https://thestreetsofbangkok.blogspot.com/2010/05/walking-tour-talat-noi-sampeng-and.html\" target=\"_blank\" rel=\"noopener\">walking tour</a>, which began right outside the Royal Orchid Sheraton&#8217;s front doors. Talk about convenient!)</p>\n<p><img class=\"aligncenter size-full wp-image-16733\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/10/Chinatown-Talat-Noi.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Chinatown Talat Noi\" width=\"1000\" height=\"550\"></p>\n<p>Talat Noi gives you a taste of old Bangkok (pre-skyscrapers) and has machinery&#160;parts spilling out of doorways and onto the small streets. Sampeng Lane is fascinating simply because of the sheer volume of STUFF. It&#8217;s like Alibaba or Amazon incarnate within the sweltering bowels of Bangkok. You&#8217;ll be happy to learn that even&#160;though it&#8217;s an open-aired market, the shopkeepers blast their AC, which will prevent you from melting completely.</p>\n<h3><p id=\"Soi_Rambuttri\"><p>Soi Rambuttri</p></p></h3>\n<p>Dare we utter (write?) the words &#8216;Khao San Road&#8217; on this blog but this infamous street is actually one of the better-known landmarks near Soi Rambuttri. That&#8217;s because the two roads run parallel with each other. Soi Rambuttri is lined with small eclectic shops, boutique caf&#233;s and restaurants, and plenty of opportunities for foot massages. It&#8217;s an all-around charming place to visit.</p>\n<h3><p id=\"Floating_Market\"><p>Floating Market</p></p></h3>\n<p>Bangkok&#8217;s two largest and most popular floating markets are nearly&#160;100 kms from the city center. However, the <a href=\"https://www.tielandtothailand.com/taling-chan-floating-market/\">Taling Chan Floating Market</a> is a smaller, lesser known market that doesn&#8217;t take long to get to and can be explored in about an hour. We recommend this if you are comfortable exploring Bangkok on your own.<br>\n</p>\n<blockquote class=\"instagram-media\">\n<p></p>\n<p><a href=\"https://www.instagram.com/p/BL08chojFgD/\" target=\"_blank\" rel=\"noopener\">There is nothing quite like allowing yourself to get lost in a busy Bangkok morning market! &#127823;&#128248;&#127961; #Bangkok #Thailand #Markets #1HourGEM #&#3585;&#3619;&#3640;&#3591;&#3648;&#3607;&#3614; #&#3611;&#3619;&#3632;&#3648;&#3607;&#3624;&#3652;&#3607;&#3618; . Check out our recent article over on the blog for a mini guide of things to do during your next visit to the city.</a></p>\n<p>A photo posted by Thailand Travel Blog &#127481;&#127469; (@tielandtothailand) on Oct 21, 2016 at 6:50am PDT</p>\n</blockquote>\n<p></p>\n<p>The vendors sell small snacks grilled right on their boats or fresh produce. You can feed the wriggling schools of catfish and carp of the market&#8217;s pier,&#160;get a foot massage under a shady tree, or even take a short ride up and down the canals in a longtail boat for 100 baht a person.</p>\n<h2><p id=\"If_you_have_a_full_uninterrupted_day8230\"><p>If you have a full, uninterrupted day&#8230;</p></p></h2>\n<p>&#8230;as in, you arrived in Bangkok the night before and won&#8217;t be leaving until late the next night, then travel somewhere away from the city center. The following day trips are roughly an hour and a half away from Bangkok&#8217;s city center.</p>\n<p>You can drive yourself there or take a private or group tour. We recommend <a href=\"https://yourthaiguide.com/\" target=\"_blank\" rel=\"nofollow noopener\">Your Thai Guide</a> if you want a private tour guide for the day.</p>\n<h3><p id=\"Maeklong_Railway_Market\"><p>Maeklong Railway Market</p></p></h3>\n<p><img class=\"aligncenter size-full wp-image-16731\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/10/Maeklong-Railway-Market.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Maeklong Railway Market\" width=\"1000\" height=\"550\"></p>\n<p>This is a bustling seafood and produce market about 90 km southwest of Central Bangkok. What makes it unique is a <a href=\"https://www.tielandtothailand.com/famous-maeklong-railway-market/\" target=\"_blank\" rel=\"noopener\">train runs right through the Thai market</a>, passing just inches away from the vendors. It travels from Bangkok to the Maeklong Railway Station three times per day. It&#8217;s also possible to ride the train for an entirely different perspective.</p>\n<h3><p id=\"Koh_Kret\"><p>Koh Kret</p></p></h3>\n<p>Who knew there&#8217;s an island in Bangkok? Time has practically stood still on this peaceful, man-made island. Here you&#8217;ll find a plethora of Thai treats, old-fashioned Thai homes, and intricate earthenware pottery created by member of the Mon community. You can visit this island any day of the week but it&#8217;s most lively on Saturday and Sundays thanks to its weekend market.</p>\n<h3><p id=\"Ayutthaya\"><p>Ayutthaya</p></p></h3>\n<p></p>\n \n<p></p>\n<p>About 85 km north of Bangkok are the ruins of Ayutthaya, the old capital of Siam. Today it&#8217;s preserved as a UNESCO World Heritage Site. All that remains are royal towers (which, at first glance, look like&#160;Wat Arun), Buddha statues, and the famous Buddha head overgrown by a fig tree.</p>\n<h2><p id=\"Goodnbspeats_in_Bangkok\"><p>Good&#160;eats in Bangkok</p></p></h2>\n<p>There are plenty of caf&#233;s and restaurants a stone&#8217;s throw from any of the&#160;activities we mentioned above. However, here are several places&#160;that&#160;we particularly enjoyed and think are good for first-time visitors:</p>\n<h3><p id=\"Klongsan_Plaza\"><p>Klongsan Plaza</p></p></h3>\n<p><img class=\"aligncenter size-full wp-image-16726\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/10/24-Hours-in-Bankok-Klongsan-Plaza.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"24 Hours in Bangkok: Shop and eat at Klongsan Plaza\" width=\"1000\" height=\"563\"></p>\n<p>If you&#8217;re looking for authentic Thai street food, check out the large gathering of vendors pumping out snacks and hot meals at Klongsan Plaza. This was a new market to us and had only learned about it thanks to the&#160;<a href=\"http://www.starwood-ap.com/travelsolutions/en/one-hour-gem\" target=\"_blank\" rel=\"noopener\">1-Hour Gem</a>&#160;pamphlet we picked up from the Royal Orchid Sheraton&#8217;s concierge desk. Come to find out, the&#160;Klongsan Plaza is a stone&#8217;s throw across the river from the hotel.</p>\n<p><img class=\"aligncenter size-full wp-image-15878\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/04/Thai-Street-Food-Safe-Eat-12.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Thai street food\" width=\"1000\" height=\"550\"></p>\n<p>To get there, we took the express boat from the Si Phraya Pier (this can be seen from the hotel&#8217;s breakfast area) and took a one minute ride across the river to the back entrance of the Klongsan Plaza. We walked through vendors selling clothing, accessories, shoes, and handbags before popping out at the food court area (near the main road). Bowls of noodles, stacks of Thai fried chicken, and sweet snacks like mango and sticky rice were available from the dozens of vendors.</p>\n<h3><p id=\"Siam_Center8217s_Food_Republic\">Siam Center&#8217;s Food Republic</p></h3>\n<p>If you&#8217;re hesitant about ordering from street vendors, then you can cheat a little and go to a place called Food Republic. This indoor food court can be found on the third floor of the Siam Center Mall in Siam and provides &#8216;street food&#8217; in a clean, decorative dining area.&#160;It has a good selection of easy-to-order items that will please most people; we saw tourists, expats, and locals enjoying meals there. Plus, you don&#8217;t have to worry about trying to figure out what the food is (there are English menus) or how/when to pay (pre-loaded card at the food court&#8217;s entrance).</p>\n<h3><p id=\"Thara_Thong\"><p>Thara Thong</p></p></h3>\n<p><img class=\"aligncenter size-full wp-image-16727\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/10/Royal-Orchid-Sheraton-Thara-Thong.jpg?resize=1000%2C625&amp;ssl=1\" alt=\"Upscale Thai dining at the Royal Orchid Sheraton's Thara Thong restaurant\" width=\"1000\" height=\"625\"></p>\n<p>After a full day of exploring Bangkok, we headed back to our hotel&#160;and enjoyed an upscale Thai dinner at Thara Thong. We got our seafood fix with the&#160;Goong See Tong&#160;(Fried Jumbo Prawns in Yellow Curry)&#160;and loved the Thai-inspired cocktails, namely the&#160;Lychee Martini and the Security Check (a pandan-lime-pomelo flavored martini). As an added bonus, several performers came into the dining area midway through our meal and put on three traditional Thai dances for all the guests. We thought this was a special touch and a nice way to end our short stay&#160;in Bangkok.</p>\n\n\n\n<p><strong>TIP:</strong></p>&#160;For more suggestions on what and where to eat, check out <a href=\"https://www.eatingthaifood.com/\" target=\"_blank\" rel=\"noopener\">Eating Thai Food</a> and <a href=\"http://bkkfatty.com/\" target=\"_blank\" rel=\"noopener\">BKK Fatty</a> &#8211; they&#8217;re the foodie experts in town.\n\n\n\n<h2><p id=\"Make_the_most_out_of_24_hours_in_Bangkokor_any_city_in_the_world\"><p>Make the most out of 24 hours in Bangkok&#8230;or any city in the world</p></p></h2>\n<p></p><img class=\"wp-image-16728 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/10/24-Hours-in-Bangkok-King-Rama-I-Monument.jpg?resize=1000%2C750&amp;ssl=1\" alt=\" A Day in Bangkok: Sightsee the Chao Phraya River, Memorial Bridge, and King Rama I Monument\" width=\"1000\" height=\"750\"><p>There&#8217;s definitely an advantage to having a lengthy&#160;layover in a city. We&#8217;ve explored Seoul, South Korea and&#160;Paris, France this way during some (very long) international flights. And mini guides are the way to go, like this video guide below (although this one&#8217;s for Hong Kong &#8211; maybe we&#8217;ll have a layover there next!)</p>\n<p></p>\n<p>We love short and sweet tips like these whenever we&#8217;re traveling to somewhere unfamiliar. Why spend all that time researching when short guides like these are easily available at your fingertips?</p>\n<p><strong>What are some of your favorite things to do in Bangkok? If you haven&#8217;t visited yet, what are you looking forward to doing?</strong></p>\n<p>Disclosure: Some of the above links contain affiliates. If you click them, you are helping support our blog. Thanks &#8211; we appreciate it! We were also guests of the Royal Orchid Sheraton Hotel &amp; Towers. Our opinions and thoughts of the hotel, activities, and restaurants during our 24 hours in&#160;Bangkok are our own.<br>\n</p>\n\t\t\t\t</div>","title":"Mini Guide: 24 Hours in Bangkok"}},"pageContext":{"id":"5b95ef2487be05832749010b"}}