{"data":{"mongodbDatabaseArticles":{"id":"5b95eea287be0583274900e9","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Resigning from My Job and Moving to Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/resigning-from-my-job/\"> <img class=\" aligncenter\" title=\"Work, Before Resigning From My Job\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/workcollage.jpg?resize=563%2C421&amp;ssl=1\" alt=\"Before resigning from my job\" width=\"563\" height=\"421\"></a></p>\n<p>Today, one year ago, I said my goodbyes to my comfortable government job of five and a half years in pursuit of a dream to live in Thailand.&#160;Although my final day in the office was rather anticlimactic, nothing could prepare me for the emotional roller-coaster I experienced on the day I told my boss I was resigning from my job one month prior.</p>\n<p>When the time came to quit my job, my plans were to have a short and simple face-to-face discussion with my boss. I wasn&#8217;t going to go on an unprofessional self-destructing spiral and vent about office life, or even send a passive aggressive email and subtly gloat about the freedom I was about to have in Thailand. And I most certainly wasn&#8217;t going to cry and turn into mush over leaving a job that had not turned out to be my calling.</p>\n<p>Oh, wait, no, no, that last one was true.</p>\n<p>Flashback to January 2013. Chris and I had <a href=\"https://www.tielandtothailand.com/thoughts-before-i-quit-my-job/\">made up our minds</a> that we were moving to Thailand what seemed like forever ago and the day had come to throw in the towel. My plan was to get it off my chest and tell my boss I was resigning from my job first thing in the morning.</p>\n<p>I would have expected myself to have a healthy dose of nervous butterflies and to be at least a little excited. Instead, I found myself to incredibly apprehensive to qualify for this &#8220;quit my job&#8221; milestone.</p>\n<p>I realized I felt a sense of loyalty to the organization that had treated me so well for the past five and a half years. I felt like I was letting them down, leaving them scrambling to disperse my responsibilities as I chased my dream to live in Thailand</p>\n<p>On top of that, for at least a decade, I had conditioned myself into believing that a responsible adult should have a career and stick with it. Leaving a profession that I had so carefully groomed and prepared myself for over a decade made feel like I&#8217;d lost a bit of my identity. And so, I felt that resigning from my job was terribly irresponsible.</p>\n<img class=\"size-full wp-image-8929 \" title=\"ADM Plant\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/ADM-edit.jpg?resize=563%2C349&amp;ssl=1\" alt=\"Ethanol Plant Intern \" width=\"563\" height=\"349\"><p>And so, it turned out that I was dreading the talk with my boss. I had worked myself up during my morning commute, and so I was utterly deflated when I found out that he had already left for a meeting by the time I arrived at the office.</p>\n<p>I made a second attempt a few hours later and was also greeted by an empty office. By the third and final attempt of resigning from my job,&#160;the anxiety was making my nerves raw and I could barely focus on my tasks for the day.</p>\n<p>I got lucky about an hour before I had to leave for the weekend. As I rounded the hallway corner, I caught my boss walking down the hallway in my direction. He&#8217;s back! It&#8217;s now or never! As we approached each other, I stopped and casually suggested that I update him on a project that was coming to a close. &#8220;Mind if we talk in your office?&#8221; flashing an over exaggerated smile.</p>\n<p>I had my game face on while we chatted together down the hall to his office. No sooner had we stepped inside and I closed the door behind me when I went from calm and collected to a hot mess in mere seconds. Good grief! I hadn&#8217;t managed even a single sentence out of my mouth before the waterworks began.</p>\n<p>He looked like a deer in headlights. And in all honesty, I was just as surprised he was! What was supposed to be a quick and matter-of-fact meeting to tell him I was resigning from my job turned out to be a discussion so overwhelming that it induced tears before it even began.</p>\n<p>I commend him for his quick recovery and firing off a slew of &#8220;What&#8217;s wrong?&#8221; questions and immediately handing me a box of tissues. I was standing there, trying to stop the tears, and so embarrassed that I couldn&#8217;t make eye contact.</p>\n<p>&#8220;Nothing is wrong, but&#8230;&#8221;</p>\n<p>Pause.</p>\n<p>&#8220;&#8230;I want to put in my resignation.&#8221;</p>\n<p>I peeked up, and was met with a blank face.</p>\n<p>&#8220;I am resigning from my job not because I am unhappy here, but because Chris and I have the opportunity to travel to Thailand, and we want to take it.&#8221;</p>\n<p>There, I said it. Incredibly ungracefully, but I said it.</p>\n<p>The thing is, I wasn&#8217;t unhappy at my job.&#160;I had a great boss and dependable co-workers, a flexible schedule, the opportunity to make overtime, a tolerable commute, and excellent pay. The problem was my life was flashing by, and every day felt the same. If I didn&#8217;t act now, I could have had another thirty-some-odd years left in a sterile cubicle.</p>\n<p>Or, I could quit and move to Thailand.</p>\n<p>To my relief, the anxiety I had been carrying around immediately started to dissipate. I composed myself a bit and managed to look him in the face. We had a short discussion, which included the explanation behind moving abroad and how he would distribute my workload among my fellow employees.</p>\n<p>Two weeks later, I submitted the following resignation letter:</p>\n\n\n\n<p>My Fellow Co-Workers,</p>\n<p>I am proud to say that since 2007 I have been part of the acoustics group.&#160;I will be forever grateful for all that this organization has provided me with over the years and I feel very lucky to have had such a supportive work environment. Although my experience here has been wonderful, I&#8217;ve decided that it is time to walk a different path in life and so I have tendered my resignation.&#160;My last day with Code 712 will be Friday, February 15th, 2013.</p>\n<p>For those of you who are wondering why I am leaving or to where I am going, it may come to you as a surprise. My husband and I have decided to do some world&#160;traveling while we have the opportunity, and so we are moving abroad.&#160;In the beginning of March, we will be packing two bags each and starting a new chapter of our lives on the other side of the world in Thailand.&#160;We plan to live in Chiang Mai for some time, but will also travel around Southeast Asia on a quest to see and do things that are quite different from what we can do here in hustle and bustle of the nation&#8217;s capital.&#160;We are also looking at this adventure as a great opportunity to cross a few things off our bucket lists a lot sooner than expected. Who says I have to wait until retirement?!</p>\n<p>I wish everyone the best here. It&#8217;s been a great experience and I&#8217;ve enjoyed the responsibilities entrusted in me. For those of you interested in what life is like over there, I will be happy to keep in touch!</p>\n<p>Angela</p>\n\n\n\n\n<p>My final day at work arrived. I finished emptying my cookie-cutter cubicle and passing along files to fellow co-workers. A group of us went out for my farewell lunch at a familiar sushi joint, and then I came back to turn in my badges and sign some non-disclosure agreement forms. I said goodbye to the one or two people who caught me walking down the hall as I was leaving, and that was the end of it. I walked out of the building, got into my car, and went home to an empty apartment.</p>\n<p>My last day on the job happened to be the same day our apartment lease ended. The six months leading to this day were spent <a title=\"Cashing in on Craigslist\" href=\"https://www.tielandtothailand.com/cash-in-on-craigslist/\">selling our possessions</a>, and only a few bags waited for me in the hallway when I got home.</p>\n<p>I did a final walk through of the place we had called home for the past two and a half years. I took a few pictures with my phone, which has since been lost in a taxi in Bangkok. I packed the remaining bags in my car and ushered our cat and dog into the back seat. After a quick drop-off of the keys to the apartment community&#8217;s&#160;front office, I was on my way to my parent&#8217;s house with the little left I owned in the world.</p>\n<p>That last day was nostalgic. I left my work. I left my home. But it was also the day I gained the freedom to move to Thailand.</p>\n<p><img class=\"aligncenter size-full wp-image-8983\" title=\"A New Chapter in Thailand\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/TielandtoThailand.com-82.jpg?resize=563%2C399&amp;ssl=1\" alt=\"Life in Thailand after resigning from my job\" width=\"563\" height=\"399\"></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Resigning from My Job and Moving to Thailand"}},"pageContext":{"id":"5b95eea287be0583274900e9"}}