{"data":{"mongodbDatabaseArticles":{"id":"5b95ea9787be05832748ffba","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/changetheworld.jpg\" alt=\"Why travel can change the world\">Posted: 12/14/2017 | December 14th, 2017</p><p>There always seems to be something bad in the news. If it bleeds, it leads right? Even if it doesn&#8217;t bleed, it is still there.&#160;And all that bad news seems to dampen the world&#8217;s spirit. The economy, climate change, politics, pollution, terrorism, nationalism, poverty, disease &#8211; the list of challenges and things to worry about seems endless. The future, while always uncertain, appears even more so lately. Will the planet be inhabitable in a few decades? Will some Jihadi get his hands on a nuke and blow up Paris? Will Israel go to war with Iran? Will there be enough water and resources to go around? Is the sky falling?</p><p>Polls frequently show that people, while optimistic in general, are worried about the short and medium term state of the world. Globalization, a force that forces us together, has accelerated change in the world. People don&#8217;t really like change. It scares them.</p><p>But I&#8217;m optimistic about our future for two reasons: technology and the youth. Technology brings everyone closer together and makes archaic notions of race and difference obsolete. Firefox was invented by two people halfway around the world from one another who never met. I get graphic designers from websites. We buy products from companies on other continents. We debate on blogs with people from across the globe.&#160; The Internet makes the global village smaller, and in doing so makes people less hung up on notions of race, gender, religion, and nationality.</p><p><img src=\"https://media.nomadicmatt.com/changetheworld2.jpg\" alt=\"people diving off a wharf\"></p><p>That&#8217;s great because, one of the sad realities is that most <a href=\"https://nomadicmatt.com/travel-blogs/why-americans-dont-travel-overseas/\" rel=\"noopener\" target=\"_blank\">Americans don&#8217;t travel overseas</a>. But with the youth not as scared of the&#160;outside world, I think they will travel more and that travel will change the world. Sure, it is not a panacea, but I think increased travel will help cure many of the social ills we face.</p><p>Why? Because travel exposes you to new ideas, new cultures, and new people. By interacting with people from around the world, you put a face to the names. They aren&#8217;t some people who live &#8220;over there&#8221; with some problem you don&#8217;t really care about. Instead, they are real people with real problems. We either live together or die alone.</p><p>And as much as travel highlights our differences, it also highlights our similarities. Traveling around the world, I&#8217;ve found that the differences between cultures are minor and that, across the globe, people all have the same hopes and dreams. We all want to be safe, happy, work, do what we love, be loved, and make sure&#160;our kids lead a better life than we did. Those ideals are not limited to one place or ideology. While we go about it differently, we are all after the same things in life. I think recognizing that will do wonders to help heal the world.</p><p>Travel changes everybody. No one ever looks at life the same way again after traveling. We all come back with a greater appreciation for life, and for people. That&#8217;s how travel can change the world.</p><p><img src=\"https://media.nomadicmatt.com/changetheworld3.jpg\" alt=\"A shy young boy hiding\"></p><p>It won&#8217;t solve the economic crisis or reduce energy costs. It won&#8217;t solve climate change. It won&#8217;t send a man to the moon. And it for sure won&#8217;t make you breakfast in bed, though sometimes I wish it did. But what it can change is social misunderstanding and perceptions. It can expose people to problems they would not have seen at home. It&#160;can show them that not all Muslims are terrorists, or that the French don&#8217;t really hate America.</p><p>Travel takes people out of their comfort zones and forces them to confront something new and different. And while the boomers had their time, and Gen X got a little too jaded, the youth of today are more excited to travel. Call them &#8220;Gen Z,&#8221; but studies and polls confirm what I see on the road &#8211; the youth of today are turning out in larger numbers to try&#160;and make a difference in the world. They want to see what lies outside their borders and make a positive impact on it. It&#8217;s this generation that helped get Obama elected. It&#8217;s this generation that volunteers more than the others.</p><p>So that is why I am hopeful. Young people today seem more interested in travel than people my age! That&#8217;s a promising trend, and, as this next generation gets more involved in the world, they will go out and see it more. Traveling won&#8217;t make us all sing kumbaya and hold each other&#8217;s hands, but it will help tear down some of the walls that divide us. It will show us that we&#8217;re all in this together and that we aren&#8217;t as different as we like to pretend we are. To quote Maya Angelou:</p><p>&#8220;Perhaps travel cannot prevent bigotry, but by demonstrating that all peoples cry, laugh, eat, worry, and die, it can introduce the idea that if we try and understand each other, we may even become friends.&#8221;</p><p><strong>Related articles:</strong></p></div>","title":"Why Travel Can Change the World"}},"pageContext":{"id":"5b95ea9787be05832748ffba"}}