{"data":{"mongodbDatabaseArticles":{"id":"5b95eef987be058327490101","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Review: Thailand&#8217;s Green Bus VIP Class Bus</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-18678\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/Thailand-Green-Bus-1000px.png?resize=1000%2C550&amp;ssl=1\" alt=\"Review: Green Bus VIP Class Bus\" width=\"1000\" height=\"550\"><br>\nOne bus company in that has made a name for itself in Northern Thailand is Green Bus. It&#8217;s a clean, comfortable, and affordable transportation option with routes that go as far north as Mae Sai near the Burmese border and as far south as Phuket. I (Angela) used the Green Bus VIP class bus on my recent trip to Nan, Thailand and this is what I experienced.</p>\n<p>Green Bus offers bus routes from Chiang Mai to about a dozen so cities in the Northern region. The most popular route is Chiang Mai to Chiang Rai with nearly twenty buses per day. There are also several routes to the Northeastern, Central, and Southern regions of Thailand.</p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"pinit aligncenter wp-image-18679 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/Thailand-Green-Bus-Pinterest.png?resize=400%2C609&amp;ssl=1\" alt=\"Green Bus VIP bus service has made a name for itself in Northern Thailand. Here's our review about the clean, comfortable, and affordable VIP bus. | Tieland to Thailand\" width=\"400\" height=\"609\"></p>\n<h2><p id=\"Review_of_Green_Bus_VIP_Class_Bus\"><p>Review of Green Bus VIP Class Bus</p></p></h2>\n<p>Chris and I have traveled by land across Thailand on several occasions on VIP buses and two other times on a first class bus and second-class bus. Let&#8217;s just say that a VIP bus is the way to go!</p>\n<p>You don&#8217;t get views like these when you&#8217;re flying in an airplane.</p>\n<p><img class=\"aligncenter size-full wp-image-18668\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/Nan-Rice-Fields.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Countryside rice fields in Nan, Thailand\" width=\"1000\" height=\"550\"></p>\n<p>This latest trip was my first time using the Green Bus company. <strong>Green Bus VIP class buses feature premium seats, air conditioning, a hostess providing snack service, and an onboard bathroom.</strong></p>\n<p>I purchased a Green Bus ticket online a week in advance (more details below). Although I could have probably booked my ticket a day or two in advance because I wasn&#8217;t traveling during the weekend or on a holiday, I&#8217;d rather not take chances. I showed up about 30 minutes prior to departure, presented my paper 7-11 receipt directly to the bus driver, and had my luggage stowed underneath the bus before hopping onboard. There was no need to go to the Green Bus counter at the bus station for &#8216;official&#8217; tickets.</p>\n<h3><p id=\"Cool_Clean_and_Comfortable_VIP_Bus\">Cool, Clean, and Comfortable VIP Bus</p></h3>\n<p>I boarded the cool, clean bus, which featured both VIP and first class seats.&#160;<strong>The VIP seats were extra wide and plush with adjustable head rests, reclining capabilities, and adjustable leg rests, too.</strong></p>\n<p><img class=\"aligncenter size-full wp-image-18664\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/VX-Green-Bus-Interior.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Green Bus VIP and First Class Combo Interior\" width=\"1000\" height=\"550\"></p>\n<p><strong>Tall people will be happy to hear that there&#8217;s enough room for their long legs </strong>(reason #1 why Chris and I don&#8217;t usually ride&#160;buses). In fact, there&#8217;s so much room that I couldn&#8217;t reach the foot rest (or the floor, if I&#8217;m being completely honest). I resorted to using the adjustable leg rest throughout the trip for leg/feet support. And even when the passenger in front of me leaned back all the way, I was surprised to see how much space my knees still had and I didn&#8217;t feel cramped.</p>\n<p><strong>Like an airplane, I could open, close, and adjust the direction of the air vents. There are also reading lights in the bus. The overhead bins are narrow (approximately ten inches) but deep.</strong> While it&#8217;s possible to fit a large purse, shopping bag, or electronics bag in the overhead compartment, don&#8217;t expect to fit your TSA-approved maximum sized carry-on bag. You&#8217;ll have to put that under the bus or keep it at your feet during the ride.</p>\n\n\n\n<p><strong>NOTE:</strong></p>&#160;Anytime you travel via plane, train, or bus be sure to keep your valuables (money, jewelry, electronics, and personal documents) on your person to eliminate any chance of them being stolen while stowed away.\n\n\n\n<h3><p id=\"Solid_Customer_Service\">Solid Customer Service</p></h3>\n<p>The bus departed right on time (as I&#8217;ve noticed with Thai buses) and arrived at my final destination about 15 minutes late. Two hours out of the six-hour journey it rained, so the late arrival is understandable. I had been a little skeptical of the bus driver (reason #2 we don&#8217;t often ride buses), but he was responsible. He didn&#8217;t seem to be speeding or zig-zagging through traffic unlike some experiences we&#8217;ve had in the past. There were several occasions that he passed other cars but it was not reckless. He slowed down appropriately whenever the roads were curvy or wherever there was construction.</p>\n<p><img class=\"aligncenter size-full wp-image-18665\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/Green-Bus-VIP-snacks-and-leg-room.png?resize=1000%2C494&amp;ssl=1\" alt=\"Green Bus VIP snacks and leg room\" width=\"1000\" height=\"494\"></p>\n<p>There was a bus hostess who handed out cold water and sweet snacks about five minutes into the ride. She also handed out cooling towelettes at the end of the ride. To be truthful, the air condition was on full blast during the 6-hour trip and I needed no further cooling off from a cold, wet towel. A warm towel would have been preferred!</p>\n<p>On this particular trip (Nan to Chiang Mai), the bus stopped three times at the bus stations along the route (Phrae, Lampang, and Lamphun). The restroom breaks were five to seven minutes long. This was juuuust&#160;enough time to get off the bus, find the restrooms or snack shop, take care of business, and re-board. <strong>Although I was traveling alone, I wasn&#8217;t worried that the bus would leave without me because the hostess took a head count of all the passengers before the bus left.</strong></p>\n<p><strong>A few things you cannot do on the bus:</strong></p>\n<ul>\n<li><p>Eat strong smelling foods such as durian or instant noodles</p></li>\n<li><p> Drink alcohol</p></li>\n<li><p>Smoke</p></li>\n</ul>\n<p>Compared to several past experiences riding VIP buses around Thailand, Green Bus was excellent. It was second only to Nakhonchai Air&#8217;s VIP bus. That bus company offers personal TVs, electric massage chairs, pillows and blankets, a buffet food break and very nice rest stops.</p>\n<p>Even though we prefer flying, some provinces in Thailand don&#8217;t have an airport. Or, if they do, the routes are round-about and not direct from Chiang Mai. So, the VIP bus is the next best thing.</p>\n<h2><p id=\"How_to_Buy_Green_Bus_VIP_Tickets\"><p>How to Buy Green Bus VIP Tickets</p></p></h2>\n<p>Green Bus provides an easy-to-understand list of <a href=\"http://www.greenbusthailand.com/website/en/services/bus/trading-channel\" target=\"_blank\" rel=\"noopener\">buying methods and payment options</a>. Whatever you chose will depend on what you are comfortable with. You may have to use transportation to get to a counter that issues tickets, speak to a cashier (who may or may not know English) and pay in cash, or buy a ticket online by credit card.</p>\n<h3><p id=\"Reserving_or_Buying_Tickets\">Reserving or Buying Tickets</p></h3>\n<p>It is possible to reserve/buy a Green Bus VIP class ticket:</p>\n \n<p>If you buy a ticket online, the website is now in English and has an intuitive four-step booking process. By selecting your departing terminal, the arrival terminal will automatically update with the available routes.</p>\n<p><img class=\"aligncenter size-full wp-image-18663\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/GreenBusThailand.com_.png?resize=953%2C446&amp;ssl=1\" alt=\"GreenBusThailand.com\" width=\"953\" height=\"446\"></p>\n<p>The Greenbus App is even easier to use.</p>\n<p><img class=\"aligncenter size-full wp-image-18662\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/09/Greenbus-App.png?resize=1000%2C520&amp;ssl=1\" alt=\"Greenbus App\" width=\"1000\" height=\"520\"></p>\n<p>During the booking process, you will need to provide your first and last names and your phone number. The phone number is required so that you can have the ticket reference number texted to you. If you don&#8217;t have one, it&#8217;s ok to write the number down or take a photo of it to take to a 7-11 cashier. Just list your hotel&#8217;s number.</p>\n<h3><p id=\"Payment_Options\">Payment Options</p></h3>\n<p>Payment options include cash at a ticket counter, cash at 7-11, Master Card or Visa credit cards online (a rather uncommon but welcomed option in Thailand), or SCB or Krungsri Thai bank transfers. <strong>If you reserve a ticket online without paying for it by credit card or Thai bank </strong><strong>transfer, you have two hours to pay it by cash at a 7-11.&#160;</strong></p>\n<p>It&#8217;s possible to purchase tickets up to 60 days in advance. You can also buy them as little as 3 hours prior to departure.</p>\n<p>If you aren&#8217;t in a position to reserve a ticket online, a hotel staff member can. They will act as a courier and pick up your paper bus ticket for a small service fee.</p>\n<h2><p id=\"Green_Bus_VIP_Routes_Across_Thailand\"><p>Green Bus VIP Routes Across Thailand</p></p></h2>\n<p>There is a solid selection of Green Bus routes to choose from depending on your budget or specific route.&#160;The following map displays the bus stations (bus icons) that are serviced by Green Bus as well as the VIP routes (colored lines).</p>\n<p></p>\n<p>In addition to VIP seating (V-Class), there are also first class (X-Class) and second class (A-Class) seating.</p>\n<ul>\n<li><p><strong>V-Class (VIP):</strong></p><p> 24 to 30 seats (3 wide seats to a row), air conditioning, bus hostess plus snacks, and onboard bathroom</p></li>\n<li><p><strong>XV-Class (Combo):</strong></p><p>&#160;VIP seats in the front and first class seats in the back</p></li>\n<li><p><strong>X-Class (First Class):&#160;</strong></p><p>40 seats (4 narrow seats to a row) with air conditioning, bus hostess plus snacks, and an onboard bathroom</p></li>\n<li><p><strong>A-Class (Second Class):</strong></p><p> 48 seats (4 narrow seats to a row) with air conditioning, no service, no onboard bathroom</p></li>\n</ul>\n<p>We&#8217;ve summarized the Green Bus VIP routes below:</p>\n\n<span><a></a><p>All routes, times, and prices can be found on neatly displayed <a href=\"http://www.greenbusthailand.com/website/en/services/bus/time-table\" target=\"_blank\" rel=\"noopener\">time tables on the Green Bus website</a> </p></span>\n\n\n<p><strong>Green Bus VIP Northern Routes</strong></p>\n<p><strong>Class</strong></p>\n<p><strong>Cost</strong></p>\n<p><strong>Travel Time</strong></p>\n\n\nChiang Mai &#8211; Chiang Rai\nV-Class\n&#3647;258\n3 hours\n\n\nChiang Mai &#8211; Chiang Rai &#8211; Chiang Khong\nVX-Class\n&#3647;395\n5.25 hours\n\n\nChiang Mai &#8211; Chiang Rai &#8211; Mae Sai\nV-Class\n&#3647;319\n4.75 hours\n\n\nChiang Mai &#8211; Phayao\nV-Class\n&#3647;221\n2.5 hours\n\n\nChiang Mai &#8211; Lampang &#8211; Phrae\nVX-Class\n&#3647;256\n4 hours\n\n\nChiang Mai &#8211; Lamphun &#8211; Lampang &#8211; Phrae &#8211; Nan\nVX-Class\n&#3647;395\n5.75 hours\n\n\nChiang Mai &#8211; Lampang &#8211; Phrae &#8211; Nan &#8211; Thung Chang\nVX-Class\n&#3647;487\n7.5 hours\n\n\n\n<p>&#160;</p>\n\n\n\n<p><strong>Green Bus VIP Southern/Central Routes</strong></p>\n<p><strong>Class</strong></p>\n<p><strong>Cost&#160;</strong></p>\n<p><strong>Travel Time</strong></p>\n\n\nPhuket &#8211; Surat Thani (Co-op) &#8211; Chumphon &#8211; Prachuap Khiri Khan &#8211; Nakhon Sawan &#8211; Tak &#8211; Lampang &#8211; Chiang Mai\nV-Class\n&#3647;1,646\n23.5 hours\n\n\nPhuket &#8211; Surat Thani (Co-op) &#8211; Chumphon &#8211; Prachuap Khirikhan &#8211; Phisanulok &#8211; Uttaradit &#8211; Phrae &#8211; Phayao &#8211; Chiang Rai\nVX-Class\n&#3647;1,736\n24.75 hours\n\n\nPhitsanulok &#8211; Nakhon Sawan &#8211; Nakhon Pathom &#8211; Ratchaburi &#8211; Prachuap Khiri Khan &#8211; Chumphon &#8211; Surat Thani &#8211; Don Sak (harbor&#8217;s Seatranferry to Koh Samui)\nVX-Class\n&#3647;1,184\n16.5 hours\n\n\n\n<p>&#160;</p>\n\n\n\n<p><strong>Green Bus VIP Northeastern Route</strong></p>\n<p><strong>Class</strong></p>\n<p><strong>Cost&#160;</strong></p>\n<p><strong>Travel Time</strong></p>\n\n\nBueng Kan &#8211; Nong Khai &#8211; Udon Thani &#8211; Khon Kaen &#8211; &#8230; &#8211; Mae Sai\nVX-Class\n&#3647;1,168\n18 hours\n\n\n\n<p>&#160;</p>\n\n\n\n<p><strong>NOTE:</strong></p> When you go to book, you don&#8217;t have to travel from the originating city to the final city &#8211; it&#8217;s possible to book beginning halfway through the route.\n\n\n\n<p><b>What&#8217;s your preferred method of travel in Thailand? If you&#8217;ve ever traveled on a VIP bus, how was it?</b></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Review: Thailand’s Green Bus VIP Class Bus"}},"pageContext":{"id":"5b95eef987be058327490101"}}