{"data":{"mongodbDatabaseArticles":{"id":"5b93831f87be056953db7e2e","content":"<div><h3 name=\"f4e6\" id=\"f4e6\" class=\"graf graf--h3 graf--leading\">CHAPTER TWELVE</h3><p name=\"e1c9\" id=\"e1c9\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--h3\">After Dan Lafferty read The Peace Maker in the early 1980s and resolved to start living the principle of plural marriage, he announced to his wife, Matilda, that he intended to wed her oldest daughter&#8202;&#8212;&#8202;his stepdaughter. At the last minute, however, he abandoned that plan and instead married a Romanian immigrant named Ann Randak, who took care of the horses on one of Robert Redford&#8217;s ranches up Spanish Fork Canyon, in the mountains east of the Dream Mine. Ann and Dan met when he borrowed a horse from her to ride in a local parade. She wasn&#8217;t LDS, says Dan, &#8220;but she was open to new experiences. Becoming my plural wife was her idea.&#8221; Ann, he adds, &#8220;was a lovely girl. I called her my gypsy bride.&#8221;</p><p name=\"0513\" id=\"0513\" class=\"graf graf--p graf-after--p\">Living according to the strictures laid down in The Peace Maker felt good to Dan&#8202;&#8212;&#8202;it felt right, as though this really were the way God intended men and women to live. Inspired, Dan sought out other texts published by a well-known fundamentalist and Dream Mine backer, Ogden Kraut, about Mormonism as it was practiced in the early years of the church.</p><p name=\"d9c0\" id=\"d9c0\" class=\"graf graf--p graf-after--p\">It didn&#8217;t take him long to discover that polygamy wasn&#8217;t the only divine principle the modern LDS Church had abandoned in its eagerness to be accepted by American society. Dan learned that in the 19th century, both Joseph Smith and Brigham Young had preached about the righteousness of a sacred doctrine known as &#8220;blood atonement:&#8221; Certain grievous acts committed against Mormons, as Brigham explained it, could only be rectified if the &#8220;sinners have their blood spilt upon the ground.&#8221; And Dan learned that Joseph had taught that the laws of God take precedence over the laws of men.</p><blockquote name=\"2a19\" id=\"2a19\" class=\"graf graf--pullquote graf-after--p\">Like fundamentalists in other faiths, Dan Lafferty was intent on adhering unfailingly to God&#8217;s &#8220;true&#8221; commandments, as determined by a rigorously literal interpretation of his church&#8217;s earliest and most sacred texts. And he was no less intent on adhering to the &#8220;true&#8221; commandments of his country&#8217;s earliest and most sacred texts, as well. To Dan, such documents as the Book of Mormon, The Peace Maker, the United States Constitution, and The Declaration of Independence are all of a piece: They are holy scriptures that provide a direct link to the Almighty. The authority that flows from their divinely inspired sentences is absolute and immutable. And it is the duty of righteous men and women to conduct their lives according to a stringently literal reading of those sentences.</blockquote><p name=\"a387\" id=\"a387\" class=\"graf graf--p graf-after--pullquote\">Legal theory was a subject of particular interest to Dan. His curiosity had first been aroused when he was training to be a chiropractor in California, following a run-in he had with state and county authorities. At the time, he supported his family primarily by running a small sandwich business out of their home. Dan, Matilda, and the oldest kids would get out of bed before dawn every morning in order to make and wrap stacks of &#8220;all natural&#8221; vegetarian sandwiches, which Dan would then sell to other chiropractic students during the lunch hour.</p><p name=\"d87d\" id=\"d87d\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;It was a very profitable little hustle,&#8221; Dan says proudly. &#8220;Or it was until the Board of Health closed me down for not following regulations. They claimed I needed a license, and that I wasn&#8217;t paying the required taxes.&#8221; Just before he was put out of business, Matilda had given birth to a baby boy. Money was tight. Losing their main source of income was problematic. It also proved to be a pivotal event in Dan&#8217;s passage to fundamentalism.</p><p name=\"c8f1\" id=\"c8f1\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;After they shut me down,&#8221; Dan recalls, &#8220;I didn&#8217;t know quite what to do. It didn&#8217;t seem right to me, that the government would penalize me just for being ambitious and trying to support my family&#8202;&#8212;&#8202;that they would actually force me to go on welfare instead of simply letting me run my little business. It seemed so stupid&#8202;&#8212;&#8202;the worst kind of government intrusion. In The Book of Mormon, Moroni talks about how all of us have an obligation to make sure we have a good and just government, and when I read that, it really got me going. It made me realize that I needed to start getting involved in political issues. And I saw that when it comes right down to it, you can&#8217;t really separate political issues from religious issues. They&#8217;re all tied up together.&#8221;</p><p name=\"2d01\" id=\"2d01\" class=\"graf graf--p graf-after--p\">Upon completing his chiropractic training and returning to Utah, Dan went to work as a chiropractor for his father. By then the Lafferty parents had sold their farm and bought a house in the old part of downtown Provo; Dan&#8217;s father ran his practice out of a basement office in this home. In 1981, shortly after Dan started working for Watson Sr., the LDS Church sent both of the elder Laffertys abroad on a two-year mission, at which point Dan and his younger brother, Mark (who had graduated the Los Angeles College of Chiropractic six months after Dan), agreed to take over the practice in their father&#8217;s absence.</p><p name=\"4bba\" id=\"4bba\" class=\"graf graf--p graf-after--p\">Dan and Mark had always enjoyed one another&#8217;s company. &#8220;As children,&#8221; says Dan, &#8220;we were inseparable.&#8221; Every morning and evening they sat together across a milk pail to milk the family cow. They spent their summer vacations practically joined at the hip, &#8220;playing in the barns, jumping in the hay, throwing the football, playing in our tree hut,&#8221; he recalls. &#8220;It&#8217;s funny to remember how hard it was to stop playing even long enough to get a drink or take a pee. Nothing tasted so good as cold water from the faucet that filled the watering trough, and nothing felt so good as taking a pee when the pressure got so bad we had to stop playing because you couldn&#8217;t hold it any longer.&#8221; When their younger brothers&#8202;&#8212;&#8202;Allen, Tim, and Watson Jr.&#8202;&#8212;&#8202;were old enough, the smaller boys eagerly joined in Dan and Mark&#8217;s escapades. Then, says Dan, &#8220;we&#8217;d all line up along the fence, oldest to youngest, and have a group pee. The little guys loved to do what Mark and I did, especially lining up to pee on a fence.&#8221;</p><p name=\"ee7f\" id=\"ee7f\" class=\"graf graf--p graf-after--p\">When Dan and Mark started working together in their father&#8217;s office, the special closeness they had shared in their youth was rekindled. During breaks between patients they engaged in heartfelt discussions about everything that was most important to them&#8202;&#8212;&#8202;and increasingly what seemed most important concerned religious doctrine, and its power to remedy the insidious evils inflicted by the government on its citizens.</p><p name=\"45c2\" id=\"45c2\" class=\"graf graf--p graf-after--p\">Regarding the timing of these heart-to-heart talks, Dan reports, &#8220;I began to observe a fascinating phenomenon.&#8221; Dan and Mark were usually so busy seeing patients that several days would often pass between their religious/political discourses. But on those days when they would unexpectedly have gaps in the schedule in which to talk at length, says Dan, &#8220;rather mysteriously, my younger brothers would show up, unannounced. And we would have some very, very valuable time discussing issues.&#8221; These impromptu get-togethers happened often enough, says Dan, &#8220;that it seemed like it had to be more than just a coincidence.&#8221; Five of the six Lafferty brothers&#8202;&#8212;&#8202;Dan, Mark, Watson, Tim, and Allen&#8202;&#8212;&#8202;were usually present for these ad hoc conferences; the only brother who failed to attend was Ron, the eldest of the Lafferty offspring, who was six years older than Dan, and had always acted less like a sibling than a father figure to his brothers.</p><p name=\"e112\" id=\"e112\" class=\"graf graf--p graf-after--p\">Dan usually led the discussions, which inevitably described how the government had far exceeded its constitutionally mandated reach, and was dangerously out of control. Buttressing his arguments by quoting scripture from the Book of Mormon, he patiently explained to his brothers that the government had no right to require American citizens to obtain any kind of license, or pay taxes, or submit to the oppressive burden of a Social Security number. &#8220;I had come to realize,&#8221; Dan says, &#8220;that a license was simply an agreement with the government to let them have control of your life. And I decided I didn&#8217;t want them to have control of my life&#8230;. I already had a basic right to enjoy all of the basic activities of a human being, without their permission.&#8221;</p><p name=\"21c1\" id=\"21c1\" class=\"graf graf--p graf-after--p\">Although Dan had not yet allied himself with any established fundamentalist church or prophet, his self-directed studies had transformed him into a de facto Mormon Fundamentalist&#8202;&#8212;&#8202;and an exceedingly ardent one. The impetus for most fundamentalist movements&#8202;&#8212;&#8202;whether Mormon, Catholic, Evangelical Christian, Muslim, or Jewish&#8202;&#8212;&#8202;is a yearning to return to the mythical order and perfection of the original church. Dan Lafferty was moved by this same desire.</p><p name=\"46c7\" id=\"46c7\" class=\"graf graf--p graf-after--p\">The more he studied historical Mormon documents, the more certain Dan became that the LDS Church had blundered off course around 1890, when then-president and prophet Wilford Woodruff was coerced into doing away with the doctrine of plural marriage by the godless government in Washington, D.C. The modern LDS Church, Dan had become convinced, was an elaborate fraud.</p><p name=\"3977\" id=\"3977\" class=\"graf graf--p graf-after--p\">Like fundamentalists in other faiths, he was intent on adhering unfailingly to God&#8217;s &#8220;true&#8221; commandments, as determined by a rigorously literal interpretation of his church&#8217;s earliest and most sacred texts. And he was no less intent on adhering to the &#8220;true&#8221; commandments of his country&#8217;s earliest and most sacred texts, as well. To Dan, such documents as the Book of Mormon, The Peace Maker, the United States Constitution, and The Declaration of Independence are all of a piece: They are holy scriptures that provide a direct link to the Almighty. The authority that flows from their divinely inspired sentences is absolute and immutable. And it is the duty of righteous men and women to conduct their lives according to a stringently literal reading of those sentences.</p><p name=\"af17\" id=\"af17\" class=\"graf graf--p graf-after--p\">For people like Dan who view existence through the narrow lens of literalism, the language in certain select documents is assumed to possess extraordinary power. Such language is to be taken assiduously at face value, according to a single incontrovertible interpretation that makes no allowance for nuance, or ambiguity, or situational contingencies. As Vincent Crapanzano observes in his book, Serving the Word, Dan Lafferty&#8217;s brand of literalism</p><blockquote name=\"a42b\" id=\"a42b\" class=\"graf graf--blockquote graf-after--p\">encourages a closed, usually (though not necessarily) politically conservative view of the world: one with a stop-time notion of history and a we-and-they approach to people, in which we are possessed of truth, virtue, and goodness and they of falsehood, depravity, and evil. It looks askance at figurative language, which, so long as its symbols and metaphors are vital, can open&#8202;&#8212;&#8202;promiscuously in the eyes of the strict literalist&#8202;&#8212;&#8202;the world and its imaginative possibilities.</blockquote><p name=\"900c\" id=\"900c\" class=\"graf graf--p graf-after--blockquote graf--trailing\">For his part, Dan scoffs at this sort of pointy-headed exegesis. &#8220;I was just on a quest,&#8221; he insists. &#8220;A quest to find the truth.&#8221;</p></div>","title":"The Fundamentalist Religious Views That Inspired Ammon Bundy and His Militia to Occupy a Remote…"}},"pageContext":{"id":"5b93831f87be056953db7e2e"}}