{"data":{"mongodbDatabaseArticles":{"id":"5b95eab087be05832748ffc6","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/vikram.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\">Posted: 03/18/2014 | March 18th, 2014</p><p>As an American, it&#8217;s easy for me to <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\">travel the world</a>. My dollar goes far (<a href=\"https://www.nomadicmatt.com/travel-blogs/cheap-places-to-visit-on-the-us-dollar/\">though not as far as it used to</a>), and I only have to worry about visas to a few countries around the world. Yet not everyone is blessed with a golden passport (EU, British, Canadian, Australian, and New Zealand passports fall under this description, too), and it can be very hard to not only save money for travel but also obtain a visa to most countries around the world. And so today, we talk to Vikram and Ishwinder, an Indian couple who not only managed to <a href=\"https://www.nomadicmatt.com/travel-blogs/cut-your-expenses/\">save money for their round-the-world trip</a>&#160;but also navigated the tough process of getting tourist visas with an Indian passport.</p><p><b>Nomadic Matt: Tell everyone about yourselves!</b><br> <strong>Vikram:</strong> We are an Indian couple in our late 20s that loves to travel. I am from a city called Aurangabad, close to Mumbai, while Ishwinder is from New Delhi. We were both working in London when we decided to get married in January 2012. Within a year we decided to quit our jobs, sell what little we owned, and travel the world. We have been on the road for 15&#160;months now. We have traveled to 25 countries and want to travel until the last bit of our savings runs out. We started <a href=\"http://www.emptyrucksack.com/\">Empty Rucksack</a> to share our experiences and send our love and inspiration to people who also dream of travel.</p><p><b>What inspired this big trip?</b><br> Ishwinder worked for a consulting firm while I worked as a software engineer. Stable jobs provided us the funds to travel, but we always had to rush and return to our desks on Monday. We always found ourselves wanting to stay a little longer and not be dictated by the calendar. The more <a href=\"https://www.nomadicmatt.com/travel-blogs/find-time-to-travel/\">we traveled on weekends and short holidays</a>, the more we wanted to travel longer. The tipping point was when we were hiking in Wales, climbing to the top of Snowdon. It was a Sunday so it was pretty crowded. We never saw a more crowded mountaintop than Snowdon. People were scrambling to step on the peak. We kept wondering what it would be like to come here on an off-peak day and have all this beauty to just ourselves. That was when we <a href=\"https://www.nomadicmatt.com/travel-blogs/the-day-i-quit/\">decided to quit our jobs</a> and travel long term.</p><p><img src=\"https://media.nomadicmatt.com/vikram1.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\"></p><p><b>As Indians, do you find getting visas hard? What are some of the difficulties you face?</b><br> My visa has been rejected three times by Belgium, Spain, and United States, though Ishwinder has never had her visa rejected. Visa requirements are a necessary dimension we have to consider when we are planning to travel to a new country, and we can&#8217;t afford to be ignorant about it. Most times they require proof of funds, bank statements, income tax returns, return tickets, hotel bookings, and letters from employers, and some even ask for cover letters.</p><p><b>Do visa requirements keep you from visiting certain countries?</b><br> Visa requirements do not prevent us from visiting any country. The restrictions only make the process tiring, which ends up discouraging most people from&#160;applying. If we have to apply for a tourist visa for any <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-legally-stay-in-europe-for-more-than-90-days/\">Schengen country</a> (most European countries), we would need to provide income tax returns, bank statements, and return tickets. The immigration officers are very strict, so any shortcomings in paperwork are not tolerated. One of my visa applications was rejected because I did not have enough blank pages in my passport. Such restrictions discourage spontaneous travel.</p><p><img src=\"https://media.nomadicmatt.com/vikram2.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\"></p><p><b>How do you go about making the application process successful?</b><br> There is no shortcut or simple way to making a successful application. All you do is read the immigration website thoroughly for the all the required paperwork. Then you follow all the guidelines and paperwork to the letter. Make sure you don&#8217;t overlook anything. Any mistake is just an excuse for them to deny your application. They aren&#8217;t very lenient.</p><p>Most common requirements include return flights, a certain [amount]&#160;of money in your bank accounts for a period of time, and hotel bookings. Websites like <a href=\"http://booking.com\">Booking.com</a> allow hotel bookings with no fees and allow cancellations until the last minute. If you are in <a href=\"https://www.nomadicmatt.com/travel-guides/england-travel-tips/\">England</a> and planning to travel to the EU, then bus tickets are the cheapest option for showing return tickets; you can book some as low as 10 GBP. We keep a separate account in which we keep a certain amount of money to show immigration officials that we have sufficient funds.</p><p>Even if you meet all the necessary requirements and have all your paperwork ready, you should still be prepared to accept rejection.</p><p><img src=\"https://media.nomadicmatt.com/vikram3.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\"></p><p><b>What countries are easier for Indians to get visas from?</b><br> We can visit Bhutan and Nepal without a visa, as well as Sri Lanka, <a href=\"https://www.nomadicmatt.com/travel-guides/the-maldives-travel-tips/\">the Maldives</a>, and Mauritius, and countries in <a href=\"https://www.nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\">Southeast Asia</a> are fairly easy to travel to since most of them offer visas on arrival. Based on Internet research, countries in South and Central America also seem visa friendly for Indians. Having a UK, US, or Schengen [visa] is also helpful, as it makes us eligible for visas on arrival for certain other countries. (Having a UK visa allowed us to get a visa on arrival in Turkey.)</p><p><b>Is there an interview process? How does that go? How hard is it to get a UK, EU, or US visa? </b><br> The visa process for US is fairly complicated. You make a payment, receive a code, and use it to book an appointment. When you go to the embassy, they check your paperwork and you are interviewed. They keep your passports only if they are going to issue you a visa; else they return the papers making it clear that the visa is being denied. It&#8217;s a country that seems that it doesn&#8217;t welcome tourism from India and is the toughest visa to get.</p><p>UK and EU applications are made through a third-party agency. Most people in India still live under the impression that applying through an agent increases your chances of getting a visa. If you have the funds to travel and the proper paperwork (leave approved by employer, bank statements, bookings, and tax returns), you will most likely get the visa.</p><p><img src=\"https://media.nomadicmatt.com/vikram4.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\"></p><p><b>What did you do to save up for your trip?</b><br> Both of us finished college and started working immediately.&#160;I worked seven years, and Ishwinder worked about six years before we decided to quit. The major chunk of our saving was from the two&#160;years we worked in <a href=\"https://www.nomadicmatt.com/travel-guides/england-travel-tips/london/\">London</a>.</p><p><b>How do you stick to a budget when you travel?</b><br> Since we have been traveling around in Southeast Asia, India, Nepal, and Bhutan, we have not had to watch our budget that much. The only rule with us is &#8220;don&#8217;t splurge.&#8221; In the past 15 months there have been no expensive dinners, spas, shopping binges, or overpriced adventure sports. But when we arrive in a place, we look for a clean and airy room and don&#8217;t mind paying a little extra for that. Sticking to the basics keeps us on budget.</p><p><img src=\"https://media.nomadicmatt.com/vikram5.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\"></p><p><b>I get a lot of emails from Indians saying &#8220;travel is different for them.&#8221; Is that true? Has traveling changed your perspective on everything? What would you tell people/friends back home? </b><br> A lot of people think it&#8217;s a waste of time and money and that travel should be done once or twice a year. Long-term travel is still unheard of. A reason for this is that so many of us have [such] limited opportunities that job security is a concern, so you can&#8217;t quit your job and go travel. The most important thing is to secure your future. Indian society does not accept risk-taking, and that is what traveling long term is: a big risk.</p><p>Besides, if you are single, your family is preoccupied with getting you married. If you are married, there is a lot of societal expectation for you to have a baby. Spending time with family and being present at social functions is supremely important.</p><p>So with so many preoccupations, <a href=\"https://www.nomadicmatt.com/travel-blogs/stay-motivated/\">travel takes a back seat</a>.</p><p>We were able to <a href=\"https://www.nomadicmatt.com/travel-blogs/michael-success-story/\">save money</a> because we had good jobs in London and we didn&#8217;t want to buy a house or a car, and our families were much more understanding than most people. But I think even if we had been in India we would still have been able to quit and travel, but we would have needed two more years of saving. The only thing is with those savings we would not have been able to <a href=\"https://www.nomadicmatt.com/travel-guides/europe-travel-tips/\">travel to Europe</a>.</p><p><img src=\"https://media.nomadicmatt.com/vikram6.jpg\" alt=\"Vikram and Ishwinder from Empty Rusacks\"></p><p><b>What is one thing you know now that you wish you knew when you started traveling?</b><br> Besides all the fun things about traveling, I wish we had known that traveling long term and not eating a proper diet could really affect your health in mysterious ways. Ishwinder suffered from a severe throat infection for four&#160;months and is still recovering from it. The thing that did the most damage was the improper medication she took. You must never treat yourself with medications you carry in your rucksack. It is worth spending money for medical checkups when you are abroad. But we have been hanging out at nature cure centers and yoga ashrams and are feeling a little better now. It&#8217;s important to slow down and take care of yourself.</p><p></p>*********************<br> It may be harder for Indian citizens to travel and obtain visas, but it&#8217;s not impossible. I&#8217;ve met many Indian travelers on the road, and as Vikram and Ishwinder&#8217;s story shows, it&#8217;s possible to successfully get visas. Maybe not to everywhere, but for enough places to keep you traveling for a while. For more, visit Vikram and Ishwinder at their blog, <a></a><h3>Become the Next Success Story</h3><p>It may be harder for Indian citizens to travel and obtain visas, but it&#8217;s not impossible. I&#8217;ve met many Indian travelers on the road, and as Vikram and Ishwinder&#8217;s story shows, it&#8217;s possible to successfully get visas. Maybe not to everywhere, but for enough places to keep you traveling for a while. For more, visit Vikram and Ishwinder at their blog, <a href=\"http://www.emptyrucksack.com/\">Empty Rucksack</a> </p><p>One of my favorite parts about this job is hearing people&#8217;s travel stories. They inspire me, but more importantly, they also inspire you. I travel a certain way, but there are many ways to fund your trips and travel the world.&#160;I hope these stories show you that there is more than one way to travel and that is within your grasp to reach your travel goals. Here are some more examples of people who made their travel dreams come true:</p></div>","title":"How this Indian Couple Gets Visas and Travels the World"}},"pageContext":{"id":"5b95eab087be05832748ffc6"}}