{"data":{"mongodbDatabaseArticles":{"id":"5b95f4fa87be05832749013e","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Thai Visa 101: Common Misconceptions and Lingo Mistakes</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/thai-visa-101/\"><img class=\"aligncenter size-full wp-image-10523\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/09/ThaiVisa101r1.png?resize=556%2C371&amp;ssl=1\" alt=\"Thai Visa 101\" width=\"556\" height=\"371\"></a><br>\nUnderstanding Thailand&#8217;s visa laws can be quite frustrating. For one, they change a lot. And two, if you aren&#8217;t familiar with the proper lingo, things can get hairy pretty quickly. To make things easier, especially if you are new to learning about Thai visas, we&#8217;ve addressed some common misconceptions and lingo mistakes.</p>\n\n\n\n<p><strong>JULY 2017 UPDATE:</strong></p>&#160;This post reflects Thailand&#8217;s most up-to-date visa laws.\n\n\n\n<p>Let&#8217;s start with the basics. There are many different types of Thai visas. They include business, dependent, education, retirement, tourist, medical, and volunteer visas. You can recognize a Thai visa by the shiny paper sticker placed in your passport. They give you varying lengths of stays, can be extended, and have different application requirements for each type.</p>\n<h2><p id=\"Common_Misconceptions_Explained\"><p>Common Misconceptions Explained</p></p></h2>\n<p>We&#8217;ve seen our fair share of discussions gone wrong in online forums and on Facebook threads. Here are two questions that commonly pop up but have a multitude of answers:</p>\n<h3><p id=\"Can_Iapply_fora_Thai_visa_in_Thailand\">Can I&#160;apply for&#160;a Thai visa in Thailand?</p></h3>\n<p>Technically speaking, no.</p>\n<p><strong>The closest you can get to applying for a visa in Thailand is a &#8216;Visa On Arrival&#8217; literally meters before going&#160;through the immigration checkpoint to get into Thailand.</strong> And this only applies to passport holders of these <a href=\"http://www.thaivisaservice.com/visa-rules\" target=\"_blank\" rel=\"nofollow noopener\">21 countries</a>. Immigration counters at most land crossings&#160;along Thailand&#8217;s border (not all entry points) as well as at&#160;Thailand&#8217;s international airports issue this type of visa. But again, it&#8217;s just before you actually enter ther country.</p>\n<p>A Thai visa should also not be confused with the free Visa Exempt Stamp, which isn&#8217;t a visa. We talk more about this below.</p>\n<p>Otherwise, <strong>foreigners looking to enter Thailand on a Tourist or Non Immigrant visa must apply for one at either&#160;a Royal Thai Embassy or Consulate-General.</strong> These offices only exist in&#160;other countries around the world and not in Thailand.</p>\n<p>Living in America and need a Thai visa? There&#8217;s a Royal Thai Embassy in Washington, DC. Vacationing in Canada? It&#8217;s in Ottawa. Sating in Australia? Go to Canberra. A Royal Thai Embassy can be found in London if you are in the UK. There are also smaller Royal Thai Consulate-Generals in&#160;each of these countries.</p>\n<p>Alternatively, <strong>you cannot apply for a Thai visa at your country&#8217;s embassy in Thailand.</strong> For example, an American cannot go to the American Embassy in Thailand (located in Bangkok) and apply for a Thai visa. It is not possible.</p>\n<p><strong>It is possible to change your visa type once you are in Thailand, but you must already have an existing visa.</strong> This can be done at the <a href=\"http://www.immigration.go.th\" target=\"_blank\" rel=\"noopener\">Office of Immigration Bureau</a>&#160;in Bangkok. It&#8217;s located on Soi Suan Plu off South Sathorn Road and can be reached at (022) 873-101.</p>\n<h3><p id=\"A_single_entry_tourist_Thai_visa_is_good_for_60_days_Or_is_it_90_days\">A single entry tourist Thai visa is good for 60 days. Or is it 90 days?</p></h3>\n<p>A single entry tourist visa grants a visitor up to 60 days in Thailand. However, you can apply for a 30-day extension at your local immigration office (there is one in every&#160;province, i.e. Thai &#8220;state&#8221;), so you don&#8217;t have to leave Thailand to do this. An extension costs 1,900 baht and the 30 days will be tacked on after the 60th day of your Thai tourist visa, no matter when you apply for it.</p>\n<p>Therefore, <strong>a single entry tourist visa can get you 60 days plus a 30-day extension for a total of 90 days.</strong></p>\n<h2><p id=\"Lingo_Mistakes\"><p>Lingo Mistakes</p></p></h2>\n<p>Using improper terminology causes a lot of confusion about an already confusing subject! Let&#8217;s clarify a few things:</p>\n<h3><p id=\"A_visa_exempt_stamp_is_not_a_visa\">A visa exempt stamp is not a visa.</p></h3>\n<p><img class=\"aligncenter size-full wp-image-10524\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/09/VisavsStamp.png?resize=559%2C345&amp;ssl=1\" alt=\"Thai Visa vs Thia Visa Exempt Stamp\" width=\"559\" height=\"345\"></p>\n<p>Let&#8217;s start with the definition of &#8216;exempt&#8217;, as defined by Merrian-Webster&#8217;s Dictionary:</p>\n<pre>exempt (adj): not required to do something that others are &#13;\n              required to do</pre>\n<p>A visa exempt stamp means that you are not required to have a visa. It&#8217;s a waiver. In lieu of a visa, a visa exempt stamp (the rubber kind with ink) is stamped into your passport.</p>\n<p>Citizens of the following <a href=\"http://www.thaivisaservice.com/visa-rules\" target=\"_blank\" rel=\"noopener\">55 countries</a>, including Australia, Canada, Germany, Japan, New Zealand, South Africa, the UK, and the USA receive a visa exempt stamp that allow them to stay in Thailand for 30 days &#8211; for free.</p>\n<p>A visa exempt stamp is perfect for the short-term traveler. Anyone who wants to stay in Thailand for less than a month or is passing through as they hop around Southeast Asia should stick with the convenient (and did we mention, free?) visa exempt stamp.</p>\n<p>If you do want to stay a bit longer, you can <a title=\"How to Extend a Thai Tourist Visa and Visa Exempt Stamp\" href=\"https://www.tielandtothailand.com/how-extend-thai-tourist-visa-chiang-mai/\" target=\"null\">apply for an extension</a> at any local Thai Immigration Office. As of August 29, 2014, an extension will grant you another 30 days and costs 1,900 baht.</p>\n<p>Remember, it is not a visa. It is simply an ink stamp in your passport.</p>\n<h3><p id=\"There_is_no_such_thing_as_a_work_visa\">There is no such thing as a work visa.</p></h3>\n<p><strong>There is a Non Immigrant &#8216;B&#8217; Business Visa, nicknamed a B Visa, and there is a Work Permit. They are two separate, very different documents. They cannot be combined and dubbed &#8220;work visa.&#8221;</strong></p>\n<p>A Non Immigrant Business Visa is the shiny paper sticker that goes into your passport and gives you permission to legally work in Thailand. It&#8217;s good for up to a year (once it&#8217;s been extended during the first 90 days) and is issued by a Royal Thai Embassy or Consulate. A Business Visa costs roughly the equivalent of 65 USD; the exact fee and method of payment vary slightly for each country&#8217;s office due to the currency exchange rate.</p>\n<p>A Work Permit is a document that looks a lot like a blue passport and is issued by Thailand&#8217;s Department of Labor. Your employer provides you with the right paperwork to apply for a Thai work permit. A work permit shows that you are a properly registered tax-paying employee and it costs 3,000 baht (roughly 100 USD) for one year.</p>\n<p><a href=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/09/Work-Permit.jpg?ssl=1\"><img class=\"aligncenter wp-image-10528 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/09/Work-Permit.jpg?resize=563%2C440&amp;ssl=1\" alt=\"Thai Work Permit\" width=\"563\" height=\"440\"></a></p>\n<p><strong>To work legally in Thailand, you need both a B Visa and a Work Permit.</strong> But again, there is no such thing as a work visa.</p>\n<p>A border run and visa run are two different things.</p>\n<p><strong>A border run is, quite literally, a run to the (Thai) border.</strong> It allows you to activate the next visa entry on your multiple entry visa OR to re-enter Thailand on a Visa Exempt Stamp or a Visa On Arrival (if you are not on a multiple entry visa).</p>\n<p>The most common border run method is to take a scheduled van to the land border of Thailand&#8217;s neighboring countries (Myanmar, Laos, Cambodia, or Malaysia). Foreigners cross the border for short time and then re-enter Thailand.</p>\n<p><strong>A visa run is much more complex than a border run. It involves going to a Royal Thai Embassy or Consulate (which only exist outside of Thailand) and applying for a visa.</strong></p>\n<p>A visa run is not a quick, relatively easy, or inexpensive trip like a border run is. Instead, it usually involves standing in a long line to apply for a new visa (hoping that all your paperwork is correct and that you&#8217;re approved); spending at least one night in the neighboring country; waiting in line to pick up your new visa after it&#8217;s been processed; re-entering Thailand.</p>\n<h3><p id=\"There_is_no_such_thing_as_a_residency_visa\">There is no such thing as a residency visa.</p></h3>\n<p>There is what&#8217;s called <a title=\"Thai permanent residency\" href=\"http://www.thaiembassy.com/thailand/thai-permanent-residency.php\" target=\"_blank\" rel=\"noopener\">Thai permanent residency</a>, but it is not a visa because you no longer have to apply for extension of stay and are not required to leave the country every year for a new one. The eligibility requirements to get Thai permanent residency are pretty steep and few foreigners are granted it each year. Obtaining Thai citizenship can be even harder.</p>\n<p>There is such a thing as a<strong> residence certificate. It is a simple document that proves you are residing here (i.e, that you are paying rent).</strong> For example, a <a title=\"Residence Certificate Required to Buy a Vehicle\" href=\"https://www.tielandtothailand.com/certificate-residency/\">residence certificate</a> is required when applying for a Thai license or buying a vehicle in Thailand. But it is NOT a visa or part of the paperwork required to get a visa.</p>\n<p><strong>Foreigners who want to live in Thailand for many years are best off obtaining a Non Immigrant Visa and reapplying for a new one or extending it every year.</strong> Just make sure you still meet the minimum visa and extension requirements! It is a common practice for people to stay in Thailand for many years on a Non Immigrant Business, Education, Dependent, or Retirement Visas.</p>\n<h2><p id=\"Covering_the_Thai_Visa_Basics\"><p>Covering the Thai Visa Basics</p></p></h2>\n<p>We hope this sets straight some of the basic questions people often have with Thai visas. Before you get the correct answer, you have to be able to ask the correct question. Good luck!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Thai Visa 101: Common Misconceptions and Lingo Mistakes"}},"pageContext":{"id":"5b95f4fa87be05832749013e"}}