{"data":{"mongodbDatabaseArticles":{"id":"5b937adc87be056953db7ce0","content":"<div><h1 name=\"62ce\" id=\"62ce\" class=\"graf graf--h3 graf--leading graf--title\"><strong class=\"markup--strong markup--h3-strong\">5 Reasons Why Being A Digital Nomad Might Not Be Your Thing, After&#160;All</strong></h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*jaHdQs2bl_lqqsdFxJa3zQ.jpeg\"><p name=\"1b74\" id=\"1b74\" class=\"graf graf--p graf-after--figure\">The life of a digital nomad. A hot topic nowadays, and one that piques the interest of many. Promises of tropical islands, freedom, autonomy and self-determination. But what is behind the scenes, and is this lifestyle for everyone?</p><p name=\"c4ae\" id=\"c4ae\" class=\"graf graf--p graf-after--p\">A few years ago, being a digital nomad was a concept known only by few. The idea was that you could make use of technology and coordinate your work online, while traveling the world. Popular professions for enthusiasts of the lifestyle became most things IT-related, graphic design, writing, marketing and whatever else you could do on a computer connected to the internet. South-East Asia, Latin America and Eastern Europe became popular destinations because of their usually fast and reliable Internet connection, beautiful scenery and cheap living costs. The American Dream became a worldwide one, and transformed in ways unimaginable before the technological boom. Old values grew into new ones, where, by large, a focus on material goods was replaced by a desire for self-actualizing, life-enriching experiences.</p><p name=\"684e\" id=\"684e\" class=\"graf graf--p graf-after--p\">Within that context, becoming a digital nomad presented itself as an opportunity to live lives more suitable to the inner cores of many of us.</p><p name=\"c77b\" id=\"c77b\" class=\"graf graf--p graf-after--p\">But what are the downsides and can they be navigated? And why might being a true digital nomad not be for you, after all?</p><p name=\"8003\" id=\"8003\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">1.You want to be home</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*CH8JPNJBw5sxbKm74IDMiQ.jpeg\">Home is where the heart&#160;is<p name=\"b09b\" id=\"b09b\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--figure\">&#8220;Home&#8221; is just a feeling, so I&#8217;m not talking here about a place, per se, or a physical house. A home is a feeling of belonging, of having your own little spot in the world. A feeling of building a house, in a sense, but one for your heart. And building anything takes some time, and a certain degree of consistency.</p><p name=\"05c6\" id=\"05c6\" class=\"graf graf--p graf-after--p\">Home is the place you feel bonded with, the community to which you belong, a feeling of having roots somewhere, even though you might travel often. It&#8217;s somewhere to return to and it gives a certain sense of continuity to your life and story, like the thread that holds your memories together.</p><p name=\"ce12\" id=\"ce12\" class=\"graf graf--p graf-after--p\">It&#8217;s more difficult to develop a sense of belonging somewhere if you&#8217;re moving every three months. Everything feels temporary and on some level you might not even allow yourself to feel a deeper bond to the places you visit or the people you meet, knowing it would end soon anyway.</p><p name=\"a252\" id=\"a252\" class=\"graf graf--p graf-after--p\">The other side of the coin is that those you meet often feel the same&#8202;&#8212;&#8202;that you are temporary in a way, just passing through their lives, and therefore they don&#8217;t invest deeper. Even without wanting to, this kind of inner feeling can color a person&#8217;s behavior and shape their relationship with someone.</p><p name=\"e618\" id=\"e618\" class=\"graf graf--p graf-after--p\">Home can really be wherever the heart is. Maybe it only matters with whom you are and what you&#8217;re doing, and then the world is your oyster. But what do you do when those you love don&#8217;t want to go away with you? And that brings us to the second point.</p><p name=\"32d0\" id=\"32d0\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">2.You want to be close to your dear ones</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*52iwp00OxwKRjKg-aOb4OA.jpeg\"><p name=\"a1fb\" id=\"a1fb\" class=\"graf graf--p graf-after--figure\">And sometimes they are not the nomadic type. Then what? If your wishes lean more one way rather than the other, then your choice is easier and, in the end, it&#8217;s all about what matters most to you. And you SHOULD live your life according to what fits most that inner core of yours. At the end of the day, that is the line you draw, underneath which you do the sum of your choices.</p><p name=\"bae1\" id=\"bae1\" class=\"graf graf--p graf-after--p\">A compromise that comes close can be having a home base from where you travel often. That way you can satisfy both your need for exploring and your need to be close to your loved ones. The 9 to 5, always stuck in one place, doesn&#8217;t need to be your only option, not by far.</p><p name=\"f7fd\" id=\"f7fd\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">3.It can be tiring to be on the road all the time</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Zb_gxbXtTcGEvQVxVX6_Nw.jpeg\">Again on the&#160;move<p name=\"288c\" id=\"288c\" class=\"graf graf--p graf-after--figure\">This is probably the most tangible downside of them all. Most digital nomads are attracted to this lifestyle in part because they love traveling, but this is where too much of a good thing can become tiring. Simply put, going from place to place all the time can become a drag.</p><p name=\"e520\" id=\"e520\" class=\"graf graf--p graf-after--p\">Even though you might have only a backpack to your name, it can still become a hassle to move somewhere new every few months. And it can easily become physically, mentally and emotionally draining. Maybe this has even a sort of evolutionary component to it. We humans tended to move to new places mostly in a quest to improve our living conditions.</p><p name=\"fcad\" id=\"fcad\" class=\"graf graf--p graf-after--p\">Nowadays travel is much more comfortable and fast, and the leisure, explorative aspects of it took precedence over the practical reasons why we do it, but it seems that the association we make between the physical act of traveling and tiredness has stayed. It&#8217;s almost are though we are willing to pay the price of tiredness in exchange for the exhilaration traveling gives.</p><p name=\"5d83\" id=\"5d83\" class=\"graf graf--p graf-after--p\">On the other hand, if you do spend a slightly longer time everywhere, but not long enough to develop roots, such as 3 months&#8202;&#8212;&#8202;a year, you can become emotionally exhausted from having to constantly break attachments to places, people, habits, or whatever connections you develop to your temporary home.</p><p name=\"25ba\" id=\"25ba\" class=\"graf graf--p graf-after--p\">Personally, I think a bit of tiredness is a price worth paying, and what&#8217;s it compared to all the wonders you get to explore and experience while traveling? But this is also how you can start hating something you used to love. Remember that song you played for 100 times in a row because you liked it so much?&#160;:) We can reach a point of burnout with anything we love doing, if taken to the extreme.</p><p name=\"247c\" id=\"247c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">4.You feel lonely if you don&#8217;t get to build and enjoy deep and close relationships</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*fO6J3lZhufnVL6VUIcf9TA.jpeg\"><p name=\"a572\" id=\"a572\" class=\"graf graf--p graf-after--figure\">Many travelers meet friends on their trips, sometimes even staying in touch years later, catching up in different corners of the world every now and then. And these relationships don&#8217;t lack depth and warmth, or meaning and fun, or any of all the other beautiful qualities close relationships have. It doesn&#8217;t necessarily take forever to become close to someone. A relationship is like a chemical reaction happening between two inner worlds, first and foremost, and the degree of intimacy will depend on the two people involved.</p><p name=\"5c30\" id=\"5c30\" class=\"graf graf--p graf-after--p\">However, logistically speaking, it&#8217;s simply easier to build closeness and intimacy when you get to naturally spend more time together, over a variety of activities and contexts. Chemical reactions also sometimes get different flavors and colors when mixed for longer. Relationships, too, don&#8217;t really exist and develop in a vacuum, but are interconnected with all the other aspects of a person&#8217;s life.</p><p name=\"7e18\" id=\"7e18\" class=\"graf graf--p graf-after--p\">A growing sense of dissatisfaction starts to build when all your deep connections start drifting away, none actually growing into deep relationships. With every person that passes through your life like a shooting star, a sense of core loneliness develops. Everyone is a friend, and none a partner in crime with whom you have a history and build all sorts of memories.</p><p name=\"15c1\" id=\"15c1\" class=\"graf graf--p graf-after--p\">Even though some nomads travel with their partners, and even children, it&#8217;s more rare that one travels with their siblings and friends too, for example. And even though you schedule touching base with your family and friends from around the world, there is one more thing you might be missing on.</p><p name=\"b751\" id=\"b751\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">5. You miss those small, spontaneous moments</strong></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*K0kWuwgLi54tLwfSmuQUlw.jpeg\">You might wonder why a photo of goats. Goats are cute. And they seem to get&#160;it.<p name=\"b5f5\" id=\"b5f5\" class=\"graf graf--p graf-after--figure\">Those moments that don&#8217;t necessarily happen when you have a coffee date, or dinner together, but come up all the time when you spend extended time together, hanging out.</p><p name=\"0078\" id=\"0078\" class=\"graf graf--p graf-after--p\">Time spent together just naturally creates the kind of moments that become your funniest, most treasured memories. This doesn&#8217;t really happen as easily when you have a three-hour date-to-update with someone, even though the bond and intimacy may still be there. I&#8217;d also argue that more often than not, intimacy would suffer too. It&#8217;s easier to keep a mask and do pleasant conversation for three hours than for twenty. When you spend more time together you also get the chance to see different sides of a person, which also increases intimacy.</p><p name=\"85f5\" id=\"85f5\" class=\"graf graf--p graf-after--p\">And here&#8217;s the kick.</p><p name=\"54cf\" id=\"54cf\" class=\"graf graf--p graf-after--p\">Not being a digital nomad still doesn&#8217;t necessarily mean that you&#8217;re home, even just within yourself. It doesn&#8217;t necessarily mean you are close to your loved ones, or that you&#8217;re not tired, or alone, or unavailable for those spontaneous moments of connection.</p><p name=\"98a5\" id=\"98a5\" class=\"graf graf--p graf-after--p\">So how do you strike the balance between all your needs? How do you live authentically, in line with your inner core? And what are your priorities when you choose how and where to work?</p><p name=\"d22e\" id=\"d22e\" class=\"graf graf--p graf-after--p graf--trailing\">P.S: All these questions are not rhetorical&#8202;&#8212;&#8202;I actually really AM curious about your experience, so let me know!&#160;:)</p></div>","title":"5 Reasons Why Being A Digital Nomad Might Not Be Your Thing, After All"}},"pageContext":{"id":"5b937adc87be056953db7ce0"}}