{"data":{"mongodbDatabaseArticles":{"id":"5b95ee6587be0583274900d8","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Exploring Thailand&#8217;s Countryside with Campervan Thai</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/exploring-thailands-countryside-with-campervan-thai\"><img class=\"aligncenter size-full wp-image-11722\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/Campervanthai-Header.jpg?resize=562%2C421&amp;ssl=1\" alt=\"Exploring Thailand's Countryside with Campervan Thai\" width=\"562\" height=\"421\"></a><br>\nWe&#8217;ve been on just about every imaginable form of transportation in Thailand including&#160;airplane, bus, van, train, water taxi, longtail boat, tuk-tuk, bicycle, and motorbike. But one thing we&#8217;ve completely overlooked was traveling Thailand in a campervan! For all of those travelers who find&#160;RVing nostalgic, you&#8217;ll be happy learn about Thailand&#8217;s first&#160;campervan company, Campervan Thai.</p>\n<p><img class=\"size-full wp-image-11735 aligncenter\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/campervanthai-1.jpg?resize=563%2C386&amp;ssl=1\" alt=\"Campervan Thai Close Up\" width=\"563\" height=\"386\"></p>\n<p>It never occurred to us to travel in a campervan in Thailand. It&#8217;s probably because of all the different modes of transportation we&#8217;ve used, we&#8217;ve never seen one during our travels. And we think the local Thais can agree &#8211; we&#160;caught several of them staring at our unique ride&#160;and pointing in awe as we drove down the highway.</p>\n<p>These vehicles&#160;are ideal for a group of friends or a family and the perfect combination of a comfortable sleeping area and transportation. Even tour groups are encouraged to use Campervan Thai to explore Thailand&#8217;s countryside.</p>\n<h2><p id=\"Touring_with_the_Small_Terra_Campervan\"><p>Touring with the Small Terra Campervan</p></p></h2>\n<p>We took a three-day/two-night trip not far from Bangkok in Campervan Thai&#8217;s smallest vehicle. It&#8217;s good for two to four adults, but there are bigger vehicles available too. This includes a mid-sized that holds six to eight people and the largest size that holds eight to ten people.</p>\n<h3><p id=\"Main_Cabin_Area\"><p>Main Cabin Area</p></p></h3>\n<p><img class=\"aligncenter size-full wp-image-13185\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/Campervan-Thai-Interior-1000px.jpg?resize=1000%2C698&amp;ssl=1\" alt=\"Campervan Thai Interior\" width=\"1000\" height=\"698\"><br>\nThe area above the driver&#8217;s cab offers ample storage for luggage. There are also several interior drawers with locking doors as well as cubbies and shelves to hold items. There is even a small wardrobe area to hang up clothes.</p>\n<p>The vehicle&#160;is&#160;equipped with a microwave, mini fridge, flat screen TV, and radio with a speaker system. There is also a small sink attached to its own small water tank.</p>\n<p>The interior lighting, air conditioning, and converter run off the campervan&#8217;s battery. We only used these amenities&#160;when the vehicle was running. At night, we used the generator for power.</p>\n<p>The dining table can seat four people, but it&#8217;s&#160;more comfortable if two people sit at the table and the other two sit on the bench across the narrow aisle. There are four cup holders and several small shelving areas to keep containers and other small items&#160;from sliding around.</p>\n<h3><p id=\"Bathroom\"><p>Bathroom</p></p></h3>\n<p>The bathroom is equipped with a shower and toilet, which are&#160;hooked up to a water tank in the campervan or an external water source. There are a shower curtain and two small shelves for toiletries. Although the bathroom is small (wide and tall people may find it tight), it&#8217;s completely functional and also has a sink and a small trashcan.</p>\n<p><img class=\"size-full wp-image-11727 aligncenter\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/campervanthai-8.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Shower, sink, and tub\" width=\"563\" height=\"422\"></p>\n<h3><p id=\"Sleeping_Area\"><p>Sleeping Area</p></p></h3>\n<p>The camper has two sleeping areas that fit two adults comfortably each. One is above the driver&#8217;s cab, which expands by 1.5ft to produce extra sleeping room. Even though Chris is 6&#8217;1&#8243;&#160;tall (185cm) with broad shoulders, we were both able to sleep next to each other comfortably with room to spare. The second sleeping area is made by converting the dining table in the main area.&#160;There is a privacy curtain that separates the two sleeping areas.</p>\n<p><img class=\"aligncenter size-full wp-image-13186\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/Campervan-Thai-Interior-Day-Night-1000px.jpg?resize=1000%2C348&amp;ssl=1\" alt=\"Campervan Thai Interior Day/Night\" width=\"1000\" height=\"348\"></p>\n<p>The windows can be opened at night (not while driving though) to let in a nice cross breeze. There are mosquito screens and privacy screens on every window.</p>\n<h3><p id=\"Extra_Features\"><p>Extra Features</p></p></h3>\n<ul>\n<li>220V converter for electrical appliances</li>\n<li>Two double prong outlets on the fridge and two additional double prong outlets next to the TV (one of which is used by the TV)</li>\n<li>Wifi and GPS, which can be provided by requesting in advance</li>\n<li>Onboard first aid kit</li>\n<li>5kW generator</li>\n<li>Freshwater, grey water, and sewage tanks</li>\n<li>Automatic transmission with four-wheel drive and ABS</li>\n</ul>\n<h2><p id=\"The_Cost\"><p>The Cost</p></p></h2>\n<p>Campervan Thai offers three different vehicle sizes:</p>\n<ul>\n<li>Small (Terra): 6,000 baht (180 USD) per night</li>\n<li>Medium (Zil): 9,000 baht (270 USD) per night</li>\n<li>Large (Vega): 12,000 baht (360 USD) per night</li>\n</ul>\n<p>Long-term rentals will receive a discount on the total price. Although the original price and discount is subject to change, as of March 2015 you can receive 10% off your total booking if you book a week or more and 20% off if you rent a month or more.</p>\n<p><strong>We realize that the per night cost is more than your typical hotel in Thailand but you&#8217;re getting a lot of value for your money.</strong> If&#160;you split the cost among friends, the Terra model only comes to about $65 USD per night per person, for both a vehicle to get around Thailand and a nice place to sleep.</p>\n<p><img class=\"aligncenter size-full wp-image-13187\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/Campervan-Thai-1000px.jpg?resize=999%2C504&amp;ssl=1\" alt=\"Group tours with Campervan Thai\" width=\"999\" height=\"504\"></p>\n<p>This price includes the rental fees, insurance coverage for road accidents, and the overnight cost of the campsite which include electricity and water hookup.</p>\n<p>The cost of gas is not included in the price. Approximate gas mileage is 5&#160;to 8&#160;KPL and fuel tanks vary in size from 76 to 100 liters. Gas currently costs about 30 baht per liter (3.45 USD per gallon).</p>\n<p>A driver is optional. You can drive the campervan yourself or hire a driver starting at an&#160;extra 1,500 baht (45 USD) per night, depending on the program and period of rental. The driver will sleep outside the vehicle&#160;in a tent or a nearby hotel and will not impede on your privacy.</p>\n\n\n\nNOTE: Campervan Thai limits driving to 500 km per day. There is a 10 baht/km fee associated with exceeding this distance.\n\n\n\n<h2><p id=\"Our_Experience_with_Campervan_Thai\"><p>Our Experience with Campervan Thai</p></p></h2>\n<p>Let&#8217;s keep it short and sweet: we were very impressed with Campervan Thai. Everything from the helpfulness of the owner, the professionalism of our driver, and the amenities of the campervan were amazing.</p>\n<p><img class=\"aligncenter size-full wp-image-11730\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/campervanthai-3.jpg?resize=563%2C401&amp;ssl=1\" alt=\"Getting comfortable in Campervan Thai\" width=\"563\" height=\"401\"></p>\n<p>The interior was in excellent condition and very clean. The smallest&#160;model&#160;was plenty of room for the two of us and our driver, but we agree that up to four adults and certainly a family of four can travel comfortably in the smallest vehicle.</p>\n<p><img class=\"aligncenter size-full wp-image-11736\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/campervanthai-10.jpg?resize=563%2C401&amp;ssl=1\" alt=\"Campervan Thai\" width=\"563\" height=\"401\"></p>\n<p>The wardrobe area was a convenient spot for keeping one of our smaller luggage bags. We also liked that there were two drawers immediately upon entering the campervan that were a perfect spot to store our shoes.</p>\n<p>The ambient lighting was a nice touch&#160;(four different settings), in addition to&#160;single overhead light in&#160;both sleeping area and the bathroom. The air conditioning was powerful and ran smoothly all night.</p>\n<p>Our driver did an excellent job anticipating our needs. He drove responsibly; was always there to pull out the stairs when we stopped; kept our doors locked when we were exploring areas away from the campervan; tidied the van&#8217;s interior every day; turned on the AC before coming back into the vehicle; and even turned down the bed in the evenings.</p>\n<p>In short, the service was impeccable and we were really impressed!</p>\n<h2><p id=\"Suggestions\"><p>Suggestions</p></p></h2>\n<p>As excited as we were to hear the campervan had Wifi, it was spotty at best. However, from past experience while&#160;traveling in Thailand, cellular service is limited in some areas.&#160;Our lack of Wifi&#160;may have had less to do with campervan&#8217;s abilities and more to do with our route and lack of good cellular service.</p>\n<h2><p id=\"PackingRecommendations\"><p>Packing&#160;Recommendations&#160;</p></p></h2>\n<p>Since you aren&#8217;t staying in a hotel room, make sure to pack the following items:</p>\n<ul>\n<li>Toiletries, preferably in a small bag that you can clip or hang from the small rails in the bathroom</li>\n<li>Trash bags</li>\n<li>Towels, pillows, and a blanket</li>\n<li>Drinking water and snacks</li>\n<li>Three prong plug adapter to charge large appliances, such as a laptop</li>\n</ul>\n<h2><p id=\"Things_to_Know_Before_You_Go\"><p>Things to Know Before You Go</p></p></h2>\n<ol>\n<li>The owner will make sure you are well prepared for your trip. Allow an&#160;extra 30 to 45 minutes before your planned departure time for instructions on how to use the generator, to test drive the vehicle, how to fill up the gas, and how to hook up the water and electric sources at a campsite.</li>\n<li>Vehicles are equipped with a GPS locator to be able to find you&#160;in case of an emergency. There is a second unit that can be mounted to your windshield and gives directions in English.</li>\n<li>Campervan Thai has agreements with 18 different campsites and guesthouses around Thailand where you can park overnight and use their facilities for a small fee.</li>\n<li>If you are lost or need assistance, there is a 24-hour hotline to contact; if you need help, Campervan Thai will send someone to help you.</li>\n<li>Campervan Thai is located in Bangkok but will deliver their vehicles to any major city. Please contact them&#160;for their rates as prices will vary.</li>\n</ol>\n\n\n\nNOTE: In the event you do not make it to your&#160;evening&#160;destination, Campervan Thai recommends parking&#160;overnight at a gas station and to not park on the shoulder of the main road.\n\n\n\n<h2></h2>\n<p><img class=\"aligncenter size-full wp-image-11731\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/03/Campervan-Thai-Header-4.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Campervan Thai Small (Vera)\" width=\"563\" height=\"422\"></p>\n<p><strong>Website:</strong> <a title=\"Campervan Thai\" href=\"http://www.campervan-thailand.com/home.html\" target=\"_blank\" rel=\"noopener\">www.campervan-thailand.com</a><br>\n<strong>Office Phone:</strong> (021) 709-292 Ms. O<br>\n<strong>24 hr Emergency Contact:</strong> (080) 810-8085<br>\n<strong>Email:</strong> <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a><br>\n<strong>Address:</strong> 37/3 Khum Thong-Lam Toi Ting Road, Khwaeng Khum Thong, Khet Lat Krabang, Bangkok&#160;10520</p>\n<p>Disclosure: We received a three-day guided tour with Campervan Thai compliments of <a title=\"TBEX\" href=\"http://tbexcon.com/\" target=\"_blank\" rel=\"noopener\">Travel Bloggers Exchange (TBEX)</a>. Although we were not obliged to write a review about Campervan Thai in exchange for this expedition, we were genuinely amazed by their services and wanted to pass along the details of this unique campervan experience to our readers.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Exploring Thailand’s Countryside with Campervan Thai"}},"pageContext":{"id":"5b95ee6587be0583274900d8"}}