{"data":{"mongodbDatabaseArticles":{"id":"5b95ee1887be0583274900c9","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">8 Rotten Ways to be a Bad Expat in Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-12918\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/05/Bad-Expat-in-Thailand-Header-1000px.jpg?resize=999%2C661&amp;ssl=1\" alt=\"8 Rotten Ways to be a Bad Expat in Thailand\" width=\"999\" height=\"661\">While there&#8217;s no doubt that courteous and well-mannered people move to the Land of Smiles, all it takes is one bad expat in Thailand to make us all look bad. Here are some of the cringeworthy things we&#8217;ve&#160;seen expats do during our time living in Thailand.</p>\n<p><strong></strong></p>\n<h2><p id=\"01_Representing_YourHome_Country_Poorly\"><p>01 &#160;</p><p>Representing Your&#160;Home Country Poorly</p></p></h2>\n<p>We&#8217;ve seen more than a few expats who forgot to leave their bad habits at Thailand&#8217;s&#160;borders. Things like regularly&#160;walking around in&#160;public dressed inappropriately (going shirtless; wearing cleavage-revealing tops or booty shorts; walking around barefoot) or getting drunk and purposefully picking fights, both which are no-no&#8217;s in Thailand. There are expats who spit excessively in close proximity to other people and lazily&#160;leave trash in public areas for others to clean up.&#160;We&#8217;ve even&#160;dined with expats who complain that the service isn&#8217;t up to par with Western standards. Well duh, we&#8217;re in Thailand.</p>\n<p>Not only have these expats made themselves look like fools, but they&#8217;ve given the rest of us who haven&#8217;t forgotten our manners a bad name. Thai culture is generally accepting of foreigners but there are behaviors that are considered rude here. As an expat, it&#8217;s our responsibility to be aware of what is considered offensive now that we&#160;call Thailand our home.</p>\n<h2><p id=\"02_Negatively_Generalizing_the_Thai_Locals\"><p>02 &#160;</p><p>Negatively Generalizing the Thai Locals</p></p></h2>\n<p>We&#8217;re pretty disgusted when&#160;expats say&#160;condescending&#160;things about Thais. Phrases&#160;like,&#160;&#8220;They&#8217;re just a bunch of blood suckers,&#8221;&#160;&#8220;They&#8217;ll take you for everything you have,&#8221;&#160;&#8220;Ignorant and lazy,&#8221; and our personal favorite, &#8220;Why can&#8217;t they just learn to speak English?&#8221;</p>\n<p>Kudos to the Thai men and women who deal with foreigners&#8217; poor attitudes&#160;day in and day out and keep those revered smiles on their faces. Obviously that bad expat in Thailand has clearly forgotten that he or she is a guest in this country. And as a (polite) guest, one doesn&#8217;t offend their host, right? And by all means, Thai people are about as polite as they come.</p>\n<p><strong>TIP:</strong> If an expat has reached a point in his or her life where they are consumed by bitterness about&#160;their host country, it may be time to move on or, at the very least, learn how to forgive and forget.</p>\n<h2><p id=\"03_Never_Learning_the_Local_Thai_Language\"><p>03 &#160;</p><p>Never Learning the Local Thai Language</p></p></h2>\n<p>When moving to a new country, whether it&#8217;s for a year, five, or infinitely, isn&#8217;t it fair to put some effort into learning the language? There are expats in&#160;Thailand who know nothing more than &#8220;hello&#8221; and &#8220;thank you&#8221; in Thai but&#160;they&#8217;ve lived here for years. Where&#8217;s the ambition or sense of adventure?!</p>\n<p>We&#8217;ve had our own <a href=\"https://www.tielandtothailand.com/struggle-learn-thai-second-language/\">struggles learning Thai</a>&#160;and it&#8217;s not an easy language to learn. And with so many expats in Thailand, it&#8217;s definitely tempting (and quite easy)&#160;to settle into a clique and never learn to&#160;speak Thai. Plus it&#8217;s possible to survive in the major cities without using Thai, although&#160;in the countryside&#160;it&#8217;s an entirely different story.</p>\n<p>Making an effort to learn Thai shows that, as expats, we&#160;care about the country we&#8217;re living in and we have pride in connecting with its people. Emotions aside, learning Thai is practical! Asking how much it costs to go to the airport or ordering drinks&#160;at a restaurant in Thai not only gives us a sense of independence, but gives the locals a good impression of us. Or at the very least, doesn&#8217;t give a bad one.</p>\n<h2><p id=\"04_Not_Taking_Care_of_YourHealth\"><p>04 &#160;</p><p>Not Taking Care of Your&#160;Health</p></p></h2>\n<p>Medical care is generally more affordable in Thailand than it is in Western countries. And there&#8217;s usually no language barrier or lack of training because many doctors speak fluent English and have been trained in modern medical practices. Even so, we&#8217;ve seen expats who&#8217;ve stopped taking care of their mental and physical well being since moving abroad.</p>\n<p>We get it. Without Big Brother knocking on their&#160;door telling them&#160;when to go to the doctor, it&#8217;s possible to get out of the&#160;normal healthcare routine such as&#160;taking care of a bad tooth or that weird toenail growth. And believe us, we&#8217;ve seen some wicked teeth (or lack there of) and talons out there as proof. Other expats have a rough time living abroad, and without the proper friend and family support system, they don&#8217;t get&#160;professional help to treat their depression, anxiety, or anger problems.</p>\n<p>So&#160;when expats&#160;stop doing routine check-ups&#160;or they&#160;completely forgo the doctor when their&#160;health starts to deteriorate,&#160;that&#8217;s a serious&#160;problem.</p>\n<h2><p id=\"05_Chastising_New_Expats_for_Their_Naivety_and_Eagerness\"><p>05 &#160;</p><p>Chastising New Expats for Their Naivety and Eagerness</p></p></h2>\n<p>Sitting across a bar, we&#8217;ve seen older men take younger guys under their wing and tell them how submissive or crazy (it&#8217;s always one of the two) Thai women are. Puh-lease. Way to overgeneralize. Or veteran teachers who&#8217;ve hardened over time and scoff at the fresh ideas and enthusiasm of first time teachers.&#160;We&#8217;ve also heard lifers tell new expats that they&#8217;re crazy to&#160;live here and to go back to their home country while they&#160;still can.</p>\n<p>While there&#8217;s a time and place for being bluntly honest, twisting or skewing information or completely shooting down another person&#8217;s dreams is pretty low in our books and a perfect example of being a bad expat in Thailand.</p>\n<h2><p id=\"06_Resenting_the_Oddities_of_Thailand\"><p>06 &#160;</p><p>Resenting the Oddities of Thailand</p></p></h2>\n<p>It&#8217;s not uncommon to have&#160;single ply toilet on&#160;restaurant tables but have no TP stocked in the bathrooms. There are several Thai holidays in which alcohol sales are banned. And sometimes there&#8217;s a <a href=\"https://www.tielandtothailand.com/thai-dual-price-system/\">dual price system</a>&#160;that charges more for foreigners than for locals. All of these can be quite frustrating for expats whose countries regularly stock toilet paper in bathrooms, always sell alcohol on holidays, and never discriminate on pricing.</p>\n<p>To many expats, <a href=\"https://www.tielandtothailand.com/things-to-get-used-to-thailand/\">Thailand is full of oddities</a>, but as the saying goes &#8211; This Is Thailand. Rather than fight it or whine about things we can&#8217;t control, go with the flow.&#160;Once expats&#160;learn to&#160;accept it as is&#160;(or come prepared&#160;by always&#160;carrying a packet of tissues), they&#8217;re in for a much more pleasant&#160;time in Thailand.</p>\n<h2><p id=\"07_Spending_as_Little_Money_as_Possible\"><p>07 &#160;</p><p>Spending as Little Money as Possible</p></p></h2>\n<p>Living is cheap in Thailand, which is why we&#8217;re confused&#160;when people get drawn into a lifestyle in which they begin to&#160;pinch pennies to the point of unhappiness and boredom!</p>\n<p>We&#8217;ve overheard expats complaining about their 600 baht ($20 USD) electricity bill. We&#8217;ve read forums in which&#160;people moan about a 30% increase in fresh coffee prices, when in reality, their latte now costs&#160;40 baht, up from 30 baht.</p>\n<p>One reason why people come to Thailand is because the cost of living is so affordable and they can stretch their money. But <a href=\"https://www.tielandtothailand.com/cant-recommend-living-on-usd500-per-month-in-chiang-mai/\">living cheaply can backfire</a>&#160;when all an expat does is hole&#160;themselves&#160;up and spend as little as possible. Yes, for some it&#8217;s about&#160;survival,&#160;but others it&#8217;s an obsession about the (low) dollar figure.&#160;In the end, most expats who do this will only experience&#160;unhappiness and loneliness in return.</p>\n<h2><p id=\"08_Not_Living_Life_to_the_Fullest\"><p>08 &#160;</p><p>Not Living Life to the Fullest</p></p></h2>\n<p>For heaven&#8217;s sake we&#8217;re in Thailand! We aren&#8217;t stuck in some dead end cubicle job, or far worse, in an oppressed country where it&#8217;s not safe to go outside. Use this as an opportunity to explore different parts of Thailand and it&#8217;s neighbors in Southeast Asia.&#160;Thailand has everything from beaches to mountains and a constantly growing infrastructure.</p>\n<p>For&#160;expats who have lost their way, a good place to start is thinking back to what attracted them to&#160;live&#160;in Thailand in the first place.</p>\n<h2><p id=\"How_to_Not_Be_a_Bad_Expat_in_Thailand\"><p>How to <p>Not</p>&#160; Be a Bad Expat in Thailand</p></p></h2>\n<p>To end on a positive note, we encourage everyone to be a good expat in Thailand. Here&#8217;s how:</p>\n<p><img class=\"aligncenter size-full wp-image-12921\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/05/Bad-Expat-in-Thailand-Advice-1000px.jpg?resize=998%2C661&amp;ssl=1\" alt=\"How Not to be a Bad Expat in Thailand\" width=\"998\" height=\"661\"></p>\n<p>Do you agree?</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"8 Rotten Ways to be a Bad Expat in Thailand"}},"pageContext":{"id":"5b95ee1887be0583274900c9"}}