{"data":{"mongodbDatabaseArticles":{"id":"5b9624f687be058327490f4b","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">40 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p>This September, I will begin a race against 5 other travel bloggers to break the record for the world&#8217;s longest continuous train journey. To be more precise, <a href=\"http://www.ultimatetrainchallenge.com/\">The Ultimate Train Challenge</a> will have me hopping from train to train, beginning in Lisbon, Portugal all the way to Vietnam&#8217;s Saigon.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2011/06/madrid-atocha-train-station.jpg\" alt=\"madrid atocha station spain\" width=\"323\" height=\"430\"><strong>What Is The Ultimate Train Challenge?</strong></p>\n<p>In short, it&#8217;s a friendly competition between each of us who love <a href=\"http://www.foxnomad.com/category/travel/\">travel</a> to try and break a standing world record. Some of the major rules are: we must sleep on the train each night, can&#8217;t backtrack through a country once we&#8217;ve passed it, and aren&#8217;t allowed to repeat any length of rail. When I was first approached with the idea by <a href=\"http://www.goseewrite.com/\">Michael Hodson</a>, I found both the travel and personal challenge difficult to resist.</p>\n<p>I&#8217;ll spend a little over a week in Portugal, including the <a href=\"http://www.foxnomad.com/2011/04/05/the-best-city-to-visit-travel-tournament-2011-winner-is-porto-portugal/\">best city to visit in 2011 Porto</a>, before the race begins on September 1rst. Aside from exploring Portugal, a country I haven&#8217;t visited yet, I&#8217;ll also be wrapping up the final preparations for a month where I&#8217;ll have <a href=\"http://www.techguidefortravel.com/2011/05/10/how-to-stay-online-from-anywhere-3-levels-of-remote-connectivity/\">extremely limited Internet access</a>. Maintaining <a href=\"http://www.foxnomad.com/\">foXnoMad</a> and <a href=\"http://www.foxnomad.com/2011/06/21/common-misconceptions-and-several-truths-about-travel-blogging-digital-nomads/\">all that comes with it</a> will undoubtedly be my biggest challenge over the roughly 27 days the trip will take.</p>\n<p><strong>Join Me For Legs Of The Race</strong></p>\n<p>Those of you who might happen to be taking a train in Europe or along my route this September are more than welcome to join me for legs of my trip. I&#8217;ll announce the exact route I&#8217;m taking sometime in late July so if you want a beer, coffee, or conversation it&#8217;s on me if we can make schedules match.</p>\n<ul>\n<li>Many days during the trip I&#8217;ll also be running into town to find wireless at cafes which I&#8217;ll post to <a href=\"http://www.foursquare.com/foxnomad\">foursquare</a> and <a href=\"http://gowalla.com/foxnomad\">Gowalla</a> if you want to come by and say hi.</li>\n</ul>\n<p>I&#8217;m also planning a separate, major video project in late October that will have a paid camera-person position &#8211; a job that will include a few weeks of exotic travel. If you happen to be good with a <a href=\"http://www.foxnomad.com/travel-videos/\">video</a> camera and want to join me on a short leg of the train journey (even if it&#8217;s just from one city to the next) you can help provide content for The Ultimate Train Challenge &#8211; auditioning for my camera-person job in the fall at the same time.</p>\n<p><strong><img src=\"http://www.foxnomad.com/wp-content/uploads/2011/06/ikea-devil-duck.jpg\" alt=\"evil duck\" width=\"303\" height=\"229\">The Devil Is In The Planning</strong></p>\n<p>Each of us train challenge participants can choose our own paths -north or south across Europe &#8211; then south from China into Vietnam. (The Trans-Siberian Railway will get me across <a href=\"http://www.foxnomad.com/countries/russia-travel-information/\">Russia</a>.) Planning (hardly my strong suit) train connections, times, and distances will be what determines when who gets where when. I&#8217;ll create an interactive map for you to follow along, give me suggestions, and see when we might cross paths potentially to meet up in your city for a few hours.</p>\n<p><strong>Why Take A Trip Like This?</strong></p>\n<p>Partially because of that very question &#8211; the goal to break a record and have some fun along with extreme travel overland &#8211; beginning and ending in two <a href=\"http://www.foxnomad.com/countries/\">countries</a> I&#8217;ve never been to before. Personally, I&#8217;ll find it extremely difficult to manage and maintain my day to day work and operations &#8211; something I&#8217;m not convinced I&#8217;ll be able to do. Pushing my limits while meeting new people and seeing places I never have will be my biggest motivator over nearly 15,000 kilometers (~9,600 miles) of train tracks.</p>\n<p>[second photo by: <a href=\"https://www.flickr.com/photos/limowreck666/\">limowreck666</a> (devil duck)]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"From Lisbon To Saigon In One Shot: The Ultimate Train Challenge"}},"pageContext":{"id":"5b9624f687be058327490f4b"}}