{"data":{"mongodbDatabaseArticles":{"id":"5b9248e087be056953db7c09","content":"<div><p>The concept of exploiting purchasing power <a href=\"//en.wikipedia.org/wiki/Arbitrage\">arbitrage</a> between your income and expenditures seems obvious, logical and fool-proof.</p> <p>These days, renting a San Francisco 1-bedroom condo will set you back $2000. About the same for London, Paris and Amsterdam.</p> <p>But what if you do try the same in an emerging market? Like China? Or South East Asia? About $500 and you'll get a free pool, fitness and sauna and an extra bedroom with it. Or you can go barebone and just get a good room for $150 p/m. You'll save even more on spending money on food.</p> <h3>Bootstrapping to success</h3> <p>With the high cost of living in the West, most university graduates these days are forced to take on menial jobs with long hours which leave them with little to no option of building their own business on the side. There's simply no energy, money and &#8212; most importantly &#8212; time left after they finish working daily. Therefore, to me it seems a better option for many young aspiring entrepreneurs is to move to a cheaper location and bootstrap their business from there while living from some savings until their business becomes profitable. Income arbitrage is perfect for this case.</p> <p>But is income arbitrage as fool-proof as people present it?</p> <h3>Lower prices, but for a reason?</h3> <p>Prices are lower in the places arbitragers go to spend their money. But hardly anybody thinks about why prices are so low. Most products and services cost less than they do in the West. But the quality of these products and services can also be significantly less. Most people miss that realisation.</p> <p>South East Asia is a great example. I moved to Chiang Mai in the North of Thailand in April and have been experimenting first-hand with arbitrage. Rent and food is cheap here. You can have a nice meal in the street in Thailand for $1.50 (50 baht). A good night out will not set you back more than $25, even if it gets crazy. Getting around with taxis is usually not more than $2.50. You can rent a motorbike for about $50 per month. That's some great prices. But what's the other side?</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/07/IMG_3088-1024x764.jpg\" width=\"100%\"> <p>Well there's a lot actually. South East Asia's streets are messy and air pollution is a huge daily problem. Food is indeed cheap but that's because most of the dishes are quite basic with rice or noodles and a lot less meat than we are used to in the West. General facilities are cheaper but don't forget that everything around here breaks down all the time: like your Wi-Fi, air-conditioning unit, your shower or the taxi you're in on your way to the airport. That free pool that you got with your condo may be cleaned a lot less extensively than at home, and you might get sick from it sometimes. But things being broken appears to be the norm here. It's because these countries with lower costs of living, also have lower living, quality and safety standards. It's a rare occurrence to find a three-poled power socket here, simply since nobody cares about wiring an earth-pole into to avoid getting shocked to death. That motorbike? Well, maybe it's time for some extra insurance, since traffic is notoriously dangerous here and motorbike accidents are a daily occurrence. It's the same for most emerging markets like Brazil, Russia, India, China and South Africa (<a href=\"//en.wikipedia.org/wiki/BRICS\">BRIC</a>).</p> <h3>The hidden cost of arbitrage</h3> <p>The hidden cost of arbitrage is quite apparent. If you can absorb that cost and deal with it, then you might actually save money. If you can't, all these things will cost you more time and it will make you less productive. And if you want Western quality and comfort, it will actually end up costing you more money than at home.</p> <p>It may sound like I am snarky but that is not my point since personally I can deal quite fine with these discomforts. Most of the time, I like the grime and chaos that these kinds of places harbor. I like the mini-adventures I have to go on to get anything done. But I'm young and I can take discomfort relatively well. I don't know if this would be practical if you're a lot older.</p> <h3>The numbers</h3> <p>You can go to a place that's cheaper, but there's a reason it's cheaper. There'll be many discomforts because if there weren't, why wouldn't everyone in the West move here? If they did, it wouldn't be the cheap place anymore. There's hidden economic reasons around us that rule people's behaviour and tell us why things are structured in the ways they are. </p> <p>A simple financial metric like cost of living is exactly that: simple, and it's <i>too</i> simple to solely use as a basis for lifestyle decisions. There's many other factors that weigh in to the equation than just cost to make a location worth living there.</p> <p>Trying to take a shortcut and arbitraging your way into riches is probably not the right motivation. Trying to go on a low-cost world adventure while working remotely, building a new business and embracing the craziness (and sometimes discomfort) that comes along with it seems to be a much better plan.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Make money where prices are high, spend it where prices are low. Does income arbitrage work?"}},"pageContext":{"id":"5b9248e087be056953db7c09"}}