{"data":{"mongodbDatabaseArticles":{"id":"5b921d2a87be0571ac1b0506","content":"<div><p>The only difference between death and taxes is that death doesn&#8217;t get worse every time Congress meets. &#8211; Will Rogers</p>\n<p>Whether on ideological grounds you&#8217;d prefer to donate your extra money to charity, or you simply would like reinvest as much as possible into growing your business, it&#8217;s prudent to consider legal options to protect as much as your wealth as possible.</p>\n<p>By moving your money offshore in a safe, intelligent and legal way, you can employ the same strategies that the global elite does to&#160;reduce your tax burden.&#160;Every day, people like you and me are saving money on their taxes by employing offshore strategies.</p>\n<h2>Consider the following case studies:</h2>\n<p><strong>Arthur </strong>is a client who came to me interested in saving money on his taxes. He was finally earning a respectable income after toiling away for the last 18 months.As a self-made man he was frustrated to see a large portion of the money he&#8217;d earned through sweat and perseverance be suddenly taken away.</p>\n<p>He was expecting to pay 20% of the 300,000 pounds that he&#8217;d earned in 2015 to taxes and wanted to find another way so that his business could continue to thrive.</p>\n<p>Working together on a tailored plan, Arthur&#160;not only became a tax-non resident of the UK, but also obtained residency in a different country where the tax laws were more in his favor. He is still able to spend time in the UK, and is not obliged to spend more than a couple of days every year in the country of his new residency.</p>\n<p>With the money that he&#8217;s saved, he&#8217;s been able to hire two full-time employees, so he can focus all of his attention on the business&#8217; core competency.</p>\n<p>As easy as this sounds, finding on the ground relationships and being able to complete the process of residency, incorporation and opening the right bank accounts was not something A.J. had the time to do while focusing on his business.</p>\n<p>Like him, you may be an entrepreneur that needs a trustworthy partner that he can outsource this process to and save you the time, money and mental frustration that often comes with creating relationships and dealing with governments across the world.</p>\n</div>","title":"How to Legally Lower Your Taxes"}},"pageContext":{"id":"5b921d2a87be0571ac1b0506"}}