{"data":{"mongodbDatabaseArticles":{"id":"5b9248d287be056953db7bfa","content":"<blockquote><p> The dawn of the twenty-first century has proved unsettling. It was not what we expected. Only a few years ago, the world was full with apparently justified optimism. The new century would be free of the ideological fights that plagued the twentieth. (..) <strong>a &#8220;new economy&#8221; born out of the combination of computers and telecommunications was emerging and globalization was uniting the world into a happy global village.</strong></p> <p>As the new century settled in, however, worrying facts are deflating all these optimistic expectations. Each and every one of the reasons for optimism has failed to deliver what it promised and many problems that we thought we had left well behind have come back to haunt us. <strong>Negative turns in the distribution of income and wealth, financial crises,</strong> terrorism, fundamentalist terrorist states trying to spring out of the Middle East and Africa, a visible turning away from democracy in many countries that had just become capitalistic or democratic, Russia expanding its territory just like the aggressive powers of yesteryear... </p> <p>(..) <strong>[The] profound technological advances, </strong>while opening the road for a better future in the long run, are terribly disruptive in the short term. They render obsolete the capital accumulated in physical assets, in human knowledge and skills, and, even more fundamentally, in the shape of <strong>the institutions linking together the fabric of society</strong>. </p> <p>(..) This brings about all kinds of economic and social disruptions, including unemployment, negative turns in the distribution of income, bankruptcies, frequent financial crises, and depression. <strong>Life becomes unstable, the future unbearably uncertain.</strong></p> <p>(..)<strong> Trying to keep the current shape of society unchanged, however, is the best way to fall into stagnation, destructiveness, or both. </strong>The countries that had more state intervention in the economy&#8212;like Russia and Germany one hundred years ago&#8212;were the ones that broke under the pressures of change and fell under destructive regimes. In their search for stability through authoritarian governments, these countries sold their souls to the devil and rather than the stability of older, romanticized times, they got the order of slavery and destructiveness. </p></blockquote> ","title":"The total chaos that the dawn of the 21st century has become"}},"pageContext":{"id":"5b9248d287be056953db7bfa"}}