{"data":{"mongodbDatabaseArticles":{"id":"5b95eaaa87be05832748ffc3","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/internetchange01.jpg\" alt=\"Man using his computer\"><br> Blogs. Message Boards. Online maps. <a href=\"https://www.nomadicmatt.com/travel-tips/finding-cheap-accommodation/\">Couchsurfing</a>. Online booking. <a href=\"https://www.nomadicmatt.com/travel-blogs/sharing-economy-travel-cheap/\">Homeaway</a>. Twitter. It seems you can do everything on the web nowadays.</p><p>With all the travel plans you can make online, it&#8217;s no wonder that many people say the future of travel is on the Internet. While these services and tools have not completely changed how people travel (just mostly), as more people get wired, they will. The groundwork has already been laid. Nowadays, the majority of people look online for travel information before they head to buy a guidebook.</p><p>For starters, look at the broader picture. Internet connectivity and speed is drastically increasing. <a href=\"https://www.nomadicmatt.com/travel-guides/singapore-travel-tips/\">Singapore</a> has country-wide Wi-Fi, and broadband providers around the world are increasing their connection speed all the time. Everywhere you go now seems to be a Wi-Fi hot spot. <a href=\"https://www.nomadicmatt.com/travel-guides/united-states-travel-guide/\">Many cities in the U.S.</a> now offer Wi-Fi. Every cafe in the world seems to offer Wi-Fi. Even in less developed countries, connectivity is increasing and you can scarcely walk five feet without tripping over an Internet caf&#233;. Though the majority of the world&#8217;s citizens may not have Internet at home, they can get access to it relatively easily. And, <a href=\"https://www.nomadicmatt.com/travel-blogs/smartphones-for-travel/\">with the rise of smart phones</a>, it becomes even easier.</p><p>Furthermore, companies continue to increase their Web profiles as more people use the Internet for information, business, and maintaining social relationships. Many of the most savvy companies already use social networking sites like Twitter and Facebook to advertise and keep consumers aware of developments. Kids, who are increasingly more Web-savvy than their elders, use the Web for everything. These social networking and media services are vital for them to get information. They have already made Google a verb. It&#8217;s the first place they go when they want to find something.</p><p>People already use the Internet for travel. We book flights and hotels online, meet other travelers online, stay in touch via blogs, and find information via Google and <a href=\"http://forums.nomadicmatt.com\">community forums</a>. This trend will only continue. It&#8217;s easy, convenient, and more practical for finding deals and getting information.</p><p><img src=\"https://media.nomadicmatt.com/internetchange02.jpg\" alt=\"Girl with phone waiting for taxi\"><br> More and more companies are realizing the world is going wired. They are looking to increase their Web presence and use of social media to reach these future travelers and consumers. <a href=\"https://www.nomadicmatt.com/books/#guides\">Travel guides</a> are already available for download in PDF format, and most companies let you pick and pay for the chapters you want instead of buying the whole book. While many of the writers interviewed for this site don&#8217;t see the death of print media yet, it&#8217;s not far off. Why lug a guidebook around when you can simply download it or the section you want? Offbeat Guides already lets you customize your guidebook and then will print and ship it to you.</p><p>What will really facilitate this process is the growth of mobile Internet technology. As the iPhone and its copycats become increasingly utilized and companies create applications for them, services are going to be increasingly digitized. Wi-Fi will mean constant Internet access &#8211; and therefore constant access to the information you need on the road. Every company has an app these days, and guidebooks are increasingly available as PDFs or little apps you can have on your phone &#8211; even when you don&#8217;t have an Internet connection. Soon you&#8217;ll be able to look up any place or piece of information you need via your mobile device. Google already has great maps available for these devices and is only making them better.</p><p>The groundwork for a digital revolution in travel is already here. Services already exist to connect you with travelers, book hotels and flights, get destination information, read reviews, find things to do, and locate the best deals. The majority of all these services are free, too. Yet the revolution will not get fully under way until mobile technology gets better and a critical mass of people begin to use it. There is already a very savvy group of people out there, but they remain a tiny portion of existing travelers.</p><p>However, as young people, accustomed to doing everything online, grow up and start to travel, this digital travel revolution will mushroom from a spark to a wildfire. Pretty soon, all the information we get will be in digital form.</p></div>","title":"How the Internet Will Change Travel"}},"pageContext":{"id":"5b95eaaa87be05832748ffc3"}}