{"data":{"mongodbDatabaseArticles":{"id":"5b921d2a87be0571ac1b0505","content":"<div><p></p><img class=\"wp-image-25014 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-1.jpg\" alt=\"renounce US citizenship\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>This is not a topic that I had planned to discuss. But I felt that you deserved to hear about a decision this big. </p>\n<p>As someone who has never been afraid to put my face out there in an industry full of &#8220;mystery men,&#8221; I came to the conclusion that I could share the parts of this big announcement that are the most relevant and important to you while still taking into account my personal privacy and maintaining a high level of respect for all parties involved in the process.</p>\n<p>I have been working through this big decision in my own mind as a private citizen &#8211; separate from<a href=\"http://nomadcapitalist.com/\"> Nomad Capitalist</a> &#8211; for many, many, many years. </p>\n<p>As such, I now have a lot to talk about. </p>\n<p>This article may be a bit longer and a bit more serious than usual, but I wanted to make you aware of this decision because you deserve to know. </p>\n<p>Many of you probably had a feeling this was coming. You have been asking me about it in emails and in the comment sections of the blog and <a href=\"https://www.youtube.com/watch?v=J-3tTNgixUI\">YouTube channel</a>, and it makes sense that you would ask because some of the content we&#8217;ve put out lately has had a bit of a different vibe. </p>\n<p>But here it is, officially out in the open for everyone to know: <strong>As of late 2017, I am no longer a citizen of the United States. </strong></p>\n<p>Coming to this decision has been a really interesting process for me and I feel that it is important to share the background and feelings that preceded the decision, and not just the process I went through in order to renounce. </p>\n<p>My hope in doing this is that people out there can identify with my experience and understand why I renounced and whether or not it is the right decision for them.</p>\n<p class=\"et_post_video\"></p>\n<p>&#160;</p>\n<h2><b>My Journey</b></h2>\n<p></p><img class=\"wp-image-25015 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-2.jpg\" alt=\"renounce US citizenship\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>I&#8217;ve been thinking about <a href=\"http://nomadcapitalist.com/2018/01/17/renounce-us-citizenship-ultimate-guide/\">renouncing my US citizenship</a> for a long time. </p>\n<p>While I grew up in the United States, I never fully felt like I belonged there&#8230; and I simply found the rest of the world too fascinating to want to stick around. </p>\n<p>When I was eight years old, I had two big maps on my wall &#8211; one of the US and one of the world. I would spend the majority of my time looking at the world map thinking about how I was going to live in other countries.  Maybe there was somewhere else where I would feel more comfortable. </p>\n<p>About a decade ago, I set off to find those places. I started traveling around,<a href=\"http://nomadcapitalist.com/2017/05/15/how-to-go-where-youre-treated-best/\"> looking for where I could be treated best</a> in every aspect of my life. </p>\n<p>And, a couple years after that, I left the United States for good. </p>\n<p>Around the time I left, I shared an evening with several friends, including my good business friend Matt. </p>\n<p>Much of the tone of my conversation that evening revealed how upset I was about what was going on in the United States and how angry I was about many of the rules there. </p>\n<p>You can get a glimpse of some of that same anger if you go back to the very beginning of Nomad Capitalist in late 2012. We&#8217;ve updated many of those first articles that had actual information because much of that information has changed, but you can still find the occasional non-updated article with much more sarcasm and snark. </p>\n<p>If you remember those days, you&#8217;ll remember the apparent frustration with the United States and being a US citizen. I would often speak in sweeping generalizations &#8211; in ways that I would never speak today.</p>\n<p>During this period of my life, I often wondered if I wanted to be a US citizen. I liked it much better living overseas and I found I could better connect with people outside the United States. </p>\n<p>However, while I began to seriously consider renunciation at this time, I was very cognizant of the fact that I didn&#8217;t want to throw away a very sought-after passport just because I was angry. </p>\n<p>Looking back, that was an incredibly important emotional decision. I am grateful I decided not to make the decision to renounce out of anger.</p>\n<p>Fast forward a few years to late 2015 and I was once again very close to making the decision to renounce. I ran the idea by my family and casually talked about the possibility to other friends and associates to get some feedback.</p>\n<p>I was about ready to go through with the decision and renounce when several things came up that actually made it beneficial to be a US citizen. </p>\n<p>I went back and reevaluated the situation and decided to put my renunciation on the back burner, knowing that I would undeniably come back to it later.</p>\n<p>In the years that followed, people would often ask me why I was still a US citizen based on all the opinions I had voiced about the country in the past. I would always tell them that it really wasn&#8217;t anyone&#8217;s business.</p>\n<p> I am the Nomad Capitalist and I advise people on how to build a Nomad Capitalist strategy and <a href=\"http://nomadcapitalist.com/lifestyle-design/\">lifestyle</a>, but what works for me may not work for someone else. However, I would always assure them, &#8220;You know, I look at it once a year and decide what makes sense for me.&#8221;</p>\n<p>And I did.</p>\n<p>And when I evaluated my US citizenship at the end of 2017, it no longer made sense for me to be a US citizen. And that is, ultimately, when I decided to <a href=\"http://nomadcapitalist.com/expatriation/\">go through the process and renounce</a>.</p>\n<p>&#160;</p>\n<h2><b>Disclaimer: Renunciation Is Not For Everyone</b></h2>\n<p></p><img class=\"wp-image-25016 size-large\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-3-688x467.jpg\" alt=\"renounce US citizenship\" width=\"688\" height=\"467\"><p>&#160;</p>\n<p>Before I get into the process that I went through to renounce, it is important to mention that I strongly believe that renunciation is NOT the solution for everyone.</p>\n<p>In the months since I&#8217;ve renounced, I&#8217;ve talked about the decision with my close colleagues, friends, and advisors. In one of those conversations, someone said, &#8220;Oh, now you&#8217;re just going to be the renunciation guy and you&#8217;re going to tell everyone to renounce.&#8221;</p>\n<p>Perhaps I <i>would</i> be the renunciation guy if I had renounced all those years ago out of anger, but the emotional growth I&#8217;ve made since then means that I can now recognize that renunciation is not for everybody.</p>\n<p>I recently met with four guys over a small weekend mastermind and each one had a different story. </p>\n<p>One of the guys had already decided he was going to renounce before he even came to me, another I helped decide that it would be a good thing for him to renounce, the third wasn&#8217;t that interested in renouncing but was keeping the idea open, and the fourth guy said, &#8220;Hey, I love living in the United States! I&#8217;m fine with being a US citizen. I love the country.&#8221; </p>\n<p>This particular group is the perfect demonstration of the different opinions and needs that exist in regards to US citizenship and renunciation.</p>\n<p>This is a decision that you not only need to come to on your own and feel right about but it&#8217;s one that not everyone <i>should</i> make. </p>\n<p>Contrary to what some folks might believe, this is not really a financial decision for many people. The news media like to paint it as a <a href=\"https://www.huffingtonpost.com/entry/record-number-denouncing-us-citizenship_us_589d18bae4b03df370d4e90a\">bunch of rich guys who are just running off</a>, but it is a serious decision that you have to feel right with on every level.</p>\n<p>That is why it wasn&#8217;t right for me for a long, long time.</p>\n<p> I spoke to my former business partner before I made the final decision to renounce and we reminisced about that first conversation all those years ago when my focus was on all my anger and frustration with the US.</p>\n<p>He told me how much happier and comfortable and at ease I seemed and then admitted, &#8220;When you first started talking to me about renouncing years ago, if you had actually made the decision then, I would have told you that you were being emotional and overreacting. I would have told you not to do it. Now, even though I personally love living in the US, I can see why it doesn&#8217;t make sense anymore for you to be a US citizen.&#8221;</p>\n<p>While I had come to the same realization myself, it was good to see that my close friend had recognized that the time was right as well. </p>\n<p>It took me years of really going through the process to come to the conclusion, but the time had finally come. </p>\n<p>Now, some people may be able to come to the decision quicker than I did. It could be more of a financial decision for them than it was for me, and that is fine. </p>\n<p>The key is not how quickly you make the decision, but recognizing that this is not a decision you want to overreact to. It <i>is</i> an emotional decision no matter how you make it, so you want to ensure you are doing it for the right reasons&#8230; if you renounce at all.</p>\n<p>&#160;</p>\n<h2><b>Shattered Renunciation Stereotypes</b></h2>\n<p></p><img class=\"wp-image-25017 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-4.jpg\" alt=\"renounce US citizenship\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Now, I had a lot of stereotypes going into this process about what it would be like to renounce. They were all shattered along the way. </p>\n<p>One of these shattered stereotypes was the belief about how difficult it would be and the sense of judgment I would receive from the government officials processing my renunciation.</p>\n<p> I am happy to say that the people who helped me on the US level were incredibly professional, non-judgmental, and actually incredibly nice.</p>\n<p>It&#8217;s easier to assume that the people who work at the State Department will be professional, but these people were actually nice and I felt that they even went out of their way to help and be kind.</p>\n<p>This was another sign that demonstrated to me that I really was ready for this because, if you would have asked me how I planned for my renunciation to go down back during my angry years, the idea was that I was going to go in and give everyone a piece of my mind.&#160;I fully expected everyone to be angry about it and I was going to meet the confrontation head-on.</p>\n<p>My actual renunciation experience couldn&#8217;t be more different. I was extremely professional. I was at my best and they were extremely kind and helpful and really accommodating. </p>\n<p>The idea that the renunciation process will be adversarial is untrue. </p>\n<p>We see so much media and so much of the general public who is angry at the 1% and we project that onto the government. We expect them to be pointing fingers like the rest of society, but they are doing their job as professionals and it shows. </p>\n<p>Quite frankly, if you are a US citizen, you have the right to renounce. The folks who work at the State Department understand that people have this right. </p>\n<p>And my impression has been that they are pretty cool with your decision. You get the sense that they would not make the same decision &#8211; after all, they are working for the US government (and I respect that) &#8211; but they respect your decision as well.</p>\n<p>Another idea I was able to come to terms with was that the US does not have to be my enemy. If you are upset with the way the US does business or manages its foreign policy or how it forces you to fill out a thousand forms every year, it&#8217;s good to come to terms with this idea. </p>\n<p>The US government doesn&#8217;t have to be the enemy. </p>\n<p>Now that I have renounced, I feel a much greater sense of peace and understanding. I no longer have to be upset about what the US does. It&#8217;s no longer my circus. I am no longer a part of it.</p>\n<p>&#160;</p>\n<h2><b>The Process</b></h2>\n<p></p><img class=\"wp-image-25018 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-5.jpg\" alt=\"renounce US citizenship\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>When it comes to the actual process of renouncing, the first thing I did was spend a week or two sitting down with family members, friends, associates, and people I work with to talk with them about my decision to renounce and how the process would work.</p>\n<p>I informed them that I had decided that 2017 would be the year that I would renounce. It was the end of the year and I could simplify my life and go into 2018 with a new outlook.</p>\n<p>From there, I contacted the US Embassy in one of the places where I live and arranged an appointment.  The embassy officials were incredibly helpful. They said, &#8220;Hey, if you want to come in tomorrow, we can help you.&#8221; </p>\n<p>I was traveling in Mexico at the time, so I adjusted my travel plans to return a bit earlier than I expected so I could get an appointment before the year was up.</p>\n<p>I showed up at the US Embassy on the day I had booked my appointment and brought a couple of forms that they had asked me to fill out.</p>\n<p> We sat down to a private and professional interview in which they explained a lot of things and asked me several questions.</p>\n<p>One of the questions that I don&#8217;t believe they always ask in every interview, but that they asked me was, &#8220;What&#8217;s your reason? Why do you want to renounce?&#8221; </p>\n<p>The honest thing that I told them is that I just don&#8217;t feel like an American anymore. Maybe I never did. But I feel it now to the point that I&#8217;m totally comfortable with renouncing.</p>\n<p>I&#8217;ve been living outside the United States for many years now. In fact, in the last four years I spent all of six or seven days last summer in the US. </p>\n<p>And, when I went, I felt more like a tourist than a citizen. That feeling led me to realize that the US may be a nice place to visit every once in a while, but the country no longer feels like it is mine. </p>\n<p>I explained to the official that I felt comfortable with the idea that if I was never able to go back to the US, I could live with that. My personal identity is no longer associated with the US &#8211; not out of hatred for the country, but merely out of a sense that it is not my place.</p>\n<p>Obviously, I renounced for more than one reason, but that was the biggest one of all. </p>\n<p>Another reason I wanted to renounce was to remove the sense of dread that I might make a mistake along the way when it came to complying with all the laws and regulations the US has in place. </p>\n<p>One thing I have learned from working with people who have renounced is that, once you do, it feels like a weight off your shoulders. I have felt that weight for years, worrying that I might miss something and unknowingly fail to comply 100%.</p>\n<p>I have never agreed with the folks who say you should bury all your wealth and hide all your cryptos offline and simply not follow the rules because you can get away with it.</p>\n<p> Following the law, whether you like it or not, is a good thing to do. I believe in compliance. I believe that it is always best to follow the law, even if you don&#8217;t agree with it.</p>\n<p>But with that kind of outlook, there was always a sense of dread for me about being able to comply 100% because there was always a chance of making a mistake somewhere, even though it was my intention to report everything. </p>\n<p>It became a lot to keep up with. </p>\n<p>So, when they asked me in the interview if my renunciation was about taxes, initially I didn&#8217;t know how to respond. I have used legal strategies for myself for a long time to pay very little, if anything in taxes.</p>\n<p> I think that&#8217;s a fair system considering that I have only spent about six days in the United States in the past four years. I wasn&#8217;t using any of the services.</p>\n<p>So, the issue wasn&#8217;t that I had to <i>pay</i> taxes &#8211;<a href=\"http://nomadcapitalist.com/tax-reduction/\"> legally, I was paying very little</a> &#8211; the burden I no longer wanted to carry was having to file all the forms and follow endless regulations.</p>\n<p>When I asked for clarification, the official explained, &#8220;Well, you do understand that if you renounce, if you owe us money, the debt doesn&#8217;t just go away.&#8221; And that is true, the same applies to any military obligations you may have. They don&#8217;t go away either. </p>\n<p>With the issue clarified, I confirmed that it wasn&#8217;t about tax. I don&#8217;t owe the IRS any money and they recently sent me a letter saying that they actually owed <i>me</i> money. </p>\n<p>Renouncing to eliminate the paperwork burden is not the same as renouncing to avoid tax.  Again, that wasn&#8217;t the whole reason I chose to renounce, it was just another push in that direction.</p>\n<p> The real reason for me was that I felt like I did not identify with the country and I didn&#8217;t want to go back and live there and felt more comfortable living overseas. </p>\n<p>They listened to my answers and we talked and then they asked, &#8220;You know that once you do this it can&#8217;t be undone?&#8221; </p>\n<p>They walked me through some scenarios and I confirmed that I understood and they informed me that I would need to come back for a second interview, so we set the appointment. Again, this embassy was very nice and they allowed me to come back pretty shortly thereafter. </p>\n<p>At the end of the first interview, I went out and gave it a lot of thought. I did some journaling and made some videos for my own use (that I may or may not put out in the future). I really wanted to document how I felt. </p>\n<p>When I went back to the Embassy for the next appointment, I took the $2,350 (the fee to renounce) in cash in an envelope. They called my name and asked me to pay in cash at the cash register, took my money, gave me my receipt, and told me to take a seat and that they would call me up in a moment.</p>\n<p>What I love about the renunciation process is that it&#8217;s actually a very dignified process. Most people who go into the Embassy &#8211; to apply for a visa, for example &#8211; have to do the entire process by talking through a window and passing papers through the glass. </p>\n<p>The renunciation&#160;process, on the other hand, is actually done in an office and you sit there and talk to them in a dignified process. </p>\n<p>During the second private interview, they went through all the questions again and then it came to the part where they read through the oath of renunciation with me and then had me raise my right hand and read the oath.</p>\n<p>It was kind of an emotional moment. It almost felt like I was breaking up with somebody.</p>\n<p> As I read the oath, I could understand the gravity of what I was saying.</p>\n<p>I&#8217;ve said for many years that just because you were born somewhere doesn&#8217;t mean that you have to be in love with it, be a patriot, stay there forever, or not consider other options. And I still believe that, but that&#8217;s not to say that some of the conditioning still doesn&#8217;t work its way into you at a very deep level and that you&#8217;re not going to have to fight a little of it off.</p>\n<p>If you&#8217;ve ever broken up with somebody, you know that when you&#8217;re looking the person in the eye and saying those words, &#8220;We can&#8217;t be together any longer&#8221; it&#8217;s a little tough.</p>\n<p> And, sometimes, you&#8217;ve ended a relationship with somebody where you wished it could have worked out and under different circumstances maybe it could have, and you get a little emotional. </p>\n<p>It is emotional.  And, even though you know the relationship needs to end, you really think about it and feel it when you are saying those words, &#8220;It&#8217;s over.&#8221;</p>\n<p>It was the same with renouncing. I knew that ending the relationship was for the best, but officially saying it out loud was an emotional moment.</p>\n<p>Once I took the oath, they thanked me and asked me to hand in my passports. They were actually really nice and told me that I could keep my passports for a time if I needed to return to the US to take care of business, but I told them that wouldn&#8217;t be necessary. It is a fair deal that when you renounce you don&#8217;t get the passport anymore. </p>\n<p>And then I walked out.  And, since US Embassies are all very fortified, it almost felt like I was walking out of a prison. </p>\n<p>I went to the front desk, then to the guard shack to get my cell phone and other belongings I had brought with me that I wasn&#8217;t allowed to take in and then I walked out the front door and took my first breath of fresh air as a non-US citizen.</p>\n<p>That was the moment I realized that I have a new life ahead of me.</p>\n<p>The burden had been lifted.</p>\n<p>Because I had done it for the right reasons (even if it took me years to come around to it), I realized that, just as with breaking up, I could say, &#8220;It is unfortunate that this had to happen, but ultimately it will be for the best.&#8221;</p>\n<p>No regrets.</p>\n<p>I&#8217;ve done a couple things in my life that have changed the course of my life and I have no regrets.</p>\n<p> I like to say that it was the right decision for the time.  By renouncing, I have obtained a greater sense of freedom and a detachment from the sense of dread, but most of all I feel much more aligned with my own personal identity. </p>\n<p>When you&#8217;re an American and you don&#8217;t agree with the things the US stands for and you don&#8217;t feel like you connect with the average American (not the people I work with because they get what I&#8217;m talking about), there can be a substantial gap in who you are as a person and how the world identifies you as a citizen. </p>\n<p>I now feel much more peaceful about my identity. Nothing else has changed. </p>\n<p>I&#8217;m going to keep doing what I&#8217;m doing, regardless. But I am no longer a US citizen.</p>\n<p>&#160;</p>\n<h2><b>You Are Not Alone</b></h2>\n<p></p><img class=\"wp-image-25019 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-6.jpg\" alt=\"renounce US citizenship\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>What I am trying to change by sharing my experience is to remove the mystery and show you that you are not alone. You have support if you need it. </p>\n<p>Some are going to speculate about my decision and why I made it, but I choose to share my experience because I feel that nobody else in this field has done this (and, if they have, they won&#8217;t stand up and talk about it).</p>\n<p>Is there some risk to me doing this? </p>\n<p>Maybe. But I believe that you deserve the truth. </p>\n<p>The people who are considering renunciation deserve to know that there is someone who supports and understands them &#8211; someone who knows that this is not just a technical process. </p>\n<p>One of the things I talk about with the people I help is that you&#8217;re never going to fully understand whatever it is you want to do until you do it. </p>\n<p>The same principle applies to <a href=\"http://nomadcapitalist.com/expatriation/\">renouncing your US citizenship</a>.</p>\n<p>I was fortunate to have worked with dozens of individuals who had gone through the process before I took the plunge myself, but most people do not have that privilege. </p>\n<p>Nobody talks about this stuff. That&#8217;s why it helps to have a mentor. </p>\n<p>So many people in the offshore industry cling to the &#8220;man of mystery&#8221; approach to the point that they don&#8217;t identify the things that we really think about &#8211; the fears and insecurities. And (especially as men) we try to step over those fears and insecurities because we don&#8217;t want to appear weak, but we still have them and still wonder what&#8217;s going to happen.</p>\n<p>What I tell people is that they&#8217;re never really going to understand what&#8217;s going to happen unless they&#8217;ve been through it or they can rely on a mentor who has been through it.</p>\n<p>When people come to me asking if they should renounce, it is easy to see that what they really crave is mentorship.</p>\n<p> They want to know how this works and what&#8217;s involved.  That&#8217;s what I want to provide.</p>\n<p>I want people to know that there is someone who understands them, even if that means that I will be the subject of some nasty comments or people coming in and saying I did it for this or that reason.</p>\n<p> I know why I did it. I know what&#8217;s in my heart. </p>\n<p>There are certain parts of this process that will remain private to me because it is a personal process, but I wanted to share as much as possible because it is important that you understand that there are a lot of misconceptions about renouncing your US citizenship that can be cleared up by simply talking about it.</p>\n<p>You will have your own reasons for renouncing if it really is something that you want to do. And <a href=\"https://nomads.leadpages.co/fk-andrew-consultation/\">there is a process to figure out</a> if this is something that you <i>should</i> do if you are living the lifestyle that we talk about here.</p>\n<p>I am happy to help people who are trying to figure this out &#8211; whether you are wondering if you want to renounce, you are in the process, or you want to know how to strategize in order to renounce with all your ducks in a row.</p>\n<p>I have learned a lot going through this process and <a href=\"https://nomads.leadpages.co/fk-andrew-consultation/\">I&#8217;d be happy to help</a>. </p>\n<p>This is something that I would have done with or without Nomad Capitalist, but I think that having a megaphone to talk to millions of people to let them know that they&#8217;re not alone is important.</p>\n<p>I&#8217;d love to hear your thoughts and comments. I appreciate your time in reading this or watching the video. I hope this has helped people who are trying to better understand the process. </p>\n<p>I understand that it&#8217;s not going to make sense to everybody, but it is something that needs to be clarified because this process is very opaque and people deserve to know how it works. And, perhaps by talking about it, some folks will realize that they don&#8217;t want or need to renounce. </p>\n<p>At the end of the day, <a href=\"https://nomads.leadpages.co/fk-andrew-consultation/\">I&#8217;m here to help you figure that out.</a></p>\n</div>","title":"Why and How I Renounced My US Citizenship: My Expatriation Story"}},"pageContext":{"id":"5b921d2a87be0571ac1b0505"}}