{"data":{"mongodbDatabaseArticles":{"id":"5b95eaa587be05832748ffc1","content":"<div><p class=\"sub-title\">Buy my Thailand Book, Get Bangkok for Free</p><br> <a href=\"https://www.nomadicmatt.com/cart/?add-to-cart=137430\"><img class=\"alignleft\" src=\"https://media.nomadicmatt.com/2018/thai-bang-books2.png\" width=\"400\"></a><strong>Updated:</strong> June 2018<br><strong>Format: </strong>PDF (Instant download) <br><strong>Price: </strong>$14.99 <strong>$9.99</strong><br><strong>30 Day, 100% Money Back Guarantee</strong><p>June 2018PDF (Instant download)</p><p><strong>Limited Time Offer!</strong></p><p>Read more about my Thailand book below.</p><p>Thailand is one of the most beautiful, colorful, and vibrant countries in the world. I fell in love with Thailand in 2005 when I went on a two-week vacation to escape the Boston winter. It was my first time to Asia, and I found the country chaotic, beautiful, energetic and filled with incredible things to see and do, delicious food, and friendly and happy people. I had never experienced a place so beautiful and fulfilling.</p><p>Since that initial visit, I lived in Bangkok for two years teaching English, learned Thai, ran tours throughout the country, and crisscrossed and digested every part of the country on countless trips. There isn&#8217;t a year that goes by that I don&#8217;t visit the country &#8211; drawn in by its magical powers.</p><p>Over the last ten years, I&#8217;ve watched the changes Thailand has undergone. I&#8217;ve seen the tourists come and go, places fall in and out of fashion, hostels boom, the political landscape change, and the food and international cocktail scene exploded. I&#8217;ve seen markets spring up only to be torn down.</p><p>I&#8217;ve had a front row seat to what&#8217;s been going on in the country.</p><p>And, in this travel guide, I share all that knowledge with you.</p><p>With this guidebook, you&#8217;ll get a look at Thailand the way it&#8217;s meant to be seen. This book is for the intrepid traveler who wants to not only see the main sites but also get to know the culture, get off the well-trod tourist travel path, and have a fun time that yields a deeper understanding of the country, its people, and culture.</p><p>This guide is for someone who doesn&#8217;t just want to check off a box but wants to explore. I wrote this guide as the guide I wish I had when I had started out &#8211; a no fluff guide that gave me exactly the practical, precise, and insider information I couldn&#8217;t find elsewhere.</p></div>","title":"Thailand/Bangkok Book Bundle"}},"pageContext":{"id":"5b95eaa587be05832748ffc1"}}