{"data":{"mongodbDatabaseArticles":{"id":"5b95eaae87be05832748ffc5","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/partybangkok.jpg\" alt=\"Khao San road in Bangkok\"><br> Updated: 8/28/2018 | August 8th, 2018</p><p>Khao San Road. It&#8217;s arguably the most famous (or perhaps infamous?) backpacker/tourist street in <a href=\"https://www.nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\" target=\"_blank\" rel=\"noopener\">Southeast Asia</a> (if not the world). If you&#8217;re a budget traveler in Southeast Asia, chances are you&#8217;ll end up here are some point. All roads seem to point here and it&#8217;s the transit hub for backpackers in the region.</p><p>The area has been a backpacker / traveler haven since the first guest houses opened in the 1980&#8217;s. Ever since then Khao San Road has become a mythic place in the hearts of all backpackers. (It&#8217;s become quite trendy for locals too!)</p><p>It&#8217;s a street brimming with food stands, bars, locals hawking cheap souvenirs, and backpackers from every corner of the world. Here on Khao San Road, you can grab a beer and some banana pancakes at all hours of the day as the entire street caters to the whims of its backpacking guests. If you&#8217;re booking a bus or a tour, chances are you&#8217;ll be leaving from somewhere near here.</p><p>And while travelers will always complain about it being too expensive, loud, and touristy, it&#8217;s magnetic nature draws us back to it over and over again because we know that no matter what happens we go there to meet people, make travel plans, and get away from it all!</p><h3>Tips for Visiting Khao San Road</h3><p>To help you make the most of your visit to Khao San Road, here are some tips for visiting Khao San Road:</p><ul><li>The street food on Khao San isn&#8217;t that good. For better food, go one street over to Soi Rambuttri. There is a little group of food stalls outside the 7-11 and the Pizza Company restaurant that serve authentic Thai food at a cheaper price. Additionally in the roundabout across the street, is a decent local market!</li><li>While Khao San closes at 2 am, Soi Rambuttri stays open all night long. Head there to continue the party if you want to stay open until the wee hours of the morning</li><li>Never get a taxi or tuk-tuk from Khao San. You WILL get ripped off. Walk a couple of blocks to the main road and hail a taxi from there. Make sure they put on the meter!</li><li>Brick Bar is the best place to hear local Thai music and is one of the few places on the street that caters to Thais over tourists. It&#8217;s behind the McDonald&#8217;s.</li><li>Shamrock plays great live rock music.</li><li>The outdoor drinking stalls and Center Khao San are the best places to meet other travelers. Start your night there!</li><li>D&amp;D Inn offers really clean private rooms, air conditioning, a decent breakfast, and a pool for 500 baht a night. It may be comparatively expensive but for what they offer, it is a great deal.</li><li>With so many drunk foreigners in one place, Khao San Road is an easy target for pickpockets. Be vigilant.</li><li>There are a lot of scams and ripoffs here. Avoid buying anything valuable here like jewelry or tailored suits. The quality is going to be pretty poor. Shop elsewhere for those.</li></ul><p>For a fun (but dated) look at Khao San Road from a few years ago, you can check out this video on Khao San Road below:<br> </p><h3>Get the In-Depth Budget Guide to Bangkok!</h3><p><a href=\"https://nomadicmatt.com/books/bangkok-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Bangkok_Flat.jpg\" alt=\"Nomadic Matt's Guide to Bangkok\" width=\"180\" height=\"240\"></a>My detailed, 80 page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Bangkok, a city I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!!<br> <a href=\"https://nomadicmatt.com/books/bangkok-guide/\">Click here to learn more and get started.</a></p><h4>Book Your Trip to Bangkok: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Bangkok by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Bangkok with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Bangkok?</strong><br> Be sure to visit our robust <a href=\"hhttps://www.nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\" target=\"_blank\" rel=\"noopener\">destination guide on Bangkok</a>&#160;for even more planning tips!</p><p>Photo credit: <a href=\"https://www.flickr.com/photos/21160499@N04/7622990712/in/photolist-cBBPym-4ezwvv-4ezwLn-4ezwDr-997rvo-9QeYH2-58ERM6-ynLqA-RxJRtx-bKfxg4-cmmaKE-58ET6x-WhZwy9-79iFB5-xKaam-xKa7V-b7kJHx-dT97mZ-8TPJWD-WhZwmL-xKabi-ynLyW-77pWQG-ynLdy-77m2br-FCGApq-58ES72-ynM8o-aaFmX-ynLki-VRM61y-aaFn2-nTkMd-ynLTu-4WAuj2-7SmTRL-ynMcK-77pVAA-77pWfu-ynM1F-ynLCP-ynLEX-xKa6T-dC2Soc-ynLNQ-ynLWM-ynL9P-4ArNDw-WhZwM5-svrJBc\">1</a></p></div>","title":"Bangkok's Khao San Road: A Complete Visitor's Guide for 2018"}},"pageContext":{"id":"5b95eaae87be05832748ffc5"}}