{"data":{"mongodbDatabaseArticles":{"id":"5b95ef6087be058327490110","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Guide for American Expats Visiting Home</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-10243\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/07/Guide-for-American-Expats-Visiting-Home2.png?resize=560%2C400&amp;ssl=1\" alt=\"Guide for American Expats Visiting Home\" width=\"560\" height=\"400\"></p>\n<p>Going home to the US for a month was not only an opportunity to visit friends and family, but it also allowed us to take care of personal business that&#8217;s difficult to do while living in Thailand. Fellow American expats visiting home, here is a list of things we recommend taking care of both before and during a visit to the US.</p>\n<p><strong></strong></p>\n<h2><p id=\"What_to_do_Before_Visiting_the_USA\"><p>What to do Before Visiting the USA </p></p></h2>\n<h3><p id=\"01_Purchase_US_Touring_Auto_Insurance\"><p>01&#160; </p>Purchase US Touring Auto Insurance</p></h3>\n<p>At the last minute we opted out of purchasing traveler&#8217;s medical insurance while in the US. We like to think we&#8217;re pretty healthy.</p>\n<p>However, accidents do happen, and our biggest health risk would be driving. Since we could not financially afford to pay for body and vehicle damage if we were in a car crash, we signed up for traveler&#8217;s car insurance through USAA. At $25 per year we were both provided with full coverage.</p>\n<p>We recommend American expats visiting home to call your previous car insurance company for their US touring auto policy rates.</p>\n<p><strong>NOTE:</strong> Expat medical insurance has various degrees of coverage; some basic plans will not cover Europe or North America. You can be sure to pay a premium if you need coverage in the USA.</p>\n<h3><p id=\"02_Take_Advantage_of_Airline_Mileage_Programs\"><p>02&#160; </p>Take Advantage of Airline Mileage Programs</p></h3>\n<p>Before moving to Thailand, we signed up for several rewards credit cards. We earned enough miles for our round-trip <a title=\"Visiting Home After Long Term Travel\" href=\"https://www.tielandtothailand.com/visiting-home-after-long-term-travel/\">visit from Thailand to the US in June 2014</a>, as well as most of our domestic flights. What would have cost us nearly $3,450 without points cost us just over $350.</p>\n<h3><p id=\"Breakdown_of_Angela8217s_Flights_To_and_Around_the_USA\">Breakdown of Angela&#8217;s Flights To and Around the USA</p></h3>\n<p><img class=\"aligncenter wp-image-10054 size-full\" title=\"Flights to and around the USA\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/07/US-Flights-with-Pts.png?resize=560%2C300&amp;ssl=1\" alt=\"Money Saved After Using Airline Miles Accrued Using Rewards Programs\" width=\"560\" height=\"300\"></p>\n<p>What credit card companies did we originally apply with? We signed up for the Chase Southwest Premier, Chase Southwest Plus, Chase Sapphire, Citi American Airlines, and Capital One Venture cards back in Fall 2012. It&#8217;s well worth the investment for American expats visiting home. We signed up for more of them during our visit in June 2014!</p>\n<h3></h3>\n<p>Since it can be difficult to directly ship a new credit card overseas (you sometimes need a domestic address), we checked to see if any of our credit cards needed replacement within the next twelve months.</p>\n<p>We had one that was expiring soon. So, we called two weeks prior to going home and requested a new card be shipped to a trusted family member whom we were visiting.</p>\n<h3><p id=\"04_Get_Supporting_Paperwork_for_a_Thai_Visa\"><p>04&#160; </p>Get Supporting Paperwork for a Thai Visa</p></h3>\n<p>We saw our trip to the States as an opportunity to renew our expiring Thai visas. Although many people do visa runs to neighboring countries of Thailand, we opted to do a visa run while in Washington, D.C., USA. We made sure to have our supporting paperwork squared away before hopping on the plane.</p>\n<p><strong>TIP:</strong> It can take anywhere from two to four weeks processing time for the paperwork required to apply for some Thai visas.</p>\n<h2><p id=\"What_to_Do_While_Visiting_the_USA\"><p>What to Do While Visiting the USA</p></p></h2>\n<h3><p id=\"01_Renew_License_Get_an_International_Driver8217s_License\"><p>01&#160; </p>Renew License; Get an International Driver&#8217;s License</p></h3>\n<p>Making sure that our licenses were up to date was one of our top priorities. Luckily, many states offer license renewal services online.</p>\n<p>With an unexpired drivers license, we applied for an international license through AAA. All we needed was a completed application (provided on site at AAA), a 2&#8243;x2&#8243; passport photo, and $15 USD. Having an international driver&#8217;s license makes it significantly easier to get a Thai driver&#8217;s license (no driving test required!).</p>\n<h3><p id=\"02_Obtain_Copies_of_Important_Documents\"><p>02&#160; </p>Obtain Copies of Important Documents</p></h3>\n<p>Many documents need to be originals when applying for visas, work permits, etc. Make sure you have the originals you need and store them in a protective folder. Examples include:</p>\n<ul>\n<li><p>social security card</p></li>\n<li><p>birth certificate<br>\n</p></li>\n<li><p>marriage license</p></li>\n<li><p>updated passport</p></li>\n<li><p>diploma or official transcript</p></li>\n</ul>\n<h3><p id=\"03_Stock_up_on_US_Currency\"><p>03&#160; </p>Stock up on US Currency</p></h3>\n<p>USD bills come in handy when purchasing visas for some of Thailand&#8217;s neighboring countries, like Laos or Cambodia. Thailand&#8217;s ATMs do not spit out US dollars, and while it&#8217;s possible to get them at currency exchanges, the downsides are that:</p>\n<ul>\n<li><p>You are charged roughly 3% for every dollar</p></li>\n<li><p>The exchange companies have set hours, so if you need money over a national holiday or the night before a visa run, you&#8217;ll be out of luck<br>\n</p></li>\n<li><p>The currency exchange booth may not have enough USDs!<br>\n</p></li>\n</ul>\n<p><strong>TIP:</strong> Make sure they are clean crisp bills. Some visa processing stations will not accept wrinkled or torn bills as form of payment.<br>\n</p>\n<h3><p id=\"04_Sign_up_for_a_Charles_Schwab_Investors_Checking_Account\"><p>04&#160; </p>Sign up for a Charles Schwab Investors Checking Account</p></h3>\n<p>Set up an account with Charles Schwab because it <a title=\"Charles Schwab\" href=\"https://www.tielandtothailand.com/banking-abroad-foreign-atm-fee-solution/\">reimburses ATM fees and doesn&#8217;t charge foreign transaction fees</a>. We highly recommend American expats visiting home to sign up for this money-saving bank.</p>\n<p>Although we had one before moving to Thailand, we added Angela to our existing account and obtained a second debit card under her name. Having a second card is a nice safety net if one of ours ever got lost, stolen, or eaten by an ATM machine.</p>\n<h3><p id=\"05_Apply_for_a_Thai_Visa\"><p>05&#160; </p>Apply for a Thai Visa</p></h3>\n<p><img class=\"aligncenter size-full wp-image-10058\" title=\"Royal Thai Consular Office in Washington, D.C.\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/07/Thai-Consular-DC.jpg?resize=563%2C393&amp;ssl=1\" alt=\"American expats visiting home may apply for a Thai visa at the Royal Thai Consular Office.\" width=\"563\" height=\"393\"></p>\n<p>Rather than enter Thailand on a visa-exempt 30 day stamp and do a visa run to a neighboring country later on, we applied for a Thai visa while we were in America.</p>\n<p>Luckily, our itinerary brought us to Washington, D.C., home to a Consular Office of the Royal Thai Embassy. We dropped off our passports, passport photos, completed applications, Thai visa paperwork (which we brought from Thailand), and a money order and both received our new visas three days later.</p>\n<p>An alternative would have been to mail everything to the nearest Royal Thai Consulate or Embassy Consular Office. It takes about two weeks processing time.</p>\n<p><strong>TIP:</strong> There are Royal Thai Consulates Located in Atlanta, Chicago, Houston, Los Angeles, New York, and Portland.</p>\n<h3><p id=\"06_Buy_a_Temporary_American_SIM_Card\"><p>06&#160; </p>Buy a Temporary American SIM Card</p></h3>\n<p>Although Thailand often hands out free SIM cards in airports, and you&#8217;re sure to find a cheap one at a local 7-Eleven (which are everywhere), that&#8217;s not the case in the US.</p>\n<p>We tried buying a SIM card in an airport. We were informed that the going rate was $0.49 per 1 Mb of data. 1 Gb of data would have cost us over <strong>five hundred dollars</strong> at that going rate!</p>\n<p>We later went to T-Mobile, and in about 20 minutes had a 1Gb SIM card with unlimited texting and calling. It cost $60 ($50 for the 1Gb data, $10 for the SIM card itself) and was activated for 30 days. Other carriers, like Verizon and AT&amp;T, have also begun offering contract-free services. All that&#8217;s required is an unlocked phone. The great news is that if your phone works in Thailand, it&#8217;s unlocked!</p>\n<h2><p id=\"Staying_in_the_USA_Longer_than_35_Days\"><p>Staying in the USA Longer than 35 Days</p></p></h2>\n<p>While we would love to visit friends and family longer, it is not financially feasible. There are two major penalties for American expats visiting home who stay for more than 35 days in one calendar year.</p>\n<h3><p id=\"01_Paying_Taxes_Abroad\"><p>01&#160; </p>Paying Taxes Abroad</p></h3>\n<p>If you travel outside the US for more than 330 days of the year, American expats visiting home can claim &#8220;non-resident&#8221; status. In doing so, you remain <a title=\"US Taxes Abroad for Dummies\" href=\"https://americansabroad.org/issues/taxation/us-taxes-abroad-dummies/\" target=\"_blank\" rel=\"nofollow\">tax free on your overseas earnings</a> up to $97,600 (2013, filing single, under 65). However, if you stay in the USA for more than 35 days, you must file as a resident. This means you pay taxes on anything above the filing threshold of $10,150 (2013, filing single, under 65). Way to eat into your traveling funds!</p>\n<h3><p id=\"02_Obamacare_Penalty\"><p>02&#160; </p>Obamacare Penalty</p></h3>\n<p>After 2014 rolled in, it&#8217;s mandatory that every US citizen have health insurance unless you&#8217;re outside the US for at least 330 days a year. Unfortunately, popular traveler&#8217;s insurance, such as BUPA and AXA often used by expats, do not cover medical treatment in the US unless you pay a hefty premium.</p>\n<p>The <a title=\"The Fee You Pay if You Don't Have Health Coverage\" href=\"https://www.healthcare.gov/what-if-i-dont-have-health-coverage/\" target=\"_blank\" rel=\"nofollow\">penalty for not having insurance</a> is 1% of your household income (on the amount made above the filing threshold of $10,150 in 2013) OR $95 per person, whichever is higher. It goes up every year after that. The latter penalty applies to us, so we would pay $190 if we visited home for more than 35 days. The frustrating thing is that we would still have no health insurance!</p>\n<h2><p id=\"It8217s_More_than_Just_a_Vacation_for_American_Expats_Visiting_Home\"><p>It&#8217;s More than Just a Vacation for American Expats Visiting Home</p></p></h2>\n<p>That completes our checklist of things we took care of right before and during our trip home to the US. We highly recommend this to other American expats visiting home. Even though we all wish it could be fun and games during our trip home, sometimes you have to take care of business, too.</p>\n<p>Of course, all of these items are applicable to those who have yet to move to Thailand but want to. We highly encourage everyone to be as prepared as possible before moving (back) to Thailand!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Guide for American Expats Visiting Home"}},"pageContext":{"id":"5b95ef6087be058327490110"}}