{"data":{"mongodbDatabaseArticles":{"id":"5b92489787be056953db7bbe","content":"<div><p>Someone just showed me this: <a href=\"//www.kickstarter.com/projects/787756203/glocalme-kills-sim-card-and-roaming-pains/description\">GlocalMe</a>, a device that lets you roam globally (with data) all over the world without having to deal with the hassle of buying SIM cards in every country you visit. We've seen a lot of these solutions. Mobile carrier <a href=\"http://www.vodafone.com.au/personal/international-roaming\">Vodafone</a> has been one of the longest running in offering data roaming worldwide, selling it to customers in most countries they offer service.</p> <p>Companies are admirable for trying to fix this. Who wouldn't want to travel the world with one data plan?</p> <h2>But it doesn't make any sense</h2> <p><strong>Let's see how it looks if we're a company trying to offer a global mobile data roaming service, economically.</strong></p> <p>The world is ~195 countries. If we assume a country has an average of 3 carriers, that's 585 carriers. Now good luck working out a roaming deal with 585 carriers. I'm sure you can do it, but it'll take a lot of time. A lot of deal making. And because they know you're a foreign entity trying to build up a global roaming service, they won't necessarily give you the lowest price (per GB) either. So this will cost money and all the deal making will cost time (thus more money to pay local reps). And, who knows if you get a fair price for the data you buy in?</p> <p>Now, there might be companies in the middle who can already do this for you, like for a certain region. Maybe you could strike a deal with Vodafone to cover Europe. But they'll take a cut, for sure.</p> <p>You might see where this is going, will we ever be able to offer the same rate for data as local carriers do? Um.....let's see!</p> <h2>The price</h2> <p>Here it gets difficult. The local operators are incumbents (that means, they've been major players in the industry of those countries for years). They're able to offer data to customers at an average of $0.10 to $10 per GB. They know the country, culture, they've already made the deals and have the phone poles. If they don't, they'll be virtual carriers like <a href=\"http://www.lycamobile.com/\">Lyca</a> or <a href=\"//www.lebara.com/\">Lebara</a> who have already bought lots of data (and have economies of scale) to sell for a good price to tourists or locals.</p> <p>And it makes sense if we look at their prices.</p> <p>Here's Lebara, a carrier active in most of Europe, <a href=\"http://www.lebara.nl/mobiel-internet\">offering $10 per GB</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/Screenshot-2015-09-01-18.45.51.png\"> <p>Here's TRUE, Thailand's primary carrier, <a href=\"http://truemoveh.truecorp.co.th/3g/packages/inet/entry/583\">offering $2.80 per GB</a> (499 THB == $14 USD, 5 GB / $14 = $2.80)</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/Screen-Shot-2015-09-01-at-18.47.09.png\"> <p>Sometimes it's even cheaper. In the extreme case of South Korea, it's <a href=\"/korea-4g/\">$0.01 per GB</a>, as my receipt for uploading 4TB shows:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/811706348_11940113344041057145-copy-copy.jpg\"> <h2>So what does global roaming cost?</h2> <p>Now here you come in with your roaming plan. Let's look at <a href=\"//www.kickstarter.com/projects/787756203/glocalme-kills-sim-card-and-roaming-pains/description\">GlocalMe</a>\"&gt;GlocalMe, what I started this post with.</p> <blockquote><p>GlocalMe G2 -World's first 4G global Wi-Fi hotspot featuring roaming, advanced smart UI, and worldwide SIM-FREE Internet access</p></blockquote> <img src=\"/wp-content/uploads/2015/09/bffcd6f42343c1dee45b01f8afb7f233_original.jpeg\" alt=\"bffcd6f42343c1dee45b01f8afb7f233_original\" width=\"680\" height=\"453\" class=\"alignnone size-full wp-image-4829 responsively-lazy\"> <p>It looks nice, and it's a great effort. But how much does it cost to use it?</p> <a href=\"//www.kickstarter.com/projects/787756203/glocalme-kills-sim-card-and-roaming-pains/description\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/Screenshot-2015-09-01-18.22.00.png\"></a> <p><strong>That's $33 per GB!</strong></p> <p>But then there's <a href=\"http://www.t-mobile.com/optional-services/roaming.html\">T-Mobile America</a>, who offer UNLIMITED data ANYWHERE:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/Screenshot-2015-09-01-19.15.09.png\"> <p>Must be great to be on a motorbike AND HAVE INTERNET!</p> <p>But let's not forget <a href=\"//support.t-mobile.com/thread/60114?tstart=0\" class=\"broken_link\">the small print</a>:</p> <blockquote><p>There is no limit on data, home or abroad. HOWEVER - Domestically -if you have just the basic 500Mb that comes with the basic plan, you won't be charged if you go over, just slowed down a fair amount. You can by 2G more (total of 2.G of data) For $10.<br> You can roam in 100 countries at no additional charge. All (unlimited) data will be at EDGE speeds (128Kbs). I, and others who have used it overseas have found that perfectly adequate for everything from Email to Facebook and audio streaming.<br> The only fine print in the intl roaming is - you can't use it for more than 3 months in a row overseas and have to use your TM phone more than 1/2 the time in the U.S.</p></blockquote> <p>Did you miss that?</p> <blockquote><p>All (unlimited) data will be at EDGE speeds (128Kbs)</p></blockquote> <p><a href=\"http://techcrunch.com/2014/10/12/t-mobile-free-international-data-test/\">Oh wow. 128kb/s. NOPE.</a></p> <blockquote><p>you can't use it for more than 3 months in a row overseas</p></blockquote> <p>OKAY BYE!</p> <p>What about Vodafone's plan?</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screenshot 2015-09-01 18.23.30\"><img src=\"/wp-content/uploads/2015/09/Screenshot-2015-09-01-18.23.301.png\" alt=\"Screenshot 2015-09-01 18.23.30\"> <p>That's $5 per day. Let's say you're somewhere 1 month, you'll spend at least 1 GB. So that's 30 days * 5 = $150. Insane.</p> <h2>The problem</h2> <p>As most frequent traveling people know, <strong>buying a SIM card at the airport is not an issue</strong>, if you know where to look (and which local carrier to pick). The first thing most of us do after leaving the airplane, is heading towards the shopping area at any airport, find the phone shop, and buy a SIM. This takes 5 minutes:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/simcorner-store.jpg\"> <p>Most countries now have tourist SIMs, that you can buy either at the airport or, if you forget, in any city's shopping street. In Europe, most of the Arabic (run by Turks, Moroccans etc.) telecom shops sell them. And if you have a locked phone, they can even help you with that:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/12971488645_ae629ed6ea_b.jpg\"> <p>Or you can go to an actual national phone carrier's shop (like Vodafone) and ask for a tourist SIM card with only data. It's cheap, and works, and usually about $10 per GB (often less):</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/vodafone_6.jpg\"> <p><strong>The problem is that the problem is non-existent.</strong></p> <p>Global roaming services are trying to solve the hassle of 5 minutes of buying and switching a SIM card. But solving that 5 minutes of switching with a global roaming service will mean the cost of mobile data will skyrocket. Thus, only rich business people with no limits on spending (e.g. business expenses) will buy them. Most people will not, unless they're stupid and want to pay 5x to 100x more for the same they can get easily at the airport for cheap.</p> <h2>The solution</h2> <p>The solution to this problem that doesn't exist? It's Apple's virtual SIM:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/09/apple_ipad_air_2.jpg\"> <p>The thing is that it only works on iPad Air's yet. Not on iPhones. But they're planning on <a href=\"http://www.forbes.com/sites/amitchowdhry/2015/03/05/iphone-6s-2gb/\">rolling it out with the upcoming iPhone 6S</a>:</p> <blockquote><p> The pre-installed SIM that Apple debuted in the iPad Air 2 lets users sign up for mobile data plans from participating carriers in the Settings app without having to sign a contract. The Apple SIM offers the ability to choose from short-term plans offered by carriers in the U.S. (AT&amp;T T -2.14%, T-Mobile and Sprint) and the U.K. (EE). The Apple SIM in the iPad Air 2 supports 20 different LTE bands within the GSM and CDMA standards, according to Wired. Support for multiple bands and standards makes it easier to use the iPad Air 2 while traveling overseas. </p></blockquote> <p>&#8212; <a href=\"http://www.forbes.com/sites/amitchowdhry/2015/03/05/iphone-6s-2gb/\">Forbes</a></p> <p>Why does that make more sense? Because there will be (virtual) national carriers who start to compete and offer decent prices on top op Apple's virtual SIM platform. Just like they do now with cheap tourist SIM cards. So that means, no 5 minute hassle with an actual SIM card anymore. Just a few taps once you land in a country. And <a href=\"http://gizmodo.com/android-pay-is-google-wallet-upgraded-1707452042\">if Apple does it, Android follows in months</a>.</p> <p>Problem? Solved!</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Why global roaming data solutions don’t make any sense"}},"pageContext":{"id":"5b92489787be056953db7bbe"}}