{"data":{"mongodbDatabaseArticles":{"id":"5b937b1c87be056953db7d1e","content":"<div><p name=\"0a06\" id=\"0a06\" class=\"graf graf--p graf--leading\">The internet seems to have been buzzing a lot about Estonia in the last year, and a lot of it is due to the innovative new e-residency program that was launched in a limited form in December 2014, and has been rolling out additions and improvements ever since.</p><p name=\"f797\" id=\"f797\" class=\"graf graf--p graf-after--p\">Yet, there has been a certain degree of confusion of what the e-residency is and isn&#8217;t, and what you can and cannot do as an e-resident of this progressive Baltic country. Instead on relying on press releases, shallow news articles or random speculation from internet-commenters, I have gone through the process of obtaining an e-residency as well as actually traveling to Estonia to go through the process of opening a bank account as an e-resident and learn more about the program first-hand.</p><p name=\"87b4\" id=\"87b4\" class=\"graf graf--p graf-after--p\">In this extensive article I go into detail of <strong class=\"markup--strong markup--p-strong\">why you might or might not want an Estonian e-residency</strong>, <strong class=\"markup--strong markup--p-strong\">how it can make it really convenient to bank</strong> and <strong class=\"markup--strong markup--p-strong\">run a business</strong> in Estonia, some <strong class=\"markup--strong markup--p-strong\">basic tax implications</strong>, and lastly, explaining <strong class=\"markup--strong markup--p-strong\">the process of obtaining e-residency</strong>.</p><p name=\"1023\" id=\"1023\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I will not go through the actual process of opening a business</strong>&#8212;I&#8217;ll save that for another article. Although registering and managing a business in Estonia is quite straight forward, <strong class=\"markup--strong markup--p-strong\">using a service provider like </strong><a href=\"https://nomadgate.com/go/leapin\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">LeapIN</strong></a> to deal with regulations, accounting and a mandatory business address <strong class=\"markup--strong markup--p-strong\">is affordable and well worth it</strong>. If you use the code &#8220;nomad&#8221; when <a href=\"https://nomadgate.com/go/leapin\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">registering for LeapIN&#8217;s service</a>, you&#8217;ll get a 100 EUR credit towards your membership fees.</p><p name=\"19b9\" id=\"19b9\" class=\"graf graf--p graf-after--p\">But first of all, there are a lot of misconceptions surrounding the e-residency. Let&#8217;s just get a few of the glaringly obvious ones out of the way right now.</p><p name=\"4744\" id=\"4744\" class=\"graf graf--p graf-after--p\">What the Estonian e-residency is not:</p><ul class=\"postList\"><li name=\"3ed9\" id=\"3ed9\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">IT IS NOT an actual residency</strong>. It does not give you any rights to stay in Estonia, the EU or the Schengen zone whatsoever. Nor any other social rights in Estonia or anywhere else.</li><li name=\"9cda\" id=\"9cda\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">IT IS NOT a way to avoid paying tax</strong> in your actual country of residence.</li><li name=\"d7dc\" id=\"d7dc\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">IT IS NOT a citizenship</strong>, and you will never receive any consular support from the Estonian government for holding an e-residency.</li><li name=\"1cfb\" id=\"1cfb\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">IT IS NOT a travel document</strong>. It is not a picture ID. It can not be used as a form for identification in the &#8220;real world.&#8221;</li></ul><p name=\"7833\" id=\"7833\" class=\"graf graf--p graf-after--li\">Currently it&#8217;s an electronic form of identification allowing you to log into online services in Estonia such as government portals and online banks. To some degree the card can also be used around Europe and this is bound to increase. You can also use it to legally sign documents electronically within the EU and increasingly also elsewhere.</p><p name=\"5aa0\" id=\"5aa0\" class=\"graf graf--p graf-after--p\">Basically it&#8217;s a digital identity card accepted by many banks and the Estonian government. By 2018 it will be accepted as online identification in all EU countries.</p><p name=\"7979\" id=\"7979\" class=\"graf graf--p graf-after--p\">So why would you need an e-residency then? Well, most people wouldn&#8217;t. But it can be very useful if you want to either bank or run a business in Estonia. Or if the e-residency just resonates ideologically with you and you want to show your support. That&#8217;s a completely valid reason too.</p><h3 name=\"ff56\" id=\"ff56\" class=\"graf graf--h3 graf-after--p\">Reasons to bank in&#160;Estonia</h3><p name=\"53e1\" id=\"53e1\" class=\"graf graf--p graf-after--h3\">Here are just a few reasons for why you might want to bank in Estonia:</p><ul class=\"postList\"><li name=\"f138\" id=\"f138\" class=\"graf graf--li graf-after--p\">You live there or spend a significant amount of time there</li><li name=\"933f\" id=\"933f\" class=\"graf graf--li graf-after--li\">You have friends, family, or customers there</li><li name=\"1145\" id=\"1145\" class=\"graf graf--li graf-after--li\">You want a Euro-account or a multi-currency account (which many Estonian banks offer)</li><li name=\"28a1\" id=\"28a1\" class=\"graf graf--li graf-after--li\">You want to diversify your assets as part of an internationalization strategy</li><li name=\"6bf1\" id=\"6bf1\" class=\"graf graf--li graf-after--li\">You want access to modern banking that you can manage from anywhere</li><li name=\"7fe4\" id=\"7fe4\" class=\"graf graf--li graf-after--li\">You want to place (some of) your assets in a country where the government isn&#8217;t consistently running huge budget deficits</li><li name=\"b0ad\" id=\"b0ad\" class=\"graf graf--li graf-after--li\">You want to do your banking in English, Estonian or Russian</li><li name=\"77f6\" id=\"77f6\" class=\"graf graf--li graf-after--li\">You want to incorporate a business in Estonia</li><li name=\"0bdc\" id=\"0bdc\" class=\"graf graf--li graf-after--li\">You have an e-residency card and want to use it for something</li></ul><h4 name=\"b92e\" id=\"b92e\" class=\"graf graf--h4 graf-after--li\">The challenge of opening a bank account in Estonia, even for e-residents</h4><p name=\"215c\" id=\"215c\" class=\"graf graf--p graf-after--h4\">If you just get on a plane to Tallinn, walk into a bank branch and expect them to open an account for you without any fuss, you are bound to be disappointed. The e-residency does not give you a right to open an account with any bank in Estonia. You read that right. As long as you are not an actual legal resident of Estonia, no bank has any obligation to open an account for you whatsoever.</p><p name=\"63e3\" id=\"63e3\" class=\"graf graf--p graf-after--p\">Due to fairly strict Anti-Money Laundering (AML) rules, it is unlikely that you will be able to open an account if you can not demonstrate a strong connection to Estonia. Basically you need to demonstrate why you want to bank in Estonia, and most of the reasons listed above will not cut it.</p><p name=\"bb94\" id=\"bb94\" class=\"graf graf--p graf-after--p\">However, the following reasons are considered valid by most banks in most cases:</p><ul class=\"postList\"><li name=\"b761\" id=\"b761\" class=\"graf graf--li graf-after--p\">You live in Estonia long-term</li><li name=\"adf3\" id=\"adf3\" class=\"graf graf--li graf-after--li\">You are Estonian (but may currently live elsewhere)</li><li name=\"2090\" id=\"2090\" class=\"graf graf--li graf-after--li\">Your parents are Estonian</li><li name=\"b81f\" id=\"b81f\" class=\"graf graf--li graf-after--li\">You&#8217;re employed by an Estonian company</li><li name=\"560d\" id=\"560d\" class=\"graf graf--li graf-after--li\">You own or manage one or more businesses that are physically located in Estonia</li><li name=\"f9a4\" id=\"f9a4\" class=\"graf graf--li graf-after--li\">You own property in Estonia</li></ul><p name=\"a42d\" id=\"a42d\" class=\"graf graf--p graf-after--li\">In short, unless you&#8217;re part of the lucky sperm club or have strong investment or business ties with Estonia it will be a bit more challenging to open a bank account, no matter if you&#8217;re an e-resident or not.</p><p name=\"4f5f\" id=\"4f5f\" class=\"graf graf--p graf-after--p\">Luckily there are ways for the rest of us. I went to Estonia last month to explore options. Through this boots on the ground-approach I learned a whole lot, which I will share in the next few paragraphs.</p><h4 name=\"784f\" id=\"784f\" class=\"graf graf--h4 graf-after--p\">Choosing a&#160;bank</h4><p name=\"3dae\" id=\"3dae\" class=\"graf graf--p graf-after--h4\">Currently there are only three banks in Estonia that support the e-residency card for logging in and managing your account. I&#8217;m sure this number will grow over time. But to be honest, the banks that currently support it is likely the banks you would want to bank with anyway.</p><ul class=\"postList\"><li name=\"7bd5\" id=\"7bd5\" class=\"graf graf--li graf-after--p\">SEB (Sweden)</li><li name=\"4f2d\" id=\"4f2d\" class=\"graf graf--li graf-after--li\">Swedbank (Sweden)</li><li name=\"9aea\" id=\"9aea\" class=\"graf graf--li graf-after--li\">LHV (Estonia)</li></ul><p name=\"3bba\" id=\"3bba\" class=\"graf graf--p graf-after--li\">Both SEB and Swedbank are fairly large, world class, Swedish banks with large scale operations in Estonia. LHV is a mid-sized, modern Estonian bank with roots as an investment firm. LHV is actually the bank used by <a href=\"http://nomadgate.com/go/tw\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Transferwise</a> for all their SEPA transactions in Euros.</p><p name=\"4f6a\" id=\"4f6a\" class=\"graf graf--p graf-after--p\">SEB and Swedbank both have branches scattered throughout the country, while LHV only has to two branches in total, one in Tallinn and one in Tartu. While that might seem like a disadvantage at first, I actually perceive it as a big plus. First of all, it gives them a lower overhead which results in cheaper banking for you. Unlike the two Swedish banks they do not charge clients from outside the EEA/EU a few hundred euros for the privilege of opening an account. They are also used to dealing with their customers remotely, even their Estonian ones.</p><p name=\"d07f\" id=\"d07f\" class=\"graf graf--p graf-after--p\">If you want to manage your bank relationship 100% remotely, the latter point is a big plus. As long as you&#8217;re an e-resident you only ever have to step foot in a LHV branch once. Even if you want to open a business account at a later date, as long as you are already a customer you can handle everything electronically from anywhere in the world.</p><p name=\"581e\" id=\"581e\" class=\"graf graf--p graf-after--p\">The only caveat is that if you want a debit card with your account, you might have to come back to pick that up a week or so after the account opening has been approved. In my case I did not have any need for yet another debit card denominated in EUR, especially since I already have the fantastic debit card from Number26 in Germany (which surprisingly is <a href=\"https://medium.com/nomad-gate/the-world-s-best-bank-accounts-for-international-travelers-and-nomads-3257e6839cff\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">accessible to most people if you know what you&#8217;re doing</a>). If you require a debit card and don&#8217;t have the time to stick around in Tallinn, I would recommend that you contact LHV up-front to see if it&#8217;s possible to have the card ready for you pick up when you come in to verify your ID.</p><p name=\"8bde\" id=\"8bde\" class=\"graf graf--p graf-after--p\">Still, the biggest plus with LHV and the definite deciding factor for me for which bank to open an account with was that they allowed me to open one. With SEB and Swedbank, if you do not meet any of the criteria listed above (or potentially deposit a huge amount of money), they will not open an account for you. If you have already managed to register a business in Estonia, at least Swedbank and maybe even SEB will consider opening an account for the business (but not necessarily for you).</p><p name=\"d2dd\" id=\"d2dd\" class=\"graf graf--p graf-after--p\">LHV, on the other hand, accepted one more reason for opening an account in addition to the above list. Critically it&#8217;s a reason anyone can give. It does not require having any prior ties to Estonia at all, nor does it require any huge investments of time or money.</p><blockquote name=\"0b2d\" id=\"0b2d\" class=\"graf graf--pullquote graf--startsWithDoubleQuote graf-after--p\">&#8220;I wish to invest in the Estonian and Baltic stock&#160;market.&#8221;</blockquote><p name=\"94dc\" id=\"94dc\" class=\"graf graf--p graf-after--pullquote\">That&#8217;s it.</p><p name=\"61bf\" id=\"61bf\" class=\"graf graf--p graf-after--p\">It might have something to do with their history as an investment firm, and the fact that they offer some great investment options. Or maybe they are just a little bit more flexible than the two giants, because that is what it takes to succeed as a smaller player? I&#8217;m not sure, but at the end of the day it doesn&#8217;t really matter.</p><h3 name=\"84ea\" id=\"84ea\" class=\"graf graf--h3 graf-after--p\">Why you might want to set up a business in&#160;Estonia</h3><p name=\"cfe1\" id=\"cfe1\" class=\"graf graf--p graf-after--h3\">Businesses registered in Estonia are <a href=\"http://taxsummaries.pwc.com/uk/taxsummaries/wwts.nsf/ID/Estonia-Corporate-Corporate-residence\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">by default considered to be tax resident in Estonia</a>. If you are running the business from a different country where you are personally tax resident, please consult the <a href=\"http://www.eoi-tax.org/jurisdictions/EE#default\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">relevant tax treaties</a> and talk to a tax professional to see if the company might be considered resident in your home country instead.</p><p name=\"8225\" id=\"8225\" class=\"graf graf--p graf-after--p\">The tax burden in Estonia is far from the highest, but also not quite a tax haven either. The tax code is generally straight forward, with 20% flat tax on most stuff. That includes 20% income tax, 20% corporate tax on distributed profits (meaning 0% on undistributed profits, see below), and 20% VAT. Note that there are social taxes totaling around 35% for employees and directors that perform their services within Estonia. As far as I have understood the social taxes will not apply to someone living outside of Estonia and not performing any actual work within Estonia.</p><p name=\"f0d9\" id=\"f0d9\" class=\"graf graf--p graf-after--p\">Overall a medium tax burden, so if low tax is all you care about there are better options. If you care about cash-flow, easy day-to-day remote management in English and a generally business friendly environment, Estonia might be for you.</p><h4 name=\"0ec5\" id=\"0ec5\" class=\"graf graf--h4 graf-after--p\">How does Estonia&#8217;s 0% tax on undistributed profits actually&#160;work?</h4><p name=\"221f\" id=\"221f\" class=\"graf graf--p graf-after--h4\">Estonia&#8217;s tax system is quite unique due to one small quirk that makes it especially attractive to growing businesses that reinvest profits into further growing the company: The 20% corporate tax is only paid on distributed profits. So as long as profits are reinvested rather than being distributed to shareholders through dividends, no corporate tax is owed. You still need to pay the tax whenever the company actually do decide to distribute profits, however.</p><p name=\"15d0\" id=\"15d0\" class=\"graf graf--p graf-after--p\">To be clear, when profits eventually are distributed as dividends, the 20% tax is paid by the company not the person receiving the dividends. In most cases the receiving person (legal or natural) needs to pay dividend or income tax according to taxation rules in its relevant country of residence.</p><p name=\"3b56\" id=\"3b56\" class=\"graf graf--p graf-after--p\">I think a quick example will make this crystal clear: If an Estonian company decides to distribute &#8364;10,000 of its profits to a natural person resident in Germany, this is the tax that will be paid by the company and the individual:</p><ul class=\"postList\"><li name=\"d596\" id=\"d596\" class=\"graf graf--li graf-after--p\">The Estoninan company pays &#8364;2,000 in corporate tax on distributed profits</li><li name=\"b8e7\" id=\"b8e7\" class=\"graf graf--li graf-after--li\">The individual resident in Germany pays the german 25% tax rate on capital gains on the remaining &#8364;8,000 (also &#8364;2,000). The individual ends up with &#8364;6,000 after tax.</li></ul><p name=\"ac04\" id=\"ac04\" class=\"graf graf--p graf-after--li\">However, if the person receiving the dividend is a <a href=\"https://en.wikipedia.org/wiki/Perpetual_traveler\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">resident nowhere</a> or resident in a country with territorial taxation (e.g. Panama), in many cases, no other tax than the 20% Estonian corporate tax will need to be paid.</p><p name=\"0d12\" id=\"0d12\" class=\"graf graf--p graf-after--p graf--trailing\">To read up more on the tax situation for legal and natural persons in Estonia, check out <a href=\"http://taxsummaries.pwc.com/uk/taxsummaries/wwts.nsf/ID/Estonia-Overview\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">PwC&#8217;s excellent tax summary</a>.</p></div>","title":"The Ultimate Guide to Estonian E-residency, Banking and Taxes"}},"pageContext":{"id":"5b937b1c87be056953db7d1e"}}