{"data":{"mongodbDatabaseArticles":{"id":"5b9629d787be0583274911b8","content":"<div><p>Welcome to <a href=\"http://www.hippie-inheels.com/backpackers-boutique\" target=\"_blank\" rel=\"noopener\">Backpacker&#8217;s Boutique</a>. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Beijing</h1><p><strong>Tell us a little about Beijing and tell us why you&#8217;re an expert on luxury travel there.</strong></p><p>Beijing, the bustling capital of China, is the center of Chinese culture and politics. From hiking the Great Wall, to shopping in Sanlitun, there&#8217;s so much to do and see in this sprawling city. With delicacies like Peking duck, to cheap street food dumplings, you&#8217;ll be sure to leave with a full stomach and a smile on your face.</p><p>I studied abroad in Beijing a few years ago, and moved back after graduation to teach English. Beijing is one of my favorite cities in China, and is a must-see for any traveler.</p><p><strong>What makes Beijing a perfect destination for travelers seeking a glamorous trip?</strong></p><p>Beijing is much less expensive than other cosmopolitan cities around the world, meaning you can have a luxury vacation on a budget. Snap a photo of yourself conquering the Great Wall, get pampered with a cheap massage or purchase a custom-made suit. The opportunities are endless!</p><p><strong>What boutique hotel would you recommend to your friends that are stopping through?</strong></p><p>I would definitely recommend <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/The_Orchid_Hotel_Beijing.htm\">The Orchid</a><a href=\"http://www.booking.com/hotel/cn/the-orchid.en-gb.html?aid=809221\" target=\"_blank\" rel=\"noopener\"></a>. A self-described &#8220;hostel for grown-ups&#8221;, The Orchid regularly holds free wine tastings for gests to get to know one another. Located in one of Beijing&#8217;s hutong neighborhoods, there are only ten guest rooms, all furnished in Qing dynasty style surrounding a quaint courtyard. Rooms start at 680 yuan per night (just over $100 USD). Click <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/The_Orchid_Hotel_Beijing.htm\">here</a> for rates and availability.&#160;</p><p><img class=\"aligncenter size-full wp-image-6989\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/Beijing-hutong-.jpg?resize=560%2C374&amp;ssl=1\" alt=\"luxury guide to beijing\" width=\"560\" height=\"374\"></p><p><strong>What about 5 Star, of them all, which is the best in your town?</strong></p><p>If you&#8217;re looking for luxury, be sure to check out the <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Shangri_La_China_World_Summit_Wing_Beijing.htm\">Shangrila&#8217;s World Summit Wing Hotel</a><a href=\"http://www.booking.com/hotel/cn/tradersb.en-gb.html?aid=809221\" target=\"_blank\" rel=\"noopener\"></a>. Located on the top floors of the tallest building in Beijing, this luxurious hotel hosts Bill Gates on his trips to China. There is even an infinity pool on the 78th floor, as well as a rooftop bar on floor 80. With spacious rooms, giant bathtubs and feather-down pillows, Shangrila is the definition of 5 Star. Click <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Shangri_La_China_World_Summit_Wing_Beijing.htm\">here</a> for rates and availability.&#160;</p><p><strong>Are there any fun activities for the adventurous traveler?</strong></p><p>Looking for an adventure? Hike the Jinlingshan section of the Great Wall. With almost no other tourists, a steep hike will lead to breathtaking views. Just be sure to bring good hiking shoes!</p><p><img class=\"aligncenter size-full wp-image-6993\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/Great-Wall-.jpg?resize=560%2C372&amp;ssl=1\" alt=\"great wall of china luxury guide to beijing\" width=\"560\" height=\"372\">Are you an adventurous eater? Wander through Beijing&#8217;s Wanfujing night market where you can find fried scorpions, sheep testicles and snake kabobs among other things.</p><p><img class=\"aligncenter size-full wp-image-6988\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/BB-Beijing.jpg?resize=560%2C433&amp;ssl=1\" alt=\"luxury guide to beijing\" width=\"560\" height=\"433\"></p><p><strong>Where are the best hang outs during the day?</strong></p><p>If you&#8217;re an early riser, be sure to head down to Beijing&#8217;s Temple of Heaven. In addition to the beautiful architecture, you&#8217;ll find locals practicing Tai chi, singing songs and toting around small toddler grandchildren. This park is by far the best place for people watching in all of Beijing.</p><p><img class=\"aligncenter size-full wp-image-6994\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Temple-of-Heaven-.jpg?resize=560%2C374&amp;ssl=1\" alt=\"temple of heaven luxury guide to beijing\" width=\"560\" height=\"374\"></p><p><strong>If you have a big date night, what are the most delicious restaurants in Beijing&#160;and what are their best dishes?</strong></p><p>While in Beijing, be sure to head to Hai Di Lao, a famous hotpot chain. A large pot of boiling broth is placed in the center of the table, surrounded by raw vegetables, meat, noodles and more. Patrons can place items in the simmering broth and remove them when they&#8217;re cooked. Hai Di Lao offers both spicy and non-spicy versions, so everyone can enjoy.</p><p>Be aware that on a weekend night you may have to wait over an hour for a table. While the wait can be long, Hai Di Lao offers complimentary snacks, tea and even shoeshines and manicures! Best of all? Taking your significant other to Hai Di Lao won&#8217;t break the bank. I usually spend about $15 per person and leave completely stuffed.</p><p><strong>Let&#8217;s talk desserts- what place makes the best?</strong></p><p>While in Beijing, be sure to explore the small Korean-style bakeries that dot the city. Relax with a coffee and a small cake or pastry in the afternoon.</p><p><img class=\"aligncenter size-full wp-image-6995\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/Tiananmen-Square.jpg?resize=560%2C374&amp;ssl=1\" alt=\"luxury guide to beijing\" width=\"560\" height=\"374\"></p><p><strong>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers?</strong></p><p>Beijing is the place to go for fake designer goods and custom-made clothing. The city is covered in bargaining markets, which tend to look more like bargaining malls. Here you can buy souvenir trinkets, jade jewelry, silk, fake designer bags, and much more. Looking for a new suit or a custom made coat or dress? The tailors here are skilled and much less expensive than those in America or Europe.</p><p>My favorite bargaining market is the one at the Jianguomen metro stop. They have an amazing selection and are less aggressive than the Sanlitun market, which is more common with tourists. Just be sure to bargain hard. Don&#8217;t worry if you <a href=\"http://www.adventuresaroundasia.com/2014/09/27/travel-in-china-without-speaking-chinese/\" target=\"_blank\" rel=\"noopener\">don&#8217;t speak Chinese</a>, all of the shops will bargain with a calculator!</p><p><strong>What are a couple of the best salons and spas in Beijing?</strong></p><p>The best place for pampering in Beijing is Green T House. Part spa, part upscale restaurant, Green T House is chic and modern with unique spa packages. The signature Bamboo special combines four hours of spa treatments, including a green tea bath, meditation, steam scrub, a facial and their signature ten-handed massage.</p><p><strong>Time for a great sunset view&#8230; where would you go?</strong></p><p>One of the best and most unique sunset views in Beijing is in Jingshan Park. Jingshan Park contains a large hill that overlooks the Forbidden City. Hike up a bit before sunset to get a snapshot of the sprawling Forbidden City, then watch the sun set behind old imperial Beijing.</p><p><img class=\"aligncenter size-full wp-image-6992\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Forbidden-City-.jpg?resize=560%2C374&amp;ssl=1\" alt=\"luxury guide to beijing\" width=\"560\" height=\"374\"></p><p><strong>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot.</strong></p><p>When the sun goes down, head out to Sanlitun and enjoy a nice cocktail. If you love beer, be sure to check out Beer Mania, which serves a vast array of specialty beers with a generous happy hour.</p><p>Afterwards, feel free to grab a local Tsingtao beer from one of the many convenience stores and wander down the narrow streets filled with tasty street food.</p><p><strong>If you end the night at a fancy club, which one do you head towards?</strong></p><p>Sanlitun is also home to the best clubs in Beijing. If you want to experience a crazy Chinese nightclub complete with dance performances and bottle service, check out MIX. Sanlitun is packed with bars and clubs, so feel free to wander around and explore.</p><p>My personal favorite club in Beijing is Sensation, located in Wudaokou. A bit out of the way, Sensation is a more American or European style club, with a large dance floor and an active bar. They also offer three free cocktails to ladies on Thursday! Be sure to grab some Mexican food at La Bamba next door before you head home for the night.</p><p>[Book a room | Book a flight]</p><p>&#160;</p><p><img class=\"alignleft wp-image-6990 size-thumbnail\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/Bio-photo.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury guide to Beijing\" width=\"150\" height=\"150\">Richelle began her life abroad by studying in Beijing and Xi&#8217;an her junior year of college. After graduation she moved back to China to teach English to 1,000 crazy high-schoolers. Now she&#8217;s attending the University of Nottingham in China, working towards a Master&#8217;s in International Communications. Check out her travel blog <a href=\"http://www.adventuresaroundasia.com/\">Adventures Around Asia</a> for more stories, photos and crazy misadventures. (<a href=\"http://www.adventuresaroundasia.com\">http://www.adventuresaroundasia.com</a>). Follow her on <a href=\"https://www.facebook.com/adventuresaroundasia\" target=\"_blank\" rel=\"noopener\">Facebook</a>, <a href=\"https://twitter.com/Adventures_Asia\" target=\"_blank\" rel=\"noopener\">Twitter</a>, <a href=\"http://instagram.com/adventuresaroundasia\" target=\"_blank\" rel=\"noopener\">Instagram</a>, and <a href=\"https://plus.google.com/+RichelleGamlam1/posts\" target=\"_blank\" rel=\"noopener\">Google Plus</a>.</p><p>&#160;</p><p class=\"fusion-clearfix\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"A Luxury Guide to Beijing"}},"pageContext":{"id":"5b9629d787be0583274911b8"}}