{"data":{"mongodbDatabaseArticles":{"id":"5b93835d87be056953db7e56","content":"<div><h1 name=\"0a9e\" id=\"0a9e\" class=\"graf graf--h3 graf--leading graf--title\">How to Run a Remote Design Sprint Without Going&#160;Crazy</h1><h2 name=\"606f\" id=\"606f\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\"><strong class=\"markup--strong markup--h4-strong\">A few tricks for distributed teams</strong></h2><p name=\"647c\" id=\"647c\" class=\"graf graf--p graf-after--h4\">One of the most common questions about the <a href=\"http://thesprintbook.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">GV sprint process</a> is &#8220;How do you run a remote sprint? What if the team can&#8217;t be together in one place?&#8221;</p><p name=\"da80\" id=\"da80\" class=\"graf graf--p graf-after--p\">I&#8217;ve heard stories of people running successful remote sprints, but to be honest, I never totally believed it. Part of the sprint magic is being in the same room.</p><p name=\"212c\" id=\"212c\" class=\"graf graf--p graf-after--p\">But this year, our team at GV was forced to run a few distributed sprints&#8230; and it actually worked. It&#8217;s not ideal and it&#8217;s not great, but it&#8217;s definitely possible.</p><p name=\"6935\" id=\"6935\" class=\"graf graf--p graf-after--p\">I still don&#8217;t have a perfect answer for how to make remote sprints work. But if you decide to try it, I have enough ideas to (hopefully) keep you from going crazy. Here goes&#8230;</p><h3 name=\"0ffa\" id=\"0ffa\" class=\"graf graf--h3 graf-after--p\">Tricks I&#8217;ve tried that&#160;worked:</h3><ul class=\"postList\"><li name=\"96eb\" id=\"96eb\" class=\"graf graf--li graf-after--h3\"><strong class=\"markup--strong markup--li-strong\">Use Google Hangouts for video. </strong>I am totally biased toward Hangouts because I used to work on it long ago. But it really does work nicely for multi-person video chat.</li><li name=\"d05a\" id=\"d05a\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Use Google Slides for Monday&#8217;s whiteboard </strong>(or a <a href=\"http://drawings.google.com\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">Google Drawing</a>). I am biased against Google Slides because I don&#8217;t think it&#8217;s very good for making presentations. But it does make a decent whiteboard. The collaborative features allow people in all locations to edit Monday&#8217;s map, long-term goal, and sprint questions.&#160;<br>Maybe more important, everyone is equally disadvantaged. When you have a whiteboard in one location, it&#8217;s great for the people there and lousy for everyone else. With Slides, everyone&#8217;s looking at the same mediocre thing.</li></ul><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*QMqfG7etf8MSL-sAWdMr_g.png\">This isn&#8217;t from a real sprint, but you get the idea. How&#8217;d I make the arrows point where I wanted them? Pro tip: Hold down the Command key when you drag points to override the &#8220;snap to&#8221; behavior. Works in Keynote&#160;too.<ul class=\"postList\"><li name=\"e948\" id=\"e948\" class=\"graf graf--li graf-after--figure\">If you can, <strong class=\"markup--strong markup--li-strong\">buy a decent USB conference microphone</strong> for any room where there are multiple people. We&#8217;ve used <a href=\"http://amzn.to/2iej6Du\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">this one</a> and it&#8217;s pretty solid.</li><li name=\"7f1e\" id=\"7f1e\" class=\"graf graf--li graf-after--li\">Try<strong class=\"markup--strong markup--li-strong\"> multiple webcams in one room.</strong> If you have several people in one location, don&#8217;t just have one computer dialed into the Hangout. Aim one web cam at the room, one web cam at the whiteboard, potentially even a third on the speaker. (Obviously mute all the mics except one or it&#8217;s gonna get real psychedelic real fast).</li><li name=\"cb5b\" id=\"cb5b\" class=\"graf graf--li graf-after--li\">Consider <strong class=\"markup--strong markup--li-strong\">narrowing the sprint to one location on Wednesday and Thursday</strong>&#8202;&#8212;&#8202;just have the people in one location decide, map, and prototype, then bring the group back online to review the prototype (Thursday afternoon) and to watch the test (all day Friday) together. I know it sounds like a cop out, but Wednesday is especially tricky over video chat.</li><li name=\"8b14\" id=\"8b14\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">On Friday, just debrief at the end of day</strong>, not between each customer interview (unless you have specific requests for the interviewer). Each location can take their own notes, come up with their own conclusions, and then talk over video chat at the end to compare. We&#8217;ve done this a few times and it works well&#8202;&#8212;&#8202;syncing up with a call or video chat between every interview burns a lot of energy.</li></ul><h3 name=\"67d8\" id=\"67d8\" class=\"graf graf--h3 graf-after--li\">Things I haven&#8217;t tried that might&#160;work:</h3><ul class=\"postList\"><li name=\"f842\" id=\"f842\" class=\"graf graf--li graf-after--h3\"><strong class=\"markup--strong markup--li-strong\">Do How Might We notes separately. </strong>Let each location (even if it&#8217;s just one person) come up with their own top 1&#8211;3 How Might We notes, then merge them at the end.</li><li name=\"6785\" id=\"6785\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Do sketching separately. </strong>After doing lightning demos as a group, each individual could sketch on their own and turn in their work at the end of the day.</li><li name=\"b023\" id=\"b023\" class=\"graf graf--li graf-after--li\">You could probably <strong class=\"markup--strong markup--li-strong\">use Google Slides for Wednesday&#8217;s decision activities</strong>. Put photos of the sketches into a slide deck and have people add dots using circle shapes. It would be a pain.</li><li name=\"c0be\" id=\"c0be\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Divide up for storyboarding and prototyping:</strong> These activities are super hard to do over video chat. If you only have people in two locations, try dividing the prototype into two chunks (especially easy if you&#8217;re doing a Rumble). Then the team in each location can make their own storyboard and prototype, checking in with each other a couple of times ahead of the test.</li></ul><h3 name=\"b942\" id=\"b942\" class=\"graf graf--h3 graf-after--li\">Running a remote sprint is pretty exhausting</h3><p name=\"b7bd\" id=\"b7bd\" class=\"graf graf--p graf-after--h3 graf--trailing\">Remote sprints are harder than in-person sprints. There&#8217;s something about tracking a group of people over video that exhausts our poor caveman brains. If there was ever a time to break a sprint over a couple of weeks (maybe &#8220;Monday&#8221; happens on week 1, and the rest of the sprint happens on week 2) it&#8217;s with a remote sprint.</p></div>","title":"How to Run a Remote Design Sprint Without Going Crazy"}},"pageContext":{"id":"5b93835d87be056953db7e56"}}