{"data":{"data":{"edges":[{"node":{"id":"5b9248ea87be056953db7c12","title":"Co-working spaces in Bangkok: Hubba","source":"levels","summary":"I knew co-working spaces were starting to pop up everwhere but I had never considered them before.\nWell, in Amsterdam co-working spaces seem to be filled with hypey wannabe startup folk building \"the next Facebook For Dogs with GroupOn Deals\".\nSo there's no use for co-working spaces to me.\nI browsed around the terrific ShareDesk, which provides a listing of co-working spaces around the world.\nOne of the best co-working spaces I found in Bangkok was HUBBA.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/05/hubba920.jpg"}}},{"node":{"id":"5b9248ea87be056953db7c11","title":"How technology changed the music industry","source":"levels","summary":"I just graduated with a Master's degree in Business Administration from Rotterdam School of Management with my thesis entitled \"How Technology Changed the Music Industry: The New Appropriability Regime and Its Influence on Artists’ Commercialization Strategy, Business Models and Skill Sets\".\nI interviewed 12 respondents that all participated in the music industry in different ways and even though the sample size is limited, my thesis offers some interesting information for artists on where the music industry is at right now and where it may be headed in the future.\nTL;DR: It's now cheaper to make music resulting in more musicians, more music produced, higher competition and thus more independent artists, new business models and an enormous entrepreneurial opportunity to present all that music to listeners.\nDue to easier access to the means of music production and distribution, the amount of artists participating in the music industry has increased substantially with a much higher competition among artists than before.\nHowever, it may also make it more difficult for listeners to find music they like, simply because there is so much music available now.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2012/09/Screenshot-2015-11-11-22.39.33.png"}}},{"node":{"id":"5b9248e987be056953db7c10","title":"Why overnight success is a myth","source":"levels","summary":"Great bit by tsunamifury on Hacker News:Most people fail, most projects go unfinished, most beyond that never make enough money to sustain a company.\nA successful product is the evolutionary result of 10,000 products before it that failed, went unfinished, or were unprofitable.\nEven the best of the Valley didn't sit down, bang out some brilliant code, slap a business strategy on top, then cash a billion dollar check.\nThen after that, they spend months or years compiling a business strategy and altering the product to become palatable to enough customers to gain a profit.\nEven finishing a unprofitable product is an massive achievement in itself.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/02/nofailstartupsuccess.jpg"}}},{"node":{"id":"5b9248e887be056953db7c0f","title":"Anna Lunoe & Diamond Lights – Stronger (Willy Joy Remix)","source":"levels","summary":"Super original track By Willy Joy who actually uses a drum loop as his melody, wat!","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2012/08/annalunoereleasesvideoforallout_1600x560.jpg"}}},{"node":{"id":"5b9248e787be056953db7c0e","title":"In the 21st century, Maria Montessori shows to be more relevant than ever","source":"levels","summary":"In fact, the idea of \"learning by doing\" stretches back to education legends Maria Montessori and John Dewey, both of whom felt teachers should act more as guides to students' independent discoveries than as founts of information.\nDecades of research confirm that making and doing things cement knowledge in ways that lectures can't.\n\"The driver is hands-on and the passenger does what students normally do in class, which is sit passively.\nMaria Montessori's philosophies on education are more relevant than ever, now we are in the 21st century.\nAs a Montessori graduate myself, it makes me happy to see the world slowly realizing this too.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/01/maria-montessori.jpg"}}},{"node":{"id":"5b9248e687be056953db7c0d","title":"How I switched from PC to Mac in less than 7 days","source":"levels","summary":"Every time I would install Windows, I would spend days customizing it and configurating it to work like I wanted it too.\nHowever, in a week, I was doing more work and doing it faster than on my PC.\nInstead of working with 2 screens on my PC, I now work with 4 screens next to each other.\nI built up a list of tips to optimise OSX for PC users that can help you transition too.\nYou don't really know what you're missing on a PC, if you don't try a Mac for at least a week.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/03/IMG_0962.jpg"}}},{"node":{"id":"5b9248e587be056953db7c0b","title":"Makers have become the invisible hand","source":"levels","summary":"It's possible because:Amazing dev tools now means app development time is shortThe trend for apps is now minimalism, which often means shorter development times.\nTech has made makers of software simply an extension of the market.\nThe market doesn't care anymore about the personal traits of makers, it doesn't care who they are, where they're from, how great their team is, what tech stack they use, or their company culture.\nCompetition is fierce and makers know that if they win, they can capture the majority of their market.\nIt doesn't care about us individually, it cares about technological progress.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/03/meerkatper.png"}}},{"node":{"id":"5b9248e187be056953db7c0a","title":"How to access anyone’s Telegram messages without unlocking their phone","source":"levels","summary":"That's a bit scary, but as long as nobody can access your messages, that's fine.\nWell, yeah, but then getting access to anyone's Telegram account is trivially easy.\nSo, without unlocking the phone you can read the code and sign in to Telegram.\nIf you have physical access to someone's phone, you can read the code and get access to their messages.\nIt can mean sitting next to a co-worker, peeking over someone's phone in the train, or even watching someone's idle phone from a HD security camera.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/06/foto.jpg"}}},{"node":{"id":"5b9248e087be056953db7c09","title":"Make money where prices are high, spend it where prices are low. Does income arbitrage work?","source":"levels","summary":"The concept of exploiting purchasing power arbitrage between your income and expenditures seems obvious, logical and fool-proof.\nThere's simply no energy, money and — most importantly — time left after they finish working daily.\nPrices are lower in the places arbitragers go to spend their money.\nThe hidden cost of arbitrageThe hidden cost of arbitrage is quite apparent.\nThere's many other factors that weigh in to the equation than just cost to make a location worth living there.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/07/IMG_3088.jpg"}}},{"node":{"id":"5b9248df87be056953db7c08","title":"How I did not sell my startup today","source":"levels","summary":"Today, for the first time, I was asked to sell one of my startups as part of 12 startups in 12 months.\nYou must be getting a ton of interest in your 2nd startup, any thoughts of selling?\nI'm having way too much fun with it still.\nFirst of all, it's having lots of fun and learning things like startup development and marketing.\nSecond, it's about meeting lots of interesting people in the startup world (which I have already).","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/06/photo-3.jpg"}}},{"node":{"id":"5b9248df87be056953db7c07","title":"Rinse FM, here’s your podcast feed we’ve always wanted","source":"levels","summary":"I have been obsessed by Rinse FM for the last six months.\nIt's just really really fresh stuff.\nPodcastSince Rinse FM actually doesn't have podcast and I was getting tired downloading the latest episodes from their website and putting them on my iPhone every other day, I built a robot that listens to Rinse FM all day and pushes the latest episodes to a podcast feed.\nYou can subscribe to the Rinse FM podcast through your podcast app (I recommend Downcast) on the URL http://etc.levels.io/rinse-fm/podcast/.\nAn index of all Rinse FM shows is available at http://etc.levels.io/rinse-fm/podcast/shows.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/11/rinse.png"}}},{"node":{"id":"5b9248de87be056953db7c06","title":"“To awaken quite alone in a strange town…”","source":"levels","summary":"“...is one of the most pleasant sensations in the world.”","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/05/681x454.jpg"}}},{"node":{"id":"5b9248dc87be056953db7c05","title":"Our society is not in line with our natural reward systems, and alcohol and drug abuse proves it","source":"levels","summary":"It will only self-administer the drug, and starve to death for the reward, when its environment isn't interesting.\nIf you're an alcoholic, if you're a problem drinker, you're always going to be a problem drinker is the prevailing wisdom.\nSo it's no wonder so many people flock to alcohol and drug abuse in the weekends.\nOur alcohol and drug abuse is a symptom of a society that is not in line with our natural reward systems.\nYes, 3+ drinks in one session is already alcohol abuse.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/03/rat-maze-cheese.jpg"}}},{"node":{"id":"5b9248dc87be056953db7c04","title":"Finding an apartment in Chiang Mai","source":"levels","summary":"I found this amazing apartment at the Hillside Plaza 4 complex on Huay Kaew road, in the north-west of the city.\nTheir cheapest room was 42m2 studio with a stunning view of Chiang Mai's mountains in the west.\nThe apartment was big, it had a pool and a fitness area.\nIt was good for awhile, I had a great mountain view of the west side of Chiang Mai towards the temple at Doi Suthep.\nBut day by day, I found out everything was a bit torn down.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/06/IMG_3315.jpg"}}},{"node":{"id":"5b9248db87be056953db7c03","title":"The free fall that is coming home after traveling the world","source":"levels","summary":"And coming home, a floor-shattering free fall.\nSo upon coming home, surrounded by familiar faces and places, I began to find comfort again in those old familiar things.\nSimultaneously, since I myself was no longer the most familiar thing, I began losing touch with my Self.\nUpon coming home, I noticed how quickly I began to compare myself to others.\nSomething funny happens when you accept who are and are free to do whatever you want.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/06/lost-in-translation-scarlett-johansson.jpg"}}},{"node":{"id":"5b9248da87be056953db7c02","title":"A Culture of Distraction is Not The Problem","source":"levels","summary":"The New York Times wrote a piece on it aptly describing how we are now \"More Connected, Yet More Alone\".\nIn the 1960s, the Vietnam War was the first \"Television War\" displaying live moving pictures from a war America fought.\nAnd that's what we're seeing right now with the current Generation Z — those that grew up with smartphones and the internet.\nThey are connected to the internet and the smartphone is the tool to make this possible.\nWe're just not completely transitioned to a full virtual world yet.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/09/World-global-consciousness-426x188.png"}}},{"node":{"id":"5b9248d887be056953db7c01","title":"The ideal place to start a startup is not necessarily in Silicon Valley","source":"levels","summary":"You do not necessarily need to start in [Silicon Valley] to become successful, especially if your situation there imposes additional hurdles to success.\nLiving out of a car or tenement is generally detrimental to one's ability to focus on the business.\nIt's always amazing to me that as tech entrepreneurs we largely sell to others the idea that technology enables us to do anything from anywhere, but simultaneously believe that there is exactly one place on earth where we must physically be to get anything done.\nThe ideal place to start a startup is anywhere that your day-to-day life issues can take a backseat to working on your startup.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/10/tumblr_ndyg3pYbKW1tubinno1_1280.jpg"}}},{"node":{"id":"5b9248d787be056953db7c00","title":"Play My Inbox, collect music from your inbox and playlist them","source":"levels","summary":"This month, I'm launching the first project, Play My Inbox, which plays music from your inbox.\nFor years, we've always been emailing each other music tracks from YouTube we love.\nIt's great cause it's my friends recommending me music I probably like too.\nThe solutionI wanted to build something that'd keep me up to date on the music in my inbox and play them for me automagically non-stop.\nTo mitigate that, I only request the minimum time of access to people's inbox, which is 60 minutes.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/02/pic.jpg"}}},{"node":{"id":"5b9248d687be056953db7bff","title":"Celebrating my birthday North Korean style","source":"levels","summary":"Now I heard there's actual North Korean restaurants outside of North Korea.\nThe North Korean government itself started opening up a chain of restaurants called Pyongyang (after its capital) years ago.\nIronically, a South Korean entrepreneur from Amsterdam then jumped on the opportunity and employed the North Korean staff to start his own traditional North Korean restaurant.\nThey sing traditional North Korean songs with dances.\nIt's a little peek into the North Korean culture many of us are very interested in but don't have easy access too.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/04/Haedanghwa-NoordKoreaans-restaurant-1024x682.jpg"}}},{"node":{"id":"5b9248d587be056953db7bfe","title":"How to backup your Linode or Digital Ocean VPS to Amazon S3","source":"levels","summary":"After creating your S3 bucket, you need to set up your security credentials so you can let your VPS server access it.\nAccess key and Secret key are your identifiers for Amazon S3 Access Key: Secret Key: Encryption password is used to protect your files from reading by unauthorized persons while in transfer to S3 Encryption password: Path to GPG program [/usr/bin/gpg]: When using secure HTTPS protocol all communication with Amazon S3 servers is protected from 3rd party eavesdropping.\n):s3cmd sync --recursive --preserve /your-folder-name-to-backup s3://nameofyours3bucketI've added --recursive to save all child directories and important --preserve which keeps all file attributes and permissions the same.\nThe date functions logs the time so you have a better log of what's happening later:#!/bin/sh echo 'Started' date +'%a %b %e %H:%M:%S %Z %Y' s3cmd sync --recursive --preserve /srv s3://nameofyours3bucket s3cmd sync --recursive --preserve /etc s3://nameofyours3bucket s3cmd sync --recursive --preserve /home s3://nameofyours3bucket s3cmd sync --recursive --preserve /var s3://nameofyours3bucket dpkg --get-selections > dpkg.list s3cmd sync --recursive --preserve dpkg.list s3://nameofyours3bucket date +'%a %b %e %H:%M:%S %Z %Y' echo 'Finished'Save this file as backupToS3.sh.\nS3 backup at Amazon, I feel a lot safer.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/12/08bits-amazon-tmagArticle.jpg"}}},{"node":{"id":"5b9248d587be056953db7bfd","title":"My 3rd startup: Tubelytics, the real-time dashboard for YouTube publishers","source":"levels","summary":"It's called Tubelytics and it's a real-time analytics dashboard for YouTube publishers.\nIt's a YouTube network with multiple music channels featuring weekly mixes in different electronic music genres.\nMany companies simply don't have that control over all their YouTube channels.\nIt lets you make groups of YouTube channels (called \"projects\") and track their metrics.\nThink big media companies (like Dreamworks) that own thousands of YouTube channel properties but have no idea how they're performing as a whole.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/05/press-desk.jpg"}}},{"node":{"id":"5b9248d587be056953db7bfc","title":"How Go Fucking Do It raised $30,000+ in pledges in less than a month","source":"levels","summary":"Last month, I launched my second project, Go Fucking Do It (GFDI), which lets you set a goal and charges your card if you don't reach it.\nI made a big media list of the major mainstream press to reach out to.\nIn the end almost 30,000 people visited Go Fucking Do ItIn the end 1% of visitors set a goal and entered their credit card details.\nI must be able to break this to mainstream press at some point.\nEven though the big press coverage is over, visits are not tailing off yet.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/04/2014-02-gfdi1.jpg"}}},{"node":{"id":"5b9248d287be056953db7bfb","title":"Co-Working Spaces in Chiang Mai: PunSpace","source":"levels","summary":"It was located near the Nimman area, near Chiang Mai University.\nI had never seen such a high work ethic at any co-working space before than at Punspace.\nChiang Mai wasn't that boring after all.\nIn Bangkok you'll get sick of seeing so many foreign tourists everywhere, in Chiang Mai many of the foreigners you meet actually work here.\nNow that I could get my work done at PunSpace, I had to find an apartment in Chiang Mai ».","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/06/IMG_3189.jpg"}}},{"node":{"id":"5b9248d287be056953db7bfa","title":"The total chaos that the dawn of the 21st century has become","source":"levels","summary":"The dawn of the twenty-first century has proved unsettling.\nOnly a few years ago, the world was full with apparently justified optimism.\nThe new century would be free of the ideological fights that plagued the twentieth.\nAs the new century settled in, however, worrying facts are deflating all these optimistic expectations.\n(..) Trying to keep the current shape of society unchanged, however, is the best way to fall into stagnation, destructiveness, or both.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/12/s_a01_38818240.jpg"}}},{"node":{"id":"5b9248d287be056953db7bf9","title":"Why I want to live in Singapore","source":"levels","summary":"Ever since I visited Singapore for the first time three years ago, I've been obsessed by it.\nIn 2010, like so many kids during college, I was back-packing through South-East Asia and when I ended up moving south, I ended up in Singapore.\nAfter the total chaos, dirt and noise I had been through on my back-packing trip, clean Singapore was a breath of fresh air.\nShe made me realize again why I like Singapore so much.\nI love SingaporeansThe people of Singapore are the ones I most identify with too.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/11/Singapore_Panorama_v2.jpg"}}},{"node":{"id":"5b9248cf87be056953db7bf8","title":"Run through ideas quickly","source":"levels","summary":"If I had to give any advice, it would be to run through ideas quickly.\nIf they're not gaining traction, or they're a struggle to grow, drop them and move on to the next idea.\nThis isn't going to be true for everyone, but each of my successful projects was a success from day one.\nMy two or three successful projects were built within a week or two.\nIt doesn't matter if you fail 90% of the time though, you just need to burn through those ten ideas to find the one that works.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/05/tumblr_n5e0d0qDIW1st5lhmo1_1280.jpg"}}},{"node":{"id":"5b9248ce87be056953db7bf7","title":"The achiever in crisis","source":"levels","summary":"If your identity is tied up in your work, then you feel bad about yourself when work isn't going well.\nEven if we succeed and have businesses that do well, the question is what do we do it for?\nThis is a classic \"achiever in crisis.\"\nAt least before the defense they could have something look forward to, and the various requirements provided a source of manic energy to propel the achiever forward.\nAnd making sure that you enjoy whatever it is that you're actually doing, while you're doing it.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/06/tumblr_n6esyhWNdU1st5lhmo1_1280.jpg"}}},{"node":{"id":"5b9248cd87be056953db7bf6","title":"Stop calling night owls lazy, we’re not","source":"levels","summary":"And actually night owls are more intelligent.\nThere's more: night owls are also more productive, and outlast morning people in mental performance:There was no real difference between the early birds and the night owls in their performance on the morning test.\nBut the evening test was a different story: night owls were less sleepy and had faster reaction times than early birds.\n— The brains of early birds and night owls in NewsweekThere's more research coming out about the benefits of power naps too.\nSo, to anyone who still tells people that sleep late, wake up late, or sleep whenever they want that they're lazy.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/12/nighthawks.jpg"}}},{"node":{"id":"5b9248cc87be056953db7bf5","title":"Co-working spaces in Bangkok: Launchpad","source":"levels","summary":"After discovering Bangkok's most famous co-working space HUBBA and working there for a few days, I decided to check out other spaces too.\nAfter HUBBA, the second most popular is Launchpad, they are stationed around the Surasak BTS Skytrain station.\nVince told me that Launchpad was closed due to the May 1 Thai holiday of Worker's Day.\nLaunchpad is absolutely huge compared to other spaces.\nWhere HUBBA tries to be more like a small communal 'hub' to build a Thai startup environment, Launchpad is more international and business-oriented.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/05/launchpad.jpg"}}},{"node":{"id":"5b9248cb87be056953db7bf4","title":"How to successfully build a community around your startup","source":"levels","summary":"You can sign up to the #nomads community hereThe hardest part of startups these days is not building the product or app.\nLet's try itWhen I launched Nomad List, I finally had a product to cater to this audience too.\nI wanted to try and build a community around this product's audience.\nAnd then it all went IN REAL LIFE (IRL)In just a week, the chat community has spawned a lot more.\nIn this case, it's an informal community for nomads very loosely tied to Nomad List.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/10/xpic-copy.jpg"}}},{"node":{"id":"5b9248ca87be056953db7bf3","title":"Why traveling makes you feel lost","source":"levels","summary":"The self is highly adaptable to its external environment, and ironically, the more you change your external environment, the more you lose track of who you actually are, because there’s nothing solid to compare yourself against.\nFrequent travel puts your identity into constant flux where it’s impossible to distinguish with certainty who you are or what you know, or whether you really know anything at all.\nBecause uncertainty breeds skepticism, it breeds openness, and it breeds non-judgment.\nTo the waves and the wind and the calls for love in all of the beautiful languages you will never understand.\n—Mark Manson on 5 Life Lessons From 5 Years of Traveling the WorldP.S.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/09/italy-at-night.jpg"}}},{"node":{"id":"5b9248c987be056953db7bf2","title":"The myth of a globalized world","source":"levels","summary":"When I asked Kim about his future plans, he told me he had been preparing for years to travel to Europe.\nAs a European and citizen of the Netherlands, I can travel visa-free to ~173 countries (88% of the world).\nBy comparison, a Vietnamese can travel visa-free to ~45 countries (23% of the world).\nFor a non-westerner getting a visa anywhere is a painstaking process of filling out countless of forms and odds stacked against them.\nAs much as we want to believe in a globalized world with national borders having become irrelevant, the most important facet of that, traveling freely, is still a far cry for many.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/10/2-paspoorten.jpg"}}},{"node":{"id":"5b9248c987be056953db7bf1","title":"Visiting Koh Samui, the island of paradise","source":"levels","summary":"Since we were both up for some swimming in the sea, we headed off to the islands in the south.\nBack in 2010, I had already visited the coastal town Krabi and the island Koh Lanta with Sam back.\nWe really enjoyed the peace, quiet and beautiful beaches and light-blue water of Koh Lanta, eventhough we had to leave the island later due to the absolute worst food poisoning ever.\nYou can stay on a more beautiful Thai island and spend $10 per night to live in an entire beach resort and spend $2 to have breakfast/lunch/dinner.\nWith typically Thai beautiful white beaches and light-blue translucent water, where you can see cute little fish swim around your feet.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/05/IMG_2512.jpg"}}},{"node":{"id":"5b9248c687be056953db7bef","title":"“If I had this, I would be happy”","source":"levels","summary":"Paul: People tend to go \"if I had this, I would be happy\".\nThe great thing about \"having that\" is finding out or not if you truly are happy.\nAnd then the struggle becomes \"okay, what's it gonna take to be happy\".\nJoe: Isn't it fascinating that a lot of people that become really successful, become really successful because of a hole?\nJoe: So you changed your motivation, your motivation became, instead of just get love, get all this fame and then I'll feel happy.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/10/Screenshot-2014-10-24-04.32.24.png"}}},{"node":{"id":"5b9248c687be056953db7bee","title":"How I predict Bitcoin’s price by tracking Twitter mentions","source":"levels","summary":"Since Bitcoin is such a new currency, it is still heavily affected by media coverage surrounding it.\nThis then seeps through slowly into the mainstream media in the following days, resulting in a huge rise in price.\nMuch of the money made by Bitcoin day traders is based on closely following these trends of news coverage on Bitcoin.\nYou can see the live Bitcoin price vs. tweets chart for yourself here (note: it's tested on Chrome on OSX, if it doesn't work, try it in incognito without extensions).\nIncluding live Google searches and Facebook mentions will give you a pretty clear picture on where the price will be going (if it keeps following media coverage).","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/11/Screen-Shot-2013-11-21-at-17.28.001.png"}}},{"node":{"id":"5b9248c687be056953db7bed","title":"Reset your life","source":"levels","summary":"I sold my DSLR camera I used for making music videos, camera stands, and all my musical equipment.\nSelling the camera was difficult because it also meant that the music videos and the YouTube projects my friend Jim and I worked on would end.\nThailand seemed like a stable, safe start for my life reset.\nLife is an adventure again and surprisingly my anxiety is gone.\nLife is like the best video game ever, it has amazing graphics, infinite amounts of levels, a huge map and this ridiculous great freedom.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/04/IMG_1421.jpg"}}},{"node":{"id":"5b9248c687be056953db7bec","title":"Bali is the magical voodoo spirit island of Asia","source":"levels","summary":"In my head Bali was a party island full of Australians in neon tank tops I had to avoid at all costs.\nThey see it's real Indonesian coffee.\nI'm angry because just 15 minutes into my arrival in Bali, someone has been trying to scam me with a stupid tour.\n[insert Drone video here]It turns out there's lots more people from Hubud here, and in the evening we all visit a reggae bar on the beach.\nActually the whole island reminds me of Monkey Island 1:The Balinese traditional music that's played doesn't help with the voodoo vibes, at all.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/07/photo44036811243247455.jpg"}}},{"node":{"id":"5b9248c587be056953db7beb","title":"Over 2,000 people played their inbox with Play My Inbox","source":"levels","summary":"Last month, I launched the first project, Play My Inbox, which plays music from your inbox.\nI then sent it to a few major tech blogs.\nThese were Lifehacker, TheNextWeb, Fast Company, TechCrunch and music tech blog Evolver.FM.\nLike if you're building a music app, maybe you should send it to music blogs and not TechCrunch, dude.\nThat will probably work better than just sending it to the 5 biggest tech blogs.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/02/pic.jpg"}}},{"node":{"id":"5b9248c487be056953db7bea","title":"This is what happens when FlightFox copies your entire site without attribution","source":"levels","summary":"Sites before Nomad List have done it, and other startups are working in this space, like Teleport.\nBut it appears as if FlightFox directly scraped my site, merely stripping out a few cities and adding a few others to make it look theirs.\nAnd it shows direct market validation:@cwaring @jongold @flightfox obvs if inspired by @levelsio, attribute it.\n— Flightfox (@flightfox) October 14, 2014@flightfox @levelsio Sarcasm isn't becoming of corporate accounts, especially when directed at a customer and fan.\nOr even if they didn't ask but just attribute Nomad List as a source.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/10/nomadlistx.png"}}},{"node":{"id":"5b9248c387be056953db7be9","title":"How to protect your backups from solar flares with a faraday cage","source":"levels","summary":"I have 6 mirrors of my hard drive located around the country, with one even on the other side of the world.\nOne that can instantly wipe out all of your hard drive's data, without you even noticing it.\nMitigating against solar flaresSo how do can us truly paranoid protect against a solar flare?\n— WikipediaWhat's a cheap Faraday cage to put your hard drives in?\nIn case of an influx of solar energy, the tin \"should\" deflect the energy and if you connect a ground wire, the energy dissipates in to the earth away from your drive.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/02/IMG_2015.jpg"}}},{"node":{"id":"5b9248c287be056953db7be8","title":"How I hacked Slack into a community platform with Typeform","source":"levels","summary":"Slack was originally meant as a team communication platform, but it functions surprisingly well at large-scale as a community platform.\nToday, I'll show how I combined a few services to fix that and transform Slack into a community platform.\nTypeform saves all the sign ups in an spreadsheet you can download.\nMy email is damirkotoric@gmail.com — Damir KotoriÄ‡ (@damirkotoric) November 19, 2014Let's automate itI would have used Zapier for this, and although it appears to have a Typeform & Slack integration, it's too limited to be of any use here.\nYou can generate a token for your team on the Slack API page:I posted it and it returned:","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/11/2014-11-23-hackingslackx.png"}}},{"node":{"id":"5b9248bf87be056953db7be7","title":"Nationality is an accident of birth","source":"levels","summary":"—Satya Nadella, Microsoft's new CEOThis is my position on the Olympics and basically all national pride.\nIt has nothing to do with anything, there is nothing to be proud of.\n—mhurron on Hacker NewsNationalism is just outdated tribalism that requires you to put your societal overlords' agendas above your own.\nWhen they call for you to go to war and kill your brothers and sisters from different places, you do it.\nJust don't let that devolve into \"we are better than them\", as it usually happens.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/02/north-korea-parade.jpg"}}},{"node":{"id":"5b9248be87be056953db7be6","title":"Ideals, fears and the script of life","source":"levels","summary":"There's a very good chance the ideals you have when you're young do not necessarily match society's script of what an average life should be.\nBut then again, when following society's script, you're rewarded well.\nFollowing your ideals is therefore very difficult, since it means you have to write your own script of what life should be like.\nIn the long term, following society's script becomes a liability though.\nAnd then after awhile, when you have it worked out, you'll find yourself in a situation where you've created a unique script for yourself which matches your ideals.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/07/566394520_2dbf36ace1_o.jpg"}}},{"node":{"id":"5b9248bd87be056953db7be5","title":"My Bad Day At The Co-Working Space","source":"levels","summary":"Too many bean bags, not enough coffee, this is what happens when my day at the co-working space goes haywire.\nLocation: Launchpad, Bangkok","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/02/maxresdefault-2.jpg"}}},{"node":{"id":"5b9248bd87be056953db7be4","title":"If you can’t express yourself by email, you’re not worthy of anyone’s time","source":"levels","summary":"Some company likes what you're doing/making, and they want to work with you or become a client/user of your startup.\nBusiness, the role playing gameTo me, the traditional business world sounds a lot like one massive role playing game.\nBy definition you can't be bullshitting if you're text-based.\nIf you can't express yourself by email, you probably don't know what it is you want either.\nI don't use email so tweet me your questions.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/05/6FZ39Jr.jpg"}}},{"node":{"id":"5b9248bd87be056953db7be3","title":"What happens when you’re #1 on Hacker News for a day","source":"levels","summary":"Last Sunday, my post \"What I learnt from bootstrapping my startup in Thailand for 6 months\" hit #1 on Hacker News and then stayed there for most of the day.\nI was surprised to see China being up there so high, but it seems HN reaches so far now too.\nFor no real reason other than that I've seen it happen on HN, YouTube and the internet many times before.\nThe second highest comment was factual but was overtaken by the top comment at the end of the day.\nAfter reading my post, she followed the link to Hacker News and then sent me this frighteningly on-point email:Dear Pete.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/10/hn.jpg"}}},{"node":{"id":"5b9248ba87be056953db7be2","title":"On self-funding startups","source":"levels","summary":"With funded startups often founders get into business purely because there's a big opportunity.\nPersonally I can't imagine working on a problem that I am less than fanatical about solving.\nThat's not why I'm running a business.\nYou're working on something because you believe in it to the point where you're willing to take on personal risk.\nI'm running a business because I love making software, I love the problem space we're in and I love the solution that we've built.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/05/tumblr_n4ef69szs71st5lhmo1_1280.jpg"}}},{"node":{"id":"5b9248b987be056953db7be1","title":"Linkoban – Oh Oh","source":"levels","summary":"Fresh tune, fresh video, fresh MC.\nAll around sick.\nThis is....Linkoban (also check her previous tune \"Like This\")","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/02/maxresdefault.jpg"}}},{"node":{"id":"5b9248b987be056953db7be0","title":"Never dismiss your ideals as post-adolescent fantasy","source":"levels","summary":"You are told to travel, in other words, in the opposite direction to the one you want to take.\nIt is an exceptional person who emerges from this process with her aims and ideals intact.\n(..)What the corporate or institutional world wants you to do is the opposite of what you want to do.\nIt wants a reliable tool, someone who can think, but not for herself: who can think instead for the institution.\nHow many times have I caught up with those people several years later, to discover that they have acquired a lifestyle, a car and a mortgage to match their salary, and that their initial ideals have faded to the haziest of memories, which they now dismiss as a post-adolescent fantasy?","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/06/debt-ball-and-chain-620x480.jpg"}}},{"node":{"id":"5b9248b887be056953db7bdf","title":"How technology is shaping our future: billions of self-employed makers and a few mega corporations","source":"levels","summary":"That's jobs for the working class (or lower class, but I think that's a non-PC term).\nEnterprise software is any software that medium and big companies buy to make them more efficient.\nThe labor force feels entitled3/ Especially in W-Europe people seem to be too stubborn to learn to make/code and become self-employed, as they feel entitled to a job — levels.io (@levelsio) March 6, 2015There's also a sense of entitlement.\nAnd they're both necessary and will be in high demand — levels.io (@levelsio) March 6, 2015Infrastructure has always primarily been about cost.\nBut embracing change is probably a better idea — levels.io (@levelsio) March 6, 2015I'll probably get these reactions after I post this blog too.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/03/wallpaper-5686-cityscape-sci-fi-future.jpg"}}},{"node":{"id":"5b9248b787be056953db7bde","title":"GIFbook, the first animated GIF flipbook","source":"levels","summary":"Answers obviously agrees:The solutionSo even though this doesn't seem like a world shattering problem, I thought, let's fix this by letting people print animated GIFs as flipbooks.\nI needed to be able to resize/crop the GIF from the user's input, cut up the animated GIF frames, and since the flip book was set at 50 frames by my supplier, I had to somehow make sure the image sequence I sent them was exactly 50 frames.\nInstead I opted to try and half or double the frame rate so it'd fit inside the 50 frames.\nThen if it was too many frames, I'd simply repeat the GIF until it was 50 frames long.\nThat sounds like a fun market :)Try it outIt's live now, so go try it out, upload your own GIF and get your own animated GIF flipbook!","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/07/photo-3.jpg"}}},{"node":{"id":"5b9248b787be056953db7bdd","title":"I’m Launching 12 Startups in 12 Months","source":"levels","summary":"So for the next 12 months, I've set the goal to launch 12 startups in 12 months.\nThe fear of failure takes over so we don't put enough effort into launching or we don't launch at all.\nFor the next 12 months, I'm launching one startup every month.\nWe'll see where I am in 12 months, but I think I'll have more to show for my name.\nMy progress reportI'll be updating my progress here with links to posts about each month's startup.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/03/2014-02-12startups12months1.jpg"}}},{"node":{"id":"5b9248b487be056953db7bdc","title":"The 24-Hour Coffee Place in Bangkok: Too Fast To Sleep","source":"levels","summary":"I couldn't really work in a hotel room every night.\nI took to the internets and by sheer luck I found Too Fast To Sleep scribbled on some back-alley blog.\nIt was the ONLY 24-hour place in Bangkok.\nThe wooden interior gives a nice and mellow atmosphere and there's big pillows everywhere to chill on the ground with.\nEveryone's asleep, so you can focus really really well here at night.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/07/IMG_2736.jpg"}}},{"node":{"id":"5b9248b487be056953db7bdb","title":"We have an ideologically broken and personally unfulfilling society","source":"levels","summary":"A few years back I was completely disillusioned with living and working in a big city, basically just to buy more stuff.\nWhat we have is an ideologically broken, personally unfulfilling, extremely resource-intensive society, and indoctrination quips like \"it's the best thing other than all the other things that have been tried\" and \"our luxuries rise other poorer people out of poverty\" shouldn't cut it.\nI just wrote a book on bootstrapping indie startups called MAKE.\nAnd I'm now on Instagram and Twitter too if you'd like to follow more of my adventures.\nIf you like what I'm doing, consider backing me on Patreon.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/05/buy-more-stuff.jpg"}}},{"node":{"id":"5b9248b287be056953db7bda","title":"How I spent the night with Singapore’s migrant workers","source":"levels","summary":"Since I forgot to extend my booking in the hostel I was staying, I ended up moving to another hostel dorm somewhere around Singapore's central Bugis area.\nI entered the dorm where I was going to sleep tonight, which looked more like a homeless shelter than a hostel dorm.\nI figured that's a lot of beds, but since Singapore's rents are so high, you have to have some return on investment.\nI was in the dorms of Singapore's illegal migrant workers.\nThese workers are the ones making Singapore's current building boom of skyscrapers possible.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/11/1383922217593.cached1.jpg"}}},{"node":{"id":"5b9248b187be056953db7bd9","title":"How I travel the world with just a carry-on bag","source":"levels","summary":"And the easiest way to do all of those things was to get rid of check-in luggage altogether.\nI've now been traveling for almost 8 months with just this carry-on bag.\nSince 99% of things you need are available to buy in some form or another in any city in the world, most people really don't need any more than this.\nBy removing check-in luggage, my typical day of travel now goes like this.\nSince I only have a carry-on bag and am already checked in, I don't need to wait in check-in queues for hours talking to stressed-out desk agents.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/11/2013-07-13t121733z_1285117834_gm1e97d1k5e01_rtrmadp_3_switzerland.jpg"}}},{"node":{"id":"5b9248b087be056953db7bd8","title":"How Automation Left Us Feeling Empty","source":"levels","summary":"A few of us still have some minor tasks that can't be automated yet, and we've hired people for that (mostly remotely to save costs).\nWhen you're fired from your job, you become unemployed and you get the same feeling.\nAnd it's a valid feeling since you want to be active and have a purpose.\nAnd if there's nothing to do anymore, we start feeling empty.\nBut this feeling does give us a little peek into the future.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/04/Server-Farm-Medium.jpg"}}},{"node":{"id":"5b9248af87be056953db7bd7","title":"How I build my minimum viable products","source":"levels","summary":"In this post, I'd like to show you the basics of how my I build my minimum viable products (or MVPs).\nI don't think that's bad necessarily.\nI don't have as much as time to build things big and I don't see the point of building things big immediately.\nI don't think a site needs to be filled with functionality from top to bottom.\nInstead, I use Nginx's config file as a natural router to route specific URLs to specific PHP files.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/09/Stocksy_txp195e3b79y3A000_Small_192861.jpg"}}},{"node":{"id":"5b9248af87be056953db7bd6","title":"Why are the Vietnamese so rude?","source":"levels","summary":"From the perspective of a Westerner, the average Vietnamese will come across as impolite, rude and unfriendly.\nThe first I heard entering Vietnam from a Vietnamese person was \"don't take out your iPhone in the street, they'll steal it\".\nAnd the first hit for Google autocomplete for Vietnamese was \"rude\".\nEven Vietnamese themselves thought they were unfriendly:Oh my god, since I’m a Vietnamese (that is currently living in Vietnam) I feel asshame reading this.\nWay, way, way longer than any other culture I've interacted with so far.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/10/IMG_0947.jpg"}}},{"node":{"id":"5b9248ad87be056953db7bd5","title":"How I ended up in Hong Kong (or my adventures in the New York of the East)","source":"levels","summary":"With all options off the table, I decided to fly to Hong Kong and retreat into safety.\nHong Kong is expensiveHong Kong is relatively pricey and I'd say on par with most big metropolitan cities like New York and London.\nI couldn't get rid of my runny nose and nasty cough until I finally flew out of Hong Kong.\nFor me, Hong Kong is the New York of the East.\nOn the tail end of my trip, we ended up celebrating New Year's Eve in Hong Kong, which was a blast... »P.S.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/01/hong-kong-by-levelsio1.gif"}}},{"node":{"id":"5b9248ac87be056953db7bd4","title":"Remote working is the future","source":"levels","summary":"If you're building a start-up, you don't have time to play and you're probably not rich (yet).\nRemote working can be the answer to the problem.\nBut increasingly tech start-ups are considering it, simply because it's cheaper than renting an office.\nAnd with automation pushing labor costs lower, it may become the inevitable future of employment.\nRemote working also has one incredible competitive advantage.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/05/IMG_1795.jpg"}}},{"node":{"id":"5b9248ab87be056953db7bd3","title":"Celebrating NYE 2014 in Hong Kong","source":"levels","summary":"On the tail end of my Hong Kong trip, my friends came over to visit me and celebrate New Year's Eve.\nMy friend made a really cool video of our trip:After staying 3 weeks in HK, with Thailand still in distress, I flew back to my home country for a break, where I went from 100 to 0 things... »","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/04/Screen-Shot-2014-04-09-at-16.23.19.png"}}},{"node":{"id":"5b9248a987be056953db7bd2","title":"All Watched Over by Machines of Living Grace","source":"levels","summary":"One of the best documentaries I've ever seen is the series All Watched Over by Machines of Living Grace by Adam Curtis.\nThe first episode manages to trackback 1997's Asian Financial Crisis and the 2008 Worldwide Financial Crisis back to Ayn Rand's philosophies of objectivism.\nRand's ideas dictate that everyone should simply be a rational actor doing what's best for themselves, and in effect that will be best decision for all people.\nAnd I'm now on Instagram and Twitter too if you'd like to follow more of my adventures.\nIf you like what I'm doing, consider backing me on Patreon.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/01/Ayn-Rand.jpg"}}},{"node":{"id":"5b9248a887be056953db7bd1","title":"Cash means controlling your own destiny","source":"levels","summary":"I chose personal freedom over spending power.\nCash means controlling your own destiny.\nWith enough cash, you can decide for yourself what you want to do and when you want to do it.\nI call it buying my time, but in reality, you are buying your freedom to choose.\nIf you look at the most successful companies or people, they tend to have a significant reserve and that allows them to make choices.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2013/10/tumblr_n3tsvijTsy1st5lhmo1_1280.jpg"}}},{"node":{"id":"5b9248a887be056953db7bd0","title":"How I built Nomad Jobs, a remote job board for 100% distributed startups","source":"levels","summary":"The attention Nomad List got was insane and to me shows that we're in the middle of an gigantic social trend towards remote working internationally.\nThe first problem I solved was with Nomad List, answering the question where you should relocate to.\nSince Nomad List already received so much exposure to its brand, I wanted to re-use its logo to build Nomad Jobs.\nThe jobs page then pulls the new jobs straight from the Typeform's API and adds them to the website.\nAnd doing that for remote work seems like a pretty obvious market need to me.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/08/mock2.jpg"}}},{"node":{"id":"5b9248a787be056953db7bcf","title":"How I got my startup to #1 on both Product Hunt and Hacker News by accident","source":"levels","summary":"I just launched my 4th startup called Nomad List as part of my goal to launch 12 startups in 12 months.\nThe solutionSo I wanted to make a simple list of cities that were good for this kind of lifestyle.\nThe primary factor for people that take part in this lifestyle is cost of living and quality of living.\nTo give you an idea, Hacker News still gets you 4x more traffic than Product Hunt.\nHacker News gets you about 50,000 unique visitors and Product Hunt about 12,000.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/07/frame-copy.lab25mock.jpg"}}},{"node":{"id":"5b9248a687be056953db7bce","title":"Why does Generation Y feel so lost? And what’s the cure?","source":"levels","summary":"Today, Hacker News saw an anonymous post rise to the top titled \"I'm 25 years old and I am lost\".\nFeeling lostIn the last year, I can't tell you how many people I've met my age that tell me they \"feel lost\".\nThe digital nomads I met in Bali, especially in Ubud, feel it overwhelmingly, that's probably why they're there in the first place.\nSo what does \"feeling lost\" actually feel like?\nBut to show you in what a bad state we are: Even writing that, it seems logical and all, but it's hard for my mind to believe that's where happiness lies.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/08/140502-millennials-mn-1050_3f95093cf2e7ad5c4e806d7747fdf81d.jpg"}}},{"node":{"id":"5b9248a587be056953db7bcd","title":"On Thailand’s immigration police targeting digital nomads","source":"levels","summary":"Update: Thailand's immigration has stated \"People working remotely or running online businesses in Thailand can legally work there on tourist visas\".\nJon Myers just tweeted me that in the last 24 hours, Thailand's immigration police has begun rounding up foreigners working from PunSpace in Chiang Mai, checking their visas and detaining them.\nI've heard from many people that Nomad List is having some effect on the city now.\nWith Chiang Mai being #1 on the list, there's now an influx of new people relocating to Chiang Mai.\nThailand can be a legal remote working hubThailand has been at the center of the remote work and digital nomad community.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2014/10/unnamed.jpg"}}},{"node":{"id":"5b9248a487be056953db7bcc","title":"It’s about time for a digital work permit for remote workers","source":"levels","summary":"TL;DR we need a digital work permit for remote workers since they don't compete with the local labor markets in the countries they work from.\nBackstoryYesterday, I tweeted how the United Nations will let remote workers travel the world and work legally with a digital work visa.\nThe 🇺🇳UN is introducing a 💳digital work visa which lets remote workers work legally (and pay tax) in 187 countries: pic.twitter.com/XWTQugdH2S — Pieter Levels @ 🇺🇸 (@levelsio) June 7, 2017It got 200+ retweets, 600+ likes and even got picked up by some press.\nAs my readers know, digital nomads and remote workers are a burgeoning trend now and growing rapidly.\nIf they can visit a place for 90 days, they're bound to work remotely their anyway, so in that case offer them a digital work visa.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/06/2un-card.png"}}},{"node":{"id":"5b9248a487be056953db7bcb","title":"In a world of outrage, mute words","source":"levels","summary":"But it's highly questionable if just typing on a computer or smartphone keyboard actually changes something in the real world.\nStarting with Twitter which has something called \"muted keywords\", which lets you filter your timeline based on certain keywords.\nTo figure out what to mute and keep it up to date, I thought let's try get the hivemind involved.\nI built a collective muted words list app called Mute:It's a free web app that lets people add muted words and vote for them.\nYou click a word and it brings you to Twitter or Facebook to mute it.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/08/Aug-08-2017-18-36-53-1.gif"}}},{"node":{"id":"5b9248a387be056953db7bca","title":"How I cured (most of) my anxiety","source":"levels","summary":"When anxiety gets really bad, your mind feels like on the left.\nI had simply self-medicated anxiety with travel but I never really cured the core issue.\nIf you have a lot of anxiety or stress over a time, you may also start to get derealization, depersonalization or disassociation.\nI've taken it as part of these over-the-counter sleeping pills and it works REALLY amazingly well against anxiety for me.\nTobias van Schneider cured his anxiety with it too.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/08/3x.jpg"}}},{"node":{"id":"5b9248a287be056953db7bc9","title":"From web dev to VR: How to get started with VR development","source":"levels","summary":"There's VR laptops now but they are prone to overheat and break.\nIt has room scale VR by default, which means you can walk around freely in your room.\nWebVRI didn't want to write this post about learning VR as a web dev and not even mention WebVR.\nConclusionI'm amazed how easy it is to get a 3d scene you made into VR.\nHere's a start:Then at the end of this year I'd like to try and get it into the SteamVR store for free and I'll close the year having learnt 3d, VR and released my first VR game/experience.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/03/2016-03-01-render-without-lantern-corrections.jpg"}}},{"node":{"id":"5b92489f87be056953db7bc8","title":"Most coworking spaces don’t make money; here’s how they can adapt to survive the future","source":"levels","summary":"Since it's a coworking space conference and I've been to many coworking spaces traveling the last few years.\nFor nomads, coworking spaces are like a Mount Everest Basecamp in a foreign world.\nCoworking spaces don't really have economies of scale.\nThose empty spots could be bought up by the city government and cheaply changed into very basic coworking spaces for its citizens.\nTherefore the economic benefits are way bigger than the cost it would be for cities to build coworking spaces in their cities.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/02/IMG_4371-1.jpg"}}},{"node":{"id":"5b92489e87be056953db7bc7","title":"Building a startup in public: from first line of code to frontpage of Reddit","source":"levels","summary":"I show how I built a mini startup called Hoodmaps in public from the first line of code to a functioning web app that I got to the frontpage of Reddit with over 300,000 people using it.\nDay 1 (2017-03-31)📺 I'm live streaming on @twitch coding a new thing called Hood Maps from zero 👉 https://t.co/VNpJMQTuId pic.twitter.com/UpUKlFor2A — Pieter Levels @ 🇺🇸 (@levelsio) March 31, 2017On day 1, I'll build the first prototype of Hoodmaps.\npic.twitter.com/h8SP8qJggU — Pieter Levels @ 🇺🇸 (@levelsio) July 3, 2017Technically, it's simply the same database entry with coordinates but with a text label included:epoch,user_id,latitude,longitude,label,uidEpoch is the timestamp of when the tag was made.\nWill see if I can make an auto ban thingy pic.twitter.com/ccBIH3xRzF — Pieter Levels @ 🇺🇸 (@levelsio) July 6, 2017all auto generated weird word spam, no idea why pic.twitter.com/uJOUg6Aodq — Pieter Levels @ 🇺🇸 (@levelsio) July 6, 2017It turns out they automatically submitted 205,603 tags like \"brontometer unretractable Pharisaism\".\nReddit is a spoiled child, it gets the best content on the web, and it's all competing for the frontpage.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/07/Jul-26-2017-15-11-29-1.gif"}}},{"node":{"id":"5b92489e87be056953db7bc6","title":"The TL;DR MBA","source":"levels","summary":"This is all 140 character tweets which forces it to keep it concise, something 300-page business books and 4 years of business school doesn't.\nHonestly, I don't think you should pay lots of money to spend it business school.\npic.twitter.com/pPUbM98sjl — Pieter Levels @ 🇺🇸 (@levelsio) July 21, 2017Reading Profit & Loss statementsA big part of finance is being able to understand companies based on their documents filed.\n— Pieter Levels @ 🇺🇸 (@levelsio) July 22, 2017The most important part is that we can't manage an organization if we don't collect data.\npic.twitter.com/WFO0f5tPxU — Pieter Levels @ 🇺🇸 (@levelsio) July 22, 2017Most importantMid-thread TL;DR: make a unique high-value high-priced product that's hard to replicate in a market that's hard for competitors to enter — Pieter Levels @ 🇺🇸 (@levelsio) July 20, 2017ConclusionObviously this is just a tiny summary of parts of a real MBA.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/07/Jul-20-2017-21-27-02.gif"}}},{"node":{"id":"5b92489d87be056953db7bc5","title":"Bootstrapping Side Projects into Profitable Startups","source":"levels","summary":"I presented about bootstrapping startups to profit at Dutch startup school Growth Tribe.\nBecause if I can show I can do it, more people can stop attending these events, and just open their laptop and build stuff.\nI decided to do 12 projects in 12 months, and for fun I called it 12 startups in 12 months.\nIf you're building an MVP (a basic first prototype to launch), don't use giant frameworks.\nDon't launch with just an email sign up form (like we'll message you when we really launch).","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/09/2Screenshot-2016-10-16-01.54.47-copy.jpg"}}},{"node":{"id":"5b92489c87be056953db7bc4","title":"If you put the entire world in one city, you get Los Angeles","source":"levels","summary":"Los Angeles County has a city in it called, yes, the City of Los Angeles (depicted in red), which has about 4 million people in it.\nThis means LA is so gigantic, it's ridiculous to even consider it as one city.\nExactly people that don't work normal hours and don't really have a limit to how much they work.\nIt's a total mindfuck as it's roughly 20 by 40 blocks of mostly Korean people, Korean signs, Korean businesses, Korean churches, Korean hospitals, Korean food, Korean coffee shops and Korean cars.\nIt's Mexican people, Mexican food, Mexican cars, Mexican laundromats, Mexican street art, Mexican cafes, Mexican churches and Mexican dentists.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/08/Aug-06-2017-21-53-35.gif"}}},{"node":{"id":"5b92489b87be056953db7bc3","title":"I’m Product Hunt’s Maker of the Year again!","source":"levels","summary":"I've won 2x Product Hunt Awards this year:🏆 Maker of the Year🏆 Side Project of the Year💖 Thank you Product Hunt and everyone for supporting throughout the years!\nThe Product Hunt Golden Kitty Awards are one of the most renowned startup awards in the world, and it’s a giant honor to receive them.\nIn 2014, Product Hunt kickstarted an indie startup revolution that's still on-going.\nThere's never been a better time for makers to build indie startups than today.\nI just wrote a book on bootstrapping indie startups called MAKE.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2018/01/b5291478-8cf3-49dc-b5de-59270cda38ee.gif"}}},{"node":{"id":"5b92489a87be056953db7bc2","title":"Turning side projects into profitable startups","source":"levels","summary":"So I was always trying to find problems and then to solve, and I think that's the way to do.\nIt's all fake growth and paid traffic, and I don't really think it works.\nAnd there's always a free alternative of your app that's worse, but yeah, you're not competing with them.\nOkay, so now we have a list of 10,000 people that might actually wanna pay for it, because they clicked pricing, so they actually wanna maybe pay for it.\nA lot of websites you know and startups, they don't actually make money off their main product.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2018/02/Feb-01-2018-16-07-09.gif"}}},{"node":{"id":"5b92489987be056953db7bc1","title":"Day 30 of Learning 3d 🎮 Cloning objects 👾👾👾","source":"levels","summary":"Today is day 30 of my challenge to learn 3d in a month.\nA day ago, I learnt how to make glass and reflectives.\nFold down doorI also added a fold down door between the restaurant and the wooden front:This was really fun.\nTo make the angled fold down door I thought I'd just duplicate lots of little rotated bars.\nI'd saved lots of time adding little panels everywhere if I knew about it before :)ConclusionThis was a pretty quick short day.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/03/2016-03-03-restaurant-front.jpg"}}},{"node":{"id":"5b92489887be056953db7bc0","title":"Why doesn’t Twitter just asks its users to pay?","source":"levels","summary":"Right now, Twitter doesn't have enough users to make enough money from ads to reflects its valuation of ~$20 bln.\npic.twitter.com/2KdLQ66UAO — Tobias van Schneider (@schneidertobias) October 18, 2015This is interesting, Tobias van Schneider did a survey on who would pay for Twitter.\nWith 300M users, if 33% paid $5/m for Twitter, that'd result in300,000,000 users * 33% = 100,000,000 paying users100,000,000 paying users * $5/m * 12 months = $6,000,000,000/yThat's $6 billion in revenue.\n300,000,000 users * 3% = 10,000,000 paying users10,000,000 paying users * $5/m * 12 months = $600,000,000/yThat's still $600 million in revenue.\n@levelsio @twitter shit, let ppl pay for verification badges & they double their users AND revenue!","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/10/Twitter_wallpaper_pack_by_sebianoti-d5wi6gt.png"}}},{"node":{"id":"5b92489787be056953db7bbf","title":"Day 27 of Learning 3d 🎮 Details, details, DETAILS!","source":"levels","summary":"Today is day 27 of my challenge to learn 3d in a month.\nI want to create a Tokyo street scene in 3d.\nHere's how it looks on the photo:It's hard to see exactly how the bar itself looks though from that angle.\nIt shows that sometimes you don't need to model something but a high res texture (with depth itself) is good enough.\nSo I duplicated my aircon:ConclusionHere's the whole scene now:Every day, I'm getting closer and closer.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/02/2016-02-29-manhole.jpg"}}},{"node":{"id":"5b92489787be056953db7bbe","title":"Why global roaming data solutions don’t make any sense","source":"levels","summary":"Mobile carrier Vodafone has been one of the longest running in offering data roaming worldwide, selling it to customers in most countries they offer service.\nBut it doesn't make any senseLet's see how it looks if we're a company trying to offer a global mobile data roaming service, economically.\nIn the extreme case of South Korea, it's $0.01 per GB, as my receipt for uploading 4TB shows:So what does global roaming cost?\nGlobal roaming services are trying to solve the hassle of 5 minutes of buying and switching a SIM card.\nBut solving that 5 minutes of switching with a global roaming service will mean the cost of mobile data will skyrocket.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/09/Screenshot-2015-09-01-18.38.251.png"}}},{"node":{"id":"5b92489687be056953db7bbd","title":"We are the heroes of our own stories","source":"levels","summary":"In front of me are copies of Herman Melville’s Moby Dick, Tolkien’s The Hobbit, and Homer’s epic poem The Odyssey (the wonderfully condensed Samuel Butler translation, if you’re wondering).\nAll three are hailed as landmark pieces of literature, and all three share a common theme: travel.\nIt resonates with something inside us, a gut feeling that we are the heroes of our own stories.\nBut adventures are few and far between in the real world.\nIn the real world, travel alone suffices.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/12/Odysseus.jpg"}}},{"node":{"id":"5b92489687be056953db7bbc","title":"We did it! Namecheap has introduced 2FA","source":"levels","summary":"Namecheap has introduced true 2FA.\nVia their iOS app domain owners can now approve or deny log in attempts with fingerprint authentication:It's a great start since SMS verification isn't safe anymore.\nYou can enable their new 2FA in your admin dashboard:To standardize it across the industry, a great next step would be to also support Google Authenticator and Authy.\nFor now, 👏 to Namecheap for listening to your users.\nAnd I'm now on Instagram and Twitter too if you'd like to follow more of my adventures.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/07/2namecheap-lock-2.png"}}},{"node":{"id":"5b92489687be056953db7bbb","title":"Now is probably the time to make HTTPS the default on all your sites and apps","source":"levels","summary":"I just spent the last week moving ALL my sites to be HTTPS by default.\nBetter securityWith HTTPS enabled by default, your users are more secure.\n— Peter Eckersley on EFF.orgEven non-interactive sites should think about this, because the URLs people visit on your site without HTTPS are shared publicly.\nLuckily Wikipedia already set HTTPS default 2 years ago.\nWith more sites switching to HTTPS as default in the future, this seems like a good choice.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/05/https2.png"}}},{"node":{"id":"5b92489187be056953db7bba","title":"“I can’t buy happiness anymore. I’ve bought everything that I ever wanted. There’s not really anything I want anymore.”","source":"levels","summary":"You can buy pleasure though.\nFrom the time you're a little kid, you get something, you're happy.\nYou get a boat, you're happy.\nYou can buy the pleasure, but the pleasure is so much shorter lived.\nI said you don't think it's an option because you don't think it's possible for you to ever achieve that level of material possession.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/10/Screenshot-2016-10-14-00.29.47.png"}}},{"node":{"id":"5b92489087be056953db7bb9","title":"Punk died the moment we learnt that the world WAS in fact getting better, not worse","source":"levels","summary":"Punk died the moment we learnt that the world WAS in fact getting better, not worse @MaxCRoser https://t.co/sea5fHMsSE — levels.io (@levelsio) October 17, 2015I like punk rock.\nMy favorite punk song is The Decline by NOFX, it's an 18-minute long epic critique on American society and a tale of its decline.\nBut it applies to most of the world as American culture has been exported everywhere now.\nBecause no matter how weird we are, on the internet there's always at least a thousand like us, somewhere in the world.\nThe world is getting betterIt's a really great time we live in and we should be grateful for it.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/10/p0000001.jpg"}}},{"node":{"id":"5b92489087be056953db7bb8","title":"My first time floating in a sensory deprivation tank ☺️","source":"levels","summary":"The rooms contain a shower and a gated hole in the wall:When you open it, you see, that's the float tank.\nExcept for a line of light around the door/gate of the float tank from the shower room.\nIn the float tank, it felt more manageable.\nAnd my \"YOU NEED TO DO SHIT\"-brain took over and felt it was idiotic that I was in a float tank.\nI also wonder if this thing can help me to get rid of my worries, and tense body more.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/02/3mg-bg-6-d1-705x490.jpg"}}},{"node":{"id":"5b92489087be056953db7bb7","title":"How to 3d scan any object with just your phone’s camera","source":"levels","summary":"If you want to learn how to 📦 3d scan any object with just your phone's 📸 camera: in this thread I will explain how to do that for free 🙃 pic.twitter.com/uiW9EQYMvE — Pieter Levels @ 🇳🇱 (@levelsio) October 21, 2017Something many people don't know is that these days you can 3d scan any object with just your phone camera.\nYou get an .OBJ 3d model:.. a material file .MTL and a texture file as a .JPG that's simply a raw image of the textures it projects on your 3d object.\nIt's a 3d model sharing community where anyone can upload, download and share 3d objects, not just 3d scans.\n3d printingAny .OBJ file you can send to a 3d printer company and they can help you convert it into a 3d object to print.\nIn those cases it's still better to use a real 3d scanner like Matterport, that I bought to 3d scan my parents house.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/10/Screen-Shot-2017-10-22-at-2.12.59-AM.png"}}},{"node":{"id":"5b92488f87be056953db7bb6","title":"Using Uptime Robot to build unit tests for the web","source":"levels","summary":"I can't count the amount of times people have told me to add unit tests to my code.\nWikipedia describes unit tests as:In computer programming, unit testing is a software testing method by which individual units of source code, sets of one or more computer program modules together with associated control data, usage procedures, and operating procedures, are tested to determine whether they are fit for use.\nI tried all these unit testing suites, and like always, it's all just too complicated and convoluted for me.\nI was already using an app called Uptime Robot which pings my servers every few minutes to check if they're up.\nThe cool thing about Uptime Robot is that it has a wide array of alert outputs.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/05/IMG_3874.gif"}}},{"node":{"id":"5b92488c87be056953db7bb5","title":"Day 4 of Learning 3d: @shoinwolfe visits the actual street I’m modeling 🏮😎🏮","source":"levels","summary":"Today is day 4 of my challenge of learning 3d.\nToday @shoinwolfe from Tokyo tweeted me that he was going to visit the street in Tokyo that I'm modeling to start learning 3d.\nThat would be pretty helpful to get more reference material to see where objects are in the street.\nI was able to locate the place where the photo was made simply by Googling for Bar 254 in Tokyo.\nAnd I'm now on Instagram and Twitter too if you'd like to follow more of my adventures.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/02/Screenshot-2016-02-23-18.08.03.jpg"}}},{"node":{"id":"5b92488b87be056953db7bb4","title":"Robots make mistakes too: How to log your server with push notifications straight to your phone","source":"levels","summary":"If we do it well, we can actually enjoy our lives and let the robots do all the work in the background.\nPushoverPushover lets you send push messages from inside your apps, shell or scripts to your iPhone, Android or any web device.\nThis means opening this URL:https://api.pushover.net/1/messages.json...with this POST data:token=wMpQqm7iYCKGvhoTu4YjaPKDn21ZfEmessage=Hello WorldBecomes a push message on ALL my devices saying \"Hello World\".\n'/tailLogToPushover.md5');// don't update, if log hasn't changed since last pushif($hash==md5($result)) exit;$lines=explode(\"\",$result);foreach($lines as $line) {shell_exec('curl -s --form-string \"token=aS8whNNHSXS4niSJ\" --form-string \"user=udjCGMmQ5qCzW\" --form-string \"message='.\nThese push notices work BETTER than PayPal and Stripe's own actually, that sometimes somehow don't even show up.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/10/2Untitled-2.png"}}},{"node":{"id":"5b92488b87be056953db7bb3","title":"Taipei is boring, and maybe that’s not such a bad thing","source":"levels","summary":"I stayed in the city and tourist center (around Taipei Main Station):More pics of Taipei, as requested by @marckohlbrugge ^___0 pic.twitter.com/ZtWGcQ9SL1 — Pieter Levels @ (@levelsio) August 28, 2014Terrible decision.\nTaipei Lunch 8x Xiaolongbao (or Chinese soup dumplings) $4.96 (150TWD) pic.twitter.com/wT12oX46T0 — Pieter Levels @ (@levelsio) April 24, 2017There's Xiaolongbao (literally: bamboo steamed buns).\nTaipei dinner Mixed pork and vegetable wonton soup w/ noodles $2.47 (75TWD) pic.twitter.com/9xmcbyNVpi — Pieter Levels @ (@levelsio) April 13, 2017Then there's Wonton.\nRenting a public bike in Taipei with Hello Kitty pic.twitter.com/dZcSSl8jZJ — Pieter Levels @ (@levelsio) February 17, 2017Or access my coworking space.\nhttps://t.co/YmxVtNBS4F — Pieter Levels @ 🇯🇵 (@levelsio) May 3, 2017(Timelapse by Cédric Charlesia, thanks @x3nome and @olimuchacha for fact-checking this post)P.S.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/05/May-03-2017-16-40-11.gif"}}},{"node":{"id":"5b92488a87be056953db7bb2","title":"Fixing “Inf and NaN cannot be JSON encoded” in PHP the easy way","source":"levels","summary":"I got this pesky problem this week where PHP doesn't like to json_encode erroneous infinite (Inf) and not available (NaN) values.\nThis is incredibly stupid because with PHP's serialize() function NaN and Inf encode fine.\n> echo json_encode($array);\"\"> echo json_last_error_msg();Inf and NaN cannot be JSON encodedPHP's json_encode() function actually returns blank if it gets an error.\nI gave up fixing the source of the data problem as it took too much time with 100,000 values.\nSo I came up with this smart but dirty trick:json_encode(unserialize(str_replace(array('NAN;','INF;'),'0;',serialize($reply))));We literally just str_replace NAN and INF with 0 and the data encodes to JSON successfully.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/07/silver-infinity-symbol_shutterstock_64474066.jpg"}}},{"node":{"id":"5b92488987be056953db7bb1","title":"Just. Breathe.","source":"levels","summary":"Two years ago, I was in Bali and I met one of the most inspiring people in my life: Lowen.\nFor example, on psychedelic mushrooms I learnt how to separate all my good thoughts and bad thoughts and put the bad thoughts in a big giant soap bubble and push the bubble away.\nAnd if you took too much, this bad trip is going to take a long time.\nHe kept slowly coming out and then he was sucked back into this bad trip.\nTelling yourself to just breathe works because that's really all you need to do in life (to some extent of course).","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2017/04/Q4s9y2z.jpg"}}},{"node":{"id":"5b92488887be056953db7bb0","title":"I uploaded 4 terabyte over Korea’s 4G, and paid $48","source":"levels","summary":"Getting a 4G SIMAs any traveler, I arrived in the airport and tried to find a SIM card.\nThey made a copy of my credit card, which gave me some anxiety but there was no other way.\nWiFi okay, 4G awesomeWe moved in to the house, it was this cute old Korean house:And I tried the WiFi.\nDivide that number by 8 (mbps is bit, mb is byte) It means you can transfer 5 megabytes per second.\nI then connected my HHDs, yes that's a rice cooker on the right.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/05/seoul-282441.jpg"}}},{"node":{"id":"5b92488787be056953db7baf","title":"How to use your iPhone as a better Apple TV alternative (with VPN)","source":"levels","summary":"Instead of paying $150 getting Apple TV to watch Netflix on your TV, there's a cheaper and better way.\nNow here's the BEST part and why it's superior to Apple TV.\nApple TV doesn't support VPN services.\nMost streaming services that have apps for Apple TV (like Amazon Prime), have apps for iPhone too.\nMost apps on Apple TV in general are also available for iPhone:Admittedly the controls on iPhone might be slightly inferior, but then again you can hold your iPhone in your hand.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/01/Untitled-1.png"}}},{"node":{"id":"5b92488787be056953db7bae","title":"“There will be 1 billion digital nomads by 2035”","source":"levels","summary":"I did a presentation on the future of digital nomads (and remote workers) in the next 20 years.\nThe future of digital nomads.\nThere's a lot of overlap with digital nomads here.\nAnd if you can calculate fast, you know that's 1 billion digital nomads.\nYou need to do it, because we have this unique position as digital nomads.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2015/10/110.jpg"}}},{"node":{"id":"5b92488787be056953db7bad","title":"Day 29 of Learning 3d 🎮 Glass, reflectives, HD, coloring and more details","source":"levels","summary":"Today is day 29 of my challenge to learn 3d in a month.\nTwo days ago, I added lots of small details like manholes and found more reference material to use.\nThe blur it creates is more of a dusty mess (but pretty) though:Making other materials reflectiveInspired how I now could make glass.\nBecause the street started turning green with orange and blue lit on it, so I made it a bit more neutral.\nAt the end of the street is a big blue light though which is panned slightly to the left.","info":{"author":"","top_img":"https://levels.io/wp-content/uploads/2016/03/2016-03-01-no-grade7.jpg"}}}]}},"pageContext":{"source":"levels","alias":"work","label":"工作技能"}}