{"data":{"mongodbDatabaseArticles":{"id":"5b9629c187be0583274911b1","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to&#160;New Forest</h1><p class=\"p4\"><b><i>Tell us a little about yourself and tell us why you&#8217;re an expert on luxury travel in the New Forest.</i></b></p><p class=\"p1\">I have been based in the area since my university days and couldn&#8217;t bring myself to leave!&#160; My husband previously worked in the travel industry, based nearby and so my tastes developed rapidly, they became quite expensive he might say&#8230; The New Forest dates back to the days of William the Conqueror over 1000 years ago who wanted to protect the area.&#160; Thank goodness he did &#8211; it is a massive area of unenclosed grazing and heathland in between Southampton and Bournemouth.&#160; </p><p class=\"p1\">Even today it is a protected area and become a National Park in 2005. We&#8217;ve been lucky enough to enjoy many of the luxury hotels in the area, we also love the outdoors too and have spent many weekends exploring and evenings or long lunches in restaurants and bars.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13221\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/new-forest-trees.jpg?resize=560%2C374&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"560\" height=\"374\"></p><p class=\"p1\"><b><i>What makes the New Forest a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p1\">There is no shortage of places to stay, dine and visit &#8211; being so close to London (approx. 90 minutes) the area caters for the discerning city slicker as well as visitors from overseas or those looking for a relaxing break in the country with some outdoor exploring.&#160; Whether you are looking for luxurious privacy, a boutique retreat or some water or land-based adventure &#8211; it&#8217;s easy to find here.&#160; With such a good choice of luxury hotels there is of course a plethora of fantastic restaurants to enjoy too.&#160; I may be biased but the area gives the best of both worlds &#8211; close enough to London, but in easy distance of the sea and the great outdoors.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13217\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/Hurst-castle.jpg?resize=560%2C374&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"560\" height=\"374\"></p><p class=\"p1\"><b><i>What 5 star hotel is the best in&#160;New Forest?</i></b></p><p class=\"p1\">The<strong> Chewton Glen </strong>wins hands down (<a href=\"http://www.travelwithpenelopeandparker.com/2014/06/21/a-great-dame-the-chewton-glen/\" target=\"_blank\" rel=\"noopener\">review here</a>) &#8211; the UKs grand dame.&#160; The hotel is elegant, timeless and quintessentially British, but it is also moving with the times.&#160; Sweeping up the long drive you will appreciate how large the grounds are.&#160; If you look carefully through the trees you may even spot some of the exquisite and private tree houses which are a relatively new and luxurious addition to the hotel &#8211; hot tub on the deck, wood burning stoves, breakfast delivered through a hatch door for complete privacy.&#160; The suites and rooms in the main house are no less luxurious and are sumptuously decorated.&#160;Click<a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/http://www.hotelscombined.com/Hotel/Chewton_Glen_Hotel_New_Milton.htm\"> here</a> for rates and availability.&#160;</p><p class=\"p1\">Many have terraces or open up onto the lawns.&#160; The grounds here are gorgeous with plenty of places to relax and it is just a short walk down the valley to the beach.&#160; There are indoor and outdoor pools as well as a fantastic spa and hydrotherapy pool.&#160; Dining here, as you might expect, is fantastic &#8211; it is a relatively formal set-up but this suits the character of the grand house.&#160; There is also an oak paneled set of rooms that house the bar which are so welcoming and warm in the winter for pre-dinner or after-dinner drinks.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13215\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/chewton-glen.jpg?resize=560%2C374&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"560\" height=\"374\"></p><p class=\"p1\"><b><i>What about boutique hotels in New Forest, of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p1\"><strong>Hotel TerraVina</strong> is where I would send a friend to stay.&#160; It is a short drive from Ashurst Station which is on the mainline train route from London, just on the edge of the New Forest.&#160; With only 11 rooms the hotel has a real feel of staying at a country house &#8211; albeit a modern one with everything a guest could wish for including an outdoor pool, terraces attached to many rooms and stylish d&#233;cor unique to the property.&#160;Click <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/http://www.hotelscombined.com/Hotel/Hotel_Terravina_Southampton.htm\">here</a> for rates and availability.&#160;</p><p class=\"p1\">The owners, Gerard and Nina Bassett, used to own Hotel du Vin but took this on as a new and personal challenge.&#160; As you might expect from the former &#8216;world&#8217;s best sommelier&#8217; the wine list is extraordinary and varied and having dined here on many occasions the menu is always interesting, varied, local and the chef team seem to revel in being challenged by food allergies (nowhere else have I been offered a choice of 3 different dairy-free desserts that could be made to order). </p><p class=\"p1\"><b><i>Are there any fun activities for the adventurous traveler&#160;in New Forest?</i></b></p><p class=\"p1\">The area spoils us with so many miles of coastline and forest to enjoy.&#160; Cycling or horse-riding in the New Forest is a perfect day out in the summer, with plenty of choice of country pubs for a hearty lunch to boost energy.&#160; It is easy to hire bikes or arrange a hack &#8211; with so much choice, each hotel will have their own recommendations.&#160; </p><p class=\"p1\">Through the summer there are regular Polo events at the New Park grounds near Brockenhurst.&#160; Our personal favourite pastime though is to head out onto the water. We always pick Lymington Yacht Charters for a boat as they have some elegant and comfortable boats for charter and you can enjoy the Solent and perhaps visit Yarmouth or Cowes.&#160; Alternatively you could take a trip on a speedboat and see the Solent at pace!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13220\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/new-forest-pony.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Where are the best hang outs during the day in New Forest?</i></b></p><p class=\"p1\">For beaches then there are a couple of choices if you know where to find them &#8211; we normally head to these in the winter for a walk but they will be equally lovely in the summer.&#160; Lepe Beach and Country Park has a fascinating naval history as this is where the troops practiced for D-Day walking west from the car parks takes you to a quieter area at the entrance to the Beaulieu River and the beach is stunning and peaceful.&#160; </p><p class=\"p1\">Hurst Castle Spit is another spot with plenty of history to it as well &#8211; it&#8217;s a good walk out to the castle along the shingle spit, or&#160; a stroll along the sea wall around to Lymington.&#160; After a bracing walk there is nothing better than a good lunch and the area is blessed with gastro pubs &#8211; The East End Arms, The Master Builders and Monty&#8217;s Inn will all look after you superbly (we particularly enjoy the riverside walk between 2nd and 3rd of these pubs).</p><p class=\"p1\">On a summers day it is always possible to find a quiet corner in the forest for a picnic and games.&#160; There are hundreds of free car parks dotted across the park and plenty of well made footpaths to follow.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13222\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/new-forest.jpg?resize=560%2C560&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"560\" height=\"560\"></p><p class=\"p1\"><b><i>If you have a big date night, what are the most delicious restaurants in New Forest&#160;and what are their best dishes?</i></b></p><p class=\"p1\">I really enjoy going to eat at Hartnett Holder &amp; Co which is part of the Limewood Hotel and offers relaxed dining based in one of the most stylish hotels in the area &#8211; there is nothing stuffy or pretentious whatsoever about eating here.&#160; A fantastic menu &#8211; full of sharing options and homely dishes.&#160; The seating is some of the most comfortable I have found in a restaurant. &#160; There is also a lovely bar, and also a spa &#8211; it is marvelous to spend an afternoon being pampered before supper!</p><p class=\"p1\">Another option would be to eat at The Thatched Cottage in Brockenhurst.&#160; This is a quaint little rickety place with quirky furniture and all set out in a little cottage.&#160; There is however nothing rickety about the food and wine list, we have always been very impressed when we have visited. It is perfect for a winter supper &#8211; roaring fire, romantic lighting &#8211; it&#8217;s a very special place.</p><p class=\"p1\">Somewhere always getting rave reviews is The Pig in Lyndhurst.&#160; Personally I haven&#8217;t had a good experience there, but I will give it another try someday soon &#8211; in the summer there is courtyard relaxed dining and all year round a more formal restaurant too which is very proud of knowing the provenance of all its food and sourcing as much from the local area as possible.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13223\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/sunset-1.jpg?resize=420%2C560&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"420\" height=\"560\"></p><p class=\"p1\"><b><i>Tell us all the hot shopping spots in New Forest and who&#8217;s carrying the trendy local designers?&#160;</i></b></p><p class=\"p1\">I wouldn&#8217;t say we have designer hotspots but there is plenty of choice for a spot of shopping.&#160; For an enjoyable day out with a selection of shops beyond the normal high street then head to Winchester or Lymington &#8211; these are definitely the most pleasant places for some retail therapy and you will be spoilt for choice with coffee shops and lunch venues too.&#160; Beaulieu has some lovely little gift shops and it&#8217;s one of the places we always pop to in the run up to Christmas.</p><p class=\"p1\"><b><i>Time for a great sunset view in New Forest&#8230; where would you go?</i></b></p><p class=\"p1\">Hurst Castle and Lepe Beach are superb locations as they both have a great aspect for enjoying the sunset, perhaps with a sundowner-picnic.&#160; I just love the reflected sunlight across the water.&#160; Sunsets out at sea can be spectacular if you get the chance to take a charter from somewhere like Lymington.&#160; There are some high points in the forest that give you a real &#8216;big sky&#8217; view of sunset, if ever we are driving across the forest at the right time we&#8217;ll pull in to the nearest car park and enjoy sunset in the wilderness!&#160; For sunset with a sundowner &#8211; then my two recommendations would be either The Marine in Milford on Sea or The Haven in Lymington Yacht Haven.&#160; Both of these have roof terraces and are a perfect place to make the most of the final hours of sunshine.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13218\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/lepe-beach.jpg?resize=560%2C208&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"560\" height=\"208\"></p><p class=\"p1\"><br> <img class=\"alignleft wp-image-13216 size-thumbnail\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/gravatar.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury Guide to New Forest\" width=\"150\" height=\"150\">Always in search of luxury and unique retreats with vitamin sea, Anna loves to travel in style with her&#160;husband and started her blog,&#160;<a href=\"http://www.travelwithpenelopeandparker.com/\">Penelope and Parker&#8217;s travel</a>s, to keep note of where she&#8217;s been, the memories, the stories and plenty of recommendations. If Anna can build into a holiday some cycling, sailing or walking and perhaps a spot of wine-tasting, all off the beaten track, then that&#8217;s a perfect trip.&#160; Especially if it is set somewhere gorgeous where she&#160; can enjoy a glass of champagne with a view! Connect on <a href=\"http://twitter.com/aeparker81\" target=\"_blank\" rel=\"noopener\">Twitter</a>, <a href=\"http://www.facebook.com/Penelopeandparker/\" target=\"_blank\" rel=\"noopener\">Facebook</a>, and <a href=\"http://www.instagram.com/annaeparker/\" target=\"_blank\" rel=\"noopener\">Instagram</a>.</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide To Isle Of Wight- Hippie in Heels"}},"pageContext":{"id":"5b9629c187be0583274911b1"}}