{"data":{"mongodbDatabaseArticles":{"id":"5b962a1b87be0583274911ce","content":"<div><p class=\"p1\">Not everyone feels called to travel to India, but those who do feel it strongly and tend to have a huge desire to explore India. Traveling to India can be incredibly life-changing (<a href=\"https://hippie-inheels.com/backpacking-love-stories/\">I know it was for me</a>) but it doesn&#8217;t come without its struggles. While there are travelers who feel called to India, there are others who feel it&#8217;s too difficult to travel; it&#8217;s true &#8211; India travel <a href=\"https://hippie-inheels.com/is-traveling-to-india-dangerous/\">can be intense</a>. I first traveled to India five years ago, and have been living here for four and a half.&#160; I am going to just sum up everything from start to finish in this travel to India guide to just simplify it all for you.</p><h1 class=\"p1\"><p class=\"s1\"><b>Step by Step Guide: Travel To India Made Easy</b></p></h1><p><img class=\"aligncenter size-full wp-image-11846\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2015/10/DSC_9460x.jpg?resize=560%2C353&amp;ssl=1\" alt=\"munnar\" width=\"560\" height=\"353\"></p><p class=\"p1\">If you took the time to read my <a href=\"https://hippie-inheels.com/asia/india-asia/\">400+ posts about India</a>, you&#8217;ll find a lot of information, but I wanted one big whopper of an article that just tells you how to start planning your India trip from scratch. </p><p class=\"p1\">I&#8217;m going to break this article down into the following sections. <i>&#160;I&#8217;ll often link back to articles where I have written more in depth on the subjects below. </i></p><blockquote><ol><li class=\"p1\"><p class=\"s1\">Before You Come</p><ol><li class=\"p1\">When to Come</li><li class=\"p1\">How Long to Stay</li><li class=\"p1\">Flight</li><li class=\"p1\">Visa</li><li class=\"p1\">Health &amp; Wellness</li><li class=\"p1\">Safety &amp; Culture</li><li class=\"p1\">Packing</li><li class=\"p1\">Currency &amp; Budget</li></ol></li><li>What Lodging is Like</li><li>What Food is Like</li><li>Transportation<ol><li>Trains</li><li>Buses</li><li>Taxis and Rickshaws</li></ol></li><li>Itinerary Considerations<ol><li>Top Towns Tourists Love</li><li>Sample Itinerary for 10 Weeks</li><li>Tours I Recommend</li></ol></li><li>Experiences to Try<ol><li>Yoga Retreats and Yoga Teacher Training</li></ol></li><li>How to Meet People</li><li>Shopping<ol><li>What to Buy in Which Areas</li><li>How to Negotiate</li></ol></li><li>Traveling With Kids</li><li>Volunteering Considerations</li><li>Additional Reading</li></ol></blockquote><h2 class=\"p1\"><p><p class=\"s1\"><b>1. Travel to India: Planning for Your Trip to India, What to know before you come to India</b></p></p></h2><h3 class=\"p1\"><p class=\"s1\"><b>1.1) When to Come to India</b></p></h3><p class=\"p1\"><a href=\"https://hippie-inheels.com/when-to-travel-to-india-everything-you-need/\">When to come to India</a> should be your first consideration before you start planning. Peak season in India is October to March. For MOST, peak season is going to be when you want to come. Although there are more tourists at this time, India is a crowded country in general and it&#8217;s going to feel crowded no matter when you come. </p><p class=\"p1\">In the off-season the weather is not as nice (it gets very hot in May then June brings the monsoon), and in areas where the monsoon hits hard like Goa and Kerala, pretty much everything is shut from restaurants to hostels. Another downside of traveling off-season is that there will be fewer tourists to meet along the way which could be potential travel buddies. </p><p class=\"p1\">There are some places you should avoid in the most &#8220;peak&#8221; times of peak season, which are around Christmas and New Year, and that would be Goa (partiers come in droves) and Agra (people using time off work to see the Taj Mahal). </p><p class=\"p1\">If you can only come in the off-season, don&#8217;t fret. A fantastic place to go in the off-season is the mountains, like Manali, Rishikesh, McLeod Ganj, and Leh where the monsoon doesn&#8217;t hit and the weather is fantastic! In fact, during peak season you can&#8217;t really visit those places at all as they close the roads due to snow. I stay in Goa in the monsoon, and you can read more about what it&#8217;s like <a href=\"https://hippie-inheels.com/come-to-goa-in-monsoon/\">here</a>.</p><p class=\"p1\">If you want to see the mountains and still come in peak season then plan to see the mountains at the end or beginning of the season (October or March).</p><h3 class=\"p1\"><p class=\"s1\"><b>1. 2) How Long to Stay in India</b></p></h3><p class=\"p1\">Most people who come on tourists visas get the six-month visa. You can get longer than that but you will have to exit and come back in as you cannot stay in India longer than 180 days on any type of visa no matter how long it is. </p><p class=\"p1\">Six months is ideal for a<a href=\"https://hippie-inheels.com/backpacking-india-alone/\"> backpacking trip in India</a><b> </b>although it could be hard to get that much time away, and if you need to condense it (but want to see a lot) you really do need at least 10-12 weeks. </p><p class=\"p1\">Later on, in the itinerary section, you&#8217;ll see more about what there is to see and do so you can plan your itinerary and see how many days will work best. </p><p class=\"p1\">India has a lot from the Himalayas to the Thar desert, and the beaches of Goa to the busy cities of Calcutta, you have tribals in permit zones of Northeast India and jungles hidden in the dense jungles. It&#8217;s taken me years to see so much of India, so you have to make some tough choices!</p><p class=\"p1\">If you have less time, it&#8217;s cool &#8211; still come! My parents came just for two weeks and we toured Mumbai, Goa, and Hampi. It was great and they still talk about how cool the trip was. You can visit about 3 places in two weeks. If it&#8217;s your first time to India and you have 1-2 weeks, consider a &#8220;Golden Triangle Tour&#8221; which I&#8217;ll talk about later.</p><h3 class=\"p1\"><p class=\"s1\"><b>1.3) Flights</b></p></h3><p class=\"p1\">Flights are the first thing you might want to start looking into once you when you want to come and how long you want to stay. You&#8217;ll likely fly into Mumbai or Delhi as that is where many good priced international flights come in from. Then you can start your trip from there or interconnect to where you&#8217;d like to start. </p><p class=\"p1\">India&#8217;s airports have been revamped and it&#8217;s quite modern, but you do need to have an idea what to expect when you arrive. On your first day arriving, it&#8217;s best to have a hotel booked and ask them to send a driver. It&#8217;s worth it to avoid the culture shock and chaos. But, if you are up for it, it&#8217;s also easy to get a <a href=\"https://hippie-inheels.com/prepaid-taxi-in-india/\">pre-paid Government taxi</a>, or if it&#8217;s a city with Uber, that&#8217;s a <a href=\"https://hippie-inheels.com/uber-in-india/\">great choice</a>. Make sure you have the exact address of where you are staying, not just for the taxi driver but for immigration.</p><p class=\"p1\">When it comes to booking flights, I use <a href=\"http://kiwi.com/deep?affilid=hippieinheels\"><b>kiwi.com</b></a> and wrote a review about why I always get the best deals from them, which you can <a href=\"https://hippie-inheels.com/kiwi-book-cheap-flights/\">read here</a>. I also wrote about how you can fly around India for just $200 with Kiwi&#8217;s anywhere tool, which you can <a href=\"https://hippie-inheels.com/can-use-kiwis-multicity-tool-fly-around-india-200/\">read here</a>. </p><p class=\"p1\">If you want to fly domestically in India, I have a list of good airlines <a href=\"https://hippie-inheels.com/guide-to-budget-airlines-in-india-for-domestic-flights/\">here</a>. </p><h3 class=\"p1\"><p class=\"s1\"><b>1.4) Visa</b></p></h3><p class=\"p1\">You have to have one! There are a few ways to get one and I have massively detailed posts on my blog about it, which I&#8217;ll link to below.</p><p class=\"p1\">If you are coming for less than 60 days, you need an E-VISA only. It&#8217;s very easy. It is often accidentally called a &#8220;Visa on Arrival&#8221; but it is actually an e-visa and you DO need to get it online at least four days ahead of time. You can do it on the government site or on <a href=\"https://www.ivisa.com/india-visa-application?utm_source=hippie_inheels\">iVisa for an easier option</a>. You can read full details on the e-visa <a href=\"https://hippie-inheels.com/how-to-get-a-business-e-visa-medical-e-visa/\">here</a>.</p><p class=\"p1\">If you are coming for longer than 60 days you need to do the full visa application online which can be a little time-consuming and you either need to mail in your passport with the application or you can go to an embassy. </p><p class=\"p1\">I wrote two full step by step guides with screenshots that show you how to get this tedious visa paperwork finished without making mistakes (if there is a mistake you have to do it all over again). I did the two guides one each for the USA and UK (well, Ben did the UK one).</p><h3 class=\"p1\"><p class=\"s1\"><b>1.6) Health &amp; Wellness</b></p></h3><p class=\"p1\">People always worry about the Delhi Belly, which to be fair, is a legit concern. It definitely has happened to me more than once. I wrote an article with tips for avoiding Delhi Belly, which I won&#8217;t re-type, so you can read it <a href=\"https://hippie-inheels.com/ask-me-anything-how-do-you-avoid-delhi-belly/\">here</a>. </p><p class=\"p1\">You&#8217;ll also want to consider vaccinations, which I&#8217;ve also covered in a guide <a href=\"https://hippie-inheels.com/vaccinations-for-travel/\">here</a>.</p><p class=\"p1\">India&#8217;s medication is inexpensive, but the hospitals are not and something like a UTI turning into a kidney infection will easily run you $2-3,000 so you MUST get travel insurance before you come. It&#8217;s so cheap and will give you a huge piece of mind. I spent time in the hospital twice my first trip to India, once with Dengue Fever and once with severe food poisoning. I only use World Nomads when I travel and it&#8217;s the only travel insurance <a href=\"https://hippie-inheels.com/should-i-get-travel-health-insurance/\">I&#8217;ve ever recommended</a> (it&#8217;s what Lonely Planet recommend to. Add getting travel insurance to your to do list, right up there with visas. You can check a quote in the box below and you can read <a href=\"https://hippie-inheels.com/what-is-covered-on-world-nomads-travel-insurance-and-what-is-not-covered/\">this article</a> about what is and is not covered with World Nomads.</p><p>Get a quote here:</p><p></p><p id=\"wn-insurance-quote-editor\"></p><p class=\"p1\">You can bring a <a href=\"https://hippie-inheels.com/travel-first-aid-kit/\">little medical kit</a> with you, but you don&#8217;t really need to as pretty much everything is accessible here that you&#8217;d throw in (and cheaper) like Imodium (which I don&#8217;t recommend anyway), band-aids, cortisone cream, Neosporin, and such. The one thing you might have a hard time finding in some towns in birth control pills, so do stock up on those before you come. </p><p class=\"p1\">Let&#8217;s just talk a bit about the toilet situation: it&#8217;s usually okay &#8211; but there are times when it&#8217;s just a hole and a bucket there. Indians, in this case, would use their left hand to wash themselves then wash their hands. You will encounter this, in fact, most guesthouses I stayed in had this setup. You can just simply carry toilet paper or wet wipes with you and use that instead of your hand. If you&#8217;re lucky, there will be a sprayer (aka bum gun) instead of a bucket (in nice places, hotels, restaurants, airports) and that will become your new bestie! It&#8217;s much cleaner than TP and I hate traveling to places now that don&#8217;t have one.</p><h3 class=\"p1\"><p class=\"s1\"><b>1.7) Safety &amp; Culture</b></p></h3><p class=\"p1\">I know a big concern for women traveling here is safety. I won&#8217;t say that it&#8217;s not a real concern; it is. There is an inequality in India toward women to a big extent and while there have been cases of attacks/rapes of foreigners, this is small compared to what local women deal with all the time here. I could go on and on about this, but I have dozens of times on my blog, so instead, I&#8217;m going to link to articles you should definitely read:</p><p class=\"p1\">I really think those posts will give you an idea. I also think that you should check out my series <a href=\"https://hippie-inheels.com/expat/this-is-india/\">This is India</a><i> </i>all the way back from the <a href=\"https://hippie-inheels.com/this-is-india-one/\">first one</a>. This is a series that I write most Fridays where I share stories about life in India and if you check these out you&#8217;ll get a much deeper understanding of the culture on so many levels! The stories range from funny to sad and even ones that will anger or scare you.</p><p class=\"p1\">Indian culture is confusing and exciting all at the same time and it&#8217;s the culture than makes India so interesting to visit. If you try to shelter yourself from it, you&#8217;re missing out. Most people have a real <a href=\"https://hippie-inheels.com/love-hate-relationship-with-india/\">love/hate relationship with India</a> but the more you accept India&#8217;s ways the more you&#8217;ll end up loving it. </p><h3 class=\"p1\"><p class=\"s1\"><b>1.8) Packing</b></p></h3><p class=\"p1\">Packing for India is not as hard as you might think. I always tell people &#8220;it&#8217;s India, not the moon!&#8221; but there are some things that you really DO need for India that will help your trip. </p><p class=\"p1\">If you are on a low budget and want to travel by lowest class sleeper trains (what I did) you need to have a <a href=\"https://www.amazon.com/Cocoon-MummyLiner-Natural-95-Inch-22-Inch/dp/B001DX5O6I?tag=Hipinhee-20\">mummy liner</a>&#160;and a <a href=\"https://www.amazon.com/Therm-a-Rest-Compressible-Pillow-Denim-Medium/dp/B002PWFSEO?tag=Hipinhee-20\">travel pillow</a>. Thes ones linked there are the ones I have used for years. You&#8217;ll also want a <a href=\"https://www.amazon.co.uk/s/?field-keywords=Master%20Lock%208143D%20Self%20Coiling%20Cable%20Lock%2C%204-Feet%20x%205%2F16-inch%2C%20Black&amp;tag=hippieinheels-21\">4-foot chain</a> to hook your bag to the bottom of the train beds so no one steals it. People get on and off all night long and theft is common. Another thing that helped me immensely was traveling with a <a href=\"https://www.amazon.com/Petzl-E91HNE-TIKKINA-Headlamp-Black/dp/B00UAJ2CXO?tag=Hipinhee-20\">headlamp</a>. Power outages are common so it&#8217;s good when you have to get up at night and use the bathroom or when you are on sleeper buses. </p><p>You&#8217;ll also need to think about a cell phone for India. You will need an &#8220;unlocked&#8221; phone to insert an India SIM (which are <a href=\"https://hippie-inheels.com/sim-card-in-india/\">quite the process</a> to get). If you want the easier way and don&#8217;t have an unlocked phone, check out <a href=\"http://www.trabug.com/?utm_source=hippieinheels&amp;utm_medium=affiliate&amp;utm_campaign=travelphone&amp;pref=0b72106e-1f92-4170-9163-363bc09261f7\">Trabug</a> which sends you a phone to use to your hotel the first night you arrive. All the information (for both options) is in the blog post above.</p><p class=\"p1\">I have written previously the ultimate packing list for India, which I suggest you check out for all the details on the type of shoes I use to the backpack I prefer.<a href=\"https://hippie-inheels.com/backpacking-through-india-packing-list/\"> Click here to read it</a>.</p><h3 class=\"p1\"><p class=\"s1\"><b>1.9) Currency &amp; Budget</b></p></h3><p class=\"p1\">It&#8217;s possible to budget 1200 Rs per day (around $20). You can try for 800-1000 but you will be seriously struggling to keep that budget &#8211; I&#8217;m talking hitchhiking, worst guesthouses, and dal with rice every meal. </p><p class=\"p1\">These two articles will tell you everything you need to know about budgeting and currency in India:</p><h2 class=\"p1\"><p><p class=\"s1\"><b>2. Lodging in India</b></p></p></h2><p class=\"p1\">India is seriously evolving for tourists in the past 3 years, now that hostels are starting to pop up more and more. While hostels are the best way to make fellow travels, they are not always the cheapest or &#8220;most unique&#8221; option. One great thing about backpacking in India compared to Europe is that you can stay in &#8220;guesthouses&#8221; which are one double bed with a private bath for very cheap (like 500 Rs per night in many places). A hostel is usually 500-1000 Rs per night and that&#8217;s for a shared dorm with way less charm than cute guesthouses!</p><p class=\"p1\">But you&#8217;ll find it all: hostels, guesthouses, boutique hotels, heritage houses, Airbnb, 2,3,4 star hotels, and over the top amazing 5 star hotels that literally trump the hotels elsewhere in the world.</p><p class=\"p1\">Hostels in India are on the rise and try to replicate the way they are in Europe but it&#8217;s not <i>quite</i> there yet. Guesthouses are often very basic. If you wait until the itinerary part, I link to each town I stayed and link to the inexpensive guesthouses I stayed at.</p><p><img class=\"aligncenter wp-image-9692 size-full\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2015/04/zostel-uadipur.jpg?resize=560%2C374&amp;ssl=1\" alt=\"travel to india\" width=\"560\" height=\"374\">a hostel in India</p><p class=\"p1\">If you&#8217;re interested in hostels, the best prices are <a href=\"https://www.agoda.com/?tag=US_254603&amp;CID=1497421\">usually on Agoda</a> and you can look for brands like Zostel and Stops which are nice chain hostels. It is best t book ahead at least a week or so, although I don&#8217;t recommend booking your whole trip at once as in India things change and your plans could get all mixed around by just a train cancellation. </p><p class=\"p1\"><b>3. Food in India</b></p><p class=\"p1\">Yes, it&#8217;s true that Indians do eat with their right (clean) hand. It is part of their culture and one that you will probably enjoy adapting to. Most tourists places will have silverware so you don&#8217;t have to if you don&#8217;t want to. PLEASE keep in mind that if you get sick, it could be because India is dirty and you haven&#8217;t washed your hands; <i>try not to blame establishments as you really don&#8217;t know what could have been the cause.</i></p><p class=\"p1\">Food in the North of India is totally different from that in the South! While you travel, you&#8217;ll notice differences in the dal, curries, bread, and even flavors of rice. The North has rich, creamy, buttery curries that they eat with roti or naan. Tandoori is very big in North India. The North is quite vegetarian in areas though, and even have places that are strictly veg (you can&#8217;t even have an egg, like Pushkar). The South has more coconut milk based curries, they tend to be lighter and maybe healthier. I wrote about some of my favorite South Indian foods <a href=\"https://hippie-inheels.com/guide-south-indian-food-fresher-healthier/\">here</a>.</p><p><img class=\"aligncenter wp-image-8387 size-full\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/temple-food1.jpg?resize=560%2C397&amp;ssl=1\" alt=\"travel to india\" width=\"560\" height=\"397\">a typical meal in rural India, eating with your right hand</p><p class=\"p1\">You&#8217;ll find American, English, and general European food on menus at restaurants that cater to tourists, but unless it&#8217;s a fancy restaurant, run by foreigners, or a place like Goa, it&#8217;ll likely be far from what you&#8217;re expecting (think a pizza with ketchup as the sauce and yak cheese on top). It&#8217;s best to stick to Indian food for the reasons that they know how to make it so it&#8217;ll taste better, it&#8217;s made fresh often so you won&#8217;t get sit, and it&#8217;s cheaper. </p><h2 class=\"p1\"><p><p class=\"s1\"><b>4. Transportation in India</b></p></p></h2><p class=\"p1\">Moving on to transportation! This article is turning out to be quite long. I hope you are sticking with me! Transportation is something I have written about in detail on the blog, so I&#8217;m going to link to those articles below:</p><h3 class=\"p1\"><p class=\"s2\"><b>4.1) How to book and take trains in India</b></p></h3><p><a href=\"https://hippie-inheels.com/traveling-india-by-train/\">Click here</a> to read all about trains in India from booking to which class and where to put all your stuff while you sleep.</p><h3 class=\"p1\"><p class=\"s2\"><b>4.2) How to book and take buses in India</b></p></h3><p><a href=\"https://hippie-inheels.com/traveling-india-by-bus/\">Click here</a> to read about buses in India so you know when to take a sleeper bus, Volvo A/C bus, local bus, or go for a train instead.</p><h3><p class=\"s2\"><b>4.3) Taxis and rickshaws</b></p></h3><p class=\"p1\">Other than using trains and buses (or flying) to get from town A to town B, you will also need to get around within the town. In most towns the cheapest and easiest way is to hail a rickshaw which are those funny little buggies with three wheels. In some cities they still have bicycle rickshaws but there are far less than there used to be. When you catch a rickshaw or taxi it is the law in most cities that they should turn their meter on. This doesn&#8217;t always happen. If they say no, you can try other rickshaws and if you have no luck then you need to negotiate a price <i>before</i> you get in the rickshaw.</p><p><img class=\"aligncenter size-full wp-image-2788\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/IMG_19952.jpg?resize=600%2C800&amp;ssl=1\" alt=\"trains india transport\" width=\"600\" height=\"800\"></p><h2 class=\"p1\"><p><p class=\"s1\"><b>5. Itinerary Considerations for India</b></p></p></h2><p class=\"p1\">Like I said above, there are so many regions: mountains, deserts, beaches, jungle, cities, and more which makes it hard to narrow down your trip. People sometimes email about wanting to get off the beaten path in India and I remind that that it&#8217;s totally unnecessary here. You will find culture shock and all that you want while staying on the tourist trail but more importantly you&#8217;ll stay safe. There are areas of India that are less traveled, but they are much more difficult to travel. These would be small villages that don&#8217;t have hotels, restaurants, and the local may have never seen a tourist. On your first trip to India, just stay on the path because it&#8217;s amazing and there&#8217;s a reason tourists go to the following places. </p><h3 class=\"p1\"><p class=\"s1\"><b>5.1) Top Towns Tourists Love</b></p></h3><p class=\"p1\">I am going to list out some of the top tourists town and then a few words on what they are known for. I&#8217;ll start in Northern India and work my way down then wrap up the East side. There are more amazing places in India than this, but I would guess about 90% of first time travelers to India stick to these places. </p><p class=\"p1\"><a href=\"http://traveltriangle.com/blog/places-to-visit-in-leh-ladakh/\">Leh</a> &#8211; ultimate Himalayan experience, trekking</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/what-to-do-in-mcleodganj/\">McLeod Ganj</a> / Dharamsala &#8211; the <a href=\"https://hippie-inheels.com/what-does-the-dalai-lama-teach/\">Dalai Lama</a>, Tibetan culture in the mountains</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/manali-himalayas-hippie-guide/\">Manali</a> &#8211; base for trekking, hippie zone</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/snowcapped-shimla-india-queen-hill-stations/\">Shimla</a> &#8211; cute hill station, looks straight from a movie</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/tips-get-spiritual-the-beatles-in-rishikesh/\">Rishikesh</a> &#8211; the Beatles ashram, yoga teacher training, spiritual experiences</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/dont-go-delhi-read-delhi-scams-creeps-dengue/\">Delhi </a>&#8211; chaos and the real India! </p><p class=\"p1\"><a href=\"https://hippie-inheels.com/13-tips-for-taj-mahal-visit/\">Agra</a> &#8211; Taj Mahal</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/easy-guide-to-jaipur/\">Jaipur</a> &#8211; amazing palaces, shopping, &#8220;pink city&#8221;</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/udaipur-lake-palace-guide-india-venice/\">Udaipur</a> &#8211; most romantic, white palace in the lake, the &#8220;Venice of India&#8221;</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/blue-city-of-jodhpur/\">Jodhpur</a> -the &#8220;blue city&#8221;, incredible fort</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/jaisalmer-travel-tips/\">Jaisalmer</a> &#8211; <a href=\"https://hippie-inheels.com/camel-safari-in-jaisalmer/\">camel safaris</a> in the Thar desert</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/pushkar-travel-guide/\">Pushkar</a> &#8211; holy lake, sunrise hill, spiritual place </p><p class=\"p1\"><a href=\"https://hippie-inheels.com/amritsar-golden-temple-sikhs-clever-eff-caste-system/\">Amritsar</a> &#8211; the Golden Temple and the Wagah border</p><p class=\"p1\"><a href=\"https://www.theguardian.com/travel/2013/dec/05/guide-to-indias-tiger-reserves-conservation\">Madhya Pradesh</a> &#8211; jungle and tiger tours</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/guide-one-day-mumbai-bombay/\">Mumbai</a> &#8211; Bollywood, hectic amazing city, Gateway to India</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/ultimate-unique-guide-to-north-goa/\">Goa</a> &#8211; trance parties, beach chill time, laid-back</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/expect-kerala-houseboat-alleppey/\">Alleppey</a> &#8211; houseboat on the backwaters</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/fort-kochi-guide/\">Kochi</a> &#8211; Chinese fishing nets</p><p class=\"p1\"><a href=\"https://hippie-inheels.com/adventure-sports-in-varkala/\">Varkala</a> &#8211; surfing</p><p class=\"p1\"><a href=\"https://www.lonelyplanet.com/india/tamil-nadu/puducherry-pondicherry\">Pondicherry</a> &#8211; French colony, surfing</p><p class=\"p1\">You can see I didn&#8217;t mention Tamil Nadu, Karnataka, and some big cities like Hyderabad and Calcutta &#8211; this is simply because most travelers don&#8217;t make it all this way! I <a href=\"https://hippie-inheels.com/complete-guide-traveling-karnataka-9-hotspots/\">seriously love Karnataka</a> but understand why travelers save it for their second trip. I&#8217;m also partial to <a href=\"https://hippie-inheels.com/how-to-backpack-northeast-india/\">Arunachal Pradesh</a> which is a state with many tribes and you need a permit to enter. It&#8217;s where the Apatani tribe live!</p><h3 class=\"p1\"><p class=\"s1\"><b>5.2) A Sample Itinerary for 10 Weeks in India</b></p></h3><p><img class=\"aligncenter size-full wp-image-2588\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/IMG_2276.jpg?resize=800%2C602&amp;ssl=1\" alt=\"travel tips jodhpur\" width=\"800\" height=\"602\"></p><p class=\"p1\"><a href=\"https://hippie-inheels.com/itinerary-for-india-guide/\">Here is a link</a> to the exact itinerary I did my first time to India. It covers most of the places mentioned above and after spending years in India, I still stand by my choices for these places as the top places to visit your first time in India. The itinerary there covers so many unique areas and pretty much all the &#8220;must see&#8221; tourist attractions. I&#8217;ve had many readers duplicate (even done to the same guesthouses) and they all loved it!</p><p class=\"p1\">Also, check out these two articles written by backpackers who I met along the way and I asked them to share their entire trip which has been so helpful. Each post has everything from what flight they took to their daily budget and mistakes that they&#8217;d do over differently. </p><h3 class=\"p1\"><p class=\"s1\"><b>5.3) Tours I Recommend</b></p></h3><p class=\"p1\">I have taken tours in India and I don&#8217;t think there&#8217;s a thing wrong with taking a tour rather than traveling alone. I didn&#8217;t take a tour until after I moved here, and first toured in Karnataka to really learn more about the rural areas. I ended up spending over a month in just that state. The big tour company that I recommend is <a href=\"https://www.gadventures.com/?PID=7623084\">G Adventures</a><b>.</b><b> </b>They are well-known, well-respected, and run some of the most comprehensive tours in India. My friend took one and met her now-boyfriend on it who she&#8217;s moved to Sweden to be with! It&#8217;s a great way to meet people and not have as much stress. Their tours are based on budget as well so you can still do one that used local transportation like trains and overnight buses and stays in cheap guesthouses. </p><p class=\"p1\">I made an entire list of my<a href=\"https://hippie-inheels.com/group-tour-itineraries-consider-trip-india/\"> favorite tours in India</a> which you can check out with that link. It lays it all out with maps and the route dotted out for you. I then talk about what top tourist attractions you&#8217;ll see with each tour and the pro&#8217;s of the tour as well as the cons.</p><p>*If you book a tour with G Aventures through my link, I get a percentage of the sale at no extra cost to you. Thanks so much!</p><h2 class=\"p1\"><p><p class=\"s1\"><b>6. Experiences to Try</b></p></p></h2><p class=\"p1\">Some of the top things people want to do in India are see/bathe elephants, see a tiger, go on safaris, go on a camel ride and sleep in the desert, stay at an ashram, learn yoga, learn about the religion, party in Goa, take a houseboat on the backwaters, get henna, and of course meet the Dalai Lama. Well, don&#8217;t worry you can do it ALL.</p><p><img class=\"aligncenter size-full wp-image-2739\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/IMG_23311.jpg?resize=800%2C603&amp;ssl=1\" alt=\", backpacking india budgetjaisalmer camel safari tips\" width=\"800\" height=\"603\"></p><p class=\"p1\">I wrote out the <a href=\"https://hippie-inheels.com/india-travel-bucket-list/\">ultimate India bucket list</a><b>.</b> Just go to that link to check it out. Each item that is amazing to try has a link to a blog post about trying it so you can really see in depth what it&#8217;s like. I had my own bucket list written in my journal and checked things off as I go. Think about what you want to do on the bucket list and make sure your itinerary corresponds.</p><h3 class=\"p1\"><p class=\"s1\"><b>6. 2) Yoga Retreats and Teacher Training</b></p></h3><p>Many people coming to India are interested in a beginners yoga retreat or already love yoga and want to do yoga teacher training (YTT) while in India. The best sites for these two experiences are <a href=\"https://www.bookyogaretreats.com/?aid=2262\">bookyogaretreats.com</a> and <a href=\"https://www.bookyogateachertraining.com/?aid=2265\">bookyogateachingtraining.com</a>. Many of my readers have done retreats and training through these sites (one is for retreats and one for training) and there are loads of reviews to read on each class. They&#8217;re pricey so check out all the ratings!</p><h2 class=\"p1\"><p><p class=\"s1\"><b>7.How to Meet People</b></p></p></h2><p class=\"p1\">Meeting people while traveling India use to be kind of hard and I would go weeks traveling without seeing other buddies. These days it&#8217;s getting better thanks to both more travelers coming here in the past couple years and the new hostels. Hostels make it much easier to meet other travelers, while previously all there were was guesthouses where you have a room to yourself and there are just a few rooms at each guest house which could be empty.</p><p class=\"p1\">Taking classes like meditation, art, and yoga are a great way to meet people. If you want to trek the mountains or do a camel safari it is MUCH cheaper to do as a group, so try to buddy up for these big adventures. Here&#8217;s an article about <a href=\"https://hippie-inheels.com/ask-anything-meeting-travelers-in-india/\">meeting people in India</a>.&#160;</p><h2 class=\"p1\"><p><p class=\"s1\"><b>8. Shopping in India</b></p></p></h2><h3><p class=\"s1\"><b>8.1) What to buy in each area of India</b></p></h3><p class=\"p1\">I am a shopaholic and have a full guide to what to buy in each area of India for souvenirs which you can <a href=\"https://hippie-inheels.com/shipping-india-souvenirs-home-shopping-india/\">read here</a>.</p><h3><strong>8.2) How to negotiate in India</strong></h3><p class=\"p1\">I 1000% suggest checking it out and getting an idea of prices because negotiating is going to be really important. Of course, I have a guide to <a href=\"https://hippie-inheels.com/how-to-negotiate-in-india/\">negotiating in India</a>, too.</p><h2 class=\"p1\"><p><p class=\"s1\"><b>9. Traveling With Kids</b></p></p></h2><p class=\"p1\">A lot of people ask about coming here with their kids, and although I don&#8217;t have kids, my friends do and I know a bit about traveling with kids here. Things are MUCH more laid back so there are not going to be car seats and you can forget bringing a stroller unless you&#8217;ll be in a seriously upscale area with amazing sidewalks (can&#8217;t think of a place like this). Rajasthan, Goa, and Kerala are probably the three best states to travel with kids. People will take pictures of your babies because little white babies are just too adorable to some Indians. It&#8217;s not as weird as it seems! If you&#8217;re traveling with a big budget, most five star hotels have nurseries/play rooms here. </p><h2 class=\"p1\"><p><p class=\"s1\"><b>10. Volunteering Considerations</b></p></p></h2><p class=\"p1\">Do some serious research before you volunteer in India! They are definitely taking advantage of the &#8220;voluntourism&#8221; and I have heard horror stories. You have to keep in mind, people are seriously struggling in areas of India and would do just about anything to make money to feed their families. In Mumbai, the women holding babies and begging for money for food for them have sometimes rented the baby from the slum and made it look sick &#8211; and sometimes, the baby is dead. There is a layer to India that is dark and some volunteering places take huge advantages of kind foreigners&#8230; it&#8217;s not about losing money it&#8217;s about the kids that get taken or sold away to live in an orphanage so that the &#8220;orphanage&#8221; can get volunteers to pay and help. </p><p class=\"p1\">Having said that, there are good places to volunteer. You just need to use common sense and ask yourself is it benefitting you or are you REALLY going to help?</p><p class=\"p1\">I did write a guide to&#160;<a href=\"https://hippie-inheels.com/can-volunteer-goa-answered/\">volunteering in Goa</a> because I know it well, which could be helpful if you come to this state.</p><h3>Pin this travel to India guide for later:</h3><p><img class=\"aligncenter size-full wp-image-25585\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/India-Travel-Made-Easy-1.jpg?resize=683%2C1024&amp;ssl=1\" alt=\"Travel to India Made Easy With This Step By Step Guide\" width=\"683\" height=\"1024\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Travel to India Made Easy With This Step By Step Guide"}},"pageContext":{"id":"5b962a1b87be0583274911ce"}}