{"data":{"mongodbDatabaseArticles":{"id":"5b96249987be058327490ebd","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">1.5K <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p>This is a guest post Barry and Julia, who sold up in the UK to travel around Turkey for 6 months. They&#8217;re still in Turkey, living in Fethiye on the southwest coast. Their blog, <a href=\"http://turkeysforlife.com/\">Turkey&#8217;s For Life</a> is a slow travel and food blog about Fethiye and other parts of Turkey. All of the images in this post are courtesy Turkey&#8217;s For Life.<br>\n</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-Ff6Ksmb/0/690x690/i-Ff6Ksmb.jpg\" alt=\"fethiye boats\" width=\"690\" height=\"455\"></p>\n<p>In the UK, many people dream of moving off to pastures new; moving overseas to those dreamy Mediterranean coastal towns or rural villages where life is going to be relaxed, natural, sunny, perfect.</p>\n<p>When we still lived in the UK, almost 13 years ago now, we, along with millions of others would be glued to TV programs like &#8216;A Place In The Sun,&#8217; where we were fed the dream; watching British couples looking to make the great escape being taken around overseas properties by a glamorous presenter.</p>\n<p>Luxury villas with swimming pools, traditional Spanish farmhouses, rural French gites. &#8220;Ahhh, we could live there. Just imagine how perfect it would be,&#8221; the millions of viewers would say as the couples walked from room to room saying, &#8220;Oh, this is a good size. This is bright and airy. 15 acres of land with the property, you say?&#8221;</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-k5xqm3B/0/690x690/i-k5xqm3B-X2.jpg\" alt=\"Kabak road &#246;l&#252;Deniz Turkey\" width=\"690\" height=\"518\"></p>\n<p>13 years ago, after a few holidays there, we had completely fallen for a coastal town in <a href=\"https://foxnomad.com/countries/turkey-travel-information/\">Turkey</a> and when the opportunity came about that we were in a position to jump ship, we took the plunge and bought our own &#8216;place in the sun.&#8217; (It&#8217;s not a luxury villa with a swimming pool in acres of land, by the way!) We actually took the plunge to <a href=\"https://foxnomad.com/category/travel/\">travel</a> Turkey for a few months, not to live here&#8230;but we never left.</p>\n<p>After 13 years of life in Turkey, we&#8217;ve done a lot, seen a lot and learned a lot&#8230;and there&#8217;s much further to go.</p>\n<p>When An&#305;l asked us if we&#8217;d like to write a <a href=\"https://foxnomad.com/category/guest-post/\">guest post</a> for his blog, it was a case of hmm, what to write about. Well how about a few random musings about life in Turkey, in another <a href=\"https://foxnomad.com/category/travel/culture/\">culture</a>, in a town that mixes local life with backpacker stop off, with package holiday tourism. Musings about how we assumed life would be &#8211; and how life actually is.</p>\n<p><strong>We&#8217;re Going To Be Fluent In Turkish</strong> </p>\n<p>That was definitely going to happen to us when we moved to Turkey&#8230;Oh yeah, we were going to blend in with the locals, speaking fluently in our new language. Well, we&#8217;d already picked up a few words and phrases from past visits. Surely, we&#8217;d hit &#8216;fluency,&#8217; at some point. Hmm, well, 13 years in and lots of study later, we can just about get the gist of a newspaper or magazine article. We can bumble our way through a conversation if we know the subject matter.</p>\n<blockquote><p>But put us in a room with lots of random Turkish conversations going on and watch that glaze fall over our eyes. We&#8217;ve got some friends who can fall into Turkish conversation with ease (why oh why can&#8217;t we do that), we&#8217;ve got some friends who can just about manage a &#8216;hello, how are you&#8217; and we&#8217;ve got lots like us, too. Not all of us are blessed with the language-learning knack, it seems &#8211; much as this irritates the life out of us, personally.</p></blockquote>\n<p>Survival tip we give ourselves from this &#8211; We go easy on ourselves. Our town is a bit of an anomaly in that a lot of the Turkish residents are fluent in English &#8211; and they love to speak English. We actually use our Turkish more when we&#8217;re out of town than when we&#8217;re at home.</p>\n<p><strong>I&#8217;m Going To Immerse Myself In All Things Turkish Cuisine</strong></p>\n<p>For us, moving to Turkey meant immersion into all things Turkey and Turkish and, especially with the cuisine, that&#8217;s what we did. We were almost militant about it, in fact, to the point that we never went to any other type of restaurants or made any other foods at home for perhaps a couple of years! We ate, we read, we asked Turkish friends about Turkish <a href=\"https://foxnomad.com/category/travel/food/\">food</a>, we watched them cook and we taught ourselves <a href=\"http://www.turkeysforlife.com/turkish-recipes-index.html\">lots of Turkish recipes</a>.</p>\n<p>Full English breakfast? Fish and chips? Restaurants specializing in foods from other <a href=\"https://foxnomad.com/countries/\">countries</a>? They were all off the menu.</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-rnBbvWr/0/690x690/i-rnBbvWr.jpg\" alt=\"bulgur wheat rice\" width=\"690\" height=\"518\"></p>\n<p>We&#8217;re passionate about food and, to be honest, we&#8217;re glad we did this. And it wasn&#8217;t difficult either &#8211; well, Turkish cuisine is ranked among the top 3 cuisines in the world. Why wouldn&#8217;t we want to explore and experiment.</p>\n<p>Today, our daily diet is predominantly Turkish cuisine but again, over time, we&#8217;ve learned to give ourselves a break. As well as oodles of great Turkish eateries &#8211; traditional and modern &#8211; there are a good few international restaurants in our town so if we fancy an Indian meal, Chinese, Italian or yes, even a plate of good old fish and chips; well, that&#8217;s okay occasionally, too.</p>\n<p><strong>Our Friends Will Be Turkish. I&#8217;m Not Going To Be Part Of The Expat Community</strong></p>\n<p>There&#8217;s that immersion thing again. No, we didn&#8217;t come to live in Turkey to sit in those stereotypical British bars, watching British TV programs via satellite, complaining about the latest increase in local beer prices. We&#8217;d made a few Turkish friends from previous visits to the country and they were all we needed, thank you very much.</p>\n<p>But a lot has changed in 13 years. When we first came to Turkey there were relatively few expats in our town. That number has fluctuated over the years for lots of reasons but the reality is, our town is good in that it manages to blend so many people in a relatively small space.</p>\n<p>A lot of Turkish people work in tourism so they&#8217;re comfortable with having so many people around of different nationalities. Is there an &#8216;expat community?&#8217; Not even sure, to be honest. If &#8216;expat community&#8217; translates to an &#8216;us and them&#8217; scenario then that is not the case. Yeah, there are some pockets where the clientele in bars and restaurants is predominantly British &#8211; but generally, especially around the town center, it is a whole mix of everyone and that&#8217;s where we spend a lot of our time. Inevitably &#8211; and thankfully &#8211; you meet lots of other people, too. Some live here, some have a place here and are in town often.</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-ZmfLKND/0/690x690/i-ZmfLKND.jpg\" alt=\"paspatur fethiye turkey\" width=\"690\" height=\"438\"></p>\n<p>We&#8217;ve got lots of close Turkish friends but we&#8217;ve also got British, Australian, American, Hungarian, Russian, Dutch, German and Danish people in our lives, too &#8211; and lucky us that that&#8217;s the way it is.</p>\n<p><strong>Ahh, But You Don&#8217;t Live In The Real Turkey</strong></p>\n<p>If we had a lira for every time someone said that to us! We can assure you that wherever you may live or travel to in Turkey, it is very real.</p>\n<p>There are coastal tourist areas where beaches, beachwear, bars, nightclubs, restaurants and foreign holidaymakers prevail &#8211; and these places might be &#8216;touristy&#8217; but they are still very real. Cosmopolitan cities, where the high street is packed with designer stores, remote villages in the Anatolian plains where people live off the land and barely see anyone from outside the village, let alone a foreigner. They are also the real Turkey. It&#8217;s all the real Turkey; it&#8217;s just that each place is very different.</p>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-ZL2hWWD/0/690x690/i-ZL2hWWD.jpg\" alt=\"istanbul turkey fishing\" width=\"690\" height=\"518\"></p>\n<p><strong>We Can Still View Turkey Through (Slow) Travelers&#8217; Eyes</strong></p>\n<p>One of our favorite places in Fethiye is the otogar (intercity bus station). Even after 13 years, we still get excited at the sight of all the buses coming and going and the company offices listing all their destinations &#8211; we really can just take our pick. Somewhere an hour or so down the road or a 20+ hour overnight bus journey. Where to next&#8230;</p>\n<p>Turkey is a vast country. Because we live here, we have the luxury of being able to practice what we preach on our blog &#8211; slow travel; attempted immersion into many of the places we visit. There is so much out there to see and do and absorb and if we listed everywhere we&#8217;ve been, it might look pretty impressive&#8230;but we&#8217;ve hardly scratched the surface. Each place we go to &#8211; some we visit time and again &#8211; comes with its own pleasures, rewards and challenges.</p>\n<p>Living in Turkey has been a huge learning curve and that learning never stops. It&#8217;s a case of keep traveling, asking, listening, reading, being open and the more we learn, the less we realize we know. That&#8217;s the best part. Never boring, that&#8217;s for sure.</p>\n<p><strong>And The Biggest Lesson Of All&#8230;</strong></p>\n<p>An&#305;l himself has <a href=\"https://foxnomad.com/2013/04/09/the-primary-lesson-ive-learned-traveling-people-are-fundamentally-good/\">written a blog post about this</a> subject and, with regards to Turkey, it&#8217;s what we try and show in our own blog in every post we write. The biggest lesson of all is that the majority of people in this world are good people and we&#8217;re all just trying to live our lives in the best way we can on a daily basis.</p>\n<p>Particularly recently, Turkey is often in the news for unpleasant reasons &#8211; as it should be &#8211; and the same can be said for a lot of other countries in the world, too. (I&#8217;m actually writing this post in complete sadness on a day of national mourning &#8211; the day after the terrorist attack on Atat&#252;rk Airport in Istanbul.)</p>\n<blockquote><p>The problem with such international media coverage is that you only get to see those countries when an atrocity occurs, a disaster or when its leader makes a newsworthy statement. All those billions of good people mentioned in the above paragraph, who are just getting on with their everyday lives, get swallowed up in that and we forget they exist. But those good people are the ones who are going to make your experience in Turkey &#8211; and other countries, too &#8211; memorable for all the right reasons. I hate to use the cliche but if you do a stint in Turkey, you&#8217;ll know why &#8216;Turkish hospitality&#8217; is a phrase used so often.</p></blockquote>\n<p><img class=\"alignnone\" src=\"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-HDD7rsG/0/690x690/i-HDD7rsG.jpg\" alt=\"izmir turkey\" width=\"690\" height=\"414\"></p>\n<p>As two people living in a country where lots of people currently fear to travel, all we can say is this country &#8211; and elsewhere in the world &#8211; has so much to offer. Yes, use the media to make yourself aware of what&#8217;s happening in a country but also get down to ground level, too. Read blogs (there are lots of us bloggers in Turkey &#8211; travel, food, politics, random musings), talk to people who live here (social media is a wonderful thing), do your homework&#8230;and that&#8217;s when to make the decision about whether or not you want to go off and see for yourself. You never know, you could end up living there&#8230;</p>\n<p>Thank you very much Julia and Barry for sharing your experiences living in Turkey with us. If you have any questions for Barry or Julia, you can ask them in the comments below and find them at their blog <a href=\"http://www.turkeysforlife.com/\">Turkey&#8217;s For Life</a>, <a href=\"https://www.facebook.com/turkeysforlife\">on Facebook</a>, and @<a href=\"https://twitter.com/turkeysforlife\">TurkeysForLife on Twitter</a>.<br>\n</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"What It’s Like To Live In Turkey As Foreigners, 13 Years After A Dream Come True"}},"pageContext":{"id":"5b96249987be058327490ebd"}}