{"data":{"mongodbDatabaseArticles":{"id":"5b9248d687be056953db7bff","content":"<div><p>Since I'm back in Amsterdam and my birthday was coming up, I thought it'd be fun to celebrate it in a special way. Ever since I studied in <a href=\"http://hassepietersam.nl/\">South Korea</a>, I've been obsessed by South Korean food. But what about North Korean? The cuisine of a dictatorship? </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/130309110440-03-north-korea-0309-horizontal-gallery.jpg\"> <p>It'd probably be quite similar but still I was curious. Now I heard there's actual North Korean restaurants outside of North Korea. The North Korean government itself <a href=\"http://en.wikipedia.org/wiki/Pyongyang_(restaurant_chain)\">started opening up a chain of restaurants</a> called Pyongyang (after its capital) years ago. Latest count is that there's 5 in the world, most of them in Asia, but there's 1 in Europe. And by my sheer luck <a href=\"http://haedanghwa.nl/\">it was located in Amsterdam</a>!</p> <h2>Backstory</h2> <p>This restaurant has a slightly dark backstory to it though. When it first opened a few years ago, its 10-people staff were living on EUR 100 a week and slept in a cramped room above the restaurant. They were supposedly monitored 24/7 by North Korean secret agents. Suffice to say, it didn't really work out. The restaurant went bankrupt by mismanagement by the North Koreans and shut down.</p> <p>Ironically, a South Korean entrepreneur from Amsterdam then jumped on the opportunity and employed the North Korean staff to start his own traditional North Korean restaurant. He named it <a href=\"http://haedanghwa.nl/\">Haedanghwa</a> and that's where I was going to celebrate my birthday! Yay!</p> <h2>The food</h2> <p>The main dish of Korean cuisine is a barbeque, you get lots of small vegetable-based side dishes (including kim-chi, ofcourse), lots of meat (mostly pork) and you grill it yourself on a barbeque that's built-in the table. It's fun cause it's interactive and with a group of people it's just really cosy.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/P3083839-1024x768.jpg\"> <h2>The experience</h2> <p>It was awesome. The staff are super friendly and with a level of service, you feel like you're treated like a king. They sing traditional North Korean songs with dances. And yes it's all gimmicky as fuck. But it's fun. It's a little peek into the North Korean culture many of us are very interested in but don't have easy access too.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/afbeelding-restaurant.png\"> <p>Of course, the most awesomest was to see all my friends together again after coming back home in Amsterdam!</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/IMG_29651-1024x768.jpg\"> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/IMG_2971-1024x768.jpg\"> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/IMG_2966-1024x768.jpg\"> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Celebrating my birthday North Korean style"}},"pageContext":{"id":"5b9248d687be056953db7bff"}}