{"data":{"mongodbDatabaseArticles":{"id":"5b937adb87be056953db7cdf","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*RYgX-T7fPK9IME_pWR-8Gw.jpeg\"><h1 name=\"2682\" id=\"2682\" class=\"graf graf--h3 graf-after--figure graf--title\">The World is Our Home&#8202;&#8212;&#8202;Let&#8217;s Stop Using the Term &#8216;Digital&#160;Nomad&#8217;</h1><p name=\"6814\" id=\"6814\" class=\"graf graf--p graf-after--h3\">I&#8217;ve visited around 40 countries after leaving my job in 2010 running a top social media agency in NYC and buying a one-way ticket to Thailand. Since then I wrote three full-length books on innovation and spoke/worked in places like Berlin, Budapest, Macedonia, Bangkok, and Dubai. The BBC recently did a <a href=\"http://www.bbc.com/capital/sponsored/story/20161116-innovating-in-the-digital-world-through-traditional-teaching\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">profile on my unique approach to innovation and travel</a>.</p><p name=\"59d7\" id=\"59d7\" class=\"graf graf--p graf-after--p\">For the first 2&#8211;3 years I embraced the term &#8216;digital nomad.&#8217; Location-independent work was a new thing (at least for me), and it helped explain how I could work anywhere with Internet access. My wardrobe consisted of cool shirts from my travels, and the happiness and freedom of nomadic existence reshaped my identity to feel like a global citizen.</p><p name=\"3033\" id=\"3033\" class=\"graf graf--p graf-after--p\">Today I despise the term &#8216;digital nomad&#8217; because it affirms a view that the world is closed, fragmented, divided by borders. It accepts conventional lines drawn by wars and politicians rather than pushing these boundaries to be more inclusive and open. The emerging networked society we are pioneers in co-creating in is about interconnection, trade routes, and clusters of megacities as Parag Khanna describes in Connectography.</p><p name=\"6d02\" id=\"6d02\" class=\"graf graf--p graf-after--p\">Most &#8216;digital nomads&#8217; would strongly disagree with the notion that we have no home unless we are in the country where our passports were issued. The world is my home. Our home. We need a shift in mindset. Instead of thinking that you left home to explore the world (to become a nomad) let&#8217;s expand our definition of home to encompass the universe. Home is where the heart is. Wherever you are. Inside us. Everywhere. Let&#8217;s co-create a world where everyone belongs, as Airbnb aspires to with their mission.</p><p name=\"0ac4\" id=\"0ac4\" class=\"graf graf--p graf-after--p\">An expanded definition of home parallels an expanded view of humanity characterized by interconnection, inclusivity, and openness. It echoes the Hindu Upanishads where the Atman (self, soul) is a manifestation of the universe and everything is a play of consciousness. We are living through a massive shift from an analog to digital world. We must strive to keep both worlds&#8202;&#8212;&#8202;the physical and digital&#8202;&#8212;&#8202;open and accessible to everyone.</p><p name=\"3bd0\" id=\"3bd0\" class=\"graf graf--p graf-after--p\">Look at the news. Borders are closing. Walls are going up. Platforms are being hacked. Surveillance is everywhere. Social media is becoming an echo chamber of hatred and anger. We can no longer define ourselves by a care-free nomadic existence. The &#8216;digital nomad&#8217; community must evolve and champion an emerging future of crowd-based prosperity. We must become global citizens living with passion and purpose.</p><p name=\"4ce6\" id=\"4ce6\" class=\"graf graf--p graf--startsWithSingleQuote graf-after--p\">&#8216;Digital nomads&#8217; were pioneers of a new way of being at home in the world. We need a more expanded definition of &#8216;home&#8217; rather than identities anchored in being transitory and nomadic. It is time to think about ourselves as co-creators of solutions, a global community working towards establishing a collaborative society with values of fairness, inclusivity, and openness.</p><h4 name=\"2b8f\" id=\"2b8f\" class=\"graf graf--h4 graf-after--p\">My Portable Pop-Up Home Experience</h4><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Kh5owLPrvcU3o6j4BbQDZw.jpeg\"><p name=\"eaca\" id=\"eaca\" class=\"graf graf--p graf-after--figure\">I travel with one checked bag and one carry-on. On the top I have my portable pop-up &#8220;home&#8221;&#8202;&#8212;&#8202;meditation cushion, yoga mat, coffee press and grinder, Bluetooth speaker, Phillips Hue lights, router, projector, and Apple TV&#8202;&#8212;&#8202;and on bottom 2 pairs of jeans, 2 pairs of pants, 2 pairs shorts, three button-up shirts, one blazer, 3 sweatshirts, t shirts, shoes (4 sneakers, 1 dressy), hoodie and 2 leather jackets.</p><p name=\"5f7b\" id=\"5f7b\" class=\"graf graf--p graf-after--p\">My portable &#8220;home&#8221; experience makes me feel grounded anywhere in about 20&#8211;30 minutes, the same way a pop-up store transforms temporary spaces. I basically live off of Airbnb, spending on average 1&#8211;2 months per location. This month I&#8217;m in Bangkok. I came here to co-teach an innovation camp for social entrepreneurs run by <a href=\"https://www.facebook.com/serendipialife\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Serendipia</a>. Next month I&#8217;ll be in Berlin and Ireland. Then more keynotes and workshops across Europe and Asia.</p><p name=\"e86d\" id=\"e86d\" class=\"graf graf--p graf-after--p\">Most Airbnb places have cheap lighting, poor quality sound, and bad kitchenware (I may add a high-quality pan, cutting board, and knife to my home experience). My portable home remedies that. The Phillips Hue lights allow me to control the brightness and color of lights with an app on my phone. I also have two Buddhist thankas (traditional paintings) which along with my meditation cushion and yoga mat ground my home in mindfulness.</p><p name=\"f3da\" id=\"f3da\" class=\"graf graf--p graf-after--p\">I try to stay in places with high ratings run by one person, with their own dedicated Internet router because shared connections are often unreliable. I look for places that are decorated (even badly) because this indicates an attempt to make it feel like home vs. cheap (and often uncomfortable) furniture. I find places with 30&#8211;40% discount for monthly stays, long enough to establish relationships in local startup / innovation communities.</p><p name=\"54b9\" id=\"54b9\" class=\"graf graf--p graf-after--p\">All clothes are somewhat color coordinated so anything goes with anything. I bring select jewelry to dress up/down the same outfit. I like <a href=\"http://www.scottevest.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">SCOTTeVEST </a>for functional travel pants/jacket, which have tons of cool pockets that allow me to replace my backpack. I almost always wear sneakers, t-shirt, and one of the black leather jackets weather permitting because, well, I like black leather jackets. One motorcycle jacket, one blazer, for dressing up/down.</p><p name=\"535a\" id=\"535a\" class=\"graf graf--p graf-after--p\">These anchors of my portable home experience and personal style make me feel at home anywhere. I&#8217;m not a minimalist&#8202;&#8212;&#8202;a minimalist wouldn&#8217;t travel with 2 leather jackets or 4 pairs of sneakers&#8202;&#8212;&#8202;and am certainly not a backpacker (I don&#8217;t own one). I&#8217;m just radically honest with myself about what I like and need. I have enough outfits to do professional workshops, speaking, or executive trainings based on my books, plus exercise, swimming, and casual attire. The world is my home. Our home.</p><h4 name=\"90f0\" id=\"90f0\" class=\"graf graf--h4 graf-after--p\">Access over Attachments&#8202;&#8212;&#8202;Our Emerging Digital&#160;Home</h4><p name=\"11ee\" id=\"11ee\" class=\"graf graf--p graf-after--h4\">People often talk about access vs. ownership, but ownership is really about attachments to things we often don&#8217;t really need. My life is optimized for access. Access-based platforms like Airbnb, Uber, Lyft, and a myriad of local on-demand food, laundry, delivery apps and services make it easy to access the comforts of home anywhere. I can also transform my living space in 20&#8211;30 minutes with my pop-up home experience.</p><p name=\"f050\" id=\"f050\" class=\"graf graf--p graf-after--p\">The conventional way of viewing success is to optimize for ownership. You get on a treadmill accumulating possessions. Cars. Homes. Clothes. Jewelry. Yachts. Whatever. Once you start down this path, it never ends. No matter how great the possession is, the pleasure never lasts. We experience any disruption to our attachments as a personal attack, transforming wants into perceived needs, and perceived needs into signifiers of who we are.</p><p name=\"1730\" id=\"1730\" class=\"graf graf--p graf-after--p\">Letting go of attachment to the idea of &#8216;home&#8217; being a physical building is incredibly liberating. There is tremendous, true freedom in being able to pack-up and go anywhere&#8202;&#8212;&#8202;to be nomadic&#8202;&#8212;&#8202;without having your sense of identity grounded in the transitory experience of being a traveler. For me, awakening to the reality of being at home in the world was an extension and application of my personal meditation / spiritual practice (this is also the subject of my first book <a href=\"https://www.amazon.com/Red-Bull-Buddha-Innovation-Search/dp/098982330X\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Red Bull to Buddha</a>).</p><p name=\"cf7a\" id=\"cf7a\" class=\"graf graf--p graf-after--p\">Meditation or mindfulness is about access to who we are, giving rise to wisdom and compassion towards others. I also feel inspired by Douglas Rushkoff, who talks about basic concepts like the economy, materialism, and so on in terms of an operating system. We are born into this, as Charles Bukowski famously said, but what if we change our operating system? What if we simply replace a limited conception of &#8216;home&#8217; with &#8216;the universe&#8217;?</p><p name=\"4c0b\" id=\"4c0b\" class=\"graf graf--p graf--startsWithSingleQuote graf-after--p\">&#8216;Digital nomads&#8217; already optimize their lives for access. This is the logical next step in the evolution of the global community.</p><h4 name=\"105b\" id=\"105b\" class=\"graf graf--h4 graf-after--p\">Maturing Model of Community&#8202;&#8212;&#8202;from Nomads to Global&#160;Citizens</h4><p name=\"e49a\" id=\"e49a\" class=\"graf graf--p graf-after--h4\">The term &#8216;digital nomad&#8217; blossomed alongside the resurgence of interest in startups, entrepreneurship, and innovation after the economic crash of 2008&#8211;9. Yet the term suggests the community exists in a vacuum. Location-independent work is made possible by a support system of co-working spaces, accelerators, incubators, meetups, conferences.</p><p name=\"b6c4\" id=\"b6c4\" class=\"graf graf--p graf--startsWithSingleQuote graf-after--p\">&#8216;Digital nomads&#8217; are part of a more diffuse collaborative and sharing economy movement, the subject of my most recent book <a href=\"http://cocreatethefuture.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Empower: How to Co-Create the Future.</a> We are no longer nomads, but rather travelers from one community to the next, from home to home, co-creating solutions to problems. There is a real sense of community maturing and growing that is more akin to a movement than a transient, nomadic existence. The term digital nomad is outdated. We&#8217;ve evolved and outgrown it.</p><p name=\"7e24\" id=\"7e24\" class=\"graf graf--p graf-after--p\">The days of humble-bragging &#8220;look at me travel and my monthly income reports&#8221; are coming to an end (at least I hope so). Leadership of the &#8216;digital nomad&#8217; community needs to be more than content marketing to sell list-building, drop shipping, or blogging courses to people that hate their day jobs. Let&#8217;s think beyond being self-preneurs building personal brands and freelance gigs and focus on having a meaningful impact on the world.</p><p name=\"b4b0\" id=\"b4b0\" class=\"graf graf--p graf-after--p\">The heart of the ecosystem is now a community of global citizens sharing and exchanging knowledge, resources, and helping each other. That is not a nomadic existence. It&#8217;s bigger and better than that. It&#8217;s not about you. It&#8217;s about making the world our home. We are global citizens, not nomads.</p><h4 name=\"2715\" id=\"2715\" class=\"graf graf--h4 graf-after--p\">Need for Global Leadership</h4><p name=\"2676\" id=\"2676\" class=\"graf graf--p graf--startsWithSingleQuote graf-after--h4\">&#8216;Digital Nomads&#8217; are courageous, intrepid explorers bold enough to leave their native countries in search of a more meaningful life. They let go of attachments to preconceived ways of being, embrace new technologies and form communities around likeminded interests, and perhaps most important their experiences of encountering new countries and cultures provide tangible examples of how we can co-create and coexist together.</p><p name=\"1517\" id=\"1517\" class=\"graf graf--p graf-after--p\">It&#8217;s important to continue posting stories, pictures, and videos across social media of all the wonderful experiences encountering people from diverse religious, national, and cultural backgrounds. These experiences are counter-examples to what we see everyday online. Our politicians and media pundits appear trapped in polarizing dialogue. Let&#8217;s move beyond talking about how the world could or should be and co-create solutions. Let&#8217;s live by example and be the change we want in the world.</p><p name=\"d545\" id=\"d545\" class=\"graf graf--p graf-after--p\">For example, I just finished co-teaching an innovation camp in Thailand with <a href=\"https://www.facebook.com/serendipialife\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Serendipia</a>. 40 people from 15 different countries came together to help co-create solutions in support of three local social impact ventures. Over 9 days we went from being complete strangers to developing prototypes that can be implemented and tested, all while having an incredible, life-changing experience together.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*uQ80bCHIy1-ij2lLF2o8CA.jpeg\"><p name=\"5499\" id=\"5499\" class=\"graf graf--p graf-after--figure\">There were so many variables to plan for&#8202;&#8212;&#8202;how do you bring complete strangers together, provide enough structure and frameworks to co-create solutions within such a short time frame, and empower them to be innovative and creative. If you believed what the news and media tell you, it would be impossible. If you accept conventional wisdom that people cannot get along and collaborate, it would be impossible.</p><p name=\"0ac3\" id=\"0ac3\" class=\"graf graf--p graf-after--p\">But conventional wisdom is wrong. There is tremendous power within us all to come together and solve problems. &#8216;Digital nomads&#8217; see the tremendous power of collaboration and co-creation everyday, in every city, through encounters with complete strangers. We cannot allow people who never leave their sofas tell us what the world could or should be. We cannot let fear and intolerance prevent us from making the world our home.</p><p name=\"c285\" id=\"c285\" class=\"graf graf--p graf-after--p\">The next 10&#8211;20 years will reshape the global economy and transform the world. Self-driving cars, AI, drones, robots, augmented and virtual reality, are among the many innovations that will radically disrupt conventional ways of being. It is time to let go of the idea of being &#8216;digital nomads&#8217; and embrace the vision of an emerging networked society on the horizon. It is time to be global citizens co-creating the future we want and deserve.</p><p name=\"a874\" id=\"a874\" class=\"graf graf--p graf-after--p graf--trailing\"><strong class=\"markup--strong markup--p-strong\">David Passiak</strong> is a former religion scholar who specializes in building movements around brands and startups. His most recent book Empower: How to Co-Create the Future is available by donation. That means anyone can download the full 200+ page e-book for free at<a href=\"http://cocreatethefuture.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"> CoCreateTheFuture.com</a> (Kindle, PDF, ePub versions)</p></div>","title":"The World is Our Home — Let’s Stop Using the Term ‘Digital Nomad’"}},"pageContext":{"id":"5b937adb87be056953db7cdf"}}