{"data":{"mongodbDatabaseArticles":{"id":"5b9248b187be056953db7bd9","content":"<div><p>I like to travel but I don't like to fly. Flying is one of the most stressful activities for anyone and especially for me. Firstly, I don't like the act of flying at all, I don't really feel very safe in an airplane even though statistics prove me wrong. What I like even less than flying though is the trouble I have to go through at airports of waiting and standing around in queues. So I decided to optimize my flight routine for total personal relaxation and removal of stress. </p> <p>I wanted to avoid queues, waiting, rushing and any feelings of chaos, fear or stress as much as possible. And the easiest way to do all of those things was to get rid of check-in luggage altogether. </p> <p>I've now been traveling for almost 8 months with just this carry-on bag. Since 99% of things you need are available to buy in some form or another in any city in the world, most people really don't need any more than this.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/IMG_1069x-1024x638.jpg\" width=\"100%\"> <p>By removing check-in luggage, my typical day of travel now goes like this. I wake up at 11am and think I want to move to another place. For example, this week I was in Bangkok and I wanted to move to Singapore. I load up the <a href=\"http://airasia.com/\">Air Asia</a> app on my phone, book a flight at 4pm the same day. Straight after booking, I check-in to the flight on my phone. I put my stuff in my bag and I go about my day as usual.</p> <p>Around 2.30pm, I hail a taxi to the airport and arrive at 3.15pm. Since I only have a carry-on bag and am already checked in, I don't need to wait in check-in queues for hours talking to stressed-out desk agents. I just need to print my boarding pass at one of the electronic boarding pass printing poles.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/11/airasia-self-check-in-550-550.png\"> <p>After arriving, I walk through security and customs to the gate, buy some water and sit down at my gate at 3.30pm. I wait for boarding and then enter the plane. I stow my bag under the seat in front of me for easy access. After take off at 4pm, I open my laptop and do some work. In this case, the flight takes about 2 hours, so we land around 6pm. For some reason, when a plane has landed people always become vultures and want to have their bag out as soon as possible. Since my bag is already in front of me I remain seated and keep working on my laptop until literally every passenger has exited the plane.</p> <p>I then walk through customs and I'm outside at 6.15pm. Since I have no check-in luggage, there's no wait. It took me 1.45 hours (or 42%) of time spent outside of flying. The main reason is the lack of check-in luggage. That makes everything faster. If I did have check-in luggage, it would have probably taken at least 45 minutes of waiting at the check-in desk, an extra 45 minutes of buffer time for if the check-in desk might be super busy and another 45 minutes of waiting at the baggage claim. That's over 2 hours extra time. </p> <p>I think I'm fine with just a bag.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I travel the world with just a carry-on bag"}},"pageContext":{"id":"5b9248b187be056953db7bd9"}}