{"data":{"mongodbDatabaseArticles":{"id":"5b937b0587be056953db7d08","content":"<div><h4 name=\"24bb\" id=\"24bb\" class=\"graf graf--h4 graf--leading\">What is a full stack employee?</h4><p name=\"dda0\" id=\"dda0\" class=\"graf graf--p graf-after--h4\">Just as there are <a href=\"http://www.laurencegellert.com/2012/08/what-is-a-full-stack-developer/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">full-stack engineers</a> and <a href=\"http://a16z.com/2015/01/22/the-full-stack-startup/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">full-stack startups</a>, the full-stack employee has a powerful combination of skills that make them incredibly valuable. They are adept at navigating the rapidly evolving and shifting technological landscape. They make intuitive decisions amidst information-abundance, where sparse facts mingle loosely with data-drenched opinions. Full stack employees are capable of speaking design lingo, know that using <a href=\"http://www.comicsanscriminal.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Comic Sans is criminal</a>, and are adept at making mocks in Keynote, Sketch, or Skitch (if it comes to that). And they know <a href=\"http://www.helloerik.com/ux-is-not-ui\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">the difference between UI and UX</a>.</p><p name=\"1434\" id=\"1434\" class=\"graf graf--p graf-after--p\">They can cross the aisle to talk to engineering and can make sense of algorithms, programming, and instinctively understand that scaling the backend isn&#8217;t the same as scaling the frontend. Though they may not code for production, they understand what <a href=\"http://github.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">GitHub</a> and <a href=\"http://stackoverflow.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">StackOverflow</a> are for, and can brute force a copy-paste script to perform basic analysis on a CSV file. If they must.</p><p name=\"1549\" id=\"1549\" class=\"graf graf--p graf-after--p\">They&#8217;re on the latest social apps, and know how to self-promote. Tastefully (most of the time; for the rest, there&#8217;s Snapchat). They use narrative and storytelling to involve their audience, but have watched enough three minute Kickstarter videos to know that they need to get to their point in less time than it takes to watch an Instagram video, if not a Vine. Attention is the currency of the age.</p><p name=\"db32\" id=\"db32\" class=\"graf graf--p graf-after--p\">Full stack employees have an insatiable appetite for new ideas, best practices, and ways to be more productive and happy. They&#8217;re curious about the world, what makes it work, and how to make their mark on it. It&#8217;s this aspect above others that defines and separates the full stack employee from previous generations. Full stack employees can&#8217;t put blinders on once they land a job; instead they must stay up on developments in their industry and others, because they know that <a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-760.pdf\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">innovation is found at the boundaries between disciplines</a>, not by narrowly focusing in one sphere.</p><h4 name=\"21e4\" id=\"21e4\" class=\"graf graf--h4 graf-after--p\">What it&#8217;s like to be a full stack&#160;employee</h4><p name=\"096f\" id=\"096f\" class=\"graf graf--p graf-after--h4\">Being a full stack employee isn&#8217;t necessarily easier or harder; it&#8217;s different. With always-on connectedness via their mobile devices, the boundaries between work and non-work blur, creating an implicit expectation that there&#8217;s never a time too late for a Slack chat or Google Hangout. This may or may not work out well. YMMV.</p><p name=\"f6d8\" id=\"f6d8\" class=\"graf graf--p graf-after--p\">With constant internet access comes constant distraction (tragically in the form of another time-wasting listicle on being more productive). And since much of their work involves slicing through thick ambiguity&#8202;&#8212;&#8202;they&#8217;re given to radical clarity in certain lifestyle choices, from adopting <a href=\"https://vimeo.com/111171647\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">monolithic, monochromatic wardrobes</a> to <a href=\"http://www.soylent.me\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">functional culinary choices</a>:</p><p class=\"aspectRatioPlaceholder-fill\"></p><a href=\"https://instagram.com/p/0VrCxnS3r2/?taken-by=soylent\" class=\"graf-imageAnchor\" rel=\"nofollow\"><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*pUZ443PNRFeJRX4p1YJWQw.jpeg\"></a><a href=\"https://instagram.com/p/0VrCxnS3r2/?taken-by=soylent\" class=\"markup--anchor markup--figure-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Photo</a> by&#160;Soylent<p name=\"039b\" id=\"039b\" class=\"graf graf--p graf-after--figure\">Being full stack is an exercise in shifting between opposite poles. While there&#8217;s often less support for individual work and a greater expectation of self-sufficiency (i.e. setting their own hours, using their own devices for work, etc), they&#8217;re also expected to collaborate and work in groups effectively. Previously, you&#8217;d have an IT manager select the technology for a large team, but with the increasing reliance on self-provided mobile devices, individuals are left to figure out how to communicate across and connect over different platforms. Indeed, <a href=\"http://slack.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Slack</a>, the winningest enterprise tool du jour, <a href=\"https://slack.com/integrations\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">integrates with everything</a>, <a href=\"http://www.economist.com/news/business/21647612-once-dominant-software-giant-determined-prove-life-begins-again-40-opening\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">opposite Microsoft&#8217;s latter-day strategy</a> of privileging its own platform over all others. These days, if you haven&#8217;t integrated with everyone else&#8217;s API, you&#8217;re already behind. And that&#8217;s true of full stack employees too&#8202;&#8212;&#8202;they must have at least passing knowledge of all the latest apps lest they fall behind and as a result, out of the loop.</p><p name=\"b7b3\" id=\"b7b3\" class=\"graf graf--p graf-after--p graf--trailing\">Yet full stack employees are expected to deeply understand their domain, but also dynamically deal with shifting priorities and expectations. While not an altogether new phenomenon, the flat nature of many organizations means that pull can come from the top or the bottom, and it&#8217;s up to the individual to prioritize one over the other. To evaluate these requests, the FSE stretch across traditional organization boundaries, while not get stretched too thin. They need to be informed about what everyone else is doing without micromanaging them, and not get uncomfortable working in roles unfamiliar to them: product manager, designer, communicator, strategist, advertiser, consultant, technologist, user advocate, marketer&#8230; et cetera and so on!</p></div>","title":"The full-stack employee – Chris Messina – Medium"}},"pageContext":{"id":"5b937b0587be056953db7d08"}}