{"data":{"mongodbDatabaseArticles":{"id":"5b95eb3487be058327490006","content":"<div><p>See the local side of Paris</p><p>Made with love by travelers for travelers! The purpose of my guides is to let you live large on a budget. I focus on activities that give you insight into the land, people, and culture.</p><strong>Updated:</strong> July 2018<br><strong>Return policy:</strong> No risk, 30 Day, 100% Money Back Guarantee<br><strong>Details:</strong> 107 pages of expert budget travel advice with maps<p>July 2018No risk, 30 Day, 100% Money Back Guarantee107 pages of expert budget travel advice with maps</p><p>Paris. It&#8217;s a city whose story has been told a thousand times over in a thousand books and movies. It looms large in our collective consciousness.</p><p>Paris is everything you imagine it to be &#8212; cultured, sophisticated, classy, romantic, beautiful, historic, and stylish. It is a place to fall in love and be in love.</p><p>But for first-timers, it can be intimidating. When should you go? What should you see? How do you get around? How do you avoid all those tourists who overwhelm the place? How do you avoid those high prices you&#8217;ve heard about?</p><p>In short, where do you begin?</p><p>It&#8217;s easy to get lost in the sea of information online, TripAdvisor information, and top-ten lists.</p><p>And not knowing where to go or what to do means losing out on having an authentic Parisian experience, away from the crowds and high priced (and terrible) tourist traps. When this happens, you miss the true magic that is Paris.</p><p>I&#8217;m always sad when I hear stories from people about how much money they spent on their visit or the sites they saw filled with crowds. Paris, a city of 2 million people, has its gems, nooks, and crannies where prices are reasonable and there isn&#8217;t a tourist in sight.</p><p>There are tons of websites dedicated to Paris, but who has time to wade through thousands and thousands of websites written by people who might not know a croissant from a baguette?</p><p>I used my near decade of personal experience and expert knowledge to write a straightforward book on how you can experience Paris the right way. This comprehensive guide features insider tips on places to eat, stay, and play. I&#8217;ll help you get off the beaten path and into the little secret spots free of tourists.</p><p><img class=\" aligncenter\" src=\"https://media.nomadicmatt.com/bookimages/httw1.jpg\" alt=\"Notre Dame cathedral in Paris, France at night time\"></p><p></p>(A very happy me in front of the Eiffel Tower)<h3>What&#8217;s in this Paris&#160;Guide?</h3><ul class=\"bullets\"><li><strong>Neighborhood information</strong> &#8211; Get the lowdown on all of Paris&#8217;s best neighborhoods: where to go and what to see, do, and eat.</li><li><strong>Suggested itineraries</strong> &#8211; Two-, three-, and five-day itineraries are included to make planning and navigating your visit as easy as possible.</li><li><strong>Budget advice</strong> &#8211; Discover money-saving tips and budget suggestions not found elsewhere, so you&#8217;ll know how to save on your upcoming trip. You&#8217;ll master the art of Paris on a budget.</li><li><strong>The best things to see and do</strong> &#8211; Explore Paris&#8217;s unique, beautiful, inexpensive, and often-overlooked sights. You&#8217;ll my obsessively curated favorites of on- and off-the-beaten-path suggestions to make your visit unique, authentic, and affordable.</li><li><strong>A history of Paris</strong> &#8211; Learn about how Paris became the city it is today. Paris&#8217;s history is exciting and integral to understanding it in the present day.</li><li><strong>Accommodation suggestions</strong> &#8211; You&#8217;ll find a list of my favorite, unique budget-friendly places to stay so you can avoid Paris&#8217;s famous high prices.</li><li><strong>Nightlife tips</strong> &#8211; Get away from all the tourists and hang out with locals by using my robust list of wine bars, lounges, pubs, cocktail bars, and nightclubs. I like to go out &#8212; and that works in your favor!</li><li><strong>Restaurant suggestions</strong> &#8211; You&#8217;ll get suggestions of my personal favorite places to eat in the city &#8211; from tiny cafes to markets, to brasseries, and everything in between. I&#8217;m a huge foodie, so I know exactly where to direct you for a delicious, budget-friendly meal.</li><li><strong>Transportation advice</strong> &#8211; With maps and detailed information, get all the cheapest routes and options to get around Paris like a local.</li><li><strong>Practical information </strong>&#8211; Get the essential tips that make guidebooks so useful, with information on tipping, visas, public holidays, embassies, currencies, emergency numbers, working hours, weather, and much, much more.</li><li><strong>Related books and movies </strong>&#8211; Get inspired for your trip with these incredible books and movies about the City of Lights!</li><li><strong>Maps </strong>&#8211; Get detailed maps of the entire city with suggested routes so you never get lost!</li></ul><p>&#160;</p><h2>Plan Your Paris Adventure Today!</h2><p class=\"one-third first\"><strong>eBook PDF</strong><br><p>Instant Download</p></p><p class=\"one-third\"><strong><p>$5.99</p></strong></p><a class=\"book-buy\" href=\"https://www.nomadicmatt.com/cart/?add-to-cart=45218\">Download eBook</a><p class=\"one-third first\"><strong>Kindle</strong><br><p>Buy from Amazon</p></p><p class=\"one-third\"><strong><p>$5.99</p></strong></p><a class=\"book-buy\" href=\"https://www.amazon.com/dp/B07G3KFBYQ\" target=\"_blank\">Download Kindle</a><p>Get this guidebook for your Kindle or as a PDF to read on any device AND be able to access it on the road. This book will help you navigate Paris like a local, avoid the crowds, and save money so you can travel cheaper, better, and smarter!</p><p>&#160;</p><h3>What Readers Are Saying About This Book</h3><p><img class=\"headshot-right\" src=\"https://www.nomadicmatt.com/wp-content/uploads/2016/07/shannon.jpg\">&#8220;I only had five days in Paris and wanted to make each one count. This guide was brilliant in breaking down each arrondissement so I could eat and explore the areas most suited to my travel style and budget. Matt&#8217;s suggested itineraries and personal recommendations were a huge time saver for me. I will definitely be using more of his guides for my upcoming trips!&#8221; &#8211; Shannon</p><h3>F.A.Q.</h3><p><strong>What makes your guide different? </strong>It caters to budget travelers and helps those previously discouraged by financial budgets to make their travel dreams come true. In addition, all of the information included in this guide is from first-hand experience by a professional nomad and best-selling author.</p><p><strong>What makes you an expert on Paris? </strong> I&#8217;ve been to Paris over a dozen times and run tours to the city each year. I know the city like the back of my hand. All of the recommendations in this guide are my personal favorite places to go, see, eat, and drink.</p><p><strong>What&#8217;s the difference between this guide and the information on this site? </strong>While the website has a lot of good information on Paris, it doesn&#8217;t offer specific accommodation, restaurant, bar recommendations, neighborhood information, itineraries, and extensive money saving tips. It doesn&#8217;t give any sort of background on the history of Paris, tell you anything about the culture there, or go over important information like customs, laws, visa, and emergency information. This 80-page guidebook goes into way more detail than a couple thousand word blog posts can!</p><p><strong>How frequently are these guides updated? </strong>These comprehensive guides are updated yearly to include the most up-to-date information.</p><p><strong>How will this save me money? </strong>This guide was written for budget travelers by a budget traveler. It includes cheaper options for food, activities, and accommodation, as well as tips to save money while still having a high-quality travel experience.</p><p><strong>Is this guide available in print? </strong>No, it is only available as an e-book (for PDF or Kindle).</p><p><strong>Are there coupons inside? </strong>Unfortunately, there are not. However, there are plenty of tips included to help you save money!</p><p><strong>If I have any questions or concerns, can I contact you? </strong>Of course! You can contact me via email anytime: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\">[email&#160;protected]</a></p><p><a href=\"https://www.nomadicmatt.com/cart/?add-to-cart=45218\"><img src=\"https://media.nomadicmatt.com/instantaccessbutton.png\" alt=\"get access now\"></a></p><p><strong>Going somewhere else? </strong>Check out my other detailed guides to <a href=\"https://www.nomadicmatt.com/books/new-york-city-guide/\">New York City</a>, <a href=\"https://www.nomadicmatt.com/books/hong-kong-guide/\">Hong Kong</a>, <a href=\"https://www.nomadicmatt.com/books/bangkok-guide/\">Bangkok</a>, <a href=\"https://www.nomadicmatt.com/books/stockholm-guide/\">Stockholm</a>, <a href=\"https://www.nomadicmatt.com/books/amsterdam-guide/\">Amsterdam</a>, <a href=\"https://www.nomadicmatt.com/books/virgin-islands-guide/\">the Virgin Islands</a>, and <a href=\"https://www.nomadicmatt.com/nomadic-matts-guide-thailand-c/\">Thailand</a>.<br> </p></div>","title":"Nomadic Matt's Guide to Paris"}},"pageContext":{"id":"5b95eb3487be058327490006"}}