{"data":{"mongodbDatabaseArticles":{"id":"5b962a0c87be0583274911cd","content":"<div><p>For my American readers who may not even know what a SIM card is, you should know other countries do not have cell phone plans like ours! Getting a local SIM card in India and having access to the internet will make your trip WAY easier and less stressful. In the US your phone number comes from your provider (for most other than AT&amp;T and possibly T-mobile) and you can switch phones with them and keep that number. There is no &#8220;card&#8221; in the phone that you take out and switch between phones. This is slowly changing, but it could be that you&#8217;ve never seen a SIM card and don&#8217;t have a SIM card slot in your smartphone.</p><h1>Buy a Local SIM Card in India</h1><p>In most other countries, you buy a SIM card that you can put in any phone you want and you can refill with &#8220;Talktime&#8221; as you please.</p><p>The perfect thing about SIM cards is, they are CHEAP, at about a dollar or less a piece. Some places give them out free, and some make it a little harder to get. You add minutes and then don&#8217;t have to worry about roaming or not having 3G abroad. The Indian government has started giving SIM&#8217;s to travelers on the e-visa (30 days or less) but apparently they are loaded with just 50 Rs. are nearly impossible to recharge, according to blog readers who have gotten in touch with me.</p><blockquote><p><strong>In this article, I&#8217;m going to share how to get a SIM card in India. Then because you&#8217;ll see it&#8217;s not always easy breezy, I&#8217;m going to share the more expensive but super easy way to get connected, which is called Trabug. If you would rather take the easy route, don&#8217;t read past this and just <a href=\"http://www.trabug.com/?utm_source=hippieinheels&amp;utm_medium=affiliate&amp;utm_campaign=travelphone&amp;pref=0b72106e-1f92-4170-9163-363bc09261f7\" target=\"_blank\" rel=\"noopener noreferrer\">click over to their website</a>.&#160;</strong></p></blockquote><h1><b>Getting a SIM Card in India &amp; How to Stay Connected to the Internet in India</b></h1><p>They change the rules on how to get a SIM card in India often, but as of now, you can get one as a foreigner as long as you have an address to list.</p><p>First, you need a phone with a SIM slot. Sadly, this is why I can&#8217;t use my iPhone except for with Wi-Fi while abroad. You can buy a phone on Amazon and I&#8217;ll link some great cheap options below. Go to anywhere in India that sells &#8220;recharge&#8221; and ask to buy a SIM. Some places won&#8217;t have one. You&#8217;ll have to shop around. Sometimes they&#8217;ll give you a &#8220;recycled SIM&#8221; which isn&#8217;t a big deal; you&#8217;ll just get a lot of calls from strangers. Some airports sell SIM cards at arrivals but ususally they will have a little bit of a higher price. The best plan for buying the SIM is going directly to the authentic shop that you are buying from rather than buy from a reseller.</p><p><img class=\"aligncenter wp-image-3876\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/IMG_4463.jpg?resize=560%2C419&amp;ssl=1\" alt=\"backpackers sim card in india\" width=\"560\" height=\"419\"></p><blockquote><h4>Take a copy of your passport and a 2&#215;2 photograph. Go somewhere that is either suggested by someone local, or at least somewhere that looks popular.&#160;If they don&#8217;t ask for paperwork, passport information, or a 2&#215;2, <p>they aren&#8217;t planning on submitting</p> anything and your SIM will work until the company realizes someone is using it and turns it off. Go somewhere else!</h4></blockquote><p>Basically, the company is supposed to check the address and phone number you list, call and see if you really are there. This is why it&#8217;s so hard for foreigners to get SIM&#8217;s that last, and why three of mine have been turned off after a couple of weeks, even one that I bought IN THE MAIN OFFICE of Vodafone. It&#8217;s one of the <a title=\"WARNING: 20 Common Tourist Scams in India\" href=\"https://hippie-inheels.com/common-tourist-scams-in-india/\" target=\"_blank\" rel=\"noopener noreferrer\">many scams of India</a>&#160;in my opinion.</p><h2>The easiest way to stay connected in India via phone and the internet:</h2><blockquote><h4>Sometimes it&#8217;s worth paying a little extra to have this all sorted, though, because India can be stressful enough without dealing with SIM card problems!</h4></blockquote><p>Your other option is called <a href=\"http://www.trabug.com/?utm_source=hippieinheels&amp;utm_medium=affiliate&amp;utm_campaign=travelphone&amp;pref=0b72106e-1f92-4170-9163-363bc09261f7\">Trabug</a>. It&#8217;s a phone specifically for tourists coming to India. It has super fast 4G and you simply tell them the hotel you are staying at. They ship the phone to your hotel and it&#8217;s waiting there for you when you arrive!</p><p></p><p>If you watched the video, it explains most of how this phone works. I have contacted the company with a few questions I had about this. In my four + years living in India, I haven&#8217;t found a product or company similar to this.</p><ol><li>Can you add apps to this phone? No. It has all the popular apps and if there are others you want, you can tell them ahead of time and they will add them. I suggest adding the train booking website app and a currency converter if it&#8217;s not already there.</li><li>Can you hotspot the WiFi to share with friends or use your laptop? Yes. You can connect to 5 devices. This means that if you are traveling with a friend, you can split the cost. If you have 5 friends, this would be the BEST option for internet in India, even cheaper than a SIM. It&#8217;s high speed 4G, so the speed will be fast even if others share this. Just make sure to charge it every night.</li><li>Why don&#8217;t they just send the SIM card? &#8220;We provide a Smartphone along with the SIM to ensure that there are no issues with band compatibility, carrier locks or provider settings. Our smartphone will connect to 4G networks across India wherever available.&#8221;</li></ol><p>The phone is loaded with India travel tips! &#8220;At Trabug, our goal is to make travel easy. We have curated the best places to eat, shop or explore and integrated services like finding an ATM, getting walking directions, booking taxis, changing currency, listening to audio guided tours and more.&#8221; They have apps for all things India to help you travel. It&#8217;s like having a guide book in the phone.</p><h3>Pricing for Trabug phone</h3><p>There are a variety of plans. In my opinion, the &#8220;Eco&#8221; plan is not going to give you enough data with less than 1 GB offered. The second higher plan &#8220;Flexi&#8221; certainly will if you are using it just to make bookings online and check in with family occasionally. It has 4 GB. But, if you want to watch YouTube or stream anything, or are very active on social media, the &#8220;Power&#8221; plan might be necessary.</p><p>Plans start at $9.99 and go up from there. Then you add extra days on at $1 per day. Compared to WiFi devices I&#8217;ve reviewed like TEP, SkyRoam, and RoamingMan, this is 90% less expensive as they charge upwards of $10 per day.</p><p>Let&#8217;s say you wanted the full power plan, which offers pretty much unlimited calls and data + loads of International call time. Let&#8217;s say you are in India for 1 month. That would be a total cost of $62.99.</p><p>If you had to buy an unlocked phone to use in India anyway, then this is going to come out cheaper.</p><p>Other things you need to know about Trabug:</p><ul><li>They charge a fee that is refunded to you once you return the phone, so don&#8217;t lose it. It&#8217;s $65.</li><li>Incoming calls are free. There is a return bag in the packaging so you can send it back for without postal charges.</li><li>Plans cannot be greater than 80 days.&#160;If you are traveling longer, they will work something out with you; just email them.</li><li>If you want a phone from Trabug and<a href=\"http://www.trabug.com/?utm_source=hippieinheels&amp;utm_medium=affiliate&amp;utm_campaign=travelphone&amp;pref=0b72106e-1f92-4170-9163-363bc09261f7\"> use this link</a>, I get a small commission. As always, I never promote something I wouldn&#8217;t recommend to a friend and this is 100% what I would make my friends and family do. I remember the struggle of getting a SIM as a backpacker here and how Vodafone cut me off over 3 times. The SIM would go inactive after I would add $10 of recharge to it. It wasted a lot of money. Of course, if everything worked out well getting a SIM that is a best option, but it doesn&#8217;t always work that way and this is more fail proof.</li><li>You can cancel the booking without 6 days of your start date for a full refund. If you try it and within 24 hours tell them you don&#8217;t like the phone, you can get a full refund also.</li></ul><h2>If You Do Want to Buy a SIM &amp; not get Trabug: Cheap phones to buy in the USA and take to India</h2><p>You can buy phones in India but phones are not cheaper here than the US. The cheap ones are 40 USD at least and that&#8217;s for a piece of crap Nokia that&#8217;s text and call only. It&#8217;s better to bring a cheap one from home that has WiFi options as well. iPhone and Samsung are far more expensive in India than the US.I have been told AT&amp;T and T-Mobile will unlock a phone for you and even come with SIM cards.&#160;Also that T-Mobile has a new international plan with no roaming charge.</p><p><br> &#160;<br>  <br> </p><p>I&#8217;ve linked three phones here that Ben (my very techy boyfriend) and I have researched and think are great buys which are unlocked and ready to use internationally. I was surprised how hard they were to find! I couldn&#8217;t find an iPhone 5C that was unlocked for&#160;international use, only US use. So these might just be your best bet! It beats buying one when you get to India and if for some reason you weren&#8217;t satisfied you could return, whereas no shop in India will give you your money back if they sell you a bad phone.</p><ul><li><strong>Additional India Reading: <a href=\"https://hippie-inheels.com/backpacking-india-budget-1200-rupees-per-day/\">how to budget less than $20 a day</a></strong></li></ul><h2><b>Costs of Indian SIM Cards for Foreigners</b></h2><p>Your SIM shouldn&#8217;t be more than Rs 150 at baseline.</p><p>I use IDEA now, so will use that as an example. You need to check which has good reception in your area. If you buy a SIM in Rajasthan, you will be roaming in Goa. For this reason, it&#8217;s best not to load the phone up too much on pre-pay and purchase a new SIM card in Goa, for example, if you&#8217;re going to be in a month of each spot. This will work if you aren&#8217;t giving this number out, but just using it for bookings and calling home.</p><p>Because I live here now I put Rs 500 at a time &#8220;full talk-time&#8221;, but as a tourist, you can put 100 or 200 and be okay. You can add more anytime you like. There are shops on every corner. You will get a confirmation text when the credit has been added so stay at the shop until you get that text.</p><p>Don&#8217;t use that as your data or it will be gone in 10 minutes. Buy a data plan. With IDEA, I get 1 GB for Rs 249. Make sure you tell the clerk exactly how much, don&#8217;t say Rs 250 because when they text it through to credit your phone it won&#8217;t work properly. There are posters to help you. I use the internet a lot and 1 GB usually lasts me about 2 weeks.</p><p><img class=\"aligncenter wp-image-3879\" title=\"backpackers sim card in india\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-04-01-at-7.12.13-PM.jpg?resize=503%2C421&amp;ssl=1\" alt=\"backpackers sim card in india\" width=\"503\" height=\"421\"></p><p>So in conclusion, you can buy a cheap phone to take and pay 4 or 5 bucks in talk credit which will last a couple of weeks if calling in India. If you want 3G, you can pay about 5 bucks for at least two weeks of Facebook messaging and such. Then you never need an Internet Cafe and don&#8217;t have to worry about finding a place for lunch that has WiFi.</p><p>SIM cards can expire, depending on the country. My SIM in Thailand was only a 30 day SIM, but my card in India will last indefinitely as it was properly registered.</p><p>For a pricing example, to call abroad from a local SIM, I paid Rs 5 per international text (while it&#8217;s only Rs 1 for local). Usually, after about a 15-minute outgoing phone call to the U.S I would be charged Rs. 40. When I&#8217;m not in 3G signal I just call home (US) from my cell and it&#8217;s obviously super cheap.</p><blockquote><p>BY THE WAY: Coming to India soon? Don&#8217;t make the mistake of not having your visa or thinking you can get it on arrival. You can&#8217;t! You need to have it ahead of time. Search on <a href=\"https://www.ivisa.com/india-visa-application?utm_source=hippie_inheels\">iVisa</a> to see what type of visa you need.</p></blockquote><h2>Which is the best SIM card in India?</h2><p>It&#8217;s honestly hard to say because it depends so heavily on the area. For example, IDEA was non-existent in some areas of NE India, but works great in Mysore for me. It&#8217;s all dependent on the area and it&#8217;s very cheap to change SIM&#8217;s if necessary so don&#8217;t worry too much if yours doesn&#8217;t work well at first.</p><p>Now that I&#8217;ve traveled with a phone and Internet, I don&#8217;t think I could go back to finding Internet cafes and paying outrageous amounts of money for them. You save money getting a SIM card and it gives you more freedom to call when and where you want or to let hotels call you back with openings or whatever you need. It ended up being cheaper than paying Internet caf&#233;&#8217;s in combination with Skype charges.</p><p>I used my number on fliers asking for a ride share from McLeod Ganj to Amritsar and got loads of calls to share rides and saving me lots of money and time! You&#8217;ll also have access to maps, feel safer, give your number to a cute boy, and be able to look up the name of that song you know the lyrics to but can&#8217;t remember!</p><p><img class=\"aligncenter wp-image-3864\" title=\"backpackers sim card in india\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Scams-and-SIM.jpg?resize=560%2C315&amp;ssl=1\" alt=\"backpackers sim card in india\" width=\"560\" height=\"315\"></p><p>Just like you can get SIM cards in India, I bought one in Thailand, Sri Lanka, etc and can do so almost anywhere in the world! Having a SIM card for India travel was serious trip-changing (for the better, obviously!).</p><p><strong>Bonus Tip</strong> if you have Verizon: You can suspend you phone bill while you&#8217;re out of the country, it will just extend you contract. You can do this up to six months at a time, two times.</p><p><strong>Double Bonus TIP!</strong> If your phone is a 2G/3G phone you have to text whatever code your carrier says to basically request them to turn on 3G! Same goes for a 3G/4G phone. It won&#8217;t happen automatically. For example, for 4 months I thought 3G didn&#8217;t work on my phone until someone told me to text &#8220;ACT3G to 12345&#8221; and boom, fast internet! Also, if you have talktime but no data, there are codes to convert your talktime to data :)</p><p>For me, I have an unlocked phone now, so I buy SIM cards sometimes. Other times, I use WiFi devices if I am changing countries often. For India, if you are coming (especially for the first time) I think <a href=\"http://www.trabug.com/?utm_source=hippieinheels&amp;utm_medium=affiliate&amp;utm_campaign=travelphone&amp;pref=0b72106e-1f92-4170-9163-363bc09261f7\">Trabug</a> is the easiest and most reliable option, although it does cost more.</p><blockquote><p>PS: Coming to Goa? I wrote a 170-page ebook the Insider&#8217;s Guide to Goa which you can <a href=\"https://gum.co/kzNQX\">buy with this link</a>. It&#8217;s all my secrets to make sure you have the BEST time here.</p></blockquote><p>Other than having a phone and SIM card in line for India, the next most important thing when thinking about planning your trip to India is having travel insurance. I use World Nomads. I have never had to make a claim, but feel so much more confident being covered. Read more about <a href=\"https://hippie-inheels.com/should-i-get-travel-health-insurance/\" target=\"_blank\" rel=\"noopener noreferrer\">my views on travel insurance</a> through that link if you want. I&#8217;ll add a quote box here so you can see just how affordable it is.</p><p id=\"wn-insurance-quote-editor\"></p><p>Heading to India on a big once in a lifetime trip? Don&#8217;t forget to get my India Guide ebook, which has 6 years of India travel all wrapped up into the perfect guide to India &#8211; it covers everything from preparing with health, visas, and WiFi, but itineraries with custom maps, experiences, monuments, and things to do, places to eat, etc in each place I recommend in the book! <a href=\"https://hippie-inheels.com/guide-to-india-ebook/\">Check it out here</a>.</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Save Yourself Hassle: Buy a Local SIM Card in India"}},"pageContext":{"id":"5b962a0c87be0583274911cd"}}