{"data":{"mongodbDatabaseArticles":{"id":"5b9248da87be056953db7c02","content":"<div><p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/09/512x.jpg\" width=\"100%\"> <p>In the last week, Charlene deGuzman's video <a href=\"http://www.youtube.com/watch?v=OINa46HeWg8\">\"I Forgot My Phone\"</a> has received much attention showing us a mirror of our abusive behaviour with smartphones. The New York Times wrote a piece on it aptly describing how we are now <a href=\"http://bits.blogs.nytimes.com/2013/09/01/disruptions-more-connected-yet-more-alone/\">\"More Connected, Yet More Alone\"</a>.</p> <p>But are we?</p> <p>It has happened before that we criticised new inventions for making us less social. When the television was adopted in the 1950s, the same perceptions arose. The television supposedly isolated us and we communicated less with each other.</p> <p>But did it?</p> <p>It might have, but it also connected us in ways that were unimaginable before. A decade after the introduction, the world could watch how we landed on the moon. In the 1960s, the Vietnam War was the first <a href=\"http://www.jstor.org/discover/10.2307/20024822?uid=3739136&amp;uid=2&amp;uid=4&amp;sid=21102615334423\">\"Television War\"</a> displaying live moving pictures from a war America fought. Moving pictures that directly influenced the public's negative perception and the course of the war.</p> <p>The effects of disruptive technology that connects us more (like the printing press, radio, television and the internet) have always been extremely cultural: it directly influences the behavior of the generation that grows up with them. And that's what we're seeing right now with the current Generation Z &#8212; those that grew up with smartphones and the internet. They are connected to the internet and the smartphone is the tool to make this possible. And they're behaving differently because of it.</p> <p>The reason we're calling this behavior abusive is because it directly clashes with the traditional means of social interaction. Activities like talking to people face-to-face, having dinner with your family and even sleeping with someone now have to compete for attention with the latest and greatest media that flows into your smartphone. This media &#8212; be it breaking news, videos of <a href=\"http://www.youtube.com/watch?v=0Bmhjf0rKe8\">cute kittens</a> or <a href=\"http://instagram.com/badgalriri\">semi-naked selfies of Rihanna</a> &#8212; is because it has risen to the top of the worldwide internet, infinitely more entertaining than the person that you are with. Most interactions with people will simply not be as interesting as the concentrated bite-sized media that is available on a smartphone. People take time to get to the point and unless you haven't seen a person for a long time, you probably know most of what they're about already.</p> <p>It's irrelevant for me to make a judgement on if this behavior is good or bad. I think it's happening and it's only going to increase happening. And for good reason. Location is increasingly becoming less relevant for social interaction as we are having increased instant social interactions with people worldwide. Over half of the people I chat to on my smartphone are on the other side of the world and it does not make our relationships any less valuable. Smartphones and the internet will actually enable us to get in touch with people that we match more in terms of personality and subculture. Why would the people physically around you necessarily be the people you'd enjoy most to communicate with, or be with, for that matter?</p> <p>Without anyone blatantly noticing it, the internet has now become the first widely adopted virtual reality world. Smartphones are just the wrong means to consume this world. Wearable computing (like <a href=\"http://www.google.com/glass\">Google Glass</a> or <a href=\"//en.wikipedia.org/wiki/Bionic_contact_lens\">bionic contact lenses</a>) will bring us a step closer. Yet only if we can directly let the brain interact with the internet will we have reached the full manifestation of this new way to experience life. Using <a href=\"http://online.wsj.com/article/SB10001424052702303640104577436601227923924.html\">bionic brain implants</a> will allow us to communicate to people on the other side of the world in private thoughts and emotions, by using the internet.</p> <p>From that moment on, many of us always be connected to the collective stream of information and we will most probably lose a lot of our individuality since our sources of information will converge to those on the internet. A global consciousness will start developing, a lot like the internet represents now with its memes but with more far-reaching impact. It will transform our experience of life will to become almost completely disconnected from our local physical reality. Sounds familiar? That's because it's pretty much we're already doing with our smartphones now. Most of us are interacting with a virtual reality for almost every waking hour already. We're just not completely transitioned to a full virtual world yet. We're stuck in the middle. And that's why we're all so annoyed about it.</p> <p>Ignoring your fellow human-beings while looking down on your smartphone may be rude, but it's just the early beginnings of a global interconnected consciousness.</p> <p>Update: looks like I'm not <a href=\"http://www.futuretimeline.net/23rdcentury/2200-2249.htm#world-in-2200\">the only one thinking this</a>.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"A Culture of Distraction is Not The Problem"}},"pageContext":{"id":"5b9248da87be056953db7c02"}}