{"data":{"mongodbDatabaseArticles":{"id":"5b96298e87be058327491198","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Kathmandu</h1><p class=\"p1\"><b><i>Tell us a little about yourself and tell us why you&#8217;re an expert on luxury travel in Kathmandu.</i></b></p><p class=\"p1\">My name is Elen, I&#8217;m an editor and writer who has just moved back to Kathmandu, Nepal. I lived here for almost a year in 2013-14, travelled here for five weeks in 2015, and have set up home here again recently&#8212;the joys of having location-independent work! South Asia is my favourite region of the world. Despite Kathmandu&#8217;s general dirtiness and apparent chaos, I love its atmosphere. The people are friendly and chilled out, and I&#8217;m always discovering new hidden corners of beauty and surprise.</p><p class=\"p1\">My blog, <a href=\"http://www.wildernessmetropolis.com/\">Wilderness Metropolis</a>, focuses on travel in South Asia.</p><p class=\"p1\"><b><i>What makes Kathmandu a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p1\">Nepal isn&#8217;t widely known as a luxury travel destination, but there plenty of high-end hotels, resorts, spas and boutiques around the country&#8212;and particularly in Kathmandu&#8212;to attract travellers who like a bit of luxury. Although Nepal is often overshadowed by its dominant neighbor India, Kathmandu is really very different from any Indian cities. Luxury hotels and other experiences are uniquely Nepali in design and flavor.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13063\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/Baber-Mahal-Revisited-bronze-sculpture.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Kathmandu\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>What 5 star hotel is the best in Kathmandu?</i></b></p><p class=\"p1\"><strong><a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/http://www.hotelscombined.com/Hotel/Dwarikas_Hotel.htm\" target=\"_blank\" rel=\"noopener\">Dwarika&#8217;s Hotel</a></strong>, without a doubt. This 80+ room hotel was begun in the 1960s by Dwarika Das Shrestha, a local man who saw a lot of the Kathmandu Valley&#8217;s traditional Newari architectural heritage being destroyed through neglect. He started collecting artefacts such as window frames and intricate carvings, and promoted the traditional production of various handicrafts. Now, Dwarika&#8217;s Hotel looks like a beautiful Newari palace&#8212;such as those found in the Kathmandu or Patan Durbar Squares&#8212;and the enormous rooms are each different, and filled with antiques and other one-off, local touches. Although it is a 5-star hotel, there is nothing generic about it. </p><p class=\"p1\"><b><i>What about boutique hotels in Kathmandu, of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p1\">For a small, homely atmosphere, I recommend <strong><a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/http://www.hotelscombined.com/Hotel/Traditional_Homes_Swotha.htm\" target=\"_blank\" rel=\"noopener\">Swotha Bed &amp; Breakfast</a></strong> in Patan. This part of the city doesn&#8217;t have as many hotels as Kathmandu-proper, so is much quieter at night and more intimate. Swotha Bed &amp; Breakfast is tucked down a lane just off Swotha Square, which used to be identifiable by its small temple, but which unfortunately fell down in the earthquake of April 2015. It&#8217;s not far from the main Patan Durbar Square and some lovely art, jewellery and crafts shops. The caf&#233; downstairs, Caf&#233; Swotha, is also my favourite place to take my laptop and write.</p><p class=\"p1\"><b><i>Are there any fun activities for the adventurous traveler in Kathmandu?</i></b></p><p class=\"p1\">Nepal is all about adventure travel, but you don&#8217;t have to go far outside Kathmandu to enjoy this. Many tour companies&#8212;which are concentrated in the Thamel district of Kathmandu&#8212;arrange day hikes to spots within the Kathmandu Valley. The Shivapuri Nagarjun National Park or Phulchoki, the highest peak of the Valley, are manageable day hikes for a bit of fresh(er) air and exercise.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13064\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/Dwarika27s.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Kathmandu\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Where are the best hangouts during the day in Kathmandu?</i></b></p><p class=\"p1\">In Patan, the Patan Museum and Patan Durbar Square cannot be topped. You can first take a look around the museum to learn about the religious and architectural history of the Kathmandu Valley, then sit in the shade of one of the temples outside to contextualize what you&#8217;ve learnt. And the peaceful courtyard restaurant out the back of the museum does excellent <i>dal bhat.</i></p><p class=\"p1\">In Kathmandu, the Garden of Dreams is a surprising respite from the overly touristy Thamel district. It is a beautifully landscaped garden with trimmed lawns, fountains, flowers and nooks and crannies to hide away in with a book.</p><p class=\"p1\"><b><i>If you have a big date night, what are the most delicious restaurants in Kathmandu and what are their best dishes?</i></b></p><p class=\"p1\">Although you wouldn&#8217;t have thought that you&#8217;d come to Kathmandu for the French food, everyone raves about Chez Caroline, in the Baber Mahal Revisited complex. It&#8217;s the hangout of French expats, so you know it must be authentic. Everything there is perfect, from the set-course weekend brunches to the cr&#232;me caramel. You will not make a bad choice. And because you wouldn&#8217;t want to forget that you&#8217;re in Kathmandu, Chez Caroline is set within a courtyard of a renovated old palace. The brickwork and bronze sculptures are among the most beautiful and authentically Nepali that you will find anywhere in Kathmandu.</p><p class=\"p1\">The Baber Mahal Revisited complex is tucked a bit out of the way, so takes a little effort to get to (although it&#8217;s worth it!) From wherever you&#8217;re staying in Kathmandu, it will be a short taxi-ride away, so it is worth planning spending a leisurely lunch or dinner here.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13066\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/PA107683.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Kathmandu\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Tell us all the hot shopping spots in Kathmandu.</i></b></p><p class=\"p1\">The best things to buy in Kathmandu are the handicrafts (especially made out of paper, bronze and cashmere), Tibetan paintings and silver jewellery. Although you can buy almost anything in Thamel, it is overly touristy and the shopping experience isn&#8217;t the most luxurious. A better plan is to combine lunch at Chez Caroline (above) with window-shopping the upmarket boutiques also in the Baber Mahal complex. Check out the prices and quality of items there, although I wouldn&#8217;t recommend buying anything there. The better-value, better-variety fair-trade shops along Pulchowk Road in Patan are what you should aim for to buy a variety of handicrafts, from pashmina shawls to brass singing bowls. </p><p class=\"p1\">For jewellery and Tibetan thangka paintings, the lanes of old Patan, near the Patan Durbar Square, are a treat. The best jewellery can be found in the smallest shops, tucked behind blue and green shutters, and probably not very well lit. You will need to bargain, but nobody pushes the hard sell here, so the shopping experience is fun and memorably Kathmandu.</p><p class=\"p1\"><b><i>What is the best salon or spa in Kathmandu?</i></b></p><p class=\"p1\">The luxury hotels provide good massage and spa services, but my favourite is Wellness Spa, above Caf&#233; Cheeno in Patan. It can be found easily because it&#8217;s on the corner by the bus stand, before you go through the Patan gate. Wellness Spa is understated, but has a loyal following of expat clients.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-13067\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/sunset-over-himalayas.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Kathmandu\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Time for a great sunset view in Kathmandu&#8230; where would you go?</i></b></p><p class=\"p1\">The sun sets early in Kathmandu, year-round. But if you&#8217;re lucky (and in town during the right season) the mountains will come out on display in the late afternoon and early evening, around sun-set. The best place to catch this is from a rooftop bar, such as Mezze by Roadhouse, on Durbar Marg. Overlooking the old Narayanhiti Palace, if the conditions are right, this upmarket bar is <i>the </i>place to catch a perfect Himalayan sunset.</p><p class=\"p1\"><b><i>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks.</i></b></p><p class=\"p1\">Kathmandu is not known for its classy bars, I&#8217;m afraid, but you can definitely have a lot of fun in the city if you like dancing or loud live music. If you&#8217;ve watched the pink glow of sunset fade over the snow-capped Himalayas at Mezze by Roadhouse, stay there for a little while before walking over to Thamel and taking a seat in any number of traveller-oriented bars. As long as it&#8217;s before 11.30pm, when everything has to shut!</p><p class=\"p1\"><img class=\"alignleft wp-image-13066 size-thumbnail\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/PA107683.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury Guide to Kathmandu\" width=\"150\" height=\"150\">Elen Turner is a Kathmandu-based editor and writer with a passion for South Asia, especially Nepal and India. Highlights of her travels around Nepal include a helicopter ride from Everest Base Camp to Kathmandu, and rhino-spotting in the Chitwan National Park. She blogs about her travels at <a href=\"http://www.wildernessmetropolis.com\">www.wildernessmetropolis.com</a>. Connect with her on <a href=\"https://www.facebook.com/wildernessmetropolis/?ref=aymt_homepage_panel\" target=\"_blank\" rel=\"noopener\">Facebook</a>, <a href=\"https://twitter.com/ElenTurner\" target=\"_blank\" rel=\"noopener\">Twitter</a>, and <a href=\"https://www.instagram.com/eleninthewilderness/\" target=\"_blank\" rel=\"noopener\">Instagram</a>.&#160;</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Kathmandu"}},"pageContext":{"id":"5b96298e87be058327491198"}}