{"data":{"mongodbDatabaseArticles":{"id":"5b9629f687be0583274911c8","content":"<div><p>I have been a big fan of Kiwi.com for years now, writing about it several times and never sponsored by them but just showing you ways that I use them to save on flights. I get newsletters from them and a recent one said they had a new &#8220;nomad&#8221; tool. The Kiwi nomad tool is the coolest thing I&#8217;ve seen for travel this year and I had to share it with you because it&#8217;s definitely&#160;the cheapest way to&#160;find multicity flights that I&#8217;ve found.</p><p>If you want to know more about why I love Kiwi, you can check out these posts:</p><p>To sum up what Kiwi does: they look for the cheapest way to get from point A to point B and do not only use &#8220;code shares&#8221; which would mean that if I went from New York to Paris, I might stop in London. A normal booking site like CheapOair&#160;(who I also love) or Google flights will only look for code-shares like flying American Airlines NY to London then a partner of theirs from London to Paris, like British Airways. What Kiwi will do is get that flight from NY to London on whatever airline is cheapest, then find a budget European flight from London to Paris that isn&#8217;t necessarily a partner of your first flight (aka Ryanair, EasyJet, etc). That would be you have to re-check in and it&#8217;s basically like taking a totally new flight. But, don&#8217;t fret &#8211; if you are delayed and miss that second flight, Kiwi has a policy to re-book you on another flight on whatever airline is leaving next, for free. It works as I&#8217;ve had to do it and they re-booked me with no hassle. If you were to book yourself on a NY to London flight on say, Google Flights or Expedia, then go to the Ryanair site and book a budget flight on to Paris, there is no safety net there if you miss that connection. THAT is why I love Kiwi! When isn&#8217;t Kiwi great? When you need a visa at the place of the layover or when you have a lot of luggage as you do have to check in as if it&#8217;s a new flight.</p><p>Okay, so moving on to the point of this post!</p><h2>Kiwi&#8217;s Nomad Tool: the new cheapest way to find multicity flights</h2><p>So in the past, I&#8217;ve written about how you can use Kiwi.com&#8217;s multicity tool to fly to a bunch of cities in one booking, super cheap. I linked to them above: 9 cities in Europe for $355 and 7 cities in India for under $200. I showed how you can basically put in your starting point and use their tool to go all around the place you want to visit at the cheapest way possible. If you haven&#8217;t read those, check it out as it kind of is something you need to understand before you read on.</p><p>All flight booking websites these days have multicity tools. Kiwi&#8217;s is unique because again, it doesn&#8217;t use code-shares and finds all the budget airlines.</p><p>This NEW tool, the &#8220;nomad&#8221; tool does something different and takes that multicity price down even lower. You can read about it here on <a href=\"https://www.kiwi.com/stories/kiwi-com-revolutionises-multi-city-travel-with-nomad/\">their website</a>&#160;where they show how their multicity tool got a low price of 442 Euros forPrague to London, Stockholm, Pari, and Rome. But when adding in the nomad feature, the price went down to 276 Euro.</p><h3>What Nomad does is let you put in all the places you want to go and how many days you want to spend in each place. Hit the Nomad button and let their program do it&#8217;s magic.</h3><p>No more figuring out which order to go in to get the cheapest flights and doing from point A to B to C, etc. You can just put in all the places you want to go, use their tool, and know that you are getting the cheapest flights &#8211; if you are flexible enough to travel in any random order between cities. It basically made the multicity tool even better. I know it seems like I work for Kiwi, but I don&#8217;t, haha! I am an affiliate of them but to be honest, they pay me a lot less than if I were an affiliate of Expedia or Kayak, but Kiwi is what I actually use.</p><blockquote><p>&#8220;Using its powerful algorithms and proprietary data, Kiwi.com is able to search for the cheapest route possible between cities on the dates that a&#160;traveller wants to leave and return. No longer will people be flicking through tabs for hours trying to find the perfect adventure.&#8221;</p></blockquote><p>They explain it like this: &#8220;The traveling salesman must travel between a&#160;number of different cities, but doesn&#8217;t care about the order in which he does so. He just wants to find the most efficient way to visit each one. If the salesman is visiting 10 different cities, there are 180,000 different combinations of journeys that must be checked to find the most efficient route.&#8221;</p><p><img class=\"alignnone size-full wp-image-27829\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/kiwi-nomad-tool-1.jpg?resize=1250%2C807&amp;ssl=1\" alt=\"Kiwi's Nomad Tool: the new cheapest way to find multicity flights\" width=\"1250\" height=\"807\"> <img class=\"alignnone size-full wp-image-27830\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/kiwi-nomad-tool-2.jpg?resize=1250%2C814&amp;ssl=1\" alt=\"Kiwi's Nomad Tool: the new cheapest way to find multicity flights\" width=\"1250\" height=\"814\"></p><h2>So, let&#8217;s try it!</h2><p>I set my departure city as Merida, my departure date as the 14th of August and set it to return to Merida at the end of the trip on the 14th of September.</p><p><img class=\"alignnone size-full wp-image-27831\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/kiwi-nomad-tool-3.jpg?resize=1250%2C684&amp;ssl=1\" alt=\"Kiwi's Nomad Tool: the new cheapest way to find multicity flights\" width=\"1250\" height=\"684\"></p><p>I&#8217;ve randomly selected the cities of:</p><ol><li>Merida, MX</li><li>Columbus, Ohio</li><li>Nashville, TN</li><li>Las Vegas, Nevada</li><li>Orlando, FL</li><li>Any NYC airport</li><li>Austin, TX</li><li>Seattle, WA</li><li>Merida, MX</li></ol><p><img class=\"alignnone size-full wp-image-27832\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/kiwi-nomad-tool-4.jpg?resize=1250%2C690&amp;ssl=1\" alt=\"Kiwi's Nomad Tool: the new cheapest way to find multicity flights\" width=\"1250\" height=\"690\"></p><h2>$885 USD for 9 cities, leaving from Merida, Mexico and returning to Merida, Mexico. You guys, that is insane. A round trip flight from Columbus to Vegas last time I went was nearly $600.</h2><p>As you can see, it created the order for me in which I&#8217;d get the cheapest flight. I think this is pretty amazing for when you are going to like 5 cities in Europe on a backpacking trip or spending two weeks bouncing around Central America. I mean, even the route I just did, if you took away Merida, imagine someone coming to the USA as a tourist and being able to hit up all those places &#8211; the rate is $885 because it&#8217;s coming from Mexico into the USA and back out, but if you took off that flight it&#8217;s even less at $535. That&#8217;s wild! </p><p>Yes, it&#8217;s mostly budget airlines but for that price, this is definitely something I&#8217;m going to be testing out on future travels. I just booked Merida to Atlanta to Ohio and back to Merida and that was $500 because I wasn&#8217;t flexible on the order &#8211; so you can see how being flexible on your itinerary can make for some insane savings! </p><p>Have fun planning your dream trip.&#160;I hope that you can find some deals with this tool and if you do, please let me know!</p><h3>Pin this info on the cheapest way to find multicity flights for later:</h3><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"The New Cheapest Way to Find Multicity Flights"}},"pageContext":{"id":"5b9629f687be0583274911c8"}}