{"data":{"mongodbDatabaseArticles":{"id":"5b95ea0887be05832748ff78","content":"<div><p> </p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/islay2.jpg\" alt=\"street in islay\" width=\"675\" height=\"395\"><br> Whisky and I got off to a rocky start. The first time I tried it was in college. It tasted like rocket fuel. I only drank it when I had no other options &#8212; and drowned what little I poured into my glass under a ton of Coke.</p><p>Then I met my friend Dan, whose home collection of various Scotches and whiskies rivaled any bar I knew. He and Choun, the manager of Rye House in NYC, slowly walked me through the world of whisky. From sweet to smoky to heavy to peaty, I got to taste everything.</p><p>I went from whisky hater to whisky lover, and soon I learned that there was nothing I liked more than the smoky, peaty whiskies that come from the Scottish island of Islay. I came to love their campfire smell and strong bite at the end.</p><p>Last month, I finally had the chance to visit Islay with Sean, my other whiskyphile friend. Located off the west coast of <a href=\"https://www.nomadicmatt.com/travel-guides/scotland-travel-tips/\">Scotland</a>, Islay is a large island battered by the sea, wind, and rain. (The weather is so bad that planes can&#8217;t land often enough that the island&#8217;s carrier FlyBe&#8217;s nickname is &#8220;FlyMaybe.&#8221;)</p><p>As my whisky-loving friend Sean and I flew onto the island, I gazed out my window in glee. I was finally in the whisky drinker&#8217;s promised land and it looked beautiful. Through the cloud cover, I could see a vast green island with rocky shores, endless farms, grazing sheep, and rolling hills dotted with diminutive stone houses. The land looked pastoral and untamed. It&#8217;s hard to imagine that so much of the world&#8217;s whisky originates here.</p><p>Whisky has a long history on Islay. It&#8217;s been made there since the 16th century &#8212; first in backyards and then, starting in the 19th century, in big distilleries. Over the years, whisky from the island came to be considered a specialty and was used to flavor a lot of other blends on the mainland. It wasn&#8217;t until the early 2000s that Islay whisky became world famous. The island produces mostly single malt Scotch, which means they only use one type of grain (barley).</p><p>Sean and I visited seven of the eight distilleries on the island (sorry, Coal Ila, see you next time!). We began our first day at Bowmore (Sean&#8217;s favorite), famous for its mildly peaty whiskies. Bowmore was founded in 1779 and is one of the oldest and largest distilleries on the island, producing 1.5 million liters per year. Located on the shores of Loch Indaal in the town that bears it name, the white painted buildings behind the walls of Bowmore made it seem less a factory and more like a housing complex. (All but one of the distilleries are located near the water because it was easier to get supplies in and out of the bays rather than overland.)</p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/islay1.jpg\" alt=\"grass in islay\" width=\"675\" height=\"395\"></p><p>During our tour, we focused a lot on the production of whisky, learning the ins and outs of how it is made. It&#8217;s a simple process: first, you take barley, soak it for 2-3 days in warm water, and then spread it on the floor of the malting house, turning it regularly to maintain a constant temperature. These days, only Bowmore and Laphroaig do their own maltings, though they produce only a fraction of what they need (used to make the tourists happy, I suspect); most of the malt and smoking process &#8212; for all the distilleries on the island&#160;&#8212; is done at a big plant in Port Ellen or on the mainland.</p><p>After the malting, the barley is then smoked in peat, an earthy fuel from the bogs that cover the island. It is this process that gives the whisky the flavor that has made Islay famous. After that it is fermented, distilled, and then put in casks, where it ages.</p><p>In Scotland, most distilleries reuse American bourbon or Spanish sherry casks (some use French oak, but that&#8217;s very rare). By law, Scotch whisky has to be made in non-virgin oak &#8212; they can&#8217;t make their own barrels. It&#8217;s not Scotch if it&#8217;s made any other way! It&#8217;s in these casks that the flavors of the whisky mix with the wood to become what they are. The longer the alcohol stays in, the smoother and mellower it becomes. (So if you like a real smoky, peaty whisky, get a young one!) Unlike wine, which continues to change with age, once the whisky is out of the barrel, it&#8217;s done maturing.</p><p>The highlight of our trip to Bowmore was when the attendant let us bottle our own whisky right from the cask! Let me introduce you to the Nomadic Rebel:</p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/islay4.jpg\" alt=\"the whisky i created in islay\" width=\"675\" height=\"380\"></p><p>After Bowmore (and a quick walk around town), we went to Bunnahabhain. Located at the very far end of the island, its remote location provided the opportunity for the most scenic drive of the trip: across the island and then down a tiny road, with the sea and mountains of the nearby island of Jura to your right and farmland to your left.</p><p>Looking like an old industrial factory with long warehouses on a rocky shore, Bunnahabhain does most of its production off the island. After a short, very underwhelming tour, our guide took us for a tasting, where he leapt out of his shell and gave us an animated history of the whiskies we were trying. (Overall, this was my least favorite distillery I visited, although I loved their products.)</p><p>Our second day, we visited the three most famous distilleries on the island: Laphroaig, Ardbeg, and Lagavulin.</p><p>Laphroaig sits on a beautiful, wide, and rocky inlet that opens up to the sea. The smell of salt and sea fills the air, fighting for control over the peat smell of the distillery. Laphroaig&#8217;s distillery is considered one of the most beautiful, with its small historic buildings, its name in giant letters placed on the outside wall that faces the bay, and a number of viewing points of the bay, where you can sit out and enjoy a dram or three. The highlight here was seeing the malting process in progress, as well as the peat fire and smoke as it filled the kiln.</p><p>At Ardbeg, we had lunch before joining our tour guide, Paul. &#8220;You&#8217;ve probably seen a bunch of these now, huh? I&#8217;ll just show you what makes Ardbeg different and we&#8217;ll just drink,&#8221; he said as he grabbed two bottles for the tour. &#8220;In case you get thirsty!&#8221; he added slyly. (We got thirsty!)</p><p>Paul gave us a quick tour of the facilities, highlighting their old mash tanks and distilling process, which produces alcohol at 62-75% alcohol by volume (ABV). Afterward, we toured the grounds, marveling at the old casks and original buildings still in use, before setting back to the main house. Ardbeg is set back from the road and seems to take up a city block with its large white warehouses. Back at the tasting room, Paul let us sample many of Ardbeg&#8217;s famous brands, as well as some special distillery-only blends found nowhere else, never seeming to care that we kept slipping in requests for the harder-to-find good stuff.</p><p><img class=\"alignnone\" src=\"https://media.nomadicmatt.com/islay3.jpg\" alt=\"beautiful sun streaking through clouds in islay\" width=\"675\" height=\"395\"></p><p>We talked with Paul for a long time. Like most people we met, he had grown up on the island, moved away, and come back. &#8220;City life was too busy for me,&#8221; he said. Like most of his friends, he got a job at a distillery. Unlike most of his friends, though, he actually <i>liked </i>whisky. A surprisingly large number of the young people we talked to weren&#8217;t really keen on Scotch (&#8220;it&#8217;s what my grandfather drinks&#8221;), but Paul was a big fan and knew his way around the spirit.</p><p>After wishing Paul goodbye, we stumbled out of Ardbeg and strolled toward our final stop of the day, Lagavulin. With plenty of time before our tour, we walked slowly down the path between the distilleries, awed at all the cows and sheep on the rocky verdant hills that rolled across the island, then caught a few minutes&#8217; snooze on one of the benches that line the way. Walking this path from distillery to distillery is something I can&#8217;t recommend enough.</p><p>On our final day, Sean and I visited Bruichladdich and Kilchoman. Starting early at Bruichladdich (which had been shut for decades before two private investors reopened in 2000), our guide Jenn gave us the grand tour and history of the place. The grounds are mostly white industrial buildings in a small compound, though upon arriving we were struck by the cobblestone courtyard (parking lot). It was a beautiful entranceway that harked back to days of old. She set seven different types of whisky in front of us, though I had to drink most of Sean&#8217;s too because he was driving.</p><p>At Kilchoman, the visit becomes a blur, after having drunk so much at Bruichladdich. Our tour moved quickly through the distillery, then we tried a few of the brands. I don&#8217;t remember which ones, as I mostly turned them down since I didn&#8217;t want to be too drunk too early!</p><p>After a quick lunch and final dram before I hugged Sean goodbye, I boarded the ferry back to <a href=\"https://www.nomadicmatt.com/travel-guides/scotland-travel-tips/glasgow/\">Glasgow</a> and promptly fell asleep in a happy, whisky-induced haze with a giant smile on my face. From the friendly people with their small-town charm to the beautiful landscape, distilleries, and sea air, Islay was an island of dreams. I had been to my alcoholic promised land and it was everything I had imagined it to be.</p><p>(Though next time I&#8217;ll spend more time outdoors appreciating the scenery and hiking off all that whisky!)</p><h3>Logistics</h3><p>If you&#8217;re going to go to Islay, you can get there by a twice-daily plane from Glasgow with FlyBe or via the ferry/bus combo from Glasgow.</p><p>For meals, I liked Yan&#8217;s Kitchen, Lochindaal (best seafood on the island), the caf&#233; at Ardbeg, Bridgend Hotel, and The Harbour Inn.</p><p>Accommodations consist mostly of cute little farmhouses turned B&amp;Bs. They are super cool and old fashioned. There&#8217;s also an HI hostel on the island (which is gong to be the cheapest option).</p><p><b>Recommended Whiskies</b></p><ul><li>Bowmore 13 &#8211; Nice, smoky taste with a strong finish. One of my favorites.</li><li>Bowmore 18 (sherry cask) &#8211; Smooth, fruity flavor.</li><li>Bowmore 25 (wine cask) &#8211; Smooth, with a peaty finish.</li><li>Laphroaig 21 &#8211; Smooth, light on the palette.</li><li>Laphroaig Cask Strength 16 Year &#8211; Really strong, very flavorful. Packs a punch.</li><li>Ardbeg Supernova &#8211; Very strong with good, peaty finish.</li><li>Lagavulin Double Matured Distiller&#8217;s Edition &#8211; Delicious!</li><li>Lagavulin 8 &#8211; Very strong smoky and peaty flavor. Tastes like a campfire. One of my favorites.</li><li>Lagavulin 18 &#8211; Smooth, with a more subtle flavoring.</li><li>Bruichladdich 1989 &#8211; Smooth, with a subtle sweet flavor.</li><li>Bruichladdich 2003 &#8211; Really strong, powerful flavor.</li><li>Kilchoman Machir Bay &#8211; Great smooth Scotch, with a subtle peaty finish.</li></ul><p><b><i>Note</i></b><i>: Visit Islay provided the car and accommodation (Rosemary and Don from Persabus were incredible hosts. Don cooks a mean breakfast!) for Sean and I, and they also connected me to distilleries so I could get&#160;the behind-the-scenes tours for this article. Meals, flights, and transportation to and from the island &#8212; as well as all that whisky I bought &#8212; were at my own expense.&#160;</i><br> <br> Here&#8217;s a link to Sean&#8217;s article about <a href=\"https://www.locationrebel.com/islay-scotch/\">our trip too!&lt;/&gt;</a></p></div>","title":"Searching for the Perfect Dram on Islay"}},"pageContext":{"id":"5b95ea0887be05832748ff78"}}