{"data":{"mongodbDatabaseArticles":{"id":"5b95eed187be0583274900f8","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Dos and Don&#8217;ts of The Yacht Week Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-15577\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/Dos-Donts-The-Yacht-Week-Thailand.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Dos and Donts of The Yacht Week Thailand\" width=\"1000\" height=\"550\"><br>\nThrowing&#160;a party on a boat can be a blast but spending an entire week on a yacht takes fun&#160;to the next&#160;level! Since we already had plans to be in southern Thailand in December, there was no way we&#8217;d turn down our invitation go to The Yacht Week Thailand. Sailing in the Andaman Sea on a yacht, you don&#8217;t say?!&#160;We&#8217;ve never&#160;done anything of&#160;this caliber, so what should we have expected as&#160;first-timers?</p>\n<p>If this is the first time you&#8217;ve heard of The Yacht Week, let&#8217;s just say it&#8217;s an incredible mashup of partying and sightseeing while exploring the seas on a bona fide yacht. The Yacht Week originated in Croatia but has blown up to include tours around&#160;Turkey, Italy, the British Virgin Islands, Greece, and yes, Thailand.</p>\n<img class=\"size-full wp-image-15475\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Yacht-Week-Thailand-Map-Small.jpg?resize=800%2C400&amp;ssl=1\" alt=\"Yacht Week Thailand Route\" width=\"800\" height=\"400\"><p>Since&#160;we have never been to The Yacht Week before and had conjured up certain images and expectations of the trip as we excitedly packed our bags,&#160;we&#8217;d thought we give a bit of insight to the event for others who are itching to go. Even though we&#8217;d love to go into the nitty gritty of preparing for The Yacht Week, &#8220;how to&#8221; guides have been done <a href=\"http://www.pausethemoment.com/yacht-week-croatia/\" target=\"_blank\" rel=\"nofollow\">here</a>, <a href=\"http://www.freecandie.com/2015/09/everything-you-need-to-know-about-the-yacht-week/\" target=\"_blank\" rel=\"nofollow\">here</a>, and <a href=\"http://www.heysarahlee.com/2013/07/the-yacht-week-guide.html\" target=\"_blank\" rel=\"nofollow\">here</a> so we&#8217;ll be providing&#160;a different twist on the trip:</p>\n<h2><p id=\"Do_Go_for_Amazing_Views\"><p>Do</p> Go for Amazing Views</p></h2>\n<p>&#160;</p>\n<blockquote class=\"instagram-media\">\n<p></p>\n<p><a href=\"https://www.instagram.com/p/BAOLpNjIBl6/\" target=\"_blank\">Happy Hour. We were disappointed when we noticed the #sunset was being blocked by a nasty grey sky of rain clouds. A few b&#822;e&#822;e&#822;r&#822;s&#822; minutes later this happens. Glad we stuck it out. @TheYachtWeek #TYWThailand #Thailand</a></p>\n<p>A photo posted by Chris and Angela Scott (@tielandtothailand) on Jan 6, 2016 at 6:47pm PST</p>\n</blockquote>\n<p></p>\n<p>We saw some absolutely fabulous rock formations, beaches, and sunsets as we sailed around a dozen or so&#160;beaches and islands on our route in the Andaman Sea. And of course, <strong>the sailboats themselves were a beautiful sight along the horizon, particularly during the regatta and when they formed the famous yacht ring.</strong></p>\n<p></p>\n<blockquote class=\"instagram-media\">\n<p></p>\n<p><a href=\"https://www.instagram.com/p/_tnpIWIBpG/\" target=\"_blank\">The colorful longtail boats of Maya Bay, also known as &#8220;The Beach&#8221; &#127754;&#127796; @TheYachtWeek #TYWThailand #Thailand</a></p>\n<p>A photo posted by Chris and Angela Scott (@tielandtothailand) on Dec 25, 2015 at 3:17am PST</p>\n</blockquote>\n<p></p>\n<p>As we bounced from place to place we also stopped for an hour or two at small islands with famous sites&#160;like Maya Bay Beach (early in the morning before the crowds got there!) and the Emerald Cave. Other boats went to <a href=\"https://www.tielandtothailand.com/island-hopping-thailand-andaman-sea/\">Hong Island, James Bond Island, and Tup Island</a>.</p>\n<h2><p id=\"Don8217t_Go_for_the_Sailing\"><p>Don&#8217;t</p> Go for the Sailing</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15571\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/The-Yacht-Week-Thailand-Regatta.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"The Yacht Week Thailand Regatta\" width=\"1000\" height=\"563\"></p>\n<p><strong>Ironically this trip is more about sightseeing and having fun and less about&#160;the demands of skillfully sailing&#160;a yacht in the open seas</strong>. In fact, during our trip, the&#160;skipper only raised the sails and cut the engines once and that was only for about an hour &#8211; and a wonderfully peaceful hour it was! Looking back on it, there just wasn&#8217;t adequate wind power to meet the demands of our rigorous island hopping schedule. We did raise the sails again for the regatta but we cheated a bit and used the engines.</p>\n<p>If you are a sailing fanatic and want more sail time, it might be better to be the captain of your own boat so that you&#160;can make executive decisions and choose when you want to sail. However, agreeing to this is a huge&#160;responsibility and means less partying! Bottom line: chances are you won&#8217;t be able to indulge in your sailing hobby as much as you&#8217;d like on this trip.</p>\n<h2><p id=\"Do_Go_for_the_Outrageous_Parties\"><p>Do</p> Go for the Outrageous Parties!</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15574\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/The-Yacht-Week-Thailand-White-Party.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"White Party at The Yacht Week Thailand \" width=\"1000\" height=\"550\"></p>\n<p>From the moment&#160;we&#160;woke up to the time we&#160;stumble to bed, we were&#160;celebrating in one form or another. <strong>Cocktails before noon?</strong> Yep. Inflatable floaty parties and island hopping during the day? Definitely. And every evening we could&#160;expect to either go to beachside clubs or some sort of themed party.</p>\n<p><strong>It is exhausting but exhilarating.</strong>&#160;We recommend getting plenty of sleep during the week leading up to the trip because you&#8217;ll be lucky to get more than a few hours of rest at&#160;night!</p>\n<h2><p id=\"Don8217t_Go_for_the_Excursions\"><p>Don&#8217;t</p> Go for the Excursions</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15567\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/Maya-Bay-Beach-2.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Side trip to Maya Bay Beach during The Yacht Week Thailand\" width=\"1000\" height=\"550\"></p>\n<p>Although we did a&#160;lot&#160;of island hopping during The Yacht Week Thailand, <strong>it was difficult to find the time for big daytime excursions when we stopped at the larger islands.</strong></p>\n<p>We had made a list of things to do on the islands. It included going to an&#160;overlook on Koh Phi Phi, walking a dog at&#160;the&#160;Lanta Animal Welfare on <a href=\"https://www.tielandtothailand.com/unforgettable-things-to-do-in-koh-lanta/\">Koh Lanta</a>, and going <a href=\"https://www.tielandtothailand.com/krabi-rock-and-fire-international-contest/\">rock climbing on Railay</a>. Unfortunately, by the time we arranged for boat-to-shore transportation, we only had about an hour or two on the island. These side trips were just too time-consuming to fit into our schedule. However, we did have enough time to do a little shopping, get a massage, and enjoy a freshly brewed espresso (a nice change from the instant coffee we were consuming on the yacht!)</p>\n<h2><p id=\"Do_Go_to_Relax\"><p>Do</p> Go to Relax</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15568\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/The-Yacht-Week-Thailand-Relaxing.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Relaxing with The Yacht Week Thailand\" width=\"1000\" height=\"550\"></p>\n<p>Even with all the partying, <strong>there is plenty of opportunities to relax.</strong> This is especially true once&#160;brunch cocktails are finished&#160;and before afternoon cocktails begin. We&#8217;d either stretch ourselves out on the bow&#8217;s deck to sunbathe&#160;or lounge in a water floaty. It&#8217;s time to play some summer tunes&#160;and enjoy the gentle waves and gorgeous views. We loved that there was no&#160;obligation to do anything on this trip if we didn&#8217;t want to!</p>\n<h2><p id=\"Don8217t_Go_to_be_Pampered\"><p>Don&#8217;t</p> Go to be Pampered</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15576\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/Cocktails-at-The-Yacht-Week-Thailand.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Cocktails at The Yacht Week Thailand\" width=\"1000\" height=\"550\"></p>\n<p>Although the boats are impressive, there are multiple champagne parties, and it&#8217;s possible to hire a hostess and skipper to cook and sail for you during the trip,<strong> this is not&#160;a five-star cruise</strong>. Heads are small (bathrooms for you non-sailin&#8217; folk) and you may even have to manually pump the toilets. Cabins and galleys can get cluttery in the blink of an eye, there is a limited supply of utility water on board, and seasickness may be biting at your heels. Everyone needs to work as a team to keep the yacht clean, safe, and fun. This might&#160;mean taking out trash and scrubbing toilets from time to time.</p>\n<h2><p id=\"Do_Go_for_the_People\"><p>Do</p> Go for the People</p></h2>\n<p><img class=\"aligncenter size-full wp-image-15569\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/Happy-skippers-on-The-Yacht-Week-Thailand.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Happy skippers on The Yacht Week Thailand\" width=\"1000\" height=\"550\"></p>\n<p>Ah, the people! The&#160;Yacht Week Thailand hosts 16 yachts of&#160;nearly 180 twenty and thirty-somethings from around the world. Our boat had guys and gals&#160;from Sweden, America, and&#160;Israel. <a title=\"The Yacht Week: Thailand | Paper Planes Blog\" href=\"http://www.paperplanesblog.com/the-yacht-week-thailand/\" target=\"_blank\">Our friend&#8217;s yacht</a> had people from the UK, Australia, Argentina, and Istanbul.&#160;We boarded with&#160;eight unfamiliar yet smiling faces looking at us and by the end of the trip, we were like old friends. Once the event is over, it&#8217;s not uncommon for people&#160;to stay in touch and long-term friendship and romantic relationships have&#160;come from it.</p>\n<h2><p id=\"Don8217t_Go_If_You8217re_Looking_for_a_Romantic_Getaway\"><p>Don&#8217;t</p> Go If You&#8217;re Looking for a Romantic Getaway</p></h2>\n<p>&#160;</p>\n<blockquote class=\"instagram-media\">\n<p></p>\n<p><a href=\"https://www.instagram.com/p/BAMn5zQIBou/\" target=\"_blank\">Yep. We live in a big beautiful world, and for as much as we travel around Thailand we always find places we never knew existed. All the more reason to stick around and continue exploring a whole lot longer&#8230; @TheYachtWeek #TYWThailand #PhiPhi</a></p>\n<p>A photo posted by Chris and Angela Scott (@tielandtothailand) on Jan 6, 2016 at 4:15am PST</p>\n</blockquote>\n<p></p>\n<p>We firmly encourage fun, sociable singles and couples to go on The Yacht Week Thailand and party it up together. However, if you come with a significant other in hopes of&#160;a romantic getaway, this event is not for you. Although the boats are big they aren&#8217;t that big. The rooms are even smaller, so there&#8217;s very little privacy away from other members of your crew. Two, this is a social event that&#8217;s all about mingling and having fun with many people It&#8217;s not meant for staring into each other&#8217;s eyes 24/7.</p>\n<h2><p id=\"Packing_Essentials_for_The_Yacht_Week_Thailand\"><p>Packing Essentials for The Yacht Week Thailand</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-15566\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/Yacht-Week-8.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Pierside during The Yacht Week Thailand\" width=\"1000\" height=\"550\"></p>\n<p>Bring essentials like daytime cover-ups, slip-on boat shoes, hair clips or bands to keep long tresses out of your face, and several pairs of sunglasses. Definitely err on the dressier, more stylish side for evening wear, so guys should bring a handful of collared polos and board shorts and gals should opt for sundresses. Fun extras include a costume for the regatta, all white attire for the White Party, and water floaties!</p>\n<p>But absolute must haves? Check it out:</p>\n<p><strong>3+ bathing suits:</strong>&#160;Or four. Or even five. They are essentially your outfits for the day and double as underwear. For real. Just make sure you bring real undies to wear with&#160;your evening outfits. Bringing multiple bathing suits will allow you to rotate them out, giving adequate time between washing and air drying, and break up those tan lines.</p>\n<p><strong>Battery pack: </strong>Electrical outlets are very limited on the boat and there&#8217;s a small chance that the one in your room doesn&#8217;t work or your plugs don&#8217;t fit. You&#8217;ll be SOL the ENTIRE week. We brought an <a title=\"Eloop E14 20000 Mah. Battery Pack\" href=\"https://www.amazon.com/gp/product/B00VYX41ZW/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00VYX41ZW&amp;linkCode=as2&amp;tag=tielandtothai-20&amp;linkId=ACQJZX5MC5KF7DJ2\" rel=\"nofollow\">Eloop E14 20,000 Mah Power Bank</a>&#160;(it&#8217;s a beast!) but we were able to repeatedly charge our phones (and even share juice with our crew) and it lasted the entire week. Also, bring a cigarette plug adapter with multiple USB ports (needed for phones and cameras). Backup batteries to any equipment (camera, GoPro, etc) are also a must!</p>\n<p><strong>Fully charged cordless electric razor:</strong>&#160;Men and women both, trust us on this one. Fully charged. Cordless. Trying shaving your legs, face, and other areas when the boat is rocking in an itsy bitsy bathroom with only cold water. It&#8217;s a challenge!&#160;This is a life saver since everyone&#8217;s nearly nude the entire week.</p>\n<p><strong>Waterproof bag/phone case:</strong> Absolutely bring a waterproof case for your electronics. If you are taking a camera, investing in a waterproof bag (dry bag) is also essential the island transfers are done by longtail boat and dinghy. If you have a phone, invest in a waterproof case or an underwater bag. You don&#8217;t want to accidentally drop your electronics&#160;in the sea as you get on and off the boats! If you do, follow these&#160;<a title=\"Dropped my phone in salt water. Help!\" href=\"https://www.ifixit.com/Answers/View/23523/Dropped+my+phone+in+salt+water.+help!\" target=\"_blank\" rel=\"nofollow\">tips for saving electronics from salt water</a><a class=\"post-author-username-container\" href=\"https://www.ifixit.com/User/212624/markus+weiher\">&#160;</a>(these tips are NOT the same if you drop it in fresh water)!</p>\n<p><strong>Dry shampoo and baby wipes:</strong> Unless you actually wash your hair in the sea, chances are you won&#8217;t be taking more than a sponge bath on the boat for the entire week. Dry shampoo (or even baby powder) keeps your roots dry. It can also double as body powder to keep sticky, sweaty skin at bay. Baby wipes keep your important bits fresh and clean when a shower is not a realistic option.</p>\n<p><strong>Your country&#8217;s flag:</strong> Not only does it show national pride but it&#8217;s the perfect way to identify your boat among the dozens among the fleet. Yachts look surprisingly similar&#160;identical during the nighttime, especially after you&#8217;ve had a few drinks. Going around in circles in a boat transfer at 3am is a buzzkill and frustrations can escalate quickly.</p>\n\n\n\n<strong><p>NOTE:</p></strong> After much boating experience and the tendency to get cold in the evenings, The Yacht Week Thailand in December was still warm even after the sun went down. Bring no more than one thin, long-sleeved hoodie and save space in your suitcase for something else. \n\n\n\n<h2><p id=\"Don8217t_Bother_Packing\"><p>Don&#8217;t Bother Packing</p></p></h2>\n<p>Here are a few things that are better left at home during the&#160;trip:</p>\n<p><strong>Big electronics:</strong> Don&#8217;t bring a laptop or any electronics other than a phone and small camera. You won&#8217;t get any work done anyways.&#160; Plus, it&#8217;s hard to maintain a full battery when the yacht doesn&#8217;t have electricity during the day and unreliable electrical hookups at night.</p>\n<p><strong>Heels, sneakers, boots:</strong> Slip-ons and flip-flops are the way to go. You will break your neck if you wear heels. Forget wedges, too.</p>\n<p><strong>A hard suitcase:</strong> A soft duffle bag or suitcase is a MUST. Hard cases, even the small ones, WILL NOT FIT in the cabin&#8217;s unconventionally shaped storage areas. Make sure to keep it carry-on sized only. If you have to check your bag, you&#8217;ve packed too much and it&#8217;s&#160;going to be too big!</p>\n<p>The Yacht Week Thailand isn&#8217;t a year-round event. Instead, it&#8217;s currently scheduled for three one-week sessions in December and in the beginning of January dubbed Week 51, Week 52, and Week 53. This aligns with the winter holidays and New Years, so don&#8217;t forget to bring Christmas and New Years costumes!</p>\n<p>&#8595; PIN THIS POST FOR LATER &#8595;</p>\n<p><img class=\"aligncenter size-full wp-image-15587\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/02/Dos-Donts-The-Yacht-Week-Thailand-Pinterest-Higher.jpg?resize=500%2C833&amp;ssl=1\" alt=\"Get ready for the sailing, island hopping and parties of the ultimate boat trip, The Yacht Week Thailand| Tieland to Thailand\" width=\"500\" height=\"833\"></p>\n<p><strong>DISCLOSURE:</strong> We were guests of this event but our opinions of The Yacht Week Thailand are our own.</p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Dos and Don’ts of The Yacht Week Thailand"}},"pageContext":{"id":"5b95eed187be0583274900f8"}}