{"data":{"mongodbDatabaseArticles":{"id":"5b937ad787be056953db7cda","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"4c7f\" id=\"4c7f\" class=\"graf graf--h3 graf--leading graf--title\">One of the often under talked about aspects of software engineer, debugging</h1></p><p name=\"3b64\" id=\"3b64\" class=\"graf graf--p graf-after--figure\">There are tons of resources out there that teach you how to code, but I have seen a lack of resources that teach you one of the most important aspects of being a software engineer, <strong class=\"markup--strong markup--p-strong\">debugging</strong>!</p><p name=\"dca0\" id=\"dca0\" class=\"graf graf--p graf-after--p\">I&#8217;m not actually sure off the top my head where the term &#8220;bug&#8221; came from when we talk about a software bug, but it is basically an error in our code. There are many types of errors that can happen when you are coding, many of which can be very tough to track down! Over the course of the last 15 years, I can&#8217;t tell you how many times I&#8217;ve had to track down a software bug that was just a one character error.</p><p name=\"a0f8\" id=\"a0f8\" class=\"graf graf--p graf-after--p\">Sometimes software bugs can crash your program and sometimes they can slip by without you even realizing it. I&#8217;m sure you have all seen that happen when your favorite app just suddenly quits on your iPhone. As a software engineer, you are lucky if that is what happens when your program encounters the error. There are also errors that slip by and make your program seem to work as normal, yet they provide the wrong output; these are much harder to track down and can take a lot of development time to fix.</p><p name=\"f0ed\" id=\"f0ed\" class=\"graf graf--p graf-after--p graf--trailing\">I think there are a lack of resources out there to teach debugging because it is a very hands on, trial-by-error learning process. But there are are a few tips I can give you to get you started.</p></div>","title":"One of the often under talked about aspects of software engineer, debugging"}},"pageContext":{"id":"5b937ad787be056953db7cda"}}