{"data":{"mongodbDatabaseArticles":{"id":"5b9248dc87be056953db7c05","content":"<div><blockquote><p><b>ANDREW:</b> There's all these studies showing that if you give a rat unfettered access to drugs and alcohol, the rat will hit the lever until it dies, right? That's actually not true.</p> <p>If you give a rat access to cocaine or alcohol, or something really rewarding. It will only self-administer the drug, and starve to death for the reward, <b>when its environment isn't interesting. When the environment is impoverished. </b></p> <p>[But, ] If there's lots of rat toys, and lots of other cute rats hanging out, they're much less interested in becoming (cocaine) addicts. It's only in the absence of stimulating enriched environments, do these sort of automatic behaviors take over. </p> <p>(..) If you put some toys in their case, they stop self-administering [the drugs] to some degree. Addiction is not the goal, the reward is not necessarily the goal when things are interesting and novel, and when you can explore your environments.</p> <p>(..) and this is not just rats. Humans were given this as well. If you're an alcoholic, if you're a problem drinker, you're always going to be a problem drinker is the prevailing wisdom. Which also isn't true. Something like 99.5% of people who are problem drinkers, learn to not be problem drinkers. With no programs, no intervention, no therapy. They just learn to get control over their drinking.</p> <p><b>JOE:</b> That's a really interesting point. It's a really interesting point when you think of people that look forward to happy hour. They look forward to that \"drink after work\". Like how many boring jobs have made people into alcoholics, because while they're at work all day, they're just constantly itching away at their natural reward systems. Just like \"I gotta get something in here\".</p> <p><b>ANDREW: Yes, and boredom and lack of ability to tolerate boredom (..) is often the biggest driver for problematic substance abuse.</b> </p></blockquote> <p>&#8212; <a href=\"http://youtube.com/watch?v=06olLYiMvM4#t=10m32s\">Andrew Hill PhD in JRE #629 @ 10m32s</a></p> <p>This is known as <a href=\"http://en.wikipedia.org/wiki/Rat_Park\">the Rat Park experiment</a>. And it's interesting if we apply it to humans:</p> <p>We structure our societies around rewarding unsatisfying work (<a href=\"http://www.washingtonpost.com/blogs/on-leadership/wp/2013/10/10/only-13-percent-of-people-worldwide-actually-like-going-to-work/\">jobs that people don't like</a>) with unsatisfying rewards (<a href=\"http://www.theguardian.com/commentisfree/2013/dec/09/materialism-system-eats-us-from-inside-out\">buying material stuff doesn't make you happy</a>).</p> <p>We've created our <a href=\"/orcas-sea-world/\">our own version of the rat's cage</a>.</p> <p>So it's no wonder so many people flock to alcohol and drug abuse in the weekends. Daily life itself simply doesn't offer enough stimuli to satisfy their brains.</p> <p><b>Our alcohol and drug abuse is a symptom of a society that is not in line with our natural reward systems.</b></p> <p>Yes, <a href=\"//www.drinkaware.co.uk/check-the-facts/what-is-alcohol/alcohol-unit-guidelines/\">3+ drinks in one session is already alcohol abuse</a>. <a href=\"http://levels.io/reset-your-life\">One of the reasons I left my country was to get out of this vicious cycle.</a></p> <p>Can we fix this though?</p> <p>Work seems to be at the core of this issue, so that's a good place to start. The internet can give people more freedom to choose <a href=\"http://www.telegraph.co.uk/finance/economics/11465221/Silver-entrepreneurs-behind-Britains-self-employment-boom-says-Bank-of-England.html\">what they do</a>, <a href=\"http://yongfook.com/10-reasons-why-i-self-funded-my-startup-and-so-should-you.html\">how they do it</a> and <a href=\"http://nomadlist.com/\">where they do it from</a> can help.</p> <p>And we know that <a href=\"http://www2.eur.nl/fsw/research/veenhoven/Pub2000s/2000a-full.pdf\">freedom and happiness</a> are strongly related. Freedom entails more opportunity to have <a href=\"http://www.theatlantic.com/business/archive/2014/10/buy-experiences/381132/\">a wider range of experiences</a> which results in increased stimuli. Thus, more adventure breeds less boredom. And less boredom results in more happiness.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Our society is not in line with our natural reward systems, and alcohol and drug abuse proves it"}},"pageContext":{"id":"5b9248dc87be056953db7c05"}}