{"data":{"mongodbDatabaseArticles":{"id":"5b921d2b87be0571ac1b0507","content":"<div><p>What&#8217;s the single best way to protect your money, grow your wealth, and safeguard your assets against everyone who wants a piece of the action- Uncle Sam, your ex, greedy lawyers, etc.? </p>\n<p>(Hint: it does not involve a new account at your local bank) </p>\n<p>The answer? </p>\n<p>Open an <b>offshore bank account</b>. </p>\n<p>The banking world is a madhouse, and your <i>local </i>banks are a big part of the problem.</p>\n<p>A recent study suggested United States banks are only the 40th safest in the world&#8230;<b><i>fortieth safest</i></b><b>. </b></p>\n<p>If you think that&#8217;s bad (it is!), many European countries fared worse. It seems like every time we turn around, some new stress test has uncovered more insolvent banks putting your money at risk.</p>\n<p>Here&#8217;s a grim picture for a realist: </p>\n<p>Your local bank goes under. Who protects your money? </p>\n<p>Deposit insurance? The government? </p>\n<p>Guess again. </p>\n<p>Many banks keep <i>pennies</i> on hand to pay depositors. Sovereign insurance funds in the West rarely have <i>even 1% of bank deposits</i> on hand. If your domestic bank goes under, good luck getting your money back. </p>\n<p>Here&#8217;s another <i>question</i> for you: </p>\n<p>Where can you get higher interest rates, greater diversification, and peace of mind that your money is safe?</p>\n<p><i>Answer</i>: <b>offshore bank accounts</b>. </p>\n<p>Having a bank account overseas is a must, but it&#8217;s not as easy as it used to be. There are a lot of countries to choose from and plenty of offshore banking laws to worry about. </p>\n<p>Before you start picturing yourself as a villain from <i>The Transporter, </i>let&#8217;s look at some frequently asked questions&#8230;</p>\n<p></p>\n<p>&#160;</p>\n<h2><b>Is having an offshore bank account legal?</b></h2>\n<p>&#160;</p>\n<p>There are a lot of rules and regulations to wrap your head around before you open an offshore account. But, as long as you&#8217;re complying with the laws of your home country and those regulating your overseas bank, offshore accounts are legal. </p>\n<p>As<a href=\"http://www.investopedia.com/articles/managing-wealth/042916/offshore-banking-isnt-illegal-hiding-it.asp\"> Investopedia</a> puts it, &#8220;Offshore banking isn&#8217;t illegal, hiding it is.&#8221; </p>\n<p>Offshore bank accounts have a chronic association with corruption, but the practice of opening and holding accounts overseas is not inherently illegal. Tax evasion is illegal no matter where you&#8217;re trying to do it, at home or overseas.</p>\n<p>As long as you&#8217;re <b>complying with the reporting requirements</b> in your home country, <b>offshore banking is 100% legal.</b> If you understand and follow those reporting requirements, you&#8217;ll have nothing to worry about. </p>\n<p>Once you realize you can <b>legally bank anywhere in the world</b> and start exploring your options, you&#8217;ll see the tremendous opportunity in banking <a href=\"http://nomadcapitalist.com/2017/05/15/how-to-go-where-youre-treated-best/\">where you&#8217;re treated best</a>.</p>\n<p>&#160;</p>\n<h2><b>Why have an offshore bank account?</b></h2>\n<p>&#160;</p>\n<p>If the thought of unstable banks and swindley brokers isn&#8217;t enough, there&#8217;s another good reason to move your banking overseas:</p>\n<p>You&#8217;ve heard the old saying, <i>&#8220;never keep all your eggs in one basket&#8221;? </i></p>\n<p>That&#8217;s why you&#8217;ve (probably) diversified your assets across numerous asset classes, like growth stocks, blue chip stocks, bonds, and real estate.</p>\n<p>Most people know about asset diversification, but few people think to diversify geographically. </p>\n<p>These are the same principles at work: offshore banking reduces your risk and offers the potential <a href=\"http://nomadcapitalist.com/2014/05/28/serbian-banks-europes-highest-interest-rates/\">benefit of high returns</a> (not to mention access to new opportunities and foreign investments). </p>\n<p>To put it simply,<b> having a bank account overseas is the first step to protecting your wealth and your freedom. </b></p>\n<h2></h2>\n<h2>1. Political risk diversification</h2>\n<h2></h2>\n<p>There&#8217;s always whacky stuff happening in politics all over the world. Some of it might be making you a little nervous or your assets. But there&#8217;s a better solution for peace of mind than digging a deep hole in your backyard and burying fat stacks of cash.</p>\n<p>You see, offshore bank accounts are never controlled by federal or local governments, which means added protection for your money. </p>\n<p>Money kept offshore is harder to have frozen or seized. </p>\n<p>Offshore banking can also provide increased privacy (or<a href=\"http://nomadcapitalist.com/2014/11/05/total-personal-and-bank-secrecy-offshore/\"> secrecy</a>). And yes, all of this is still legal (as long as you&#8217;re following the rules). </p>\n<h2>&#160;2.&#160;Asset protection</h2>\n<h2></h2>\n<p>If you&#8217;re reading this, chances are your government is probably broke. </p>\n<p>The United States is the reigning<a href=\"https://en.wikipedia.org/wiki/National_debt_of_the_United_States\"> champion of debtors</a> (move over, Mayweather), having run up a <i>$127 trillion dolla</i>r tab of the national debt and unfunded liabilities. </p>\n<p>That kind of debt is a ticking time bomb. </p>\n<p>Governments have a history of needing more than their citizens&#8217; tax money to pay their bills. When the situation is bad, they&#8217;re not afraid to target your personal assets. It&#8217;s happened recently in <a href=\"http://nomadcapitalist.com/2013/03/18/your-bank-account-is-no-longer-sacrosanct/\">Cyprus</a>, Ireland, Hungary, and Poland.</p>\n<p>In 2011, Hungary <a href=\"https://www.reuters.com/article/hungary-pensions/hungarian-savers-say-government-is-stealing-their-pensions-idUSL6N0TG2MP20141127\">forced its citizens</a> to ditch their private pension plans and rejoin the state-run pension plans, or forfeit their right to future state pension payouts (despite their continued contributions).</p>\n<p>In 2013, the Polish government <a href=\"https://www.reuters.com/article/poland-pensions/update-2-poland-reduces-public-debt-through-pension-funds-overhaul-idUSL6N0H02UV20130904\">seized </a><i>half</i> of its citizens&#8217; private retirement funds. </p>\n<p>When you bank in your home country, any bureaucrat can freeze your account. They can do this without needing proof and without charging you with a crime. They can do it on a whim, just like in Poland.</p>\n<p>If you have your money in safe offshore bank accounts, it&#8217;s harder for them to get to. </p>\n<p>What would happen if you couldn&#8217;t access <i>your</i> money for a couple weeks? What about a couple months? Years?</p>\n<p>It&#8217;s a scary thought, one that&#8217;s increasingly becoming a reality for citizens and business owners in the west. </p>\n<p>Especially those without offshore bank accounts. </p>\n<p>An offshore bank account can protect your hard-earned money from fat-fingered government agents. </p>\n<p>But your government isn&#8217;t the only one out for your money; aggressive lawyers, creditors, even angry ex-spouses- they all want a piece. </p>\n<p>Offshore bank accounts take your money out of their reach. </p>\n<h2>&#160;3. Banking with more Stability</h2>\n<h2></h2>\n<p>The United States banks are the 40th safest on earth. </p>\n<p>The United Kingdom banks? <i>44th</i> safest. These are results from a recent audit of the world&#8217;s banking systems. Recent rankings of the 50 safest banks put certain Canadian banks in <a href=\"https://www.gfmag.com/media/press-releases/the-worlds-50-safest-banks-2016\">10th and 20th</a>, with <a href=\"http://nomadcapitalist.com/2016/03/28/australian-banks-verge-of-financial-crisis/\">Australian banks</a> holding <a href=\"https://www.gfmag.com/media/press-releases/the-worlds-50-safest-banks-2016\">21st-24th slots</a>. </p>\n<p>Where can you find the safe banks? Germany, Singapore, South Korea&#8230; Safe banks are out there, but not necessarily where you&#8217;d expect.&#160;Western banks keep one or two cents per dollar of your money on hand. <i>Safe</i> offshore bank accounts will keep 20, 25, sometimes 30 cents per dollar. </p>\n<p>Let&#8217;s put it like this.</p>\n<p>If you had your choice of schools for your kids, would you put them in the school ranked 40th? </p>\n<p>No, you&#8217;d put them in the best school you could. </p>\n<p>What about a fantasy draft? If you have an early draft pick, you aren&#8217;t going to squander it on a decent player, you&#8217;re going for the best you can get&#8230;</p>\n<p>So why would you put your&#160;<i>money</i> anywhere but the safest banks on earth? </p>\n<p>Why settle for an &#8220;OK&#8221; bank? </p>\n<p>Your assets are in a domestic bank right now because one, it was convenient, and two, you didn&#8217;t know any better. Now it&#8217;s time to think long-term about the safety and growth of your wealth through offshore banking. </p>\n<p>One more thing: don&#8217;t confuse wealthy countries with <a href=\"http://nomadcapitalist.com/2014/04/27/top-5-safest-countries-to-bank-offshore/\">safe offshore banking countries</a>. </p>\n<p>Some banks in Europe had to start limiting customers&#8217; access to their own money. And when a<a href=\"http://nomadcapitalist.com/2016/12/14/offshore-companys-bank-account-closed/\"> bank went under</a>? Not even <a href=\"http://nomadcapitalist.com/2014/08/27/deposit-insurance-bank-failures/\">deposit insurance</a> could protect everyone.<br>\n</p>\n<h2>&#160;4. Deposit Insurance Fund Insolvency</h2>\n<h2></h2>\n<p>Here&#8217;s the scary truth: the FDIC in the United States has <i>less than one percent</i> of deposits in its reserves.</p>\n<p>If every US bank failed at once, you would only see $1 for roughly every $300 you deposited.&#160;</p>\n<p>Not a pleasant thought. You don&#8217;t need the top offshore bank accounts to do way better than that.</p>\n<p>The US government has been saying for years that the FDIC is insolvent. Since the 2008 financial crisis, &#160;the FDIC has closed <strong>465</strong> US banks.</p>\n<p>Compare that to <b>countries like <a href=\"http://nomadcapitalist.com/2017/05/01/singapore-great-flags/\">Singapore</a>, where there&#8217;s </b><b><i>never</i></b><b> been a bank failure. Never.</b></p>\n<p>Many foreign bank accounts offer some level of deposit insurance on their accounts&#8211;a few places even offer unlimited deposit insurance. But the most important thing to look for is bank stability.</p>\n<p>All that matters is whether or not the bank is stable. It doesn&#8217;t matter which country the bank is in.</p>\n<p>The next round of <a href=\"https://www.ft.com/content/0bd8f4d4-76de-11e7-a3e8-60495fe6ca71?mhq5j=e5\">&#8220;Too Big to Fail&#8221;</a> could make your local bank account a target.</p>\n<h2>5. Currency Diversification</h2>\n<p>If you&#8217;re reading this, the currency you hold is probably on the decline. The western world is in a <a href=\"http://nomadcapitalist.com/2014/12/17/currency-cds-worth/\">&#8220;currency war&#8221; </a>that&#8217;s been destroying trillions of dollars of wealth held by everyday people (like you). </p>\n<p>In addition to holding hard assets like<a href=\"http://nomadcapitalist.com/2015/02/09/best-place-buy-gold-silver-europe-vat-free/\"> gold and silver</a>, diversifying your currency is a good way to protect the value of your assets from central bankers. And a good way to diversify your currency is through offshore bank accounts. </p>\n<p>Banks in financial centers like Hong Kong, Singapore, and Andorra offer as many as 12-15 currencies&#8230; all in one safe offshore bank account. </p>\n<p>You can<i> easily</i> sell your dollars and buy pounds, euros, or renminbi at any time. Offshore banking is an excellent way to get exposure and access to emerging currencies, and profit from global financial trends.</p>\n<h2>6. Higher Interest Rates</h2>\n<h2></h2>\n<p>Diversifying your currency in safe offshore bank accounts can be a great way to obtain<a href=\"http://nomadcapitalist.com/2014/04/20/top-5-highest-offshore-bank-interest-rates/\"> higher interest rates</a> on your money.</p>\n<p><b>There are some overseas banks offering interest rates that are 5X and 10X what the USA is offering. </b></p>\n<p>I found a bank with an 11% APY (annual percentage yield). Their only condition was that I didn&#8217;t withdraw my money for a year (I won&#8217;t say where, here&#8211;the account isn&#8217;t right for everybody and you shouldn&#8217;t pursue an offshore account based on APY alone). </p>\n<p>Right now, savings accounts in the USA are considered &#8220;high yield&#8221; if they offer an APY around 1.3%. That means the offshore bank account I opened offered a return nearly ten times higher than any bank in the USA. </p>\n<p>What would that kind of interest boost do for you and your interest income? It&#8217;s a complete game changer for your wealth.</p>\n<p>If you&#8217;re even more adventurous, there are emerging market currencies that offer interest rates as high as 18%. </p>\n<p>But, like I said, it&#8217;s not all about the APY. Currency adds another layer to the interest puzzle. For example, you don&#8217;t always have to sell your US dollars or euros to profit.</p>\n<p><b>Several foreign banks pay 5-6% annual yields on US dollar accounts. </b>Even if you don&#8217;t want to invest in foreign currencies yet, you can still benefit from offshore bank accounts. </p>\n<p>The key is looking at the big picture. When you know what to look for, you can tell which offshore bank accounts are good options, and which are <a href=\"http://nomadcapitalist.com/2014/04/16/four-offshore-banking-countries-bother/\">worth avoiding</a>. &#160;</p>\n<h2></h2>\n<h1><b>You Can Open an Offshore Bank Account yourself&#8230;</b></h1>\n<h2></h2>\n<p>&#8230; But you need to be extremely careful about <i>where</i> you do it. Be extremely wary of the standard &#8220;bank offshore!&#8221; advice. </p>\n<p>Yes, there are plenty of foreign banks that will accept you as a customer, but many of them won&#8217;t offer <a href=\"http://nomadcapitalist.com/2015/03/27/the-best-offshore-banks-2015/\">the best offshore bank accounts</a> for you. </p>\n<p>The rules and procedures for opening offshore bank accounts will vary between banking systems.</p>\n<p>At certain banks, all you&#8217;ll need is some identification and proof of address, as well as an initial deposit (which can sometimes be as small as a few hundred dollars). Some banks even let you open an account without ever visiting the bank in person (or <a href=\"http://nomadcapitalist.com/2017/04/03/how-to-open-an-offshore-account-and-bank-remotely/\">even leaving your home</a>).</p>\n<p>But the most important part of this process is determining <b>which banks are safe and worth your time</b>.</p>\n<p>You&#8217;re not trying to move your money from one insolvent bank to another, are you?&#160;Didn&#8217;t think so. </p>\n<p>Unfortunately, it&#8217;s hard to find good information about offshore banking. </p>\n<p>Internet &#8220;experts&#8221; and &#8220;gurus&#8221; aren&#8217;t making it any easier for you. They have their offshore banking theories&#8230;but how many of them still have their money in local banks? How many of them are actively opening new accounts, seeking the top offshore bank accounts and <a href=\"http://nomadcapitalist.com/2017/03/28/avoid-high-offshore-bank-fees/\">avoiding the high bank fees</a> for every situation? </p>\n<p>The truth is, certain offshore bank accounts (even those widely regarded as the best offshore bank accounts) might not be best for <i>you</i>. </p>\n<p>Opening an <a href=\"http://nomadcapitalist.com/2017/06/07/remote-banking-estonia-e-residency/\">Estonian bank account </a>may work for some, while choosing <a href=\"http://nomadcapitalist.com/2017/08/11/bank-account-in-ukraine/\">Ukraine</a>, <a href=\"http://nomadcapitalist.com/2015/12/21/easiest-place-to-open-a-bank-account/\">Georgia</a>, <a href=\"http://nomadcapitalist.com/2017/08/19/banking-tax-free-vanuatu/\">Vanuatu</a> or even <a href=\"http://nomadcapitalist.com/2017/04/14/bank-account-in-mongolia/\">Mongolia</a> for others.</p>\n<p>Your nationality, your currency, your business goals&#8211;these are just a few of the factors that go into making a smart offshore banking decision. </p>\n<p>This is where we can help, but only if you&#8217;re serious about it. </p>\n<h1></h1>\n<h1><b>Banking Offshore is Legal, but There&#8217;s a Need for Speed</b></h1>\n<h2></h2>\n<p>The United States passed a law called <a href=\"http://nomadcapitalist.com/2016/10/12/global-fatca-automatic-information-sharing/\">FATCA</a>, which stands for the Foreign Account Tax Compliance Act. </p>\n<p>This law requires all foreign financial institutions to report all the details of every American-owned account to the IRS&#8211;otherwise they&#8217;ll face a 30% withholding tax.</p>\n<p>This strict requirement on accounts for US depositors has led many banks around the world to deny service to Americans. It&#8217;s easier for them. But foreign banks need access to US capital markets in order to conduct business, so banks are forced to comply with FATCA</p>\n<p>If you&#8217;re interested in an offshore account, you need to act <i>now</i>. You&#8217;ll want to get your offshore bank account opened before requirements are tightened even further (it&#8217;s not unheard of to get grandfathered in). </p>\n<h2></h2>\n<h1><b>Getting the Right Help</b></h1>\n<h2></h2>\n<p>Could you open an offshore bank account by yourself? </p>\n<p>Maybe. </p>\n<p>Would you know which bank would serve you best, and how to get the most out of your new account? </p>\n<p>Probably not. </p>\n<p>That&#8217;s where we come in. We&#8217;ve done all the research for you. We&#8217;ve opened plenty of offshore accounts (both <a href=\"http://nomadcapitalist.com/2015/06/03/what-is-a-private-bank-account-and-how-to-get-one/\">personal</a> and business). And we&#8217;ve done this not just for ourselves, but for our clients as well. We know what works best, and we know what will work for you. </p>\n<p>Don&#8217;t miss out on one of the best wealth building, asset-protection opportunities available simply because you don&#8217;t know where to start. <a href=\"https://nomads.lpages.co/apply/\">Let us help</a>. </p>\n<h2></h2>\n</div>","title":"Offshore Banking: How to legally open an offshore bank account"}},"pageContext":{"id":"5b921d2b87be0571ac1b0507"}}