{"data":{"mongodbDatabaseArticles":{"id":"5b962a5e87be0583274911d6","content":"<div><p class=\"c0\">Big trip coming up to the Mainland and wondering what to pack for China travels?</p><p class=\"c0\">When I first moved to China 3 years ago, I followed a packing list that was outdated. As a female, I was encouraged not to pack any nice undergarments (as the washing machines are rough on delicates), no nice clothes (again, the washing machines), and toilet paper.</p><p class=\"c0\">So. Much. Toilet. Paper.</p><p class=\"c0\">It&#8217;s safe to say, as we&#8217;re nearing 2018, times have changed in China, making for an easier transition to traveling in this ever-changing and modernized land. Washing machines no longer eat your clothes and you don&#8217;t need to travel with flashlights or gas lamps in case of power outages.. What a time to be alive.</p><p class=\"c0\">Jokes aside, there still are some essentials of what to pack for China that you may even know you need. Let&#8217;s get started!</p><h2 id=\"h.ci9js1q0wpv0\" class=\"c3\"><p class=\"c4\">1. Small liquid hand soap and wet wipes</p></h2><p class=\"c0\">The majority of public toilets in China will not be doing you any favors. Free toilet paper and soap are not provided, and you are expected to bring your own (or suffer the consequences). The majority of travel guides will tell you to pack your own hand sanitizer, but I&#8217;ve found that bringing your own hand soap is just as simple and&#160;more&#160;effective, as you will nearly always have access to a sink after doing your business.</p><p class=\"c0\">Speaking of business, you&#8217;re going to need to use your own toilet paper or wipes. Skip the tiny packets of tissues that you&#8217;ll see sold at the street corners, and opt for some wet wipes that will make unexpected visits to the toilet easier to manage and more comfortable.</p><h2 id=\"h.53rcthqeesog\" class=\"c3\"><p class=\"c4\">2. Deodorant</p></h2><p class=\"c0\">Apologies, in advance, if this packing list is getting pretty personal already. But let&#8217;s be frank, body odor is a highly Western concept. Deodorants are not commonly used in China and are also not very easy to find (unless you seek out a Western supermarket or department store). I&#8217;m always packing my own deodorant regardless of where I&#8217;m traveling, but the point is, really double-check that this item made it into your bag or be ready to get closely acquainted with your own body odor.</p><p><img class=\"aligncenter size-full wp-image-26455\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/11/agriculture-1807582_1280.jpg?resize=1250%2C387&amp;ssl=1\" alt=\"\" width=\"1250\" height=\"387\"></p><h2 id=\"h.ro9z6b49v5sf\" class=\"c3\"><p class=\"c4\">3. Sunscreen</p></h2><p class=\"c0\">Chinese people aren&#8217;t out to get a bronzed glow and most women will carry an umbrella or seek shade on sunny days. That said, it&#8217;s amazing how difficult it can be to find low-cost and effective sunscreens in China. Unless you can read Chinese, it can be hard to decide whether the Chinese branded &#8220;sunscreen&#8221; really provides any real protection.</p><p class=\"c0\">Even if you don&#8217;t wear a lot of sunscreen, you&#8217;ll be amazed with how much more outdoor walking you will do to get around in China, even in the big cities. Bus stops, trains, and busy intersections for taxis can require a decent amount of walking to get to. Keep your skin healthy and block those UV rays with some SPF from home.</p><h2 id=\"h.lofnaotiu5y9\" class=\"c3\"><p class=\"c4\">4. VPN</p></h2><p class=\"c0\">I&#8217;ve known foreigners who travel to China (or even live in China) without acquiring a VPN. But if you care to access any sites or apps such as Facebook, Instagram, Google Maps, or Western news sources, then you will need to either find a free or paid VPN to download onto your devices, as they are censored by the Great Firewall. Downloading these VPNs in your home country is your safest bet, as you are not guaranteed to be able to access them once you land in China.&#160;Express VPN&#160;will let you try out their VPN for free for 30 days.</p><h2 id=\"h.t4fd2kerrbkd\" class=\"c3\"><p class=\"c4\">5. Plug converter</p></h2><p class=\"c0\">The electricity in mainland China runs on 220V and not 110V. This actually is not a big deal unless you want to plug in your three-prong or two-prong plug into a Chinese switch. Your hostel or accommodation may not offer you a free plug converter for free and for this reason, you&#8217;ll need to come with your own light, reliable and cheap plug converter for China.</p><p><img class=\"aligncenter size-full wp-image-26456\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/11/china-2638230_1280.jpg?resize=1250%2C1062&amp;ssl=1\" alt=\"\" width=\"1250\" height=\"1062\"></p><h2 id=\"h.nch47gn4c3s2\" class=\"c3\"><p class=\"c4\">6. Medication (Pepto-Bismol)</p></h2><p class=\"c0\">If you&#8217;re out eating street food or late-night beers and BBQ (as is quite popular with locals in China), then your chances run pretty high that you will be happy you packed some anti-diarrheal medication with you. Oftentimes, if you tell your home doctor in advance that you are traveling to a country where the food may not be clean, then they will prescribe you a Z-pack or other antibiotic that you can take, in the case that you think you may have contracted food poisoning or other foodborne illness. This information is not to alarm you, but rather make sure you are prepared to nip your illness in the bud immediately.</p><h2 id=\"h.qwo26bwivuq3\" class=\"c3\"><p class=\"c4\">7. Your travel attire</p></h2><p class=\"c0\">Traveling to China is not the trip where you need to go buy cute &#8220;vacation&#8221; outfits ahead of time. If you are visiting in the summer months, China is going to be hot regardless of where you go. Air conditioning is not always on-point in public areas or tourist zones, so the best recommendations is to pack quick-dry fabrics. I stick to light tank dresses, quick-dry sports clothes, and other outfits that have multi-purpose use such as hiking-type shorts and pants as well as a solid pair of sneakers for walking.</p><p class=\"c0\">On the other hand, if you are traveling in Winter, check where you are going and what the weather will be like. Up North in Beijing gets snow and frost, whereas down South in Guangzhou and Hong Kong, you may only need a light jacket. &#160;</p><h2 id=\"h.7ktw7w8z5udg\" class=\"c3\"><p class=\"c4\">8. A China travel guidebook</p></h2><p class=\"c0\">This can be an incredibly useful tool. Many major travel publishers of travel guidebooks have produced the eBook versions of their guides, which makes it easy for travelers to download them on their iPad, smartphone and other devices for convenience. A Chinese travel guidebook will make it easier for you to travel to different places in China and can be super handy if you find that your internet is spotty or VPN is not connecting well.</p><h2 id=\"h.vpd1zyn0ovg5\" class=\"c3\"><p class=\"c4\">9. Backpack</p></h2><p class=\"c0\">With the various supplies you&#8217;re going to be carrying with you (hand soap, wet wipes, medications, maps, water bottles), it&#8217;s best to bring a simple backpack you can throw over your shoulders while exploring. Don&#8217;t worry if you feel like a school kid, as this is the common accessory for other foreign travelers as well.</p><h2 id=\"h.r4qj90yrlvw1\" class=\"c3\"><p class=\"c4\">Notable advice for the ladies</p></h2><ul class=\"c11 lst-kix_x6nt7yo8a3bx-0 start\"><li class=\"c0 c5\"><p class=\"c2\">Pack your own tampons: Personal hygiene for women is very different for Chinese locals as it often is for western travelers. If you plan on traveling to China during that time of the month, be sure to pack your own tampons, as these can be very difficult to access, depending on what city you are visiting in China. If you only require sanitary pads, then you can purchase these items at nearly any supermarket.<br> </p></li><li class=\"c0 c5\"><p class=\"c2\">Keep cleavage to a minimum: Leave your cleavage-baring tops at home, as Chinese women rarely wear low-cut tops. You will draw much more attention from men than you would like.</p></li></ul><h2 id=\"h.irkyaj121ab3\" class=\"c3\"><p class=\"c4\">The Bottom Line</p></h2><p class=\"c0\">This list is a good starter of what to pack for China. As long as you do your due diligence in packing for this adventure, as you already seem to be by reading this article, then you can rest easy knowing you have prepared to make your upcoming trip a success. Enjoy your travels in this marvelous country and gather new perspective on a land much different than your own!</p><p class=\"c0\">About the Author</p><p class=\"c0\">Kristine was a teacher and traveler in China for 3 years and can&#8217;t get enough of this country! She writes for&#160;<a class=\"c7\" href=\"https://www.careerchina.com/\">Career China</a>, a premier resource for living, traveling, and working in China.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"The Ultimate Packing Guide For China"}},"pageContext":{"id":"5b962a5e87be0583274911d6"}}