{"data":{"mongodbDatabaseArticles":{"id":"5b9248dc87be056953db7c04","content":"<div><p>After a week of staying at the great <a href=\"http://www.paramiguesthouse-chiangmai.com/\">Parami Guesthouse</a>, I started asking around for the best places to stay around here. At <a href=\"/co-working-spaces-in-chiang-mai-punspace\">PunSpace</a>, the co-working space I work at, I kept hearing about Hillside Plaza, so I decided to have a look for myself. I found this amazing apartment at the Hillside Plaza 4 complex on Huay Kaew road, in the north-west of the city. Their cheapest room was 42m2 studio with a stunning view of Chiang Mai's mountains in the west. It was only 14,000 baht per month (about 340 euros) and located on the road that connected straight to the Old City. The Old City is the center of the city, where you can find lots of food and bars and where the tourists hang out. The apartment was big, it had a pool and a fitness area. I checked in, paid the amount and moved into the room the next day.</p> <p>The condo is fully furnished with a bedroom and kitchen while featuring an outdoor swimming pool, sauna, steam bath, spa and washing machines. And it's only 14,000 THB or 340 euros per month. I thought that was cheap until I spoke with the girl working at the guesthouse when moving. She said she lived with her family in a house of 2,000 THB or 50 euros per month. Wow. Okay, so definitely room for improvement there.</p> <img class=\"sl_lazyimg\" alt=\"\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img alt=\"\" src=\"https://levels.io/wp-content/uploads/2013/09/IMG_3012.jpg\" width=\"100%\"> <p>It was good for awhile, I had a great mountain view of the west side of Chiang Mai towards the temple at Doi Suthep. But day by day, I found out everything was a bit torn down. It didn't really look like the photos on their website at all.</p> <p><img class=\"sl_lazyimg\" alt=\"\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img alt=\"\" src=\"https://levels.io/wp-content/uploads/2013/09/IMG_2943-1024x764.jpg\" width=\"100%\"><br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/06/IMG_3315-1024x764.jpg\" width=\"100%\"> <p>The ground floor was the most striking of the building, it looked something from an indie movie where a huge desolate shopping mall from the 1950s was struck by a nuclear disaster where people immediately fled. There was empty store windows with mannequins staring hopelessly back at me, a communist-China looking restaurant with live music where old people sat, a deserted pool hall without pool tables but with round Las Vegas style couches with the covers torn. I actually liked walking around there, since it looked so absolutely fucking weird.</p> <img class=\"sl_lazyimg\" alt=\"\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img alt=\"\" src=\"https://levels.io/wp-content/uploads/2013/09/IMG_3093-1024x764.jpg\" width=\"100%\"> <p>It wasn't just the ground floor. When I started paying attention to the building's details everything really was torn down. Somehow they managed to make it so that a prospective renter wouldn't notice it at first. On the outside the building's paint was scratched off and it was covered in smog and dust in many places.</p> <p>It wasn't just the building either, the people living here were hella weird. There was a 25-year old American next to me with a Thai wife who didn't speak English, raising a 3-month old constantly crying baby in an apartment the size of a hotel room. It was ridiculous to see that while the rest of the building was filled with Japanese, Chinese and Australian sexpats. The entire building just breathed like bad shit happened here. You could feel it in the air.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img src=\"https://levels.io/wp-content/uploads/2013/06/IMG_3304-1024x764.jpg\" width=\"100%\"> <p>And now I started seeing it in my room. Shit was broken. My shower was either excruciating hot or freezing cold. There was no middle ground. When I asked the front-desk to fix it, they obliged and sent in a Thai repair guy, who worked on it for 4 hours and then concluded by shouting FIXED. When in fact, he hadn't actually changed a thing.</p> <p>One thing was good though: the pool. I took a dive every day after waking up and it was great for my fitness and I quickly started building muscles after a month of swimming lanes.</p> <p>I was planning on working home half the time and at <a href=\"http://levels.io/co-working-spaces-in-chiang-mai-punspace\">PunSpace</a> the other half. But that plan quickly crashed. After paying for a WiFi card at the Hillside Condo 4 for 700 THB (about 20 EUR), I found out the WiFi was completely unstable. Using my MacBook's signal strength detector, I found it was only somewhat usable in the apartment building's hallway or in the kitchen &#226;&#8364;&#8221; if I had my door open. With no other option, I spent a month with my entire desk cramped into my kitchen and the apartment's door open. Just to get a connection with the speed of a 28k8 modem. A bare situation.</p> <p><img class=\"sl_lazyimg\" alt=\"\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"></p><img alt=\"\" src=\"https://levels.io/wp-content/uploads/2013/09/IMG_3061.jpg\" width=\"100%\"><br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/06/IMG_3062.jpg\" width=\"100%\"> <p>I learned somethings from this experience:<br> (1) Always book an apartment for a day first to see how it actually is;<br> (2) Don't ever trust the photos on the apartment building's website in Thailand, they are probably heavily photoshopped;<br> (3) You're not supposed to pay a rent of 14,000 THB in Chiang Mai, the locals pay 2,000 THB (50 EUR) per month for a whole house, pay accordingly. The maximum you pay should be around 7,000 THB (160 EUR).<br> (4) Apartments, hostels and hotels are interchangeable on this side of the world. With respect to the last point, it doesn't differ so much in price or services if you stay in an apartment, hostel or hotel, since it's all pretty much serviced and furnished renting. And if you ask the manager, you can actually book hotels/hostels for a month or more, while getting huge discounts (50% on the day rate is standard).<br> (5) Apartments are only rentable by at least a month or few months minimum, it decreases your flexibility and being flexible is probably one of the reasons you left the West to live here. In that respect a guesthouse/hostel/hotel is a better choice. That's why I decided to <a href=\"/living-in-a-hotel\">live in a hotel</a> after.</p> <p>After 30 days, I couldn't wait to get the hell out. They charged me 3,000 THB (75 EUR) extra for electricity usage, making the final tally 17,000 THB (400 EUR) for the most shitty apartment I have ever lived in.</p> <p><strong><a href=\"/visa-run-tachileik-myanmar/\">I was glad to pack up and go for my visa run to Tachileik in Myanmar/Burma &#187;</a></strong></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Finding an apartment in Chiang Mai"}},"pageContext":{"id":"5b9248dc87be056953db7c04"}}