{"data":{"mongodbDatabaseArticles":{"id":"5b937aee87be056953db7cf2","content":"<div><h1 name=\"2631\" id=\"2631\" class=\"graf graf--h3 graf--leading graf--title\">Digital Nomad, Digital Expat or Digital Loser? The Big&#160;Debate</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*UTH4ruRrhJwE-atk6R7tug.png\">Hopefully we can help you before this becomes your&#160;reality.<p name=\"c172\" id=\"c172\" class=\"graf graf--p graf-after--figure\">Welcome to a &#8220;lifestyle&#8221; free zone. This is a place where you can sit down and relax and avoid being told how much luggage a &#8220;real digital nomad&#8221; brings on the road with them or how an &#8220;authentic nomad&#8221; can live on $300 a month in Chiang Mai. Instead, we&#8217;re going to concentrate on a much more important issue&#8202;&#8212;&#8202;semantics.</p><p name=\"4fa4\" id=\"4fa4\" class=\"graf graf--p graf-after--p\">This dictionary definition may help if the word seems both familiar and yet slightly out of reach. Semantics are &#8220;the meaning of a word, phrase, sentence, or text.&#8221;</p><h3 name=\"1874\" id=\"1874\" class=\"graf graf--h3 graf-after--p\">Important Semantics</h3><p name=\"ffc4\" id=\"ffc4\" class=\"graf graf--p graf-after--h3\">Perhaps, the most important debate over semantics in the world is whether or not a global situation is deemed to be genocide or not. You see the United Nations (UN) is obliged to intervene if a country is committing genocide. If, on the other hand, they&#8217;re just engaging in a jolly good massacre of thousands or even millions of people&#8202;&#8212;&#8202;that&#8217;s perfectly OK and nobody is obliged to do anything.</p><p name=\"7cc9\" id=\"7cc9\" class=\"graf graf--p graf-after--p\">When Colin Powell, the US Secretary of State, referred to the situation in Darfur as &#8220;genocide&#8221;&#8202;&#8212;&#8202;he was forced to take it back. Not because the situation wasn&#8217;t genocide, from any objective measure it was, but because if the word had been allowed to stay&#8202;&#8212;&#8202;the US would have had to fight for poor people&#8217;s lives and that goes against the grain of neo-colonialism.</p><p name=\"c60f\" id=\"c60f\" class=\"graf graf--p graf-after--p\">You only invade countries to steal their stuff or to avoid having to deal with the people really responsible for attacks on your soil; you don&#8217;t do it when some good might come out of it.</p><p name=\"9cdc\" id=\"9cdc\" class=\"graf graf--p graf-after--p\">For the same reason a UN report labeling the North Korean regime as genocidal towards its own people (the report in fact pointed out that when Hitler was doing his holocaust thing, we didn&#8217;t know what he was up to, this time we fucking well do know what North Korea is up to, we just don&#8217;t care) was suppressed. Who wants to upset China and reduce the number of lead painted toys their children can access when we can just pretend a holocaust is not happening?</p><p name=\"d33f\" id=\"d33f\" class=\"graf graf--p graf-after--p\">Yes, you&#8217;ve guessed it&#8202;&#8212;&#8202;North Korea isn&#8217;t hiding much in the way of things we want to steal either. It&#8217;s a shame, if they&#8217;d been a major oil producing nation, we&#8217;d already have planted the American flag over Pyongyang.</p><h3 name=\"f447\" id=\"f447\" class=\"graf graf--h3 graf-after--p\">Much Less Important Semantics</h3><p name=\"a7be\" id=\"a7be\" class=\"graf graf--p graf-after--h3\">Fortunately, it is not to genocide that we will be turning today. Though stay tuned because later this week we&#8217;ll be turning to another very unpleasant word, &#8220;sociopath,&#8221; and we&#8217;ll be taking a much deeper look at that one.</p><p name=\"e41b\" id=\"e41b\" class=\"graf graf--p graf-after--p\">It is the meaning of &#8220;digital nomad&#8221; that needs a little definition adding to it.</p><p name=\"0918\" id=\"0918\" class=\"graf graf--p graf-after--p\">The literalist argument:</p><p name=\"d482\" id=\"d482\" class=\"graf graf--p graf-after--p\">If we were to take a literal approach to this phrase, anyone with fingers who travels and works would be a digital nomad.</p><p name=\"b08a\" id=\"b08a\" class=\"graf graf--p graf-after--p\">This is quite obviously a very stupid approach and can be ignored.</p><p name=\"2f7c\" id=\"2f7c\" class=\"graf graf--p graf-after--p\">The almost literalist argument:</p><p name=\"e7da\" id=\"e7da\" class=\"graf graf--p graf-after--p\">As well as fingers &#8220;digital&#8221; might also refer to the use of electronic equipment and the common &#8220;almost literal&#8221; approach to the phrase &#8220;digital nomad&#8221; is that it refers to someone who travels and works online.</p><h3 name=\"814d\" id=\"814d\" class=\"graf graf--h3 graf-after--p\">The Digital&#160;Expat</h3><p name=\"bc50\" id=\"bc50\" class=\"graf graf--p graf-after--h3\">This would be fine but there are good reasons that this phrase doesn&#8217;t work very well. In big &#8220;nomad hubs&#8221; there are in fact, very few nomads. There are lots of kids who work online (and quite a few that talk about working online without ever getting to the point of working&#8202;&#8212;&#8202;they joys of a trust fund, nice no-work if you can get it) but the largest number of people don&#8217;t really travel.</p><p name=\"ff51\" id=\"ff51\" class=\"graf graf--p graf-after--p\">They&#8217;re based in Chiang Mai or Ubud or wherever and they have no intention of ever moving on from these places. Sure, they do occasional visa runs but they rarely even stop to smell the roses, in the places where they switch their paperwork. They&#8217;re too busy planning their $5 return on the worst bus in history because people who &#8220;crush it&#8221; can&#8217;t afford plane tickets.</p><p name=\"918f\" id=\"918f\" class=\"graf graf--p graf-after--p\">This leads to many people arguing that they have lost their &#8220;digital nomad&#8221; status and become, instead, &#8220;digital expats.&#8221;</p><p name=\"b013\" id=\"b013\" class=\"graf graf--p graf-after--p\">The trouble with this is that it is pure hokum. Expats are legal immigrants with work permits, health insurance and who pay taxes.</p><p name=\"012e\" id=\"012e\" class=\"graf graf--p graf-after--p\">There are a small number of &#8220;digital expats&#8221; in Chiang Mai, for example, these are the IT workers who have availed themselves of the Iglu service which takes a whopping 30% of your earnings but gets you legal.</p><p name=\"34cc\" id=\"34cc\" class=\"graf graf--p graf-after--p\">The vast majority of &#8220;long-termers,&#8221; however, simply have no intention of ever getting legal. They will spend three years visa running on tourist visas and bitterly moaning about how much the &#8220;Thai government hates them&#8221; without so much as a shred of irony. Try being Thai and spending three years in the UK or the USA on a tourist visa&#8202;&#8212;&#8202;not happening. Not ever.</p><p name=\"d457\" id=\"d457\" class=\"graf graf--p graf-after--p\">Then they&#8217;ll be on an &#8220;education&#8221; visa for the next three years after that pretending to do &#8220;self-defense&#8221; or more amusingly, trying to learn Thai. Then they&#8217;ll swap out their passports and start all over again at the beginning.</p><p name=\"92f3\" id=\"92f3\" class=\"graf graf--p graf-after--p\">They will never have a work permit, they&#8217;ll never pay tax and most of them will never earn enough to have health insurance either. The only thing that they have in common with the traditional expat is that they live in another country. A more accurate description of these people might be &#8220;lazy, digital economic refugees.&#8221;</p><p name=\"8f3b\" id=\"8f3b\" class=\"graf graf--p graf-after--p\">But they would cry if you thought they were refugees. In their heads that means &#8220;Syrian&#8221; and from the depths of their visit to Chiang Mai they can wax lyrical for hours about how Muslims are ruining the world and killing everyone in the West.</p><p name=\"c37e\" id=\"c37e\" class=\"graf graf--p graf-after--p\">Sadly, this just makes them indistinguishable from other digital racists. It might be nice if these idiots wore baseball caps with &#8220;DR&#8221; printed on them; this would make it much easier to avoid them when they do creep into a bar near me.</p><h3 name=\"9cad\" id=\"9cad\" class=\"graf graf--h3 graf-after--p\">The Digital&#160;Loser</h3><p name=\"6b7a\" id=\"6b7a\" class=\"graf graf--p graf-after--h3\">Before everyone gets upset about this section, we need to have another quick look at semantics and this time our chosen word is &#8220;nice&#8221;.</p><h3 name=\"e9e5\" id=\"e9e5\" class=\"graf graf--h3 graf-after--p\">Nice&#8202;&#8212;&#8202;It&#8217;s The Worst Word in the&#160;World</h3><p name=\"cfd7\" id=\"cfd7\" class=\"graf graf--p graf-after--h3\">How would you describe a man who raised over $50 million for charity? A man who arranged for hundreds of sick children to have their wishes fulfilled? A man who was a professional athlete and who went on to entertain a whole nation?</p><p name=\"0a6c\" id=\"0a6c\" class=\"graf graf--p graf-after--p\">You&#8217;d probably pick &#8220;nice&#8221; as one of your adjectives, right? That&#8217;s a selfless, caring person, right?</p><p name=\"dc90\" id=\"dc90\" class=\"graf graf--p graf-after--p\">Oh so wrong. That&#8217;s <a href=\"https://en.wikipedia.org/wiki/Jimmy_Savile\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Jimmy Savile.</a> That is a man who will be remembered as, possibly, Britain&#8217;s most voracious sex offender in history.</p><p name=\"8b93\" id=\"8b93\" class=\"graf graf--p graf-after--p\">He abused children&#8202;&#8212;&#8202;several of whom were younger than 10, he abused the disabled, he abused adults, if there was somebody vulnerable out there that Jimmy could abuse, he got stuck in there. He even fucked corpses in a hospital mortuary. Oh do I wish I was making that up, but I&#8217;m not. Nice old Jimmy shagged dead bodies whilst he was visiting hospitals to be &#8220;nice.&#8221;</p><p name=\"f003\" id=\"f003\" class=\"graf graf--p graf-after--p\">He lived for 85 years. He had hundreds of victims. Nobody ever came forward to the police until after he was dead. Why not?</p><p name=\"2880\" id=\"2880\" class=\"graf graf--p graf-after--p\">Because Jimmy Saville was &#8220;nice.&#8221; It put him beyond criticism. He raised money for charity and helped children. He was so &#8220;nice&#8221; that he literally got away with rape over and over again.</p><p name=\"8ca9\" id=\"8ca9\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;Nice&#8221; may be the most meaningless word in the English language. It&#8217;s weak and it&#8217;s pathetic. It is used to describe somebody when there is very little of positive value to say.</p><p name=\"d9e7\" id=\"d9e7\" class=\"graf graf--p graf-after--p\">If somebody is not clever, not sporty, not funny, not talented, not attractive and not interesting the word people reach for to describe them is &#8220;nice.&#8221;</p><p name=\"3fa2\" id=\"3fa2\" class=\"graf graf--p graf-after--p\">Because &#8220;nice&#8221; people, who in the main are inoffensive but just like Jimmy Savile may not be inoffensive at all, are the washouts of society&#8202;&#8212;&#8202;it has become forbidden to criticize somebody who is nice. No matter how dangerous they are.</p><p name=\"3199\" id=\"3199\" class=\"graf graf--p graf-after--p\">Anti-vaccination lobbyists are scum. They place entire communities at risk of serious diseases that were almost wiped out. <a href=\"http://www.huffingtonpost.com/entry/california-nevada-county-measles-case_us_56faf06ae4b0daf53aede292\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">People are catching measles in California in the 2000s</a> because of these people. It doesn&#8217;t matter how &#8220;nice&#8221; they are, they&#8217;re horrible people perpetuating evil upon the innocent. Babies don&#8217;t get a say in their healthcare&#8202;&#8212;&#8202;when you start denying them preventative medicine which is 100% effective, you are not a good person even if you are a &#8220;nice&#8221; person.</p><p name=\"b82c\" id=\"b82c\" class=\"graf graf--p graf-after--p\">Wherever you look, you can find &#8220;nice&#8221; people doing shitty things. This is a huge problem for the &#8220;digital nomad movement&#8221; as a whole. We&#8217;re going to be taking a close look at a lot of &#8220;nice&#8221; people doing shitty things in Chiang Mai over the next few weeks.</p><p name=\"62e1\" id=\"62e1\" class=\"graf graf--p graf-after--p\">It may help you to remember that one of history&#8217;s biggest megalomaniacal genocide perpetrators, <a href=\"https://en.wikipedia.org/wiki/Blondi\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Adolf fucking Hitler, is described as being &#8220;nice to dogs</a>.&#8221; Don&#8217;t trust that word &#8220;nice&#8221; it doesn&#8217;t mean, what you think it means and all too often it&#8217;s used to mask something that really isn&#8217;t &#8220;nice.&#8221;</p><h3 name=\"d550\" id=\"d550\" class=\"graf graf--h3 graf-after--p\">A Return to the Digital&#160;Loser</h3><p name=\"424c\" id=\"424c\" class=\"graf graf--p graf-after--h3\">So, now we have put the word &#8220;nice&#8221; in context&#8202;&#8212;&#8202;we can acknowledge that many people in the &#8220;digital nomad lifestyle&#8221; scene are nice without that conferring on them either sainthood or immunity from criticism.</p><p name=\"c0a9\" id=\"c0a9\" class=\"graf graf--p graf-after--p\">By the way, if you are ever told something or somebody is beyond criticism it&#8217;s time to start criticizing, if nobody else is going to apply their brain in a situation&#8202;&#8212;&#8202;you&#8217;d best start using yours before you drink the Kool-Aid.</p><p name=\"3035\" id=\"3035\" class=\"graf graf--p graf-after--p\">It is fair to say, even if it&#8217;s not &#8220;nice&#8221; to say it, that the majority of &#8220;lifestyle digital nomads&#8221; are losers by ordinary societal yardsticks. Many of these losers would like to redefine those yardsticks so that &#8220;living on food stolen from bins, sleeping in shelter that you have made from material stolen from a bin and practicing &#8216;Christian Science&#8217; when you need medicine&#8221; is success. It isn&#8217;t. It&#8217;s never going to be.</p><p name=\"21c1\" id=\"21c1\" class=\"graf graf--p graf-after--p\">That doesn&#8217;t mean you can&#8217;t choose that life. Nobody is standing in your way. But it does mean you need to shut up about &#8220;living like a king&#8221; or &#8220;crushing it&#8221; or any other form of success&#8202;&#8212;&#8202;you don&#8217;t know what it looks like to speak about it.</p><p name=\"5bd3\" id=\"5bd3\" class=\"graf graf--p graf-after--p\">Your average &#8220;developing nation&#8221; digital loser has completely misunderstood the term &#8220;geo-arbitrage,&#8221; which is the idea that you take a Western salary and move to a nation where the costs of living are lower&#8202;&#8212;&#8202;so you get more bang for your buck.</p><p name=\"c532\" id=\"c532\" class=\"graf graf--p graf-after--p\">The digital loser moves to a developing nation to earn the same as a farm worker in that developing nation. They then spend a lot of time boasting about how they&#8217;re living &#8220;authentically&#8221; and how all the local farm workers love them.</p><p name=\"5151\" id=\"5151\" class=\"graf graf--p graf-after--p\">This is because losers have lots of spare time and because losers tend to have no cultural awareness at all.</p><p name=\"b4fc\" id=\"b4fc\" class=\"graf graf--p graf-after--p\">Firstly, those farm worker friends they have? They laugh at the digital loser behind their back. They don&#8217;t respect your choice to leave a rich Western nation with huge amounts of opportunity to live like a farmer in Thailand&#8202;&#8212;&#8202;they think you&#8217;re an idiot. They&#8217;re just too polite (because that&#8217;s how face cultures work) to tell you to your face.</p><p name=\"f171\" id=\"f171\" class=\"graf graf--p graf-after--p\">Secondly, those farm workers have national health coverage (it may be crap but they have it) so they don&#8217;t need to buy health insurance. They&#8217;re living in their own countries&#8202;&#8212;&#8202;so they don&#8217;t need to do visa runs. Oh and they probably own their own land and home because families pitch in to buy these things together so unlike the digital loser&#8202;&#8212;&#8202;they&#8217;re not paying rent either.</p><p name=\"07e0\" id=\"07e0\" class=\"graf graf--p graf-after--p\">In short our digital loser is living a substantially worse life than a Thai farm worker. That&#8217;s a Thai farm worker who would happily trade the opportunity to work in the UK or America (doing absolutely anything) in a heartbeat for his or her current station in life.</p><p name=\"01d0\" id=\"01d0\" class=\"graf graf--p graf-after--p\">Living in Thailand for $300-$500 a month is not success. It&#8217;s a loser&#8217;s lifestyle. It puts you in a position of living worse than a local peasant (literally because &#8220;peasant&#8221; means &#8220;poor farmer of low social status&#8221;).</p><p name=\"89cb\" id=\"89cb\" class=\"graf graf--p graf-after--p\">It is a life without health care, without security and it&#8217;s a life where you are detached from your own culture, family and friends. That&#8217;s not paradise. That&#8217;s not &#8220;crushing it&#8221;. That&#8217;s shit and that&#8217;s what &#8220;digital losers&#8221; have to look forward to.</p><p name=\"062c\" id=\"062c\" class=\"graf graf--p graf-after--p\">The thing that the <a href=\"https://entrepreneurs.maqtoob.com/10-signs-that-your-digital-nomad-guru-or-advisor-is-a-crackpot-bd63727f9cad#.r3adfncxr\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">lifestyle &#8220;gurus&#8221;</a> don&#8217;t tell these people is that it rarely gets much better for the digital loser. If you have no skills, no talents, and no way of earning a living before you get to the third world&#8202;&#8212;&#8202;you are, almost certainly, not going to develop those things after you arrive.</p><p name=\"882f\" id=\"882f\" class=\"graf graf--p graf-after--p\">Many digital losers have no way to go home. They sold everything and spent all they had on a flight and a worthless guru&#8217;s course. When they go broke&#8202;&#8212;&#8202;they can&#8217;t get out. They&#8217;re stuck in &#8220;paradise&#8221; (which looks more and more like a slum each day when you&#8217;re broke). This is when their YouTube channels disappear and they stop blogging and they end up staring at the walls of their tiny prison-cell like apartment each day, wishing they&#8217;d never done this.</p><p name=\"6680\" id=\"6680\" class=\"graf graf--p graf-after--p\">People don&#8217;t like to talk about their failure. They especially don&#8217;t like to do it during the point of failure. You may see the occasional multi-millionaire discussing the lowest points of their lives but you&#8217;ll rarely find a guy living on 5 baht packets of noodles, three times a day, talking about his. The digital loser disappears from view, they want to slip away from your attention rather than court it.</p><p name=\"2dd0\" id=\"2dd0\" class=\"graf graf--p graf-after--p\">This is great for the &#8220;digital nomad lifestyle&#8221; gurus. Their victims don&#8217;t discuss what happens to them. Rather like most crime victims, they want to forget.</p><h3 name=\"9002\" id=\"9002\" class=\"graf graf--h3 graf-after--p\">Why so&#160;Mean?</h3><p name=\"414f\" id=\"414f\" class=\"graf graf--p graf-after--h3\">Now, I know where some people&#8202;&#8212;&#8202;those who stuck it out this far&#8202;&#8212;&#8202;will be going next. &#8220;Why do you have to be so mean? Why kick someone when they&#8217;re down? Why not build up their self-esteem and encourage them to be better?&#8221;</p><p name=\"d3ab\" id=\"d3ab\" class=\"graf graf--p graf-after--p\">I&#8217;m not stopping you from doing that but I have little interest in it myself. That&#8217;s not the purpose of this piece. For my money, once the digital loser is trapped in Chiang Mai on $300-$500 a month, they&#8217;re finished. There&#8217;s no magic wand going to restore these people&#8217;s lives, they were sucked in by the guru machine and spat out broke. Sorry but that&#8217;s the past and I can&#8217;t change it.</p><p name=\"9f04\" id=\"9f04\" class=\"graf graf--p graf-after--p\">What we can do is spread the word to people considering doing the same stupid thing. Selling all their shit, buying a crappy course and moving to somewhere a million miles away from home to fail. Those people haven&#8217;t fucked up yet. They aren&#8217;t digital losers, yet.</p><p name=\"85e6\" id=\"85e6\" class=\"graf graf--p graf-after--p\">By using the term &#8220;digital loser&#8221; in relation to the reality, I hope to stop those people from getting on a plane to a personal hell in the first place.</p><p name=\"b7df\" id=\"b7df\" class=\"graf graf--p graf-after--p\">You may aspire to the &#8220;digital nomad lifestyle&#8221; or to be a &#8220;digital expat&#8221; but nobody in history has ever aspired to be a &#8220;loser.&#8221;</p><p name=\"2db1\" id=\"2db1\" class=\"graf graf--p graf-after--p\">Truth is rarely &#8220;nice.&#8221; It&#8217;s rarely pleasant. It&#8217;s unpopular when it&#8217;s told but it doesn&#8217;t mean that it doesn&#8217;t need telling. This is what <a href=\"https://www.youtube.com/watch?feature=youtu.be&amp;v=sHP1OrFUZFA&amp;app=desktop\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">living on $300 a month in Thailand</a> really looks like and it&#8217;s pathetic not aspirational.</p><p name=\"76f2\" id=\"76f2\" class=\"graf graf--p graf-after--p\">It&#8217;s living in a room with no kitchen and no living area. It&#8217;s eating rice and vegetables, every single day, cooked in a rice cooker because you have nothing else to cook with and can&#8217;t afford anything else. It&#8217;s a &#8220;$21 a month&#8221; entertainment budget and because it&#8217;s January&#8202;&#8212;&#8202;he&#8217;s not using the a/c&#8202;&#8212;&#8202;wait until it hits nearly 40 degrees in April, his entertainment budget will be minus $50 at that point.</p><p name=\"1088\" id=\"1088\" class=\"graf graf--p graf-after--p\">He&#8217;s got no pool. No palm trees. He has nothing nice in his life at all. His life is so empty that <a href=\"https://www.youtube.com/watch?v=ptkWJJxvaXY\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">he spends 5 minutes whispering at the camera</a> (with a sore throat) to explain that yes, they have pharmacies in Thailand. As if anyone would have thought otherwise?</p><p name=\"db5f\" id=\"db5f\" class=\"graf graf--p graf-after--p\">I don&#8217;t know about you but that makes me sad. Here&#8217;s a guy in his middle age and he&#8217;s sick and he has no-one to help him buy medicine and he&#8217;s sitting in a bare minimum room in Thailand looking forward to boiled rice and vegetables because he can&#8217;t afford to go out and eat. Is that how you would define &#8220;crushing it?&#8221;</p><p name=\"7846\" id=\"7846\" class=\"graf graf--p graf-after--p\">Because he looks more like he&#8217;s being crushed to me, by the harsh realities of a life&#8202;&#8212;&#8202;that is a world away from home with no money and no mates to make it more enjoyable.</p><p name=\"ddb7\" id=\"ddb7\" class=\"graf graf--p graf-after--p\">This family learned about <a href=\"https://www.youtube.com/watch?v=qKDZcYF6NG4\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the realities of digital nomad life</a> without a plan and skills too. On their YouTube channel they documented their almost inevitable fall from &#8220;we&#8217;ve got money in the bank and we&#8217;re traveling the world&#8221; to &#8220;we&#8217;re broke, we&#8217;ve overstayed our visas and we&#8217;ve had to beg for money to go home.&#8221; I salute them for their courage to be honest about their journey&#8202;&#8212;&#8202;courage that most digital losers won&#8217;t have when they fail.</p><p name=\"98e9\" id=\"98e9\" class=\"graf graf--p graf-after--p\">And this is &#8220;why so mean&#8221;.</p><p name=\"d813\" id=\"d813\" class=\"graf graf--p graf-after--p\">The people aspiring to this clich&#233;d garbage are no longer middle class 20-somethings on mummy and daddy&#8217;s dime, who can click their fingers and return to their old lives whenever they like. Those 20-somethings may be gullible but they&#8217;re not dumb. They worked this out for what it is and moved on.</p><p name=\"e1eb\" id=\"e1eb\" class=\"graf graf--p graf-after--p\">It&#8217;s being sold to people at rock bottom. People with no place to go and no ability to get there. The gurus are happy to meet them at the airport wearing their crocodile smiles as they help lighten the losers&#8217; wallets but when they end up going to the wall? The gurus are nowhere to be found.</p><p name=\"f7aa\" id=\"f7aa\" class=\"graf graf--p graf-after--p\">The digital loser is simply forgotten and discarded. The lucky ones can beg, steal or borrow a ticket home. The unlucky ones get pulled into the side of Asia that never appears in the digital nomad lifestyle brochures&#8202;&#8212;&#8202;the slum living, the endless plastic bags of sticky rice and contaminated drinking water spilled from a street side vending machine. That&#8217;s the real $300 lifestyle when your savings run out.</p><p name=\"6daa\" id=\"6daa\" class=\"graf graf--p graf-after--p\">It&#8217;s not mean to try and stop people from doing this. It&#8217;s fucking mean to let them come and fail and to profit from it. It may not be nice to let someone know they&#8217;re setting themselves up to be a digital loser but it&#8217;s far nicer than the reality of being a digital loser.</p><h3 name=\"0582\" id=\"0582\" class=\"graf graf--h3 graf-after--p\">Want to be a Digital&#160;Nomad?</h3><p name=\"7ee3\" id=\"7ee3\" class=\"graf graf--p graf-after--h3\">If you want to be a digital nomad&#8202;&#8212;&#8202;work out how you&#8217;re going to get paid before you leave home. Set up your business, get yourself a job, or whatever else you intend to do. If you have no income stay at home. DO NOT sell your things to buy a course and a plane ticket. You will end up a Digital Loser.</p><h3 name=\"1380\" id=\"1380\" class=\"graf graf--h3 graf-after--p\">Want to be a Digital&#160;Expat?</h3><p name=\"c562\" id=\"c562\" class=\"graf graf--p graf-after--h3\">Get a real job on the other side of the world, selling real skills and getting paid a real salary by a real company. Let them sort out flight tickets, accommodation, health insurance, visas, work permits, etc.</p><p name=\"0e3d\" id=\"0e3d\" class=\"graf graf--p graf-after--p\">As a fall back plan have a company big enough that you can relocate it somewhere else, where it makes sense to pay taxes, apply for work permits, etc. Please note: this is a much rarer circumstance than many would have you believe.</p><h3 name=\"d8fd\" id=\"d8fd\" class=\"graf graf--h3 graf-after--p\">Want to be a Digital&#160;Loser?</h3><p name=\"5145\" id=\"5145\" class=\"graf graf--p graf-after--h3\">There&#8217;s no helping some people. Go for it. Sell your shit, buy the course, come to Chiang Mai but before you do&#8202;&#8212;&#8202;stick around for a couple of weeks and read this column. We&#8217;re about to get under the skin of the Chiang Mai gurus and the digital nomad lifestyle and, of course, examine some more semantics.</p><h3 name=\"c97b\" id=\"c97b\" class=\"graf graf--h3 graf-after--p\">What&#8217;s Next?</h3><p name=\"e9b6\" id=\"e9b6\" class=\"graf graf--p graf-after--h3\">In our next installment we&#8217;ll be examining a real sociopath, one whose lifestyle depends on selling Chiang Mai to digital losers. Then we&#8217;ll be moving on to examine the cult of the Digital Nomad (loser) in Chiang Mai and why it&#8217;s important to tackle this now. Finally, there&#8217;s the one you&#8217;ve all been waiting for&#8202;&#8212;&#8202;a tear down on Chiang Mai&#8217;s biggest liar, braggart and bully.</p><p name=\"0777\" id=\"0777\" class=\"graf graf--p graf-after--p graf--trailing\">Once that&#8217;s done. I&#8217;m out of Thailand. I&#8217;m moving onto pastures new and a long way from the maddening herd of digital losers. Then maybe I can write about something chirpier? Or maybe not.</p></div>","title":"Digital Nomad, Digital Expat or Digital Loser? The Big Debate"}},"pageContext":{"id":"5b937aee87be056953db7cf2"}}