{"data":{"mongodbDatabaseArticles":{"id":"5b92397787be0583cfde6809","content":"<div><p></p><img class=\"size-large wp-image-21001\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/05/where-to-incorporate-amazon-fba-business-700x465.jpg\" alt=\"Where to incorporate an Amazon FBA business\" width=\"700\" height=\"465\"><p>Dateline: Kotor, Montenegro</p>\n<p>Lots of entrepreneurs with fast-growing e-commerce businesses want to know &#8220;Where do Amazon FBA sellers and Shopify store owners set up their corporation to do business?&#8221;</p>\n<p>Generally, this differs from person to person. For one thing, it depends on how much tax you want to pay; if the answer is &#8220;I love paying taxes&#8221;, then any old company in Australia or Canada or wherever else will probably do.</p>\n<p>However, if you&#8217;re trying to decide where to set up a company to reduce your taxes and liability, there are a few factors that you need to consider.</p>\n<p>The first thing to think about is tax. What a lot of people don&#8217;t realize is that you have the power to decide how you want to be taxed. More importantly, there are also things that you can do to help reduce, or even eliminate, the tax that you pay.</p>\n<p>The next thing to think about is liability. As a business owner, one of your biggest priorities is to protect yourself from getting sued. Not only that, you&#8217;ll want to make sure that if it does happen, you don&#8217;t lose absolutely everything that you own.</p>\n<p>There are, of course other things to consider. But, for the average person starting out, tax, and liability are the most common considerations. I&#8217;m going to go over each of these points in a bit more detail.</p>\n<p>First, let&#8217;s talk about legal liability. (Disclaimer: I am NOT a product liability lawyer nor any kind of lawyer, and you should consult one for a real assessment of any liability risks.)</p>\n<p>Your level of liability is heavily influenced by where you do business. The United States, for example, is one of the most sue-happy places in the world. Even if you don&#8217;t live there, selling there could subject you to liability without the proper structure. Therefore, if liability is a big concern for you, this might not be the best place to set up shop.</p>\n<p>Sellers on Shopify, and similar online platforms, based in The USA are all subject to liability. One of the best things that these sellers can do to protect themselves is to operate as a company, rather than as a sole proprietor from the get go.</p>\n<p>A lot of people start out selling online and they&#8217;re not sure how its going to work out or if they&#8217;re even going to make any profit. So, what they decide to do is run the business just as their own name. This can be a huge problem because, if anything happens and they get sued, they can lose absolutely everything that they own.</p>\n<p>When you trade online, there is a high possibility that you&#8217;re going to run into jokers and fraudsters. This might seem far-fetched but bad things do happen.</p>\n<p>Having a company somewhere is, therefore, extremely helpful. If you live in The USA that company could be an LLC (limited liability company.) If you live somewhere else then that could simply be a domestic company where you live. If you happen to live in a high tax country full time, it may be a good idea to operate as a domestic company just while you&#8217;re starting out.</p>\n<p>Ultimately, I advise getting the money together and having a company from day 1 to avoid running into any potential problems. Do what you can to start off with the best possible set up and avoid any potential mishaps.</p>\n<p>&#160;</p>\n<p class=\"et_post_video\"></p>\n<p>&#160;</p>\n<h2><strong>Tax</strong></h2>\n<p>Where you live and how you run your business largely dictates how much tax you&#8217;re going to pay.</p>\n<p>While Starbucks can use a web of international companies to reduce its tax rate and pay very little in developed countries, they have a team of accountants helping them, as well as employees all over the globe. Even then, these big companies get hit with back tax bills because the government disagrees with their aggressive structure.</p>\n<p>In the long run, it&#8217;s better to be location independent &#8211; or at least <a href=\"http://nomadcapitalist.com/2015/09/07/tax-free-countries-second-residency/\">relocate to a low-tax country</a> &#8211; if you want to enjoy the cleanest, most legal tax benefits.</p>\n<p>If you live in the United States, for example, then an LLC is very beneficial for liability purposes. However, LLC owners aren&#8217;t going to get a tax benefit. If you don&#8217;t care about paying high taxes, then I&#8217;m probably not your guru. The goal, in my mind, is for people selling online to reduce their taxes as much as possible.</p>\n<p>One of the easiest ways to do that is to live somewhere outside of your home country.</p>\n<p>The rules for this vary depending on where you go. In general, though, if you are an American citizen and you want to live outside of The USA, it&#8217;s possible to exempt a lot (or even all) of your earnings by simply starting up your business in a different country. The exact same concept goes for people in Australia, the UK, Canada etc.</p>\n<p>As discussed, there are also limited but potential circumstances to get tax benefits the way that big companies like Google and Starbucks do. They operate and live in one country but have outlets all round the world. Although, for the most part, I assume that their unique situation doesn&#8217;t apply to most people reading this article.</p>\n<p>The defining question, really, is how much do you want to reduce your tax?</p>\n<p>If you don&#8217;t care about reducing tax and just want to reduce your liability then set up something in your home country, pay your corporate tax, and you&#8217;re done.</p>\n<p>Businesses operating in the United States should pay themselves all of the profits and then pay income tax on all of the profits, too. While those of you in <a href=\"http://www.paycalculator.com.au/\" target=\"_blank\" rel=\"noopener\">Australia</a>, the UK and some other countries will set up a corporation and then pay yourself some sort of salary.</p>\n<p>To really lower your tax payments to their possible potential, I recommend starting up a company overseas.</p>\n<p>There are so many places to consider and where you choose will all depend on your situation. There are a lot of options for offshore companies, ranging from more &#8220;onshore&#8221; jurisdictions like Hong Kong and Malta, to the traditional tax havens like British Virgin Islands, Belize, and Seychelles.</p>\n<p>In general, my opinion is that the trend is moving away from tax havens with little accountability, and toward onshore jurisdictions that allow for zero tax in some circumstances or very low tax in others.</p>\n<p>Not only does starting up an overseas company give you an extra barrier in terms of liability, it also means you can choose how you&#8217;re going to be taxed. This is what &#8220;go where you&#8217;re treated best&#8221; is all about.</p>\n<p>So, if you do decided to go to a country with very low or even no tax &#8211; Georgia, <a href=\"http://nomadcapitalist.com/2016/05/25/best-country-online-company-incorporation/\">Estonia</a> and Malta are all perfect examples &#8211; you can control exactly how you&#8217;re doing it. For an Amazon FBA or online seller, this is one of the smartest decisions you can make.</p>\n<p>As an online seller, you&#8217;re going to go through a lot of inventory and every time you make a profit, you&#8217;re going to have to pay tax in the country where you live. It&#8217;s very common for online sellers operating where they live to end up paying far too much tax because of this.</p>\n<p>The end result will be that you&#8217;ll really hinder how quickly you can grow your business. If each time you make a sale, they take between 25% and 50% of your profits, that&#8217;s dramatically cutting down the amount of money you have to reinvest in new products.</p>\n<p>Starting an offshore company makes a lot more sense for anyone who&#8217;s willing to spend part of their time, or all of their time, living outside their home country. If you do this properly, you can control where you live so that you&#8217;re not paying more tax than you need to.</p>\n<p>When you&#8217;ve decided on where you want to be taxed, you can then set up your company to control where it&#8217;s being taxed.</p>\n<p>For example, you could set up your company in Hong Kong and then live in a country that won&#8217;t tax you.</p>\n<p>The plus side is that most of these countries also have beaches so they&#8217;re not exactly miserable places to live! Choose wisely and your company won&#8217;t be taxed, you won&#8217;t be taxed, and you can potentially get your tax rate as low as 0%.</p>\n<p>Evidently, this option is much more attractive, both for tax purposes and liability purposes, than merely setting up an LLC in the United States. All it takes from you is a will to relocate yourself and your e-commerce or Amazon business.</p>\n<p>I see a lot of entrepreneurs who are living in The USA and making a lot of money. However, they&#8217;re hindering their ability to grow their business because they have to pay that excruciating tax every time they make a transaction. Ultimately, it means they have much less money to put back in their company.</p>\n<p>For them, the idea of liability is a big issue but for me the big issue is tax. That&#8217;s where being offshore really counts. If you&#8217;re going to live in The USA for 365 days a year, having an offshore company may help you with liability, but it could be logistically detrimental. If living outside your home country isn&#8217;t too much of a push, then operating as an offshore company is, truly, the best option.</p>\n<p>Which jurisdiction is best for you really depends, not only on your business situation, but on your personal situation and preferences. If you&#8217;re ready to start looking for some inspiration, I recommend <a href=\"http://nomadcapitalist.com/2016/05/25/best-country-online-company-incorporation/\">reading this article</a> first.</p>\n<p>The main thing to take from this, though, is to be open to the idea of saving on tax- especially if you&#8217;re an online entrepreneur turning over money really quickly. Undoubtedly, the best way to do this is by operating as an overseas company.</p>\n<p>If you&#8217;re an Amazon seller and want some help structuring your business, banks, and life overseas to minimize or even eliminate your tax, I may be able to help. You can <a href=\"https://nomads.lpages.co/apply/\">click here to tell me about yourself</a> and my team will let you know if I can help.</p>\n</div>","title":"Where to incorporate your Amazon FBA business to reduce taxes"}},"pageContext":{"id":"5b92397787be0583cfde6809"}}