{"data":{"mongodbDatabaseArticles":{"id":"5b95ee8c87be0583274900e3","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Don&#8217;t Know Where to Travel in Thailand?</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/dont-know-where-to-travel-in-thailand/\"><img class=\"aligncenter size-full wp-image-14060\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/11/Where-to-Travel-Header-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Don't know where to travel in Thailand?\" width=\"1000\" height=\"550\"></a></p>\n<p>&#8220;I&#8217;m taking a trip to Thailand next month. Where should I go?&#8221; This&#160;question lands in our inbox quite often but it&#8217;s one that we have a hard time providing a concise but thoughtful answer to. Unfortunately, without knowing a person&#8217;s travel goals, priorities, and budget, it&#8217;s nearly impossible for us to give a worthwhile suggestion regarding where to travel in Thailand.</p>\n<p>The thing is, <strong>travel requires a lot of personal decisions and everyone&#8217;s ideal vacation or trip is different</strong>. Rock climbing in Chiang Mai may be an adventure to some and a nightmare to others. Sunbathing on a beach in Krabi and sipping cocktails for days on end may be relaxing for people who just want to unwind but downright mind-numbing for people who want to get out and explore.</p>\n<p>Lesson learned:&#160;<strong>there is no one-size-fits-all answer.</strong></p>\n<p>Never fear! We&#8217;ve put together a few questions you can ask yourself to help you decided where to travel in Thailand on your upcoming visit.</p>\n<h2><p id=\"What_first_made_you_choose_Thailand\"><p>What first made you choose Thailand?</p></p></h2>\n<p>Was it a display of Thai art you saw on Pinterest? A beautiful scene in a movie? An out-of-town-trip that randomly landed you at a Thai restaurant and your first experience eating its exotic cuisine?</p>\n<p>Ask yourself,<strong> &#8220;What was it that first put Thailand on my radar?&#8221;</strong></p>\n<p>We first became interested in Thailand after&#160;dining at an incredible Thai restaurant where we lived just outside of Washington, DC. We subsequently binge watched&#160;Anthony Bourdain&#8217;s No Reservations episodes about&#160;Thailand and were pretty much hooked after that.</p>\n<p>Nowadays&#160;when we travel in Thailand, we put a lot of focus on the local cuisine. We enjoy cooking classes, food tours in local markets, and snacking from food stalls. We like to know what the local specialty is or our hotel receptionist&#8217;s favorite restaurant.</p>\n<h2><p id=\"What_is_your_number_one_priority_while_traveling\"><p>What is your number one priority while traveling?</p></p></h2>\n<p>Think about what you want to accomplish during your travels. What are the ultimate&#160;goals you want to achieve before you go back home? Making the conscious effort to identify what is most important to you makes it a lot easier to decide where to go and what places to&#160;dismiss.</p>\n<h3><p id=\"Are_you_here_to_decompress_and_disconnect_or_to_explore\"><strong><p>Are you here to decompress and disconnect or to explore?</p></strong></p></h3>\n<p>So maybe you&#8217;re the type that likes to take it easy and opts for leisurely activities such as spa treatments or reading a book in a bungalow on one of Thailand&#8217;s quieter&#160;islands.</p>\n<p>Or maybe you&#8217;re they type to take a guided tour through Bangkok, go cycling or trekking through forests in Chiang Rai, or go swimming and snorkeling in the crystal clear waters of Southern Thailand. Less physically demanding yet equally entertaining activities may be more to your liking&#160;such as&#160;Thai food cooking courses or local art classes about&#160;creating paper umbrellas or clay pottery.</p>\n<h3><p id=\"Is_depth_or_breadth_more_important\"><strong><p>Is depth or breadth more important?</p></strong></p></h3>\n<p>As you plan for your trip to Thailand, are you choosing places based on how many items you can cross off your bucket list? Is it important that you get those once-in-a-lifetime selfies&#160;with iconic&#160;landmarks before heading to the next city?</p>\n<p>Other times, travelers like to take it slow and get to know one town really well. It takes some of the stress out of traveling when you are familiar with a place and its people. Plus, it&#8217;s pretty cool to hang out in the lesser known restaurants and attractions that aren&#8217;t frequented by tourists.</p>\n<h3><p id=\"Do_you_consider_logistics_part_of_your_traveling_experience_or_do_you_prefer_to_be_hands_free\"><strong><p>Do you consider logistics part of your traveling experience or do you prefer to be hands free?</p></strong></p></h3>\n<p>Some people find it tiresome to handle the domestic chores of booking flights, finding places to eat in an unfamiliar town, and figuring out the logistics for getting&#160;from point A to B. They prefer that these details are taken care of by someone who is more familiar with the area so they can focus their full attention on the experiences of the trip. If this sounds like you, <a href=\"https://www.tielandtothailand.com/express-custom-chiang-mai-travel-itineraries/\">we&#8217;ve got you covered.</a></p>\n<p>Others love to fly by the seat of their pants and figure things out along the way. Who knows the amazing people you&#8217;ll meet in the process or the extraordinary restaurants you&#8217;ll stumble upon that are never&#160;mentioned on TripAdvisor or in Lonely Planet guides.</p>\n<h3><p id=\"What8217s_your_style\"><strong><p>What&#8217;s your style?</p></strong></p></h3>\n<p>Some people dive head first into the culture and genuinely enjoy eating the local cuisine in hole-in-the-wall restaurants or sleeping in a Thai-style villa with a unique open-aired bathroom. Others&#160;rather dabble in a foreign experience during the day but retreat to the plush comforts of Western restaurants and hotels during their down time.</p>\n\n\n\n<strong><p>TIP:</p></strong> Be true to yourself. Don&#8217;t chase after something that&#8217;s too far outside of your comfort zone unless you truly like the challenge. We don&#8217;t want you to look back on your vacation and regret your choices!\n\n\n\n<h2><p id=\"What_are_your_limitations_when_you_travel\"><p>What are your limitations when you travel?</p></p></h2>\n<p>Conversely, knowing what limits your travel will help you make important decisions that would otherwise cost you time, money, or convenience.</p>\n<h3><p id=\"What8217s_your_budget\"><strong><p>What&#8217;s your budget?</p></strong></p></h3>\n<p>We have to disagree with&#160;Pinterest memes such as, &#8220;Don&#8217;t worry about money, just travel!&#8221; splashed across a picturesque sunset photo.</p>\n<p>Let&#8217;s be realistic!&#160;<strong>Money plays a huge part in travel.</strong></p>\n<p>Sure, there are beautiful places such as temples and national parks that are free or nearly free to visit, but there are also countless luxurious or entertaining things to do if you&#8217;re willing to spend the money. &#160;Luckily, Thailand is one of the most affordable countries in the world to travel around. <strong>You can do a lot on a small budget or have your mind blown if you spend big&#160;in Thailand.</strong></p>\n<h3><p id=\"Do_you_have_the_time\"><strong><p>Do you have the time?</p></strong></p></h3>\n<p>For people who have a small window of time to travel and want to make every minute of their trip count, choosing how to travel and the length of your individual activities is critical.</p>\n<p>If you only have a few days to spend in Thailand, flying&#160;to your next destination and taking a 15 minute cab ride to your hotel sure beats taking an overnight bus, then a 30 minute cab drive to the pier, then an hour-long ferry ride, and then another 30 minute drive to your final&#160;destination.</p>\n<p>And if you&#8217;re&#160;planning to take a scheduled tour, which ranges from half and full days to multiple days, you&#8217;ll have to decide if this fits in with the rest of your itinerary or not.</p>\n<h3><p id=\"What_are_you_physically_capable_of\"><strong><p>What are you physically capable of?</p></strong></p></h3>\n<p>Thailand&#8217;s&#160;tropical climate, your physical&#160;ability, and any medical conditions you have will limit how long, how hard, and where you travel.</p>\n<p>Thailand&#8217;s hot, humid weather can suck the energy out of even the most active people. When we travel, we&#8217;ve learned to take afternoon breaks and refuel ourselves with iced coffee or a fresh fruit smoothie. We also try to follow the &#8220;one day hard travel, one day soft travel&#8221; rule so that we don&#8217;t burn ourselves out. But we understand that it&#8217;s not the case for everyone.</p>\n<p>If you find yourself in need of medication or medical treatment while in Thailand, you can find western standard hospitals with English-speaking staff in major towns. But if you travel far into the countryside or in a generally isolated area, you may only have access to small Thai clinics.</p>\n<h3><p id=\"Are_you_traveling_in_a_group\"><strong><p>Are you traveling in a group?</p></strong></p></h3>\n<p>What may be a fun place for solo travel is often not conducive for family travel. And what may be the perfect vacation spot for a big group of 20 something year olds may not be ideal for a couple in their 40s.</p>\n<p>Everyone&#8217;s abilities and preferences are a bit different when traveling with a group, so it takes a bit of extra effort to account for everyone&#8217;s needs and to find the lowest common denominator so it&#8217;s fun for the entire group.</p>\n<h2><p id=\"Where_to_travel_in_Thailand_is_ultimately_your_decision\"><p>Where to travel in Thailand is ultimately your decision</p></p></h2>\n<p>Take a moment and think about these questions. You may be surprised how much easier it is to cross off several destinations from your list as you comb&#160;through&#160;travel handbooks or online guides and reviews for ideas.</p>\n<p>Truth be told, these are some of the same questions we ask readers&#160;who seek personalized recommendations from us and&#160;what we consider before making a trip ourselves. There truly is no one-size-fits-all answer to the question, &#8220;Where should I travel in Thailand?&#8221; but at least this list of questions is a great place to start.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Don’t Know Where to Travel in Thailand?"}},"pageContext":{"id":"5b95ee8c87be0583274900e3"}}