{"data":{"mongodbDatabaseArticles":{"id":"5b92488787be056953db7bae","content":"<div><p>I did a presentation on the future of digital nomads (and remote workers) in the next 20 years. I used public data to show actual social and demographic trends and extrapolated them to make a guesstimate how the rise of remote workers will affect the world in 2035. It's impossible to predict the future, but it's fun to imagine how it will be like for sure. And it gives us at least some direction in what to work towards. I presented this at <a href=\"http://dnxglobal.com/\">DNX Global</a> on August 1st, 2015.</p> <p></p> <p>Below is my transcript (transcribed by the amazing <a href=\"http://rev.com/\">Rev.com</a>, super big fan of them).</p> <p class=\"interview-levelsio\"> The future of digital nomads. I want to talk about the next 20 years (that's 2035).</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/3.jpg\"> <p class=\"interview-levelsio\"> I'm 29 now, so in the next 20 years I'll be 50. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/4.jpg\"> <p class=\"interview-levelsio\"> This is freelancers. We're here now, 2015. This is America. It's kind of representative of the general population (of the Western world). About 30% is freelancer (<a href=\"//www.freelancersunion.org/blog/dispatches/2014/09/04/53million/\">Freelancers Union, 2014</a>), but the prediction is it's going to reach 50%, and even higher in 2035. More than half of us will be freelancers, which is crazy to think about. It has to do with job security as well. A lot of people don't have jobs anymore, and it's really hard to get hired these days as a graduate. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/5.jpg\"> <p class=\"interview-levelsio\"> This is the internet speed. Right now, it's about 100 megabits. It varies around the world, but it's going to be 100 gigabits by 2035 (<a href=\"http://www.nbnco.com.au/content/dam/nbnco/documents/nbn-co-3-year-gbe-corporate-plan-final-17-dec-10.pdf\">Alcatel-Lucent, exhibit 9.21</a>). 100 gigabit means about 12.5 gigabytes a second (<a href=\"//www.google.com/search?output=search&amp;sclient=psy-ab&amp;q=100+gigabit+in+gigabyte\" class=\"broken_link\">Google, 2015</a>). It means I can download all my backups, all my photos that I ever made in about two minutes. It's really fast. I can do that on mobile, and that's the big thing. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/6.jpg\"> <p class=\"interview-levelsio\"> 6G, 6th generation telephony. I'll have a smartphone, where anywhere in the world, I'll have super fast internet, 10 to 100 gigabits a second. Even in Bali. I go to Bali a lot. Some of you may know, Bali's internet is a joke. Even in Bali we will have good internet, finally. Yay!</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/7.jpg\"> <p class=\"interview-levelsio\"> This is another thing. You're like, \"Why is he talking about marriages?\" Well, current marital status in America, and the West, is decreasing rapidly. In 2035, less than 40% of the people around us will be married (<a href=\"http://www.pewresearch.org/data-trend/society-and-demographics/marriage/\">Pew Research Center, 2015</a>). That's crazy to think about, because it used to be the traditional thing, getting married, getting a house, getting children. There's a lot of overlap with digital nomads here. The previous speaker spoke about it. We're trying to find a different kind of life, and this whole generation is doing that. It means, also, we're marrying less. We have more relationships. That kind of stuff. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/8.jpg\"> <p class=\"interview-levelsio\"> Why is this important? Because a decline in marriage mechanically lowers home ownership, because they go together. You marry, you get a house. You buy a house, you get a mortgage, and you're stuck to that 30 to 40 years.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/91.jpg\"> <p class=\"interview-levelsio\"> And this is actually happening already. Home ownership is decreasing in America really fast (<a href=\"http://www.census.gov/housing/hvs/files/qtr213/q213press.pdf\">U.S. Census, 2013</a>), and the only people that have homes are rich people, or they are the old people. My parents have a house. I don't have a house. Most of my friends don't have a house anymore. They can't afford it, and they don't want to as well. That's the thing, they don't want to. They want more flexibility.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/10.jpg\"> <p class=\"interview-levelsio\"> This is another cool chart. This is the Berlin-London, a price of a flight ticket. It's about $75 now if you get a good ticket (<a href=\"//www.google.com/search?q=berlin+london+flight+price&amp;oq=berlin+london+flight+price\" class=\"broken_link\">Google, 2015</a>). It's going to drop to $20 (based on extrapolating data from <a href=\"http://airlines.org/data/annual-round-trip-fares-and-fees-domestic/\">Airlines for America, 2014</a>). You're like, \"Okay. What does that matter?\" Not much, but Shanghai, $600 in mid-season will be $150, sometimes $100 if you get, I don't know, Ryan or EasyJet, because it's going to fly from Europe to Shanghai, which means we can fly for super cheap everywhere. If you make $2000 a month, you can fly a lot for that money, and you can to Shanghai for the afternoon, go to Tokyo, then go back to London, then go to New York. You'll be all over the world the whole month in the future, that's what I think.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/12.jpg\"> <p class=\"interview-levelsio\"> You will have new airplanes. This is a concept airplane by Boeing (<a href=\"http://www.gizmag.com/supersonic-passenger-aircraft-revival/32600/\">Gizmag, 2014</a>), and it can go much faster. It goes faster than sound. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/13.jpg\"> <p class=\"interview-levelsio\"> We'll go fly to London in half an hour instead of 2 hours now.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/14.jpg\"> <p class=\"interview-levelsio\"> What about Shanghai? 4 hours. Can you imagine you wake up and you get a message on Whatsapp. And you're like \"Where's my friend? Oh, he's in Shanghai. Okay, I'll just go to the airport, fly there\" and 4 hours later you're having coffee with them at the airport. That's really weird for me to even imagine, but that's going to be the future I think.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/15.jpg\"> <p class=\"interview-levelsio\"> I just showed you all this data. To summarize, we have fast, cheap internet, fast, cheap air travel, so many freelancers, everybody's almost a freelancer, nobody's marrying (or less people, at least), and everybody's dating everyone. There's no ownership, so I only have a laptop in my back ... Like nomads, we'll move around the world. We don't own anything. Most of us, what we do is rent, use Airbnb, or stay in hotels, we buy food, that stuff. We don't cook ourselves so much. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/17.jpg\"> <p class=\"interview-levelsio\"> What does that mean? Well, it means that first of all, we're going to work from home a lot, like I did.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/181.jpg\"> <p class=\"interview-levelsio\"> Then we're going to be in the coffee shop, and we'll be like, \"Oh, my arm hurts\" (from bad posture). Haha.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/19.jpg\"> <p class=\"interview-levelsio\"> Then we get the idea, I can be a nomad. I can travel. You just start slowly, maybe visit your family in a different state or different country. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/20.jpg\"> <p class=\"interview-levelsio\"> Then maybe you go to Bali, to Hubud, have your cappuccino with your laptop and the rice fields. Nice view. You're like, \"This is pretty cool. I could do this.\"</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/21.jpg\"> <p class=\"interview-levelsio\"> A lot of people are going to have this process that we had, or that I had, sitting at home being bored, and then leaving.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/22.jpg\"> <p class=\"interview-levelsio\"> In 2035, there's going to be 9 billion people (<a href=\"http://populationpyramid.net/world/2035/\">Population Pyramid, 2105</a>), and 6 billion of those will be working people, the labor force. 50% of those will be freelancers. That's 3 billion people, and then 1 in 3, and that's, I think, modest, 1 in 3 is going to be a remote worker, or digital nomad. And if you can calculate fast, you know that's 1 billion digital nomads. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/23.jpg\"> <p class=\"interview-levelsio\"> You're like, \"That's bullshit.\" But it's not, because it's not going to be digital nomads like we think, like us now. It's going to be from a lot of different countries in the world. A lot of currently developing countries. Think about India. Think about southeast Asia. We are usually the ones visiting them now. What about when they visit us? What about when there's more places to travel for them as well, when their income goes up? Digital nomads have an affect on local income. They spend money, and the wealth goes up. There will be more nomads from everywhere. And this will be a lot of people.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/25.jpg\"> <p class=\"interview-levelsio\"> What about cities? If all these people are moving, they don't have houses, where are they going to go? Well, they're going to go to big cities. They're going to go the small cities. The most interesting thing is that London, for example, has more to do, is more related, to me, to, for example, Tokyo and New York, than to Birmingham. </p> <p>The big cities in our countries are more related to big other cities than to cities in their own country. In that sense, cities are going to claim more power from the governments, and they're going to ask for city tax and that kind of stuff. They're going to be more powerful (vs. national governments) in attracting these remote workers. </p> <p class=\"interview-levelsio\"> Because as Germany or Netherlands you can try to attract digital nomads to your country, but why not just let Berlin, and Amsterdam, or London as cities do it themselves? They are the ones that really want to get those people, and I don't really want to go to a small town in Germany right now. Maybe in the future, but right now I want to go to Berlin. I want to go to London, I want to Tokyo, Shanghai. They are going to claim a lot of power and tax from the government, and maybe we can fly into Berlin, pay a nomad tax there, arrive, and that's it.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/27.jpg\"> <p class=\"interview-levelsio\"> Cities are going to compete for us, for us tech workers. We're going to have more clean cities. This is Paris.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/28.jpg\"> <p class=\"interview-levelsio\"> Cities will be more green, this is Taipei.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/29.jpg\"> <p class=\"interview-levelsio\"> This China, Tianfu in Chengdu, and this is really interesting, because this is a city being newly-designed by architects, and it's going to be finished around 2030, in 20 years (<a href=\"http://inhabitat.com/great-city-adrian-smith-gordon-gill-unveil-plans-for-chinas-first-self-sufficient-carless-city/\">Inhabitat, 2015</a>).</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/30.jpg\"> <p class=\"interview-levelsio\"> What this city does is it has no cars. It has only public transport. Every house is connected. It has super fast fiber internet, and it's made for us freelance tech workers.</p> <p class=\"interview-levelsio\"> It's a free economic zone. We can go live here, in the future, and pay tax there, and it's a great place to be. Most places in China, pretty smoggy, this place has clean air because there's no cars, no factories.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/30.jpg\"> <p class=\"interview-levelsio\"> Looks pretty good to me.</p> <img src=\"/wp-content/uploads/2015/10/31.jpg\" alt=\"31\" width=\"2400\" height=\"1800\" class=\"alignnone size-full wp-image-5082 responsively-lazy\"> <p class=\"interview-levelsio\"> </p> <p>You can walk around with your dog here. Haha.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/361.jpg\"> <p class=\"interview-levelsio\"> We're also going to have more friends. Now, half of my friends are Dutch, because I'm Dutch, myself. A lot of them are international, but most people, they still only have local friends I guess</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/371.jpg\"> <p class=\"interview-levelsio\"> It's starting to change, then, and we're going to have a lot of different friends from all over the world, and we're going to be together, communicating on Telegram, WhatsApp, Twitter, that kind of stuff. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/381.jpg\"> <p class=\"interview-levelsio\"> Then we're going to go on Tinder, and we're going to have sex, and then we're going to have babies!</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/391.jpg\"> <p class=\"interview-levelsio\"> ...and there's going to be a lot of mixed babies. We're finally getting close to the future race, which is....</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/401.jpg\"> <p class=\"interview-levelsio\"> It looks like this. I Googled it. Google is always right, haha.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/41.jpg\"> <p class=\"interview-levelsio\"> This is an Asian-African-White mix altogether, and this is how the future people look. We can be part of that. We can make that happen. What's more beautiful than to have one beautiful race with no racism, because you can't have racism, because everyone is the same race. Let's get there really fast.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/42.jpg\"> <p class=\"interview-levelsio\"> What if we have these children, haha. We're going to have to teach them. We're going to have to put them to school, but then the schooling is a problem. Because we're traveling all the time, so how can we get them to schools? Well, homeschooling is really rising fast. These children are learning at home.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/43.jpg\"> <p class=\"interview-levelsio\"> What about universities? These are really good universities, and you're like, \"Oh, my kids have to go there. My kids have to go to Delft. My kids have to go to MIT, or Harvard. I can't be a nomad anymore. Our children can't be nomads anymore.\"</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/44.jpg\"> <p class=\"interview-levelsio\"> But hey, what's this? <a href=\"http://edx.org/\">edX</a>? It's online education with all the courses from these big universities. It's already running. It's already successful. You can have all these courses, and I think it's almost free now. You can get this stuff already. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/45.jpg\"> <p class=\"interview-levelsio\"> There's local work group sessions where your children, or us, they'll be studying. We can go to local neighborhoods and have local work groups about edX there, with teachers. You have a little bit physical still, and you have a lot of virtual education as well. We can keep traveling with a family, because I always get that question, \"What about families and nomads? What about that?\" Well, this is it, pretty much.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/33-copy.jpg\"> <p class=\"interview-levelsio\"> I made a site called <a href=\"http://nomadlist.com/\">Nomad List</a>, some of you may know it. It's built for this future where people need to know which cities to go to. This is how it looks.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/34.jpg\"> <p class=\"interview-levelsio\"> There's a lot of filters. You can select, \"I want to go snowboarding and it should be pretty cheap,\" and then it will find you cities to go to. This is how it looks.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/35.jpg\"> <p class=\"interview-levelsio\"> There's a lot of cities to go to, Bangkok, Taghazout in Morocco.</p> <p>Why is it interesting? Because I built it as software for the future, for the remote generation that we're going to be, these 1 billion nomads.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/46.jpg\"> <p class=\"interview-levelsio\"> I know a lot of you are lifestyle bloggers, or sell e-book kind of stuff, or internet marketing stuff, but I think there's a way bigger opportunity for you here. </p> <p class=\"interview-levelsio\"> With 1 billion nomads, this is a huge market. You can build so much apps for that, of software, or companies, or services for them. Think about housing. Where are these nomads going to stay? Airbnb's are okay, but can we improve it? How about banking, and how about all this stuff? All of us are makers now. You can make that software for all these people, or make these services and companies. Meanwhile you can make money with it as well.</p> <p class=\"interview-levelsio\"> I think that's what I want to say. You can do that. You need to do it, because we have this unique position as digital nomads. We're the early generation, early adopters in this niche, so we know a lot about it, and we know what the problems are for digital nomads now, and what they're going to be, a little bit into the future. We're ahead of people. You have a very big advantage to build stuff for nomads.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/48.jpg\"> <p class=\"interview-levelsio\"> There's exponential growth. And we need you to build the infrastructure for it. </p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/51.jpg\"> <p class=\"interview-levelsio\"> You need to create. Please, create stuff for these people. So that in the future, we'll be one big remote generation. </p>    <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"“There will be 1 billion digital nomads by 2035”"}},"pageContext":{"id":"5b92488787be056953db7bae"}}