{"data":{"mongodbDatabaseArticles":{"id":"5b96246587be058327490e58","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">23 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p><img class=\"alignnone size-full\" src=\"https://photos.smugmug.com/Europe/Turkey/Istanbul/i-mdMrwBn/0/690x690/P1260305-X2.jpg\" alt=\"turkish airlines airplane wing\" width=\"690\" height=\"518\"></p>\n<p>Around a year ago I originally wrote whether <a href=\"https://foxnomad.com/2016/03/17/still-safe-travel-turkey/\">it was still safe to travel to Turkey</a>, a question I get regularly in my inbox. A lot has changed over the past year &#8211; and not for the better &#8211; with more attacks, a coup attempt; many people have stopped bothering to ask altogether. It&#8217;s a dramatic shift in a country that was the <a href=\"http://www.e-unwto.org/doi/book/10.18111/9789284418145\">6th most visited in the world</a>, back in 2015.</p>\n<p>There are so many reasons to visit Turkey, from <a href=\"http://www.foxnomad.com/2011/05/03/the-path-of-the-lost-above-cappadocia-turkey/\">balloon rides over ancient volcanic rock formations</a>, the <a href=\"https://foxnomad.com/2012/09/20/birthday-pictures-of-the-hagia-sophia-in-istanbul-which-turns-1475-this-year/\">impressive 1,480 year old Hagia Sophia</a>, <a href=\"https://foxnomad.com/2016/02/18/i-had-to-visit-a-place-i-lived-to-actually-take-pictures-of-it-a-photo-essay-of-fethiye-turkey/\">beautiful beaches</a>, and of course <a href=\"https://foxnomad.com/2015/04/30/12-turkish-dishes-that-are-unintentionally-vegan/\">all the food</a>. Still, Turkey&#8217;s perception as a <a href=\"https://foxnomad.com/category/travel/\">travel</a> destination has changed, so has the reality.</p>\n<p><strong>Focused Fear</strong></p>\n<p>Most <a href=\"https://foxnomad.com/countries/\">countries</a> have rough parts, cities, and often those locations are far removed from the tourist experience. In other words, you have to look for trouble. In <a href=\"https://foxnomad.com/countries/turkey-travel-information/\">Turkey</a>, a lot of the violence it faces from Kurdish terrorist groups, not to mention ISIS, was previously limited to the distant southeast. Recently, it has moved to Turkey&#8217;s travel capital, Istanbul.</p>\n<p><img class=\"alignnone size-full\" src=\"https://photos.smugmug.com/Europe/Turkey/Istanbul/i-N5744Md/0/690x690/P1170846_7_8c-X3.jpg\" alt=\"istanbul from above\" width=\"690\" height=\"562\"></p>\n<p>A goal of terrorism toward tourists is to invoke a disproportionate amount of fear from attacks designed to make you feel like, &#8220;I could have been there,&#8221; so that you decide not to go to the country at all. It is easy to dismiss one, even two attacks, but terrorism in places tourists are likely to frequent is no longer an anomaly. There are other unsettling events as well, coup attempts, <a href=\"https://www.nytimes.com/interactive/2016/06/28/world/middleeast/turkey-terror-attacks-bombings.html?_r=0\">assassinations</a>, and <a href=\"https://www.cnn.com/2016/07/29/europe/turkey-post-coup-arrest-numbers/\">arrests</a>. Although the chance of something happening to any given person in a terror-related event are low, in Turkey, those events are becoming more common. Disruptions directly related to such events, Internet blackouts, flight delays or cancellations, or curfews, could potentially occur during your trip.</p>\n<p>Istanbul, for now, might be a better plan for those who have a little bit of travel experience.</p>\n<p><strong>Experiencing The Numbers</strong></p>\n<p>A lot of experienced travelers will proclaim, &#8220;of course it&#8217;s safe, go!&#8221; Much like the crime in your own city never seems so bad, because you live the statistics. As you travel you begin to become familiar with what is normal in various regions around the world. You see the nuance. <a href=\"https://foxnomad.com/2016/07/28/what-its-like-to-live-in-turkey-as-foreigners-13-years-after-a-dream-come-true/\">Turkey is a very large country</a>. Multiple terror events, government upheavals, you realize, are very unlikely to affect you specifically. But it takes time for your experience to support what your logical mind can decipher based on numbers alone.</p>\n<p><strong>The Real Question</strong></p>\n<p>Yes, Turkey is safe. But you have to be prepared when you travel to Turkey, that something bad might happen during your stay there. Not to you specifically, but in a country where <a href=\"http://www.telegraph.co.uk/travel/advice/is-turkey-safe-for-tourists/\">there were 16 attacks in 2016</a> &#8211; and maybe to a place you could have been. Internet access might be cut for a time, making it difficult when you need it most, to inform your loved ones you&#8217;re safe.</p>\n<p>Millions of tourists a month are <a href=\"http://theplanetd.com/best-photos-of-the-year/\">still visiting Turkey</a>, having wonderful trips, and seeing a <a href=\"https://foxnomad.com/2013/10/17/photo-shows-landmarks-look-flying-istanbul/\">truly remarkable travel destination</a>. The question isn&#8217;t whether Turkey is safe, but whether or not traveling there makes you comfortable. Everyone has a different level of risk acceptance, and in Istanbul particularly, the risks, although rare, might for the time being exceed your personal limit.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Is It Safe To Travel To Turkey? [Updated: Jan. 2017]"}},"pageContext":{"id":"5b96246587be058327490e58"}}