{"data":{"mongodbDatabaseArticles":{"id":"5b95ea7d87be05832748ffae","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/venicegondola.jpg\" alt=\"posing cheerily at the leaning tower in pisa, italy\"><br> Updated: 7/1/2018 | July 1st, 2018</p><p>Here&#8217;s a secret: I love being a cheesy tourist. As much as I love getting off the beaten path and learning about local cultures, sometimes I love the artificial world the mainstream travel industry has created. I think a lot of people think too deeply about travel, as if every moment on the road has to have profound impact and meaning. They are too quick to write off <a href=\"https://nomadicmatt.com/travel-blogs/cruise-culture-thoughts-on-the-nature-of-mass-tourism/\" target=\"_blank\" rel=\"noopener\">mass tourism</a>. I&#8217;ve always found travelers who shun anything &#8220;cheesy&#8221; to be some of my least favorite. By thinking of their travels as one long romantic novel, they tend to become snobs and can&#8217;t just enjoy the moment. Sometimes you just need to take attractions and experiences for what they are: a crowded, overrated, commercialized, mind-numbing, and/or enjoyable escape.</p><p>Sometimes travel&#8217;s just about having a good time in a different place with new people.</p><p>Last year I went on a cruise and partied at Se&#241;or Frog&#8217;s in Mexico.&#160;And I had a blast.</p><p>So today, let&#8217;s indulge the cheesy tourist in all of us that we don&#8217;t want to admit we have and share some of our favorites. Here&#160;are&#160;mine:</p><h3>Cruises</h3><p><img src=\"https://media.nomadicmatt.com/cheesy1.jpg\" alt=\"Nomadic Matt on a cruise in the caribbean with a funny balloon hat\"><br> Last year, I went on my first cruise in over half a decade, and I had a phenomenal time. <a href=\"https://nomadicmatt.com/travel-blogs/how-i-spent-my-seven-day-cruise-vacation/\" target=\"_blank\" rel=\"noopener\">To me, it wasn&#8217;t travel &#8211; it was a vacation</a>. It was a way to relax and decompress. There was nothing authentic about Royal Caribbean&#8217;s &#8220;private beach&#8221; in Haiti or the cheesy dance parties on the boat each night, but gosh, was it fun. While seven days on a ship was&#160;too much for me, there are going to be a lot more cruises in my future. Because sometimes life is about sitting by the pool with a pi&#241;a colada in hand while listening to the band cover Bob Marley for the umpteenth time.</p><p><strong>Read More About Cruises!</strong></p><h3>Disney World</h3><p><img src=\"https://media.nomadicmatt.com/cheesy2.jpg\" alt=\"me and mickey mouse at a cheesy tourist activity in Disney world\"><br> I love Disney World. I love the rides, drinking my way around the world in Epcot Center, the haunted house, Space Mountain, and just feeling like a kid. Being a kid is all about playing pretend, and at Disney it&#8217;s not just welcome but encouraged. Disney is overpriced and artificial, but hey, what&#8217;s wrong with simply enjoying yourself in a make-believe fantasy land for a bit?</p><p><strong>Read More About Disney World</strong></p><h3>Pub Crawls</h3><p><img src=\"https://media.nomadicmatt.com/cheesy4.jpg\" alt=\"lots of people on a crazy pub crawl in europe\"><br> Pub crawls aren&#8217;t the place to find local watering holes, nor are they the place to meet many locals. Instead, you&#8217;ll find touristy bars (filled with tourists, of course) and watered-down welcome shots, but I love pub crawls because part of the fun of traveling is meeting other travelers &#8212;&#160;and pub crawls are an easy way to do that. Maybe we won&#8217;t see each other ever again, but for that one night over a few drinks, we&#8217;re the best of friends.</p><p><strong>Read More</strong></p><h3>The Louvre</h3><p><img src=\"https://media.nomadicmatt.com/2018/louvre_cheesy.jpg\" alt=\"The museum crowds and tourists packed into the Louvre, Paris, France\"><br> <a href=\"https://nomadicmatt.com/travel-blogs/lost-in-the-louvre/\" target=\"_blank\" rel=\"noopener\">The Louvre</a> is one of the most famous, crowded, and popular museums in the entire world. Walking through here is like walking through a Tokyo subway station during rush hour (i.e., crowded!). To me, there are far better museums in Paris, but heck, it&#8217;s the Louvre. Why miss out? Even if the Mona Lisa is the most overrated painting on the entire planet, you have to go see it.</p><p><strong>Read More</strong></p><h3>Venice</h3><p><img src=\"https://media.nomadicmatt.com/cheesy8.jpg\" alt=\"Gorgeous gondola with tourists in the canals of venice, Italy\"><br> <a href=\"https://nomadicmatt.com/travel-guides/italy-travel-tips/venice/\" target=\"_blank\" rel=\"noopener\">Venice</a> is a beautiful city filled with important historical significance, but it feels like a caricature of itself. I have no concrete data to prove this, but a number of people who are experts on the region said there are very few true Venetians who actually live in the city. But that being said, getting lost in that maze of tiny streets is incredibly fun, the city makes for an amazing backdrop to a romantic vacation, and even though a gondola ride is 100 euros, you only live once, right? Let&#8217;s live the Venetian fantasy.</p><p><strong>Read More</strong></p><h3>Diving the Great Barrier Reef</h3><p><img src=\"https://media.nomadicmatt.com/cheesy11.jpg\" alt=\"Blue water and saline in the Great Barrier Reef in Australia\"><br> Wait, what? This is overrated? Yeah, it is! The diving in the reef (at least where the day trips from Cairns will take you) isn&#8217;t that great, due to large crowds and overfishing. Almost every dive expert I spoke to didn&#8217;t see why people were so obsessed with the reef. There are far better dive spots in the country, especially on the west coast. So while you may be sharing your view of Nemo with 50 other people, who cares? It&#8217;s the Great Barrier Reef! You can see this thing from space!</p><p><strong>Read More</strong></p><h3>The Full Moon Party</h3><p><img src=\"https://media.nomadicmatt.com/cheesy5.jpg\" alt=\"Crazy fire sign and young backpacking tourist crowds in Thailand at the Full Moon Party\"><br> Every month about 15,000 people (double during the holiday season) descend on the island of Ko Phangan for this all-night beach party. It&#8217;s mass tourism in Southeast Asia at its worst &#8212;&#160;and it&#8217;s some of the best fun I&#8217;ve ever had. I enjoy myself so much that I&#8217;ve gone seven&#160;times.</p><p><strong>Read More</strong></p><h3>Khao San Road</h3><p><img src=\"https://media.nomadicmatt.com/cheesy7.jpg\" alt=\"Crowded tourist travelers on Khao San Road in Bangkok, Thailand\"><br> Bangkok&#8217;s infamous Khao San Road is awash in dirty backpackers, overpriced beers, touts, and cheesy Red Bull singlets (standard backpacker gear), but it&#8217;s one of my favorite spots in Bangkok for a few reasons: there&#8217;s great people-watching, you&#8217;ll meet some interesting characters, there&#8217;s always a party, and if you get off the main drag, you&#8217;ll find some actual local Thai bars. When I lived in Bangkok, we would always go here when we wanted an interesting night out.</p><p><strong>Read More</strong></p><h3>Times Square</h3><p><img src=\"https://media.nomadicmatt.com/2018/timessquare_cheesy.jpg\" alt=\"The crowds of tourists packing into cheesy Times Square in New York City\"><br> As someone who lives in New York I can say this is a place I rarely visit, and I don&#8217;t really know anyone who goes there either. It&#8217;s crowded, it&#8217;s filled with aggravating tourists who are too busy gawking and taking pictures instead of walking, and it&#8217;s completely commercialized, but it&#8217;s home to Broadway, you can watch many interesting street performers, the M&amp;M store is a piece of heaven on earth, and sitting on top of the TKTS stairs provides a nice place to watch it all.</p><p><strong>Read More</strong></p><h3>The Leaning Tower of Pisa</h3><p><img src=\"https://media.nomadicmatt.com/cheesy6.jpg\" alt=\"Matt pretending to hold up the Leaning Tower of Pisa in Italy\"><br> Yes, I took that photo. There I am, trying to hold up the leaning tower (and in another, push it over). In the background are other people trying to do the same. It&#8217;s absolutely clich&#233;, but hey, who doesn&#8217;t have fun playing with perspective?</p><p><strong>Read More</strong></p><h3>Any Salt Flats</h3><p><img src=\"https://media.nomadicmatt.com/cheesy9.jpg\" alt=\"Nomadic Matt and travel friends posing like a tourist on a salt flat\"><br> Like the Leaning Tower, salt flats are fun because you can play with perspective. Look, it&#8217;s people on your hand. Look, you&#8217;re lifting a car! Look, you&#8217;re smaller than a backpack. The list goes on. I mean, salt flats are kind of pretty, but once you&#8217;ve seen one, the rest are kind of all the same &#8212;&#160;but sitting there for umpteen hours taking perspective shots never gets boring.</p><p></p>***<br> For me, travel is about experiencing the world and learning about different cultures. I like seeing how everything and everyone fit together in the puzzle that is humanity.<p>For me, travel is about experiencing the world and learning about different cultures. I like seeing how everything and everyone fit together in the puzzle that is humanity.</p><p>But travel is also about having fun.</p><p>Not everything we do as travelers has to be some deep, life-changing experience. Sometimes it&#8217;s just about relaxing and cutting back with people from around the world while doing something fun &#8212;&#160;and isn&#8217;t that what life is all about anyway?</p><h4>Book Your Trip: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p></div>","title":"My Favorite Cheesy Tourist Activities and Why I Love Them"}},"pageContext":{"id":"5b95ea7d87be05832748ffae"}}