{"data":{"mongodbDatabaseArticles":{"id":"5b95efa587be05832749011b","content":"<div><p><img class=\"aligncenter size-full wp-image-21181\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/08/Elephant-Jungle-Paradise-Park-Chiang-Mai-Thailand.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"Caring for elephants for a day at the Elephant Jungle Paradise Park in Chiang Mai, Thailand\" width=\"1000\" height=\"666\"><br>\nIn recent years, Thailand has seen a steady growth in alternative forms of tourist attractions that are more in-line with the environment and natural habits of animals. Near Chiang Mai, there are a lot of elephant sanctuaries that are now open to visitors. Their focus is on taking care of the elephants. It was a great experience for me and I enjoyed seeing the elephants in their natural environment.</p>\n<h2><p id=\"The_dark_side_of_elephant_tourism\">The dark side of elephant tourism</p></h2>\n<p>Tourism doesn&#8217;t often have the best reputation. There is always the risk involved that too many tourists will delude the local culture and damage the environment. Elephant tourism is no different.</p>\n<p>In Thailand, it is very popular to use elephants as a form of entertainment. Tourists ride them and elephants are often forced to perform tricks. While this can look entertaining for the tourists, it certainly isn&#8217;t for the elephants. Although they are very big animals, their anatomy doesn&#8217;t handle the riding very well and it damages their overall well-being. The performing is also based on a lot of forced training and doesn&#8217;t happen naturally.</p>\n<h2><p id=\"A_better_future_for_the_elephants\">A better future for the elephants</p></h2>\n<p>Elephant sanctuaries provide a new home for these elephants. Oftentimes, they are connected with nearby animal hospitals that take care of the elephants. Most of the money that the elephant sanctuaries earn, either through donations or ticket fees, is invested in the food. Elephants spend most of their day eating when they aren&#8217;t asleep. Although elephant sanctuaries have their own farms where they grow some crops, they still need to buy some food from outside sources. The other part of the earnings is used for medical treatments and the general upkeep of the sanctuary.</p>\n<p>The workers at these sanctuaries dedicate a lot of their time and efforts to helping elephants. Some of them are volunteers that spend their free time taking care of the elephants. Most of the&#160;elephants taken into the elephant sanctuary parks are from former tourism businesses but are now too old to perform well. They are often abandoned by their owners because their upkeep is costly and they don&#8217;t bring in money anymore.</p>\n<p>In the beginning, the elephant sanctuaries were hesitant to open themselves up to the public. They were afraid that there wasn&#8217;t enough interest in their work and that tourists would rather visit a conventional elephant business. But the growing interest and acceptance of the elephant sanctuaries show that many tourists are interested in seeing the elephants in their natural environment.</p>\n<h2><p id=\"An_elephant_sanctuary_in_Chiang_Mai\">An elephant sanctuary in Chiang Mai</p></h2>\n<p>I visited the Elephant Jungle Paradise Park in Chiang Mai, which offers full day and half day trips. The full-day trip includes meeting the elephants in the morning, a traditional lunch, preparing food for the elephants in the afternoon, and a mudbath. I got close to the elephants, petted them and spent some time with them in the mudbath and a waterfall. Overall, it was a great experience and not only did I meet the elephants but I also learned about their history in Thailand.</p>\n<p><img class=\"aligncenter wp-image-21183 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/08/Feeding-elephants-in-Chiang-Mai-Thailand.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"Feeding elephants in Chiang Mai, Thailand\" width=\"1000\" height=\"666\"></p>\n<p>The elephant sanctuaries are located in the mountains near Chiang Mai. You cannot go there by yourself. Instead, a driver from the sanctuary will pick you and other tourists up from your hotels and drive you there. The day starts at around 8 am in Chiang Mai. The drive is around two hours but time really flies as the drive up the mountains shows the nature and environment very well. The driver also stopped at a local market on the way. Driving up the mountains in a traditional songthaew might not be the most luxurious drive, but it is worth the experience.</p>\n<p>After arriving at the sanctuary, I was given a traditional poncho to wear. I was told that the elephants are accustomed to this type of clothing and it makes them feel more comfortable. Then the tour continued with a welcome of the elephants.</p>\n<p>After that, we had our lunch and the elephants wandered off to the jungle.&#160;Lunch consisted of a buffet including pad Thai and fruit. It was great and I really enjoyed the food.&#160;&#160;It was plentiful and there were also choices for vegetarians.</p>\n<p>Thereafter we prepared some food for the elephants and met them in the mudbath. Although most of our group were hesitant to go in the mud, the elephants had fun splashing the water at us. They were intaking the water and &#8220;showering&#8221; us with&#160;mud. We returned the favor and rubbed the mud against their thick skin.</p>\n<p>For the mudbath, I made sure to bring bathing clothes and a towel. Other than that, attire that is good for hiking is needed here, too. The jungle at the mountainside is not very easy to walk and it does help to have some good shoes. Although there isn&#8217;t much walking involved, it can be a little bit difficult going up the steep slopes without any rail or other support.</p>\n<p>Since the elephants, as well as the tourists, could do well with a shower, we joined at the waterfall and fed the elephants the prepared food. It was great to see the elephants genuinely happy because they were allowed to do what they want to do instead of having to perform tricks for the tourists.</p>\n<h2><p id=\"Reflection\">Reflection</p></h2>\n<p>Overall, this elephant sanctuary in Chiang Mai was one of the best experiences for me on my trip through Southeast Asia.&#160;For me, it was great to see the elephants as they just eat and walk around. I got to meet the elephants, but they weren&#8217;t forced to do anything. Usually, the elephants follow their caretaker, but they are also free to leave when they would rather wander off into the jungle.</p>\n<p><img class=\"aligncenter wp-image-21182 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2018/08/Elephant-playing-in-Chiang-Mai-Thailand.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"An elephant playing in Chiang Mai, Thailand\" width=\"1000\" height=\"666\"></p>\n<p>The trip ended with the sunset at around 6 pm when we arrived back in the city. A full-day package costs around 50 USD, which isn&#8217;t exactly cheap, but knowing that the money goes towards the care of the elephants is a great deal for me.</p>\n<p>Any tourist that is interested in seeing more natural behavior by the elephants and is interested in their true happiness will have a good time visiting an elephant sanctuary. The elephants are very well cared for and they seem to be very happy at these places.&#160;If you happen to be in the area, I strongly encourage you to visit a sanctuary instead of a commercial elephant camp that exploits the elephants by forcing them to perform mounted trekking, tricks, or shows.</p>\n\t\t\t\t</div>","title":"A Day at an Elephant Sanctuary in Chiang Mai"}},"pageContext":{"id":"5b95efa587be05832749011b"}}