{"data":{"mongodbDatabaseArticles":{"id":"5b95eeba87be0583274900f0","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Aroon Rai Offers Tasty Curry in Chiang Mai</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/aroon-rai-offers-tasty-curry/\"><img class=\"aligncenter size-full wp-image-9004\" title=\"Aroon Rai Offers Tasty Curry in Chiang Mai\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/sign.jpg?resize=552%2C348&amp;ssl=1\" alt=\"Aroon Rai Restaurant\" width=\"552\" height=\"348\"></a></p>\n<p>For those visiting Chiang Mai and are in the mood for some cheap and tasty Thai style dishes, Aroon Rai is a great start. The restaurant is famous for its curry dishes, as self-proclaimed on its main sign, but we&#8217;ve been delighted in their stir-fry dishes and soups as well.</p>\n<p><strong></strong></p>\n<img class=\"size-full wp-image-9002 \" title=\"Khao Soi Gai\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/khao-soi2.jpg?resize=563%2C387&amp;ssl=1\" alt=\"Northern Style Yellow Curry (Khao Soi)\" width=\"563\" height=\"387\"><h2><p>Craving Thai Curry?</p></h2>\n<p>Aroon Rai serves about a half-dozen slow cooked Thai curries, but the two that really shine are the yellow curry and the khao soi. If you want something hearty, try the yellow curry (Chris&#8217; go to dish) and its tender chunks of potatoes, onions, and slices of white meat chicken (55 baht, less than $2.00). Want something you may have never tried before? Go with the khao soi, a <a title=\"Khao Soi\" href=\"https://www.tielandtothailand.com/khao-soi-northern-yellow-curry-noodles/\">dish local to northern Thailand</a>, with a tender, slow cooked chicken drumstick served over yellow egg noodles and topped with a tangle of crispy noodles (40 baht, about $1.33). Aroon Rai is unique in that their curries can be enjoyed whenever and wherever because they sell packets of homemade curry seasoning that can be taken home.</p>\n<img class=\"size-full wp-image-9001\" title=\"Takeaway Curry Packets\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/curry.jpg?resize=563%2C362&amp;ssl=1\" alt=\"Take Home Curry Seasoning Packets\" width=\"563\" height=\"362\"><h2><p>Try the Stir-Fry and Soups, Too</p></h2>\n<p>Although Aroon Rai&#8217;s curries get the spotlight, we&#8217;ve found ourselves enjoying their non-curry dishes more often than not and our favorites are the crispy pork with saut&#233;ed kale, fried rice with sweet chili paste and shrimp, and bright, stir fried veggies in oyster sauce. We also recommend the som tam (papaya salad) and tom yum soup with mushrooms, both of which are served Thai spicy! As for fried food, they deliver well in that department too &#8211; our fried frog legs and fried bananas with honey have both come out hot and crispy. There has been two minor disappointments during our dozen or so visits, ironically they were the curries; the Chiang Mai pork curry with ginger seemed overcooked and the pad thai was heavy on the oil.</p>\n<p><img class=\"aligncenter size-full wp-image-9003\" title=\"Other Delicious Thai Plates\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/02/noncurry.jpg?resize=563%2C309&amp;ssl=1\" alt=\"Non Curry Thai Dishes\" width=\"563\" height=\"309\"></p>\n<h2><p>Easy on the Wallet</p></h2>\n<p>Aroon Rai&#8217;s dishes are of similar portion size and quality as those from our favorite street vendors. Their dishes are easy on the budget and most entr&#233;es range from about 60 to 90 baht ($2.00-$3.00). Steamed or sticky rice is extra and so is bottled water (10 baht each). On the plus side, beer is available and is priced noticeably lower than most restaurants. Enjoy a few!</p>\n<p>Aroon Rai is located on the west side of the Old City, slightly south of the Taipei Gate, and is easy to spot from the moat&#8217;s outer road (Kotchasarn Road). It is an open aired restaurant with plain tables, plastic chairs, and a smattering of dated, homely decorations. The menus are old, and although they are written in both Thai and English, it is best to point at what you want when ordering because the employees speak limited English. Aroon Rai will not dazzle you with first impressions, but keep in mind that this mom and pop restaurant is known for its consistently delicious food and <strong>not</strong> for its decor. On the plus side, visiting Westerners will be happy to know that the bathrooms have been recently renovated and fitted with European style plumbing.</p>\n<p><br>\nView <a title=\"Aroon Rai\" href=\"https://maps.google.com/maps/ms?msa=0&amp;msid=209144295110982244387.0004e16de58f9c62c3221&amp;hl=en&amp;ie=UTF8&amp;t=m&amp;ll=18.788017,98.988404&amp;spn=0.018283,0.024118&amp;z=15&amp;source=embed\" target=\"_blank\">Aroon Rai</a> in a larger map</p>\n<p>Aroon Rai is not the prettiest restaurant in Chiang Mai, but their cheap, delicious food will keep you coming back for more. We would like to thank our friend and future fellow Chiang Mai expat, Scott, for initially recommending what has turned into a regular dining spot of ours.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Aroon Rai Offers Tasty Curry in Chiang Mai"}},"pageContext":{"id":"5b95eeba87be0583274900f0"}}