{"data":{"mongodbDatabaseArticles":{"id":"5b93831687be056953db7e27","content":"<div><h1 name=\"a05b\" id=\"a05b\" class=\"graf graf--h3 graf-after--figure graf--title\">Tips for working remotely in a Startup and staying productive</h1><p name=\"710c\" id=\"710c\" class=\"graf graf--p graf-after--h3\">Creating a new business is an exciting adventure. However, the hard work comes in when you are working remotely for your startup because you have to remain productive. Today, we decided to compile this list of tips to ensure that your startup is a success even if you decide not to work in a traditional office.</p><h3 name=\"dafb\" id=\"dafb\" class=\"graf graf--h3 graf-after--p\">Keep a Clean Work Environment</h3><p name=\"786e\" id=\"786e\" class=\"graf graf--p graf-after--h3\">One of the upsides of working in an office is that you can have a dedicated and clean workspace. However, when working remotely this may not always be the case. If you are working from home, you want to make sure that you are not working in your bedroom and that your home office space is clutter free. Alternatively, if you are working while traveling, make sure you are working at locations that are clean so your mind can be distraction free.</p><h3 name=\"c5a3\" id=\"c5a3\" class=\"graf graf--h3 graf-after--p\">Take Breaks Frequently</h3><p name=\"a2ea\" id=\"a2ea\" class=\"graf graf--p graf-after--h3\">Working remotely allows you to work for as many hours straight as you please. However, this also comes with a downside. While you may feel guilty that your friends and relatives work nine to five jobs without many breaks, when working remotely breaks can actually benefit you.</p><p name=\"a216\" id=\"a216\" class=\"graf graf--p graf-after--p\">We suggest taking breaks between tasks or using an app to schedule reminders for breaks every hour or two. By taking frequent breaks you can refresh your mind so you can keep the juices flowing, which will allow you to accomplish more at work.</p><h3 name=\"8dc5\" id=\"8dc5\" class=\"graf graf--h3 graf-after--p\">Keep a&#160;Schedule</h3><p name=\"36af\" id=\"36af\" class=\"graf graf--p graf-after--h3\">Just because you are working remotely, it doesn&#8217;t mean that you can just work whenever you feel like it each day. When you are running a startup you have to keep a tight schedule to make sure that you are accomplishing all of the milestones that you have set in place for your company. While it&#8217;s okay to stray away from the traditional 9&#8211;5 hours, you still need to have some type of schedule to maintain productivity.</p><p name=\"1815\" id=\"1815\" class=\"graf graf--p graf-after--p\">If you want to accomplish even more each day, you can break down your schedule into specific timeframes for specific tasks to be completed. For example, you could schedule your emails for an hour in the morning and an hour before the end of your workday. Then, you could have social media promotion for a set time and spend the bulk of your time creating your product.</p><p name=\"fb3d\" id=\"fb3d\" class=\"graf graf--p graf-after--p\">After doing your schedule for about a week or two, it will become schedule nature. To make sure that you are staying as productive as possible analyze and modify your schedule, if needed, once a month.</p><h3 name=\"e271\" id=\"e271\" class=\"graf graf--h3 graf-after--p\">Avoid Distractions</h3><p name=\"c10f\" id=\"c10f\" class=\"graf graf--p graf-after--h3\">Remote workers have a ton of distractions. You have to maintain relationships with family and friends, but at the same time, they can put you behind with your workload. As a startup owner, the idea of you working remotely may be new to friends and relatives, therefore, they may try to interrupt you when you actually need to be working on your business. Additionally, if you are working from home you may become distracted with television, chores, or the radio.</p><p name=\"461c\" id=\"461c\" class=\"graf graf--p graf-after--p\">Avoid distractions by keeping a schedule, alerting your circle of your schedule, and even using apps to block yourself from certain websites during your work hours. The less distractions that you have, the more productive you will be each day. The more productive you are, the less chance you&#8217;ll totally fucking blow it&#8230;</p><h3 name=\"691a\" id=\"691a\" class=\"graf graf--h3 graf-after--p\">Final Word</h3><p name=\"8b0e\" id=\"8b0e\" class=\"graf graf--p graf-after--h3\">Working remotely for a startup will be hard in the beginning. However, if you follow the tips that we have shared in this article today, you will find that you can be productive and successfully run a startup.</p><p name=\"5b44\" id=\"5b44\" class=\"graf graf--p graf-after--p graf--trailing\">How do you remain productive when you are working remotely?</p></div>","title":"Tips for working remotely in a Startup and staying productive"}},"pageContext":{"id":"5b93831687be056953db7e27"}}