{"data":{"mongodbDatabaseArticles":{"id":"5b9248df87be056953db7c08","content":"<div><p>Today, for the first time, I was asked to sell <a href=\"http://gofuckingdoit.com/\">one of my startups</a> as part of <a href=\"/12-startups-12-months\">12 startups in 12 months</a>.</p> <blockquote><p> Congrats on a great site w/ Go Fucking Do It. You must be getting a ton of interest in your 2nd startup, any thoughts of selling? I'm interested.</p> <p>Regards, </p></blockquote> <p>I was kinda excited, so I asked what his price range would be.</p> <blockquote><p> I was looking at $45K.</p> <p>Best of luck whatever you decide to do. You have a remarkable talent. </p></blockquote> <p>The final offer was $45,000 (or EUR 33,000). Now with Dutch tax grabbing 52% of that, I'd be left with about EUR 16,000.</p> <h2>Do or don't</h2> <p>I considered it since it was only a month's work. But I felt it wouldn't cover the potential of the site. If I can scale it up to 10x, it can generate double that offer in revenue annually. So it'd have to be a strong multiple of that before I I'd consider selling it.</p> <p>I'm having way too much fun with it still. The whole concept and execution is still so fresh and doesn't bore me yet. </p> <p>Also, I'm trying to build startups here, not be just an expensive web developer (at EUR 16k/m).</p> <h2>What's the goal here?</h2> <p>This has made me think about what my actual goal with <a href=\"/12-startups-12-months\">this</a> is.</p> <p>First of all, it's having lots of fun and learning things like startup development and marketing. </p> <p>Second, it's about meeting lots of interesting people in the startup world (which I have already). </p> <p>Third, it's being able to maintain my living standards with my projects without having to get a job.</p> <p>Fourth, it'd be fun to attract investment for one of my projects and work together with a team to really scale something to 1M in revenue.</p> <p>Fifth, it'd be fun to sell one of these off for an actual good amount of money that would give me a few years of runway of financial independence to build new stuff while traveling.</p> <h2>Conclusion</h2> <p>It was fun to experience the feelings you get when this happens. And very flattering too. It may show I'm on to something here that I can scale up...so let's <a href=\"//gofuckingdoit.com/challenge/?goal=Grow%20my%20startup&amp;deadline=2015-01-01&amp;price=250\">go fucking grow it.</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I did not sell my startup today"}},"pageContext":{"id":"5b9248df87be056953db7c08"}}