{"data":{"mongodbDatabaseArticles":{"id":"5b92397087be0583cfde6802","content":"<div><h1><p>A new era in offshore banking</p></h1>\n<p>And things have changed in the last couple years, making the whole situation even more complicated. One of the big changes is due to the<a href=\"https://en.wikipedia.org/wiki/Panama_Papers\"> Panama Papers</a>&#160;and the U.S. government&#8217;s increased focus on wiping out terrorism and tackling drugs. And, yes, these are used as excuses to tighten up control and to marginalise the banks that are providing offshore accounts remotely.</p>\n<p>But, whether you like it or not, a lot of these banks in smaller countries have been operating under the radar, and some of them have really gotten whacked, whiles others have just had their competitive advantage taken away.&#160;We have now moved into an era when your bank really needs to know who you are, but the idea of sending sensitive documents through FedEx to open the account and to conduct business through the account is no longer appealing.</p>\n<p>Now even I&#8217;ve been saying, as recently as two and a half years ago, &#8220;Hey, open a remote bank account, toss 500 bucks into an account, build a tunnel, it&#8217;s pretty easy.&#8221;&#160;And there are still banks where you can get an account open. But with tighter scrutiny and control measures, not only is it becoming more difficult for these banks to offer remote account opening, it&#8217;s becoming more difficult to go through the process of opening offshore accounts. In fact, it&#8217;s gotten to the point where it&#8217;s just worth it to fly to the location, as you&#8217;ll probably end up<a href=\"http://nomadcapitalist.com/2016/05/02/high-interest-offshore-savings-account/\"> recovering the money</a> very quickly.</p>\n<p></p><p class=\"et_post_video\"></p>\n\n<h1>Maintaining offshore accounts</h1>\n<p>But the challenge going forward &#8212; and this is one that I&#8217;ve seen with a lot of folks who have come to me &#8212; is keeping the account open, accessing money, getting people to deposit money into the account, and moving money out.</p>\n<p>So, how do you keep the account open?</p>\n<p>If you just have an account with a bunch of money sitting there, and it&#8217;s locked and you can&#8217;t do anything with it, then that doesn&#8217;t really serve you. You want to be able to receive and send money freely.&#160;Now I know some folks in Belize, where bank accounts are becoming harder and harder to manage remotely. In fact, accounts are gradually being closed to U.S. citizens. The same is even becoming true for people from countries other than the U.S.</p>\n<p>If it&#8217;s important to you to have some money in another country, my advice &#160;is to <a href=\"http://nomadcapitalist.com/2015/03/27/the-best-offshore-banks-2015/\">choose the best bank</a> and get on a plane to open that account in person. Rather than finding one with the competitive advantage of letting you set up an account from your couch with $500, find one that can eliminate the challenges of ongoing operations. Not only will opening an account in person offer you a better understanding of what you want from the bank, it will generally offer a higher quality experience as well.</p>\n<h1>A few exceptions that prove the rule</h1>\n<p>There are some special cases to consider. If you have an attorney in a particular country, for example, you can use <a href=\"http://info.legalzoom.com/gain-access-bank-accounts-power-attorney-25538.html\">power of attorney</a> to handle most things. Personally, I don&#8217;t have experience with that in places like the Caribbean. I have experience of that within more mid-range jurisdictions, but things like power of attorney are great. Of course, it means that you have to have an attorney in the country where you want to set up your offshore accounts. By the time you find one that you can trust and want to do business with, it might just be easier to fly there yourself every few months.</p>\n<p>There are also a few banks that are really rock solid and have special remote opening procedures. There are a couple of banks in Asia and Europe that only take U.S. citizens, but these generally require at least a hundred thousand, sometimes into the millions of dollars to do it. Though these are excellent banks, these are not your $500 accounts.</p>\n<h1>Go the extra mile</h1>\n<p>So, in short, opening offshore accounts remotely<a href=\"http://nomadcapitalist.com/2016/11/07/easy-online-offshore-bank/\"> isn&#8217;t a great strategy</a>. I&#8217;m not saying you should never do it, because there are still a few banks that I recommend and which work very well for some people. But the average bank account in a tiny little island where you kick off with 50 bucks and pay twenty dollars a month plus fees just to have some fun is a thing of the past.</p>\n<p>In my opinion,<a href=\"http://nomadcapitalist.com/2017/03/28/avoid-high-offshore-bank-fees/\"> if something is worth doing then it&#8217;s worth doing righ</a>t, and I believe that choosing a bank that offers easy access to managing your money is the right thing to do, even if that means getting on a plane a couple of times a year to make it happen.</p>\n</div>","title":"How to open offshore accounts and bank remotely"}},"pageContext":{"id":"5b92397087be0583cfde6802"}}