{"data":{"mongodbDatabaseArticles":{"id":"5b9248e787be056953db7c0e","content":"<div><p>Joshua Glenn and Elizabeth Foy Larsen, the creators of the kids activity book <a href=\"http://www.amazon.com/gp/product/1608196410/ref=as_li_ss_tl?ie=UTF8&amp;tag=astapcbl-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=1608196410\">Unbored</a> have written a very <a href=\"http://www.huffingtonpost.com/joshua-glenn/hands-on-learning_b_2316955.html\">inspiring article</a> on why education should become less focused on facts and lecturing and more focused on letting kids discover things themselves and allowing them to make mistakes.</p> <blockquote><p>Dec isn't alone in his conviction that experiential hands-on learning makes for a richer academic experience than memorizing the date of the Louisiana Purchase. In fact, the idea of \"learning by doing\" stretches back to education legends Maria Montessori and John Dewey, both of whom felt teachers should act more as guides to students' independent discoveries than as founts of information. Decades of research confirm that making and doing things cement knowledge in ways that lectures can't. \"Think about the driver and the passenger in a car,\" says Adele Diamond, Ph.D., a professor of psychiatry at the University of British Columbia and one of the founders of the field of developmental cognitive neuroscience. \"The driver is hands-on and the passenger does what students normally do in class, which is sit passively. The driver will learn the route better because she has to actively use the information.\"</p> <p>Making mistakes and trying again and again (and often again) until you succeed also encourages what's now being called a \"prototyper's mind,\" an asset that many experts believe will be key to the 21st century job market, where the majority of careers today's kids will pursue have yet to be invented. \"Facts can be looked up,\" says Diamond. \"What students need to be learning is how to reason and problem-solve and be creative. Kids should get rewarded for taking a chance and trying something new and not always have to be so worried about making a mistake.\"</p></blockquote> <p><a href=\"http://en.wikipedia.org/wiki/Maria_Montessori\">Maria Montessori</a>'s philosophies on education are more relevant than ever, now we are in the 21st century. As a Montessori graduate myself, it makes me happy to see the world slowly realizing this too. Montessori-style educaiton can make school more fun for kids and create a foundation for kids to become problem-solving and creative people when they grow up.</p> <p>And that's just what we need more of now. Less people following the rules, and more people taking risks will be the only way we can keep people productive in <a href=\"http://levels.io/the-wests-unemployment-problem-is-permanent/\">the coming age of unemployment by automation</a>.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"In the 21st century, Maria Montessori shows to be more relevant than ever"}},"pageContext":{"id":"5b9248e787be056953db7c0e"}}