{"data":{"mongodbDatabaseArticles":{"id":"5b95ea0687be05832748ff77","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/smoocavepic.jpg\" alt=\"Smoo Cave &#8211; Durness, Scotland\"><br> Updated: 07/01/2018 | July 1st, 2018</p><p>I wish I could be everywhere, but until they perfect cloning technology, there&#8217;s only one of me traveling this big world. I now plan on having regular guest writers on the website to highlight places I haven&#8217;t been yet&#8230; places we can together dream of visiting someday. This month my friend <a href=\"http://virtualwayfarer.com/\" target=\"_blank\" rel=\"noopener\">Alex Berger</a> talks about northern Scotland and shares the story of Smoo Cave. It&#8217;s beautifully written. Enjoy! </p><p>Perched atop the worn limestone cliffs at the mouth of the Geodha Smoo inlet, I casually brushed the toe of my walking boot across the soft, muted purple heather blossoms. I had arrived in the sleepy Scottish town of Durness a few minutes earlier and made the 10-minute walk along the edge of the inlet, hoping to catch one of Scotland&#8217;s mystical sunsets. The sound of crashing waves waging their perpetual war against the coastline echoed in my ears as I let the clean scent of heather, salt spray, and seaweed fill my lungs.</p><p>My arrival in Durness marked the culmination of a long day&#8217;s drive up the northwestern coast of Scotland. The sleepy little village of 400 stands beside one of Scotland&#8217;s most unique natural wonders. Situated at the end of Geodha Smoo, a mid-length inlet carved by the ocean, wind, and a small stream, Smoo Cave resembles a dragon&#8217;s open maw carved into the side of the surrounding stone cliff face.</p><p>What makes the cave unique in the UK is its geographic qualities. The sprawling outer chamber has been carved over the ages by the sea, while a series of internal caverns and tunnels have been etched out by the two freshwater streams that thread their way through the cave. The first of these two streams bubbles up through a submerged pool situated at the terminus of the deepest accessible part of the cave. The second comes from the waters of the Allt Smoo, a stream (or raging torrent, depending on the rains) that winds across the Scottish countryside before suddenly crashing 80 feet through a hole in the stone ceiling and down into Smoo Cave&#8217;s second largest cavern.</p><p><img src=\"https://media.nomadicmatt.com/homepage/smoocave6.jpg\" alt=\"Smoo Cave entrance &#8211; Durness, Scotland\"></p><p>There the waters join with those that have wandered their way out from beneath the bedrock to connect in a deep pool. Only partially lit by small wall lamps and the faint light streaming in through the hole in the roof, the dark waters are largely still except for the periodic swirl of a fish&#8217;s fin, the gentle mist of the waterfall, and the soft ripple of an inflatable raft as it ferries visitors deeper into the heart of the cave.</p><p>On my previous visit to Smoo the rains had turned the small Allt Smoo into a raging river, making it impossible to spend more than the briefest of moments on the wooden platform raised at the end of the small tunnel that connects the cave&#8217;s grand mouth and the flooded depths of the second chamber. This time, as I slowly walked beneath the moss-covered ceiling of the grand chamber, I hoped I would have the chance to explore the cave&#8217;s depths.</p><h3>The Portal</h3><p><img src=\"https://media.nomadicmatt.com/homepage/smoocave2.jpg\" alt=\"Smoo Cave &#8211; Durness, Scotland\"><br> With most of the tourists having left for supper, I found myself standing alone in the center of the main chamber. With a skylight in the ceiling carved by the Allt Smoo before it found an easier route into the chamber, the cave ceiling arcs overhead with more than 40 feet of clearance. The back of the cave is covered in green moss and small plants, while a perfectly lit, otherworldly crevasse glows as though an emerald gateway to another world has opened.</p><p>For those familiar with the epic of Beowulf, it is easy to envision the early Norse explorers, who archaeologists say once made camp in the cave, huddled around a campfire telling stories of sea witches and cave trolls. For others who may have dreamed of similar seaside caves, it is easy for the mind to wander with flights of fantasy and dreams straight from Arthurian legend. It seems likely, given that the archaeological record for the cave shows signs of habitation stretching back more than 4,000 years to the Neolithic Era, that the cave was inspiring travelers even while the pharaohs raised the great pyramids in ancient Egypt.</p><p>I relished the moment and paused inside the second chamber for several photographs before returning to the hostel. If the weather cooperated, the following morning promised adventure and the opportunity to delve into Smoo&#8217;s deepest depths.</p><h3>Exploring the Cave</h3><p><img src=\"https://media.nomadicmatt.com/homepage/smoocave3.jpg\" alt=\"Smoo Cave &#8211; Durness, Scotland\"><br> To my delight morning arrived with only the lightest of Scottish showers. I quickly made my way down to the grand entrance in the main cavern, paid a couple of pounds for the tour, and was fitted for a hardhat. I joined the others, and we were instructed to head into the second chamber where an inflatable river raft was set up just beneath the wooden viewing platform. After a brief wait, our guide arrived and ushered us carefully down a vertical ladder and into the boat. He was a crusty old Scotsman who obviously had a deep relationship with the cave and had been giving tours for years. After obeying a few barked orders, we ducked our heads and pressed ourselves against the bottom of the raft as he pulled us out from beneath the low-hanging dock and along the edge of the second cavern.</p><p>Soon, we found ourselves by the outer edges of the falls as he explained how the waterfall came to be and the history of the cave. After a brief pause he tossed a few pieces of crumbled bread over the edge of the boat. As soon as it hit water, our eyes widened as a small army of invisible fish tore the bread asunder and then returned to the depths of the black waters.</p><p>With a gritty chuckle, a push, and a command to mind our heads, our guide used two ropes to pull us across the chamber and beneath a low-hanging arch with just enough clearance for the boat. A helmet scraped gently on the rocks overhead as we guided the boat beneath the arch and into a small chamber. There, our guide hopped out and led us carefully onto wooden boards haphazardly sitting in the midst of a small stream.</p><h3>Deep in Smoo Cave</h3><p><img src=\"https://media.nomadicmatt.com/homepage/smoocave4.jpg\" alt=\"Smoo Cave raft &#8211; Durness, Scotland\"><br> The tunnel that stretched out before us was roughly the height of a tall man. The walls looked every bit like a fossilized seabed, reflecting their ancient past.</p><p>Careful to mind our footing, we followed our guide along the raised boards deeper into the cave. The journey wasn&#8217;t long but served to add to the feeling of otherworldliness. Each step took us further along what felt like a mixture of an underground river and the type of ancient mine our ancestors might have carved out 100 generations ago.</p><p>The tunnel dead-ends abruptly. The walls of the cave flair slightly and then converge, covered on one side by a thick layer of wide stalactites that protrude partially from the wall. Beneath them the stream threads its way across fallen rocks which in turn give way to fine sand and a small pool that slips beneath the stalactite covered wall.</p><p>With the light twang of disappointment in his voice our guide explained that attempts to further explore the tunnel through the use of dive equipment had come up empty-handed. Indications suggested that the chamber likely continued on further into the cliffs, but silt and obstacles in the submerged part of the tunnel made it impossible to explore. It was clear he had the heart of an explorer and itched for the day when some shift or change made it possible to find and delve those depths.</p><p>He broke our thoughtful reverie and voiced his theory that at one point, the cave system likely opened into additional chambers further in the cliff side. As evidence, he gestured at small bits of sodden charcoal that had gathered, caught in the sand at the pool&#8217;s lip. Bits of charcoal, like those we were seeing, had been tested and were roughly 4,000 years old. Even more interesting, they showed indications that they likely stemmed from man-made cooking fires.</p><p><img src=\"https://media.nomadicmatt.com/homepage/smoocave5.jpg\" alt=\"Smoo Cave waterfall &#8211; Durness, Scotland\"></p><p>His passion to solve the question of where the charcoal was coming from and who had left it deep within the cave captured our imaginations as we slowly made our way back to the boat. Each of us dragged our feet slightly, eager to draw out the experience. But, then, as quickly as it had all begun, we found ourselves back in the boat, our faces pressed against the thick rubber of the raft&#8217;s sides as we squeezed beneath the small arch and re-emerged into the cavern with the waterfall.</p><p>Smoo Cave isn&#8217;t the most grandiose cave you&#8217;ll ever explore. It&#8217;s also not the most beautiful. Yet, there&#8217;s something special about it that&#160;teases the imagination. For my part, I look forward to the opportunity to return and harbor the hope that someday we&#8217;ll solve the cave&#8217;s mystery and learn more about what lies behind its flooded passageway.</p><p><strong>Logistics:</strong> Durness is best reached by car or motorcycle. However, it can be reached by bus or a bus/train combination by way of Lairg. In addition to Smoo Cave, Durness is also a popular base for exploring Cape Wrath. There are several hostels and numerous hotels and B&amp;Bs in the area; the most convenient for viewing Smoo Cave is the Durness Youth Hostel. Smoo Cave is free to visit but the boat tour costs roughly 5 GBP and typically lasts 20-30 minutes.&#160;The cave is accessible all year.</p><p>Alex Berger is the author of <a href=\"http://virtualwayfarer.com/\" target=\"_blank\" rel=\"noopener\">VirtualWayfarer.com</a> and an American currently living in Copenhagen, Denmark. An avid traveler, his passions include travel photography and academic research into the evolving role technology plays in shaping backpacker culture.</p><h4>Book Your Trip to Durness: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Durness by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Durness with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Scotland?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/travel-guides/scotland-travel-tips/\" target=\"_blank\" rel=\"noopener\">destination guide on Scotland</a> for even more planning tips!</p><p>&#160;</p></div>","title":"The Mystical Smoo Cave of Scotland: A Traveler's Guide"}},"pageContext":{"id":"5b95ea0687be05832748ff77"}}