{"data":{"mongodbDatabaseArticles":{"id":"5b93832d87be056953db7e35","content":"<div><h1 name=\"bdce\" id=\"bdce\" class=\"graf graf--h3 graf--leading graf--title\">Tech companies: make remote work part of your diversity and inclusion efforts.</h1><p name=\"46ff\" id=\"46ff\" class=\"graf graf--p graf-after--h3\">I&#8217;m about to finish my first month of <a href=\"https://www.remoteyear.com/itinerary-yugen\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Remote Year</a>. Through this process, I&#8217;m learning a lot about remote work, my personal experience with the digital nomad culture and lifestyle, and how to be at my best while thousands of miles away from my office.</p><p name=\"5302\" id=\"5302\" class=\"graf graf--p graf-after--p\">Remote work is beneficial for both a company and its employees, but it&#8217;s not easy. With a little practice, I hope to have some insight to offer tech companies who are thinking about being more remote-friendly, and those searching for a remote-friendly role.</p><h3 name=\"80a1\" id=\"80a1\" class=\"graf graf--h3 graf-after--p\">Remote opportunities are part of a diverse company&#160;culture.</h3><p name=\"4f2e\" id=\"4f2e\" class=\"graf graf--p graf-after--h3\">When we think about diversity, we should think about opportunity. In order to have a diverse company, it&#8217;s important to consider the application process. How do we get more candidates in the door who offer diverse experiences and viewpoints to the company? Being open to remote work allows companies to get a broad range of candidates who may not have been able to come to the office. Looking outside of the physical limitations of your company&#8217;s HQ allows great candidates the opportunity to apply, and gives the company a broader and more diverse applicant pool.</p><p name=\"e821\" id=\"e821\" class=\"graf graf--p graf-after--p\">When opening up a new role at your company, consider the folks who won&#8217;t be applying and how you can be more inclusive to them. They may live far away, have children, have a disability that makes commuting difficult, take care of a sick family member, have anxiety in highly social situations, etc. None of these factors make them any less qualified or excited to take the job. Not having a remote friendly policy immediately takes away the opportunity to bring these diverse experiences to your company.</p><h3 name=\"b983\" id=\"b983\" class=\"graf graf--h3 graf-after--p\">Remote employees bring a new set of experiences to the&#160;company</h3><p name=\"ec70\" id=\"ec70\" class=\"graf graf--p graf-after--h3\">Diversity of experience is part of the goal of creating more diverse, more inclusive companies. Folks from different backgrounds, with different life experiences, bring with them a unique way of looking at products, approaching problems, and answering questions. Remote work opens up another layer of diversity, this time based on location.</p><blockquote name=\"1b3d\" id=\"1b3d\" class=\"graf graf--blockquote graf-after--p\">Remote opportunities allow folks to travel extensively, opening their minds to different cultures and experiences and contributing to a healthier worldview, therefore bringing broader ideas and vision to your company and product.</blockquote><p name=\"7abc\" id=\"7abc\" class=\"graf graf--p graf-after--blockquote\">In the last month, I&#8217;ve met, worked with, and lived with folks from all over the world&#8212;Croatia, France, Germany, Ireland, South Africa, the Philippines, Mexico, and others. These people have taught me so much in so little time. I am able to hear about their experiences and sympathize with their problems. I&#8217;m learning about their history and the social situations in their home countries.</p><p name=\"fe11\" id=\"fe11\" class=\"graf graf--p graf-after--p\">All of this cultural knowledge comes in handy in a professional setting. I&#8217;m able to use this context when designing online and in-person communities, working with international customers, strategizing new features for a globally used product, even answering support tickets. There&#8217;s more to learning than online classes&#8212;cultural immersion helps people step outside the bubble of their home town, their office, and the norms associated with physical permanence.</p><h3 name=\"03b9\" id=\"03b9\" class=\"graf graf--h3 graf-after--p\">Remote work is fulfilling, but it&#8217;s not&#160;easy</h3><p name=\"af73\" id=\"af73\" class=\"graf graf--p graf-after--h3\">No matter how much it sounds like rainbows and sunshine, getting into the groove of working remotely can be quite difficult. It&#8217;s up to both the employee and the employer to work together to achieve a system that makes it easy for the employee to feel like part of a team, to be heard, and to do their best work.</p><p name=\"d8c9\" id=\"d8c9\" class=\"graf graf--p graf-after--p\">I&#8217;ve learned a lot about company&lt;&gt;employee collaboration around remote policies in the last few years, and I&#8217;d love to share some of the points that have helped me along the way:</p><p name=\"b927\" id=\"b927\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--p\">R<strong class=\"markup--strong markup--p-strong\">espect remote hours</strong>. Teams should understand that it&#8217;s important to communicate with remote employees during their on times, not outside of them. Just like you wouldn&#8217;t send an email at 2AM and expect a response, keep in mind your remote team member&#8217;s time zone so you don&#8217;t schedule meetings for 10PM. Use apps like <a href=\"https://chrome.google.com/webstore/detail/foxclocks/obcbigljfpgappaaofailjjoabiikckk?hl=en\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">FoxClocks</a> to stay aware of what time it is where remote employees are.</p><p name=\"02f1\" id=\"02f1\" class=\"graf graf--p graf-after--p\">Using Slack&#8217;s new status feature, remote employees can set their hours in their status, so the team is aware of when they can be expected to be online.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*ayHPaCV_FQJ1Kl_CvEDo5w.png\">This is what my Slack status looks&#160;like<p name=\"0095\" id=\"0095\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--figure\">W<strong class=\"markup--strong markup--p-strong\">ork when and where you&#8217;re most productive. </strong>People assume that working from a tropical place is like taking a working vacation. In fact, that&#8217;s not the case. I&#8217;m most productive in the morning hours. I wake up, get a quick breakfast, and knock out most of my important tasks before noon. This means I generally prefer to work from 7&#8211;3PM. However, because of the time zone difference, I often find myself pulling 11 hour days in order to stick around for meetings with my team.</p><p name=\"da09\" id=\"da09\" class=\"graf graf--p graf-after--p\">A good way to mitigate this is to take a mid-day break. Instead of sacrificing my most productive morning hours, I take a long lunch mid-day or carve out some time for a walk in my new neighborhood. Working 11 hours a day will lead to burnout wherever you are in the world&#8212;being aware of your most productive hours will allow you to make the most of your work time without sacrificing your me-time.</p><p name=\"f7d0\" id=\"f7d0\" class=\"graf graf--p graf-after--p\">Remote work doesn&#8217;t always have to mean working alone. Although some folks, myself included, work best in a quiet room instead of an open office, bringing yourself into the local community can help create a similar workspace to the one you&#8217;re used to. Find a workspace in your area that caters to the local tech community and to digital nomads. Try using <a href=\"https://workhardanywhere.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Work Hard Anywhere</a> to find a workspace or a cafe with good Wi-Fi for when you&#8217;re trying to get out of the apartment.</p><p name=\"e6fb\" id=\"e6fb\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--p\">U<strong class=\"markup--strong markup--p-strong\">se tools that keep your community intact.</strong> When working remotely, it can be difficult to feel like you&#8217;re part of your in-office team. Using tools that bring you back into the fold can help mitigate any feelings of alienation. <a href=\"https://www.helpscout.net/blog/remote-customer-service/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">HelpScout has a great post</a> about the tools they use to collaborate. Try taking these into account as well:</p><p name=\"43bb\" id=\"43bb\" class=\"graf graf--p graf-after--p\">I love using <a href=\"http://zoom.us\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Zoom</strong></a> as a video conference platform. It works better for me than Hangouts or Skype, the quality is excellent, and it&#8217;s easy to record meetings. For video conferences, have each person on their own computer, in their own space. When one employee is remote and the others are in one big room, the remote employee has to try and read body language, participate in hard-to-hear jokes, and attempt to jump off mute to be heard at just the right time. Having everyone on Zoom from their own computer makes it much easier to communicate on a level playing field.</p><p name=\"2b6e\" id=\"2b6e\" class=\"graf graf--p graf-after--p\">When it&#8217;s impossible to have every participant on their own computer, I like using <a href=\"https://www.owllabs.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Owl</strong></a> for meetings. Owl is a 360 video camera that focuses on the person who is currently speaking. Often, non-remote employees pass the computer back and forth so folks at all ends of the room can hear them. This gets tedious and it&#8217;s often difficult for remote employees to hear everyone from all sides of the room when the computer is simply pointing at one person. Owl allows for stability, makes it easier to see and hear everyone speaking, and it&#8217;s very, very cute (big win).</p><p name=\"c3f6\" id=\"c3f6\" class=\"graf graf--p graf-after--p\">Booking meetings when remote can be a headache of its own. Time zone changes mean going back and forth on emails constantly to figure out a good time to meet, only to make a mistake when booking and having to re-schedule. I use <a href=\"http://calendly.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Calendly</strong></a> to make sure that folks can book meetings with me when I&#8217;ll actually be available. The calendar shows up in their time zone, so there&#8217;s no need to make any calculations. It makes my remote experience a lot easier.</p><p name=\"45ce\" id=\"45ce\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Build new traditions as well as participating in old ones.</strong> Transitioning into remote work physically takes you out of your old location. There will be work activities that you won&#8217;t be able to participate in any longer, such as lunchtime ping pong games, or monthly happy hours. You can modify some of these traditions to suit your new work environment, and you can create new ones to bring you back into feeling like part of a team.</p><p name=\"bbd9\" id=\"bbd9\" class=\"graf graf--p graf-after--p\">One of my Remote Year peers, Jordan, used to have walk-and-talks with members of his team. Today, he jumps on the phone (on speaker) while his colleague keeps it in his pocket or hand, so Jordan can hear and participate in the walk-and-talk. Genius!</p><p name=\"74c4\" id=\"74c4\" class=\"graf graf--p graf-after--p\">New traditions can really help when fostering remote inclusivity. Every week, send out a short video to your team about what you did during the weekend, and have them send one back. Do a video lunch hour where you &#8220;go to lunch&#8221; with a member of your team&#8212;jump on a video call with your breakfast/lunch/dinner/snack and chat about your day or what you&#8217;ve been up to. These little traditions do so much to keep a team feeling connected. Create your own based on your culture and make it a recurring event.</p><p name=\"681a\" id=\"681a\" class=\"graf graf--p graf-after--p\">Remote work brings so much to a company and their employees. Doing it right requires effort and commitment, but the benefits impact diversity, inclusion, growth, and product goals. I&#8217;d love to hear more about how you approach remote work, and what helps you stay at your best.</p><p name=\"137b\" id=\"137b\" class=\"graf graf--p graf-after--p graf--trailing\">Feel free to reach out to me at margotmazur@gmail.com for any questions or comments around remote work, culture, community, and more. If you enjoyed this post, please give it a &#128079;&#127995;!</p></div>","title":"Tech companies: make remote work part of your diversity and inclusion efforts."}},"pageContext":{"id":"5b93832d87be056953db7e35"}}