{"data":{"mongodbDatabaseArticles":{"id":"5b95eaac87be05832748ffc4","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/chiang_saturday.jpg\" alt=\"a temple in Chiang Mai\">Updated: 03/29/2018 | March 29th, 2018</p><p><a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\" target=\"_blank\" rel=\"noopener\">Chiang Mai</a> is Thailand&#8217;s northern version of <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\" target=\"_blank\" rel=\"noopener\">Bangkok</a>. It&#8217;s the second largest city in Thailand, and is the gateway to the jungles and cities of the north. Once a quiet little village, the city has morphed into a major business and tourist center in the last 10 years. Large amounts of Westerners began flocking here for jungle treks and a quiet mountain setting, but the crowds kept increasing and the locals soon followed to make money off them. Chiang Mai now has a population of 500,000.</p><p>While the city has lost some of the charm that originally made it so popular, it is still a vibrant place to be, and there is a lot to do here despite the growth, smog, and package tourists.</p><p>The city&#8217;s historic grandeur is evident in the ruins of the old city wall. These thick stone sections give an indication of the power that Chiang Mai once wielded, though they&#8217;re now left crumbling. Now, modern buildings surround the wall, and the only real evidence of Chiang Mai&#8217;s ancient past are the temples. The city is dotted with amazing and numerous Buddhist temples. The city has over 300 temples, but the main historic ones are: Wat Chiang Man (the oldest temple in Chiang Mai), Wat Phra Singh (built in 1345 and offers meditation classes), Wat Chedi Luang (founded 1401), Wat Chet Yot (founded 1451), Wiang Kum Kam, Wat U-Mong, and Wat Suan Dok (all 14th century).</p><p>The main attraction is Wat Doi Suthep, located outside the city on a mountain with the same name. According to legend, a monk from Sukhothai had a dream that told him to find an ancient Buddhist relic. He found the relic and brought it to King Nu Naone. The relic was split into two pieces. The smaller piece went to a temple in Suandok. The other piece and this is the important part of the legend, was placed on the back of a white elephant and released into the jungle. Supposedly, the elephant climbed up Doi Suthep, trumpeted three times, and then died. His death was supposed to be a sign that a temple was to be built on this site. The temple is designed with two large Naga snakes guarding the long walk up the staircase to the temple. The temple also has many Buddhist reliefs and, of course, a statue of a white elephant. Moreover, you get stunning views of the city.</p><p>But you don&#8217;t come to Chiang Mai just to see temples. They&#8217;re just a bonus. You really come here because of all the activities you can do. Not only is <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\" target=\"_blank\" rel=\"noopener\">Chiang Mai</a> a major jumping-off point for the more rugged northern cities like Pai and Chiang Rai, but it is a starting point for numerous jungle treks. Some of the best things to do and see in Chiang Mai are:</p><p><strong>Go zip lining</strong><br> If you are looking for an adrenaline rush, go zip lining. Chiang Mai has many operators offering beginner and advanced zip lining courses. The two biggest operators are <a href=\"https://www.treetopasia.com/thailand-holiday/chiang-mai\" target=\"_blank\" rel=\"noopener\">Flight of the Gibbon</a> and <a href=\"https://www.eagletrackchiangmai.com/\" target=\"_blank\" rel=\"noopener\">Eagle Trekkers</a>.</p><p><strong>Visit the zoo and aquarium</strong><br> (Doi Suthep-Pui foothill, <a href=\"http://www.chiangmaizoo.peam.biz/\" target=\"_blank\" rel=\"noopener\">chiangmaizoo.peam.biz</a>)<br> In the 1950 Harold Mason Young, son of American missionaries, started rescuing and caring for injured animals, and his collection started getting visitors. Hence the birth of the zoo, when the Chiang Mai government donated 24 acres to aid in his efforts. The zoo has grown to over 200 acres now, and houses a large variety of animals, and boasts two aquariums. The marine aquarium is the largest in Asia, and they also have one of the very rare giant pandas ever born in captivity. Hours are 8am to 5pm. Admission is 520 THB.</p><p><strong>Visit the Tribal Museum</strong><br> (Ratchamangkla Park, Chotana Road Muang)<br> Highlighting Thailand&#8217;s minority hill tribes, this ethnographic museum offers exhibits ranging from tribal clothing and jewelry items, videos on tribal life, and outdoor gardens modeling reconstructed tribal huts. Once a month, there is also a tribal market with people selling handmade goods. Open Monday-Friday from 9am-4pm. Admission is free but donations are appreciated.</p><p><strong>Visit Elephant Sanctuaries</strong><br> (1 Ratmakka Road, Phra Sing, +66 53 272855, <a href=\"https://www.elephantnaturepark.org/\" target=\"_blank\" rel=\"noopener\">elephantnaturepark.org</a>)<br> There&#8217;s a growing movement to protect the elephants, led by Lek Chailert, the founder of&#160;<a href=\"http://www.elephantnaturepark.org/\" target=\"_blank\" rel=\"noopener\">Elephant Nature Park</a>. Elephant Nature Park (ENP) has been around since 1996 and is the biggest conservation and elephant rescue organization in Thailand. Located outside of Chiang Mai, it is currently home to 37 elephants (plus a menagerie of other animals).</p><p>Demand is so high, <a href=\"https://www.nomadicmatt.com/travel-blogs/thailand-elephant-conservation/\" target=\"_blank\" rel=\"noopener\">not only for visitors but&#160;volunteers&#160;too</a>, that you have to make reservations in advance to visit (for volunteers, that might mean up to a year in advance). Prices start at 2500 THB.</p><p><strong>Bargain at the Night Bazaar</strong><br> (Intersection of Tha Pae and Chang Klang Roads)<br> This market is famous around the world, and people come here to buy cheap goods. The outdoor night market covers several city blocks. You can buy anything and everything here for much cheaper prices than you can in Bangkok. Clothes are especially cheap, as they are usually made in the surrounding area. Buyers and sellers haggle over prices through calculators. It&#8217;s interesting watching two people conduct a transaction without speaking a word &#8211; just pointing and typing in prices. Getting the cheapest price takes patience, persistence, and the ability to walk away. The bargains are there, though, and it&#8217;s the best place to get your goods in Thailand. I&#8217;m not a shopper, but I can never walk away from there without something in-hand.</p><p><strong>Go Jungle Trekking</strong><br> This town is the main starting point for all sorts of jungle trekking tours. I like the three-day ones the best but the longer the tour, the more interesting and secluded places you visit. Be careful with whom you sign up, as many guides simply walk with you and don&#8217;t tell you much about the land or wildlife. Moreover, if you visit a tribal village, make sure the money stays with the villagers, and that they aren&#8217;t being exploited, which happens a lot up here!</p><p>Though tours can be more rustic and less touristy if you leave from places like Chiang Rai, most people leave from here and there are plenty of tours to choose from. You can sign up for one, two, three, or five day jungle treks. The longer you go for, the further into the jungle you get and the less like a Disney attraction the tour seems. The one-day treks are very rushed and pretty generic. You need a minimum of two days. Spending a night in the jungle is a great way to escape civilization and stare up at an infinite number of stars.</p><p></p>*****  has plenty to offer any traveler, and a few days here can keep you busier than anywhere else in the country. I&#8217;ve been three times, and I still find new things to do when I am there. I never feel bored. It&#8217;s not the quite jungle place it used to be, but it is still a good spot from which to explore the Thai north or get some serious shopping in.<a></a><h2>Get the In-Depth Budget Guide to Thailand!</h2><span><a></a><span><a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\" target=\"_blank\" rel=\"noopener\">Chiang Mai</a> has plenty to offer any traveler, and a few days here can keep you busier than anywhere else in the country. I&#8217;ve been three times, and I still find new things to do when I am there. I never feel bored. It&#8217;s not the quite jungle place it used to be, but it is still a good spot from which to explore the Thai north or get some serious shopping in.</span></span><p><a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Thailand_Flat.jpg\" alt=\"\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p><h4>Book Your Trip to Chiang Mai: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Chiang Mai by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines.</p><p><strong>Book Your Acommodation</strong><br> You can book your hostel in Chiang Mai with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to a hotel, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"nofollow noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never take a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Chiang Mai?</strong><br> Be sure to visit our robust <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\" target=\"_blank\" rel=\"noopener\">destination guide on Chiang Mai</a> for even more planning tips!</p><p>Note: This article was originally published in 2008.</p><p>Photo credits: <a href=\"https://flic.kr/p/6Fit34\" target=\"_blank\" rel=\"noopener\">2</a>, <a href=\"https://flic.kr/p/4zq2N1\" target=\"_blank\" rel=\"noopener\">4</a></p></div>","title":"The Saturday City: Chiang Mai"}},"pageContext":{"id":"5b95eaac87be05832748ffc4"}}