{"data":{"mongodbDatabaseArticles":{"id":"5b9382db87be056953db7dfe","content":"<div><h1 name=\"7aaa\" id=\"7aaa\" class=\"graf graf--h3 graf--leading graf--title\">How We Support Remote Employees at DigitalOcean</h1><p name=\"230e\" id=\"230e\" class=\"graf graf--p graf-after--h3\">Written by Amanda Brazzell</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*hwy-P0pGB-uggXFP.png\"><p name=\"f556\" id=\"f556\" class=\"graf graf--p graf-after--figure\">Remote culture at DigitalOcean is one of my favorite things to talk about when discussing my job. When I first joined the company in June of 2015, there was already a substantial percentage of existing remote employees (better known as our &#8220;remotees&#8221;). Working with the remotees wasn&#8217;t initially a part of my function, but as a member of the Employee Experience Team, I gradually found myself getting to know many of them more personally. I learned about their experiences as distributed employees, some of their pain points, and how it influences their engagement.</p><p name=\"6994\" id=\"6994\" class=\"graf graf--p graf-after--p\">Since I&#8217;ve never been remote, I educated myself on best practices for companies with remote employees and how we could expand our top-notch employee experience to those outside of our HQ.</p><p name=\"3d6b\" id=\"3d6b\" class=\"graf graf--p graf-after--p\">Two and a half years later, our remotee population totals over 200 employees, making up over 50% of our employees, and our program has grown to support both the needs of our business and those who work remotely. To date, remotees score higher in engagement than any other subgroup at the company. This has been attributed to the attention and effort we have actively given to support the remotee experience.</p><p name=\"ddd9\" id=\"ddd9\" class=\"graf graf--p graf-after--p\">Here&#8217;s what we learned and how we adjusted our efforts to better support the remotee experience:</p><h3 name=\"f5dc\" id=\"f5dc\" class=\"graf graf--h3 graf-after--p\">Remote Communication</h3><p name=\"a8ae\" id=\"a8ae\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--h3\">&#8220;Watercooler talk&#8221; is an important aspect of working in-office, and it&#8217;s a practice that companies seeking to become more remote-friendly have trouble replicating. Being able to easily communicate with other colleagues helps improve team bonds and makes people feel part of the company fabric. At DO, we use several different mediums to avoid having remotees excluded from conversation and risking having information fall through the cracks:</p><ul class=\"postList\"><li name=\"0f1a\" id=\"0f1a\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Slack</strong>: The entire company uses Slack extensively for communication, whether you&#8217;re located across from each other or across time zones. We have a dedicated Slack channel specifically for our remotees, and we use that channel to make all remote-specific announcements (not to mention, for a lot of watercooler conversations). Additionally, we recently started a &#8220;Coffee Buds&#8221; program that pairs participants in our #coffeebuds Slack channel each week. Remotees have the chance to meet other colleagues&#8202;&#8212;&#8202;remote and in-office alike&#8202;&#8212;&#8202;and &#8220;hang out&#8221; over Hangouts!</li><li name=\"e4f7\" id=\"e4f7\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Google Hangouts</strong>: It is common practice at DigitalOcean to have all our meetings hosted on Google Hangouts. All of our conference rooms include screens where remote employees join the meeting, making it possible for them to always be a contributor in team conversations.</li><li name=\"7e3e\" id=\"7e3e\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Zoom</strong>: Hangouts can be limiting depending on the amount of people you have on a call. All of our company-wide, internal meetings are hosted on Zoom, and all remotees use it to join our biweekly All Hands Meeting. (It&#8217;s always fun seeing all of our remotees tune in at the same time.)</li><li name=\"1b7a\" id=\"1b7a\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Google Drive</strong>: But what about time zone differences? Because we have an office in Bangalore, India and other remotees globally, all of our company-wide meetings are recorded and filed in a Google Drive for anyone to access at their convenience.</li><li name=\"70dd\" id=\"70dd\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Who&#8217;s in HQ</strong>: Our weekly, internal newsletter goes out to the entire company on Monday mornings and a recurring section in it is called &#8220;Who&#8217;s in HQ&#8221;. This section has pictures of all the remotees who are visiting either our New York or our Cambridge office that week. This gives our in-office employees visibility into the visiting remotees so they can be sure to take the opportunity to meet them.</li></ul><h3 name=\"fce5\" id=\"fce5\" class=\"graf graf--h3 graf-after--li\">Remote-inclusive Programs</h3><p name=\"a434\" id=\"a434\" class=\"graf graf--p graf-after--h3\">While most of our teams at DigitalOcean are comprised of both in-office and remote employees, there is definite value in giving teams the opportunity to get together in person at different times during the year. Here are the processes we have in place to ensure teams get face time:</p><ul class=\"postList\"><li name=\"a495\" id=\"a495\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">DO Docking In</strong>: The &#8220;DO Docking In&#8221; program supports remote employees joining the rest of their team in the office all at once. We arrange leadership meetings, team dinners and activities, reserve workspace or conference room space, and host a Meet and Treat (a midday gathering between in-office employees and remotees) for them. In addition, teams also have the opportunity to participate in facilitation or meeting preparation by our internal Talent Development Team to serve the team&#8217;s goals for getting everyone together in person.</li><li name=\"e1cd\" id=\"e1cd\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">DO Out To Sea</strong>: Considering that we have employees dispersed domestically and internationally, some teams prefer to have their entire team get together in locations more local to where they work remotely from. This program is essentially the same as DO Docking In except that any team member who works from the office will fly out to meet with their remote team members. We help to arrange all of the offsite logistics and activities to support that team&#8217;s objectives for the visit.</li><li name=\"8853\" id=\"8853\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">DO Local</strong>: This program is the newest addition to our remote experience effort. This program parallels all major events or activities that are occurring in our office for our remotees. An example of this is our holiday party: we host our holiday party in New York and give the option for remotees who work in near proximity to other remotees to get together locally and enjoy a DigitalOcean sponsored dinner.</li><li name=\"2543\" id=\"2543\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Shark Week</strong>: Shark Week is our annual family gathering. Essentially it&#8217;s structured like an internal conference providing team time, workshops, team activities, shared meals, and an entire week of quality time together. DigitalOcean covers the flights and the accommodations for all the remotees to join us for that week.</li></ul><h3 name=\"106c\" id=\"106c\" class=\"graf graf--h3 graf-after--li\">Perks for&#160;Remotees</h3><p name=\"cf84\" id=\"cf84\" class=\"graf graf--p graf-after--h3\">While some companies see working from home as a perk in and of itself, we recreate many of the in-office perks and make them available to remotees. This is key to building a cohesive company culture and experience, and one where remotees feel engaged with the company at large.</p><p name=\"d75e\" id=\"d75e\" class=\"graf graf--p graf-after--p\">Our remotes are able to participate in our workstation program, where they get access to different monitors, mouse/keyboards, and trackpads for their home offices, as well as credit up to $100 for headphones of their choice. The equivalent of our commuter benefit for in-house employees is providing remotes a credit toward the cost of either their monthly internet bill or their monthly coworking space membership. Additionally, remotes can opt into a monthly subscription snack box (because snacks are awesome!). Finally, DO covers travel and per diem costs, and provides accommodation at our corporate apartments for remotee visits to HQ.</p><h3 name=\"327d\" id=\"327d\" class=\"graf graf--h3 graf--startsWithDoubleQuote graf-after--p\">&#8220;Love is What Makes Us&#160;Great&#8221;</h3><p name=\"0e0c\" id=\"0e0c\" class=\"graf graf--p graf-after--h3\">DigitalOcean&#8217;s employee experience programs strives to be inclusive of all of our employees. We do this by keeping both the needs of in-office and remote employees in mind, and by adjusting our programs as needed to ensure they can change and scale with our growing organization. Removing obstacles to communication between people in our offices and remotes is essential for building cohesion across teams and to help everyone be the most productive employee they can be, no matter where they&#8217;re located.</p><p name=\"2e0a\" id=\"2e0a\" class=\"graf graf--p graf-after--h4 graf--trailing\">Amanda Brazzell is DigitalOcean&#8217;s Office Experience Team Lead. She has helped build an effective Remote Experience program that drives dispersed employee engagement and job satisfaction. Amanda is a California native who moved to NYC without having ever visited the city before, and has been at DO since 2015.</p></div>","title":"How We Support Remote Employees at DigitalOcean – Inside DigitalOcean"}},"pageContext":{"id":"5b9382db87be056953db7dfe"}}