{"data":{"mongodbDatabaseArticles":{"id":"5b921d2887be0571ac1b0504","content":"<div><p></p><img class=\"size-full wp-image-16166\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/02/caution-offshore-accounts-at-Panama-banks.jpg\" alt=\"caution offshore accounts at Panama banks\" width=\"700\" height=\"467\"><p>Dateline: Managua, Nicaragua</p>\n<p>In the movie Blow, Johnny Depp plays Pablo Escobar&#8217;s largest cocaine trafficker during the boom era of the 1980s. At one point, Depp&#8217;s character is responsible for 85% of all cocaine brought into the United States. Interestingly, he puts all of his newfound riches into a Panama bank.</p>\n<p>This was back in the days before <a title=\"Just how bad is FATCA? Financial imperialism at work\" href=\"http://nomadcapitalist.com/2013/04/29/just-how-bad-is-fatca/\">FATCA</a>, when Americans could actually avail themselves of <a title=\"Top 5: Offshore tax havens for bank secrecy\" href=\"http://nomadcapitalist.com/2013/11/17/top-5-offshore-tax-havens-bank-secrecy/\">bank secrecy</a>. Of course, anyone who recalls what happened to Panama banks knows that things didn&#8217;t end well.</p>\n<p>Eventually, the government came in and took all of his money &#8220;for the people&#8221;. How ironic that these days places like The Land of the Free and the <a title=\"Bank account confiscation in Cyprus: why bank deposits are not safe\" href=\"http://nomadcapitalist.com/2013/03/18/your-bank-account-is-no-longer-sacrosanct/\">European Union</a> do that.</p>\n<p>In the end, Panama &#8212; and Panama banks &#8212; learned the lesson that so many other countries learn: taking peoples&#8217; money doesn&#8217;t lead to economic progress.</p>\n<p>For a while, Panama was &#8220;the Switzerland of the Americas&#8221;. While I tend to abhor the endless superlatives thrown around in today&#8217;s culture (it seems everything is &#8220;the new X&#8221; or &#8220;the X of Y&#8221;) I recognize that Panama banks truly used to be some of the best offshore banks in the world. When the tax justice crusaders at the OECD slapped Panama on a gray list of &#8220;opaque&#8221; banking jurisdictions, Panama responded by quietly signing information-sharing agreements with countries like Singapore in order to appease the OECD.</p>\n<p>This is how modern offshore banking works: morally bankrupt politicians take a &#8220;hard line&#8221; against &#8220;tax evasion&#8221; and other voodoo, and the average person who just wants to protect some of their money from <a title=\"Retirement account confiscation: why to avoid Obama&#8217;s myRA\" href=\"http://nomadcapitalist.com/2014/05/02/retirement-account-confiscation-avoid-myra/\">Team Wealth Confiscation</a> suffers.</p>\n<p>However, even after Panama banks took action to remove themselves from the lists of uncooperative bank jurisdictions, the OECD wanted more. Three years ago, Panama signed a &#8220;nuclear&#8221; agreement in which Panama banks agreed to take all of the teeth out of any kind of bank secrecy or, to be honest, any other benefit for banking in Panama.</p>\n<p>Panama banks made a completely one-sided deal to slit their own throat. And, as you might suspect, the United States government was first in leading this charge.</p>\n<p>Today, Panama banks might as well be in Uncle Sam&#8217;s back pocket. That&#8217;s <a title=\"Just how bad is FATCA? Financial imperialism at work\" href=\"http://nomadcapitalist.com/2013/04/29/just-how-bad-is-fatca/\">financial imperialism</a>. Now, opening a bank account in Panama is no longer easy. No doubt, realizing Americans would stop coming down in droves, HSBC closed their safe deposit boxes in Panama.</p>\n<p>Some of the banks that used to work with US persons closed their doors to Americans entirely as a result of the ruling. As Peter Schiff told the audience at my recent offshore conference, he doesn&#8217;t allow US persons to open offshore accounts at his bank in St. Vincent and the Grenadines for one reason: he can&#8217;t afford the compliance costs.</p>\n<p>Consequently, banking in Panama isn&#8217;t the best option for Americans, or for many other nationalities. And then there&#8217;s <a href=\"http://www.maxkeiser.com/2013/09/breaking-panama-announces-5-day-bank-holiday-bail-in-imminent/\" target=\"_blank\">this</a>.</p>\n<p><strong>Other than the geographical convenience for Americans, there have historically been two reasons to bank in Panama:</strong></p>\n<p><strong>1. For use with a Panama corporation</strong>. Panama corporations have always been tricky for US taxpayers thanks to an odd US tax law that states that Panama companies cannot be treated the same way most other offshore corporations would be. As such, they were always at a disadvantage.</p>\n<p>Over New Years, the Panama government briefly attempted to remove the <a title=\"Tax freedom starts with a territorial tax system\" href=\"http://nomadcapitalist.com/2013/05/10/tax-freedom-starts-with-a-territorial-tax-system/\">territorial tax status</a> and tax local companies on their worldwide income. That would have been game over, and Panama knew it. After the government came back from the New Year recess, they fixed the law. But it is troubling that the government could let something of that magnitude get through &#8220;accidentally&#8221;, as they later claimed.</p>\n<p><strong>2. For obtaining Panama residence.</strong> Panama&#8217;s <a title=\"Panama&#8217;s Friendly Nations Visa second residency program\" href=\"http://nomadcapitalist.com/2013/02/07/panama-residence-program-means-you-have-no-excuses-anymore/\">Friendly Nations program</a> is, hands down, the easiest <a title=\"Top 5: Best second residency programs in Central and South America\" href=\"http://nomadcapitalist.com/2014/03/09/top-5-best-second-residency-programs-central-south-america/\">second residency</a> for Americans and many other developed-world nationalities to obtain.</p>\n<p>The program requires depositing $5,000 in a Panama bank account and establishing an &#8220;economic tie&#8221; with the country, such as having a corporation, owning real estate, or even investing in forestry projects. If you&#8217;re looking for an easy place to get a second residence and become an expat, Panama isn&#8217;t a bad choice.</p>\n<p>However, I would encourage you to follow the principles of international diversification and not move all of your money there.</p>\n</div>","title":"A word of caution on Panama banks and offshore accounts"}},"pageContext":{"id":"5b921d2887be0571ac1b0504"}}