{"data":{"mongodbDatabaseArticles":{"id":"5b9248c387be056953db7be9","content":"<div><p>I have about 3TB of data. It holds almost everything I have made digitally, from work files to photos to chat logs, all dating back to 1994 (when I was 8yo). Why do I keep everything? Well, as our lives are so digital now, it seems fun to look back on your life simply by browsing through folders. Keeping all this data safe and sound is an effort.</p> <p>I have 6 mirrors of my hard drive located around the country, with one even on the other side of the world. However, for the truly paranoid like me, there's one danger left. One that can instantly wipe out all of your hard drive's data, without you even noticing it. And if it does, it can reach the entire globe, potentially wiping out ALL your drives wherever they are. It's <a href=\"http://forums.macrumors.com/archive/index.php/t-1071847.html\">solar flares</a>:</p> <blockquote><p>A solar flare is a sudden brightening observed over the Sun's surface or the solar limb, which is interpreted as a large energy release of up to 6 &#215; 1025 joules of energy (about a sixth of the total energy output of the Sun each second or 160,000,000,000 megatons of TNT equivalent, over 25,000 times more energy than released from the impact of Comet Shoemaker&#8211;Levy 9 with Jupiter) (..) The flare ejects clouds of electrons, ions, and atoms through the corona of the sun into space. These clouds typically reach Earth a day or two after the event.</p></blockquote> <p>&#8212; <a href=\"http://en.wikipedia.org/wiki/Solar_flare\">Wikipedia</a></p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/639303main_20120416-m1flare-orig_full-1024x697.jpg\"> <p>Fear mongering? Yes, a little bit. Paranoid? Yes, very much so. But it's not a completely unreal risk. Things such as the <a href=\"http://www.lloyds.com/~/media/lloyds/reports/emerging%20risk%20reports/solar%20storm%20risk%20to%20the%20north%20american%20electric%20grid.pdf\">the electric grid</a> and satellites already have issues with solar flares.</p> <h2>Mitigating against solar flares</h2> <p>So how do can us truly paranoid protect against a solar flare? Well, you put your drive in a <a href=\"http://en.wikipedia.org/wiki/Faraday_cage\">Faraday cage</a>:</p> <blockquote><p>A Faraday cage or Faraday shield is an enclosure formed by conducting material (..) Such an enclosure blocks external static and non-static electric fields by channeling electricity through the mesh, providing constant voltage on all sides of the enclosure. Since the difference in voltage is the measure of electrical potential, no current flows through the space. </p></blockquote> <p>&#8212; <a href=\"http://en.wikipedia.org/wiki/Faraday_cage\">Wikipedia</a></p> <p>What's a cheap Faraday cage to put your hard drives in? A cookie jar from mom, ofcourse! Or cookie tin I think is the more apt description in Europe.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/IMG_2016-1024x768.jpg\"> <p>In case of an influx of solar energy, the tin \"should\" deflect the energy and if you connect a ground wire, the energy dissipates in to the earth away from your drive.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/IMG_2025-1024x768.jpg\"> <p>So my my dad and me soldered an electrical wire to the bottom of my cookie jar.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/IMG_2032-1024x768.jpg\"> <p>Put my drive in, first in an anti-static drive bag and then in the cookie jar.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/IMG_2050-1024x768.jpg\"> <p>...and then we hooked it up to the water pipe to act as a ground wire.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/IMG_2033-1024x768.jpg\"> <p>I'm sure it's not full-proof, but it's a start. Now just need to figure out how to protect my drives from that lingering zombie apocalypse...</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How to protect your backups from solar flares with a faraday cage"}},"pageContext":{"id":"5b9248c387be056953db7be9"}}