{"data":{"mongodbDatabaseArticles":{"id":"5b9248a487be056953db7bcc","content":"<div><p>TL;DR we need a digital work permit for remote workers since they don't compete with the local labor markets in the countries they work from.</p> <h2>Backstory</h2> <p>Yesterday, I tweeted how the United Nations will let remote workers travel the world and work legally with a digital work visa. </p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">The &#127482;&#127475;UN is introducing a &#128179;digital work visa which lets remote workers work legally (and pay tax) in 187 countries: <a href=\"//t.co/XWTQugdH2S\">pic.twitter.com/XWTQugdH2S</a></p> <p>&#8212; Pieter Levels @ &#127482;&#127480; (@levelsio) <a href=\"//twitter.com/levelsio/status/872575388895125505\">June 7, 2017</a></p></blockquote> <p></p> <p>It got 200+ retweets, 600+ likes and even got picked up by some press.</p> <p>But of course it was too good to be true. It was a lie. I don't like to lie, but I wanted to make a point.</p> <h2>Why is this important?</h2> <p>In 1970, you'd go on a holiday to Peru, and you couldn't work there because, well, how were you going to work there? Your company doesn't have an office there. You might make some expensive phone calls to the office but that was that.</p> <p>In 2017, you fly to Peru, you land, you switch your phone off airplane mode, you instantly get a message from a colleague with a link to a spreadsheet, you update some stuff, and within 5 minutes of landing you're actually already working in another country. You'll eat nice food, meet some people, maybe go sightseeing and at the end of the day you might finish your day with an hour of work in your hotel room. That's normal now.</p> <p>There's now millions of people working around the world in countries where they don't \"officially\" live, and where their company isn't registered. The internet makes that possible. More than even making it possible, it kinda makes it \"just happen\". The work you do is international and the people you work with are located anywhere.</p> <h2>That's all fun but...</h2> <p>Traveling to another country, opening up your laptop in your hotel and pressing a single key on a spreadsheet for your company is illegal. Because that constitutes work. And to work you need a work permit. That means every year millions of us are breaking the law. Not just \"digital nomads\". But also business travelers. And even people on holiday doing some work for their employer at home.</p> <h2>The laws are outdated</h2> <p>The laws are outdated though and based on a time before the internet. Before everyone flying everywhere on cheap flights. </p> <p>So, something has changed here. But the laws haven't. Millions of people are now operating in legal grey areas every day and breaking the law when in fact this could be beneficial to all of us.</p> <p>And they're increasing. As my readers know, digital nomads and remote workers are a burgeoning trend now and growing rapidly. I'm one. They spend up to 3 months in a country on tourist visas usually. It's the elephant in the room. We all know it's illegal, but nobody cares to speak up about it because, well, what if they come to arrest you. It's cool, I'll take the fall. I'll be your nomad Mandela.</p> <h2>Tax</h2> <p>What is tax? Tax is a payment from a citizen to its government to fund the costs of operating a country. Pretty much right? There's many things to be paid for. The government itself, the legal system, policing, hospitals, health care, physical infrastructure like roads, highways and street lights. Maybe military too.</p> <p>Except for some crazy libertarians, most of us agree we'd like to see our country do well and we'd like to pay for that. Agree? I do.</p> <p>But if we're not in our country for extended amounts of time, let's say 90 days, but we're in other countries, we're not using our country's infrastructure and governing systems. Right? We're using the infrastructure of the country we're visiting though. And we're not paying for that with our tourist visas.</p> <p>So now we have an unfair system on both ends. We're paying for infrastructure in our home country we don't actually use while residents in the countries we're visiting are subsidizing our use of their infrastructure. That doesn't seem fair.</p> <p>It was fair when you'd go on a 2 week holiday and would spend your tourist dollars. But if you stay somewhere longer, it doesn't make any sense for both parties.</p> <h2>Let's make tax more fair</h2> <p>How can we fix this? Well, there's a big question. But I think the most sanest model would be to pay a discounted amount of tax in the country you're visiting, while you get a discount on your tax at home if you're not there.</p> <p>For example, if I make $3,000 in a month. I spend 1 month in the Netherlands (my country), I'll spend about $1,000 in tax that month. Now I spend 3 months living in Japan. Now my Netherlands tax is decreased by half and I pay $500 in tax there. And I pay Japan the other $500. </p> <p>This is extremely simplified. But a good starting point. The reason you'd still pay tax at home is because there's long term investments your country needs to do and you're only short term in the country you're visiting.</p> <h2>Protecting countries</h2> <p>Countries are adamant about protecting their own labor market and workers. And that makes some sense. Giving out traditional work permits should be for high skilled workers and should be a lengthy validation process. But remote workers are different. They don't compete with local workers for jobs in local companies. They already have a job (or company) in another country, and are simply using the infrastructure of the country they visit. They're not a competitive threat to the local market or labor force. That's why they deserve a separate treatment.</p> <p>How do you pick who can work where? Well, you can start with the places people are already allowed to visit as tourists for 90 days (many countries for Europeans and Americans, unfortunately lesser so for people from other regions but that's getting better recently). If they can visit a place for 90 days, they're bound to work remotely their anyway, so in that case offer them a digital work visa.</p> <h2>Conclusion</h2> <p>Paying tax implies there's a legal framework for this activity and it makes what we do legal instead of remaining stuck in a legal grey zone that might put some of us in jail one day.</p> <p>I know ideas are easy and the execution is the hard part. You can't do this on a national level. You need to go make inter-country treaties or go straight to the United Nations. I know we're an early adopting minority but at some point we should start considering this.</p> <p>What do you think? Does this make sense? Tweet me your ideas @levelsio. And again, my apologies for my fake news :)</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"It’s about time for a digital work permit for remote workers"}},"pageContext":{"id":"5b9248a487be056953db7bcc"}}