{"data":{"mongodbDatabaseArticles":{"id":"5b937b3387be056953db7d38","content":"<div><h3 name=\"6f45\" id=\"6f45\" class=\"graf graf--h3 graf--leading\">1. Getting visas can be downright Kafkaesque.</h3><p name=\"a3ff\" id=\"a3ff\" class=\"graf graf--p graf-after--h3\">You know how it is when you go to the DMV and have to wait for like 45 minutes in the line and talk to that one hateful teller and fill out the stupid forms? Getting visas is like that times 10, with different languages, governments, immigration lawyers, and time zones added in.</p><p name=\"2599\" id=\"2599\" class=\"graf graf--p graf-after--p\">When I was getting my latest visa for living in the UK I hired an immigration lawyer to sort it all out, and then planned to turn in the application myself in New York because I wanted to visit my friend in the States. As she prepared my application, requests kept trickling in for documents.</p><p name=\"fa25\" id=\"fa25\" class=\"graf graf--p graf-after--p\">Easy stuff that you keep around, you know, like rent contracts from my past three residences, rent receipts, and reference letters from those three landlords saying that I actually lived there. Any past passports that I&#8217;d ever had. Bank statements for months and months back, each one with some special stamp from the bank. A copy of my current passport with a special stamp from another solicitor. Two different sets of passport-style photos&#8230;all in triplicate.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*C52qq2j4HYE959jE_fyt6Q.jpeg\">All my visa&#160;docs.<p name=\"ff1c\" id=\"ff1c\" class=\"graf graf--p graf-after--figure\">So I scrounged all this stuff up, got it all authorized, copied, and re-authorized, and packed it together in a file folder to take it to the States with me and to hand in in New York as soon as the solicitor emailed me the completed application forms.</p><p name=\"cff0\" id=\"cff0\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">I had planned on staying with my friend for a week before going up to New York. I was there over a month.</strong></p><p name=\"d842\" id=\"d842\" class=\"graf graf--p graf-after--p\">There was always one more document to find, one more form to fill out, one more delay from the solicitor. When I finally got up to New York and got the application, the solicitor had filled out five fields wrong, including my <strong class=\"markup--strong markup--p-strong\">name</strong>, which, you know, kind of matters for a visa application.</p><p name=\"9e57\" id=\"9e57\" class=\"graf graf--p graf-after--p\">After all that, I still had to go to an authorized fingerprint-taking center, get a document from them that was only valid for 24 hours, and mail that document along with everything else in to the visa center using a courier so that it would get there on time. But hey, spontaneous, authentic expat life, right?</p><h3 name=\"c3a7\" id=\"c3a7\" class=\"graf graf--h3 graf-after--p\">2. Traveling takes&#160;cash.</h3><p name=\"e957\" id=\"e957\" class=\"graf graf--p graf-after--h3\">No shit, right? Sure, but my point is here that by choosing to live the life I do, a lot of my income goes to traveling, which means that I don&#8217;t do a lot of other &#8220;normal people&#8221; things. You know, like going out for drinks regularly, or having a car. It&#8217;s just been two years since the live-in lovah &amp; I moved into a flat that had more than 150 square feet. Part of that is because we were both getting started in our jobs and because London is insanely expensive, but a lot of it is also because we decided to spend our money traveling instead of getting a more expensive flat.</p><p name=\"98a2\" id=\"98a2\" class=\"graf graf--p graf-after--p\">Also, I pay taxes out the ass&#8202;&#8212;&#8202;since I run a company that is based in the United States, I pay taxes there (even though I haven&#8217;t been there for longer than about a month in three years), and I also pay council taxes in the UK, since I&#8217;m a resident there. How&#8217;s that for dispelling some of the glamour of an international life?</p><h3 name=\"3369\" id=\"3369\" class=\"graf graf--h3 graf-after--p\">3. Adventure is great&#160;&#8230; until it&#160;isn&#8217;t.</h3><p name=\"2936\" id=\"2936\" class=\"graf graf--p graf-after--h3\">I am all about the adventure&#8202;&#8212;&#8202;I&#8217;ll eat almost anything once, and I have carried on entire conversations in hand gestures because I couldn&#8217;t find a common language with the stranger I was talking to.</p><p name=\"5702\" id=\"5702\" class=\"graf graf--p graf-after--p\">But there always comes a time when you suddenly and irrationally get wildly enraged or tsunami-tears sad because sometimes you don&#8217;t want to go on a search to find something incredibly basic that you would know how to find in two seconds in your home country but you can&#8217;t find for love or money where you&#8217;re living. (Removable wall hooks, I&#8217;m looking at you).</p><p name=\"0b0d\" id=\"0b0d\" class=\"graf graf--p graf-after--p\">Or you are having a shit day and all you want is your favorite comfort food&#160;&#8230; but the closest version of it you can find is some German knock-off brand that has a picture of the food on it but doesn&#8217;t even taste good. Those are the days that don&#8217;t make it onto your Instagram.</p><h3 name=\"1625\" id=\"1625\" class=\"graf graf--h3 graf-after--p\">4. Making and keeping friends can be really&#160;hard.</h3><p name=\"163b\" id=\"163b\" class=\"graf graf--p graf-after--h3\">My two closest friends live in other countries&#8202;&#8212;&#8202;one is 3,500 miles away, and the other is about 600 miles away. And while we still email each other all the time and talk on Skype a lot, it&#8217;s still not the same as being able to just pop into their houses or go out for coffee together.</p><p name=\"447e\" id=\"447e\" class=\"graf graf--p graf-after--p\">And while it&#8217;s really easy to meet new people when you&#8217;re traveling (because they&#8217;re all new), it can be really hard to make lasting friendships, especially if you know that you&#8217;re going to be moving on soon&#8202;&#8212;&#8202;it just doesn&#8217;t seem like it will be worth the effort. This goes doubly if you work for yourself, because then you spend all kinds of crazy hours in front of a computer or working with clients remotely, which makes it really easy to just stay in your little Internet-shell instead of actually going out to meet people.</p><p name=\"b849\" id=\"b849\" class=\"graf graf--p graf-after--p\">Don&#8217;t get me wrong&#8202;&#8212;&#8202;I&#8217;m incredibly grateful that I get to do what I do, and I&#8217;ll never complain about it for too long because I know that so many people dream of doing this for their whole lives and never get there.</p><p name=\"44da\" id=\"44da\" class=\"graf graf--p graf-after--p graf--trailing\">But not talking about the dark sides is a disservice to everyone&#8202;&#8212;&#8202;it gives the people who don&#8217;t travel this idealized version of living the expat life, and it makes the expats who are having a rough time (which is everyone, at one time or another) feel like they&#8217;re failing to live up to the dream and sounding like selfish bitches for whining about it.</p></div>","title":"The Dark Side of Being an Expat and a Digital Nomad that No One Talks About"}},"pageContext":{"id":"5b937b3387be056953db7d38"}}