{"data":{"mongodbDatabaseArticles":{"id":"5b9248a487be056953db7bcb","content":"<div><p>It seems like every week there's a new hot issue that dominates the social timeline of Facebook and Twitter.</p> <p>And it's odd. Everyone gets angry. But it's highly questionable if just typing on a computer or smartphone keyboard actually changes something in the real world.</p> <p>Let's take an example.</p> <img src=\"/wp-content/uploads/2017/08/130518052242-north-korea-missiles-super-169.jpg\" alt=\"\" width=\"1100\" height=\"619\" class=\"alignnone size-full wp-image-8103 responsively-lazy\"> <p>What's the utility for me in repeatedly hearing about North Korea's missile tests? Can I do something about it? Well, I could vote for a political leader who does something about it but. And I did. But that's only one potential action every 4 years. What can I do now about North Korea? Should I fly there and try talk to Kim Jong-un that he should stop? Is he going to listen to me? No. Realistically the utility of this news reaches zero when it arrives in my mind.</p> <p>Even worse, its utility is probably less than zero, it's negative.</p> <p>Because it makes me fearful, outraged, polarized, frustrated, annoyed and powerless. Which results in me projecting these emotions onto others. Now other people get annoyed with me being frustrated. Meanwhile, I can't focus on work either because this fear has been planted in my brain. I'm distracted. For the people around me, I'm now a worse person than I was before this news hit my mind.</p> <p>So this piece of news has decreased my well-being, drastically. And it didn't change the situation of North Korea.</p> <h2>Media corporations</h2> <p><img src=\"/wp-content/uploads/2017/08/Screenshot-2017-08-08-20.38.13.png\" alt=\"\" width=\"2014\" height=\"1336\" class=\"alignnone size-full wp-image-8105 responsively-lazy\"><br> There's one group of people who won here though. It's the media corporations. They've gotten me to click on a few catchy headlines filled with ads for stuff I don't want. But they've made a few dollars on my outrage.</p> <p>So, it's a trick. Outrage sells. Massively. And with the old media dying, it's the last straw they can make money on.</p> <p>News has become entertainment. We know it's not objective anymore, and we know it's now all about eyballs. Pageviews. Clicks. Traffic.</p> <h2>See what's happening here?</h2> <p>In fact, it's a transaction of my happiness for their monetary income.</p> <p>I've been experimenting with muting political keywords from my Twitter timeline for the last few months. And it's been working well. I feel less powerless and I can spend my time on actually affecting change in the communities where I am locally (like Los Angeles now) with the people around me.</p> <p>It's more effective for me than trying to change things on a global scale. The peace I get from not seeing politics on social media makes me more calm and gives me more time left to actually affect change around me, where I actually have reach.</p> <h2>Solution</h2> <p>How can we reduce this stuff entering our minds?</p> <p>Well, like how Ad Blockers remove ads, we can start filtering the content we consume. Starting with Twitter which has something called <a href=\"//twitter.com/settings/muted_keywords\">\"muted keywords\"</a>, which lets you filter your timeline based on certain keywords. You add a keyword, and tweets that contain that keyword won't show up anymore. Facebook has a <a href=\"//chrome.google.com/webstore/detail/social-fixer-for-facebook/ifmhoabcaeehkljcfclfiieohkohdgbb?hl=en\">Chrome extension</a> that hides posts on the News Feed containing keywords too.</p> <p>Obvious keywords are \"trump\", \"north korea\" etc. The problem is that this list is quite dynamic, it'll have to change over time. To figure out what to mute and keep it up to date, I thought let's try get the hivemind involved. I built a collective muted words list app called <a href=\"//mute.life/\">Mute</a>:</p> <a href=\"//mute.life/\"><img src=\"/wp-content/uploads/2017/08/Screenshot-2017-08-08-18.09.14.png\" alt=\"\" width=\"2172\" height=\"1202\" class=\"alignnone size-full wp-image-8092 responsively-lazy\"></a> <p>It's a free web app that lets people add muted words and vote for them. You click a word and it brings you to Twitter or Facebook to mute it. It also has a bookmarklet that auto blocks the Top 100 muted words:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">&#226;&#339;&#168; Bookmarklet that auto adds Top 100 words to Muted Words list on Twitter, no idea how I got this to work, I'm in &#128562; <a href=\"//t.co/gLN5AqesaG\">https://t.co/gLN5AqesaG</a> <a href=\"//t.co/hFK83p9Ba6\">pic.twitter.com/hFK83p9Ba6</a></p> <p>&#8212; Pieter Levels (@levelsio) <a href=\"//twitter.com/levelsio/status/895167243046330368\">August 9, 2017</a></p></blockquote> <p></p> <p>It's my contribution for a slightly saner world for all of us.</p> <h2>Meta</h2> <p>On a meta level, this app will probably get attacked by both sides of the media, the left and right.</p> <p>And if that happens, it means it's succeeded.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"In a world of outrage, mute words"}},"pageContext":{"id":"5b9248a487be056953db7bcb"}}