{"data":{"mongodbDatabaseArticles":{"id":"5b9248c987be056953db7bf2","content":"<div><h2>Dreaming of traveling</h2> <p>My friend Kim works at the <a href=\"http://www.hostelbookers.com/hotels/vietnam/ho-chi-minh-city/72957/\">My My Arthouse</a> in Ho Chi Minh. It's a guesthouse with private rooms straight in the center of Ho Chi Minh. When I asked Kim about his future plans, he told me he had been preparing for years to travel to Europe. I thought it was because he had to save money for it, since Europe is so expensive. But that was just half of the story. The other half was that it is almost impossible for Vietnamese to travel anywhere as they need visa for most countries and due to their low income getting a visa is hard for them as well. It's not just Vietnamese either, every Thai I met during <a href=\"/bootstrapping-startup-thailand/\">my 6 months in Thailand</a> dealt with the same issue.</p> <h2>Us Westerners are spoiled</h2> <p>We never really realize how easy travel has become for us. As a European and citizen of the Netherlands, I can travel visa-free to ~173 countries (88% of the world). By comparison, a Vietnamese can travel visa-free to ~45 countries (23% of the world). In the seldom case that I do need a visa, it usually takes 1 form, ~$50, 1 day processing and 99% odds that I get it because they know I'll spend $$$ there. For a non-westerner getting a visa anywhere is a painstaking process of filling out countless of forms and odds stacked against them.</p> <p>As much as we want to believe in a globalized world with <a href=\"http://levels.io/national-borders-have-become-irrelevant/\">national borders having become irrelevant</a>, the most important facet of that, traveling freely, is still a far cry for many.</p> <h2>Increasing understanding</h2> <p>That sucks because if there's one thing that can increase international understanding and decrease racism, nationalism and the odds of armed conflict, it's people traveling. As much of a hyper-cliche backpackers are, they understand that getting to know people from different countries is beneficial them. If only to to discover that apart from some tiny cultural differences, the human race is pretty much the same everywhere you go. </p> <p>If anyone, it's nationalist governments keeping us apart to maintain their individual power. Because if we'd find out we're all the same, then why would we need borders dividing us in the first place?</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"The myth of a globalized world"}},"pageContext":{"id":"5b9248c987be056953db7bf2"}}