{"data":{"mongodbDatabaseArticles":{"id":"5b962a0b87be0583274911cc","content":"<div><p>I have been a really bad traveler and even worse travel blogger for years. Why? Because I just got my first credit card and signed up to points programs. It actually makes me a little sick to think of the 500+ flights I&#8217;ve taken and not gotten a single point from &#8211; and it doesn&#8217;t make sense. I am the girl that uses the free undies coupon Victoria&#8217;s Secret sends out. I have McDonald&#8217;s coupons in my purse and a Domino&#8217;s coupon on my fridge for the next time I call. But, I never signed up for points which would have given my FREE flights (especially considering how much I fly, but even for people who don&#8217;t fly often, they get a couple free flights a year). Like I said, it kind of makes me sick thinking about it but it&#8217;s never too late to start.</p><p>Why didn&#8217;t I start sooner? It&#8217;s really not laziness as you might guess. I&#8217;m actually really Type A and on top of things but I just found points to be a confusing topic. It sounded like a huge project and I wasn&#8217;t sure it was really worth it. More and more, I would see friends on Facebook who didn&#8217;t even travel that often getting business class upgrades and free flights in the USA and writing in their caption it was because of points. After years of traveling and meeting travel industry experts at conferences, they all balked when I said I wasn&#8217;t signed up to points &#8211; telling me stories of their free travels around the world thanks to their loyalty programs.</p><p>When I was back in Ohio last February, my BFF from nursing school was like &#8220;this is enough Rachel, I fly 3x a year and get Southwest points and use my Chase card and got a free flight already this year&#8230; you could have so many! You need to sort this out!&#8221;. I remembered that years ago I did <a href=\"https://hippie-inheels.com/get-free-flights-travel-hacking/\">an interview</a> with <a href=\"https://10xtravel.com/start-here/\">Bryce</a>, a friend from college, who runs <a href=\"https://10xtravel.com/\">10xTravel</a> which has grown into this huge online travel community that shares information about points and loyalty programs. He posts his trips with his wife on Facebook and travels more than I do &#8211; so does his Facebook group of other points people! Since I interviewed Bryce, he&#8217;s been on TV telling his secrets to Good Morning America, ABC&#8217;s Nightline, and even is a TEDx speaker.</p><p><img class=\"alignnone size-full wp-image-20032\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/11/Marrakesh-City-30.jpg?resize=1024%2C769&amp;ssl=1\" alt=\"Shopping in Morocco | What to Buy in Morocco &amp; Prices\" width=\"1024\" height=\"769\"></p><p>If I was going to start doing points and getting credit cards, I was going to do it right. In fact, one saying on his website is &#8220;do it once, do it right, get on with your life&#8221;. That&#8217;s what I wanted: to set this up right then just reap the benefits. For years, I&#8217;ve followed their Facebook group and they were the source I went with to learn everything I could about flying for free. Step 1: read their free ebook that has all the information in one place. You can download it <a href=\"https://10xtravel.com/free-tools/\">here</a>. It&#8217;s short, it&#8217;s straight to the point, and did I mention, free?</p><p>The book gets into the basics of how traveling for free with points works. It&#8217;s not rocket science and actually, I&#8217;m kicking myself more that I have waited this long. If you&#8217;re reading this, start now &#8211; don&#8217;t do what I&#8217;ve done! It&#8217;s torture. His book explains how with super minimal effort, you can get at least 3-4 free domestic flights per year. Really.</p><p>Then you&#8217;ll want to go to <a href=\"https://10xtravel.com/start-here/\">this page</a>&#160;and start going through the basics of how this all works. Bryce types like he&#8217;s chatting to a best friend and that is why I chose to get my information from him. Other sites on points seemed like they were selling credit card sign-ups or talked with vocabulary that confused me. These are articles anyone can understand.</p><p>Some of Bryce&#8217;s success stories are going to make you really jealous, I warn you &#8211; but it just goes to show how well this can work if you do it right. Honestly, the main reason people don&#8217;t travel is money and the main cost of traveling is the flights which you can literally get for free if you do this. There&#8217;s nothing in your way! Here are some of the articles he&#8217;s shared about deals his readers have gotten:</p><p>You guys, I want to go first class to Bora Bora. I want to go first class&#160;anywhere.&#160;So, it was time to start the process!</p><h2>How to Use Points and Miles to Travel For Free</h2><p>So, a little bit about my banking situation: I went to school on full-tuition scholarship and my parents (thank you mom and dad) gave me their old Tahoe SUV (which I promptly flipped going 80 MPH and totaled so then they bought me a very old indestructible Dodge car). <strong>Basically, I had no credit</strong>. I never got a credit card in college. I have a <a href=\"https://content.schwab.com/web/retail/public/get-started/checking/\">Charles Schwab ATM card</a> and that is where I keep my money &#8211; I like this card because it reimburses me ATM fees all around the world so I never have to worry about that $3 charge at the gas station ATM.</p><p>I have been living in India for 5 years and it&#8217;s a cash-only society so I very rarely used my card anywhere other than an ATM. You don&#8217;t get points on ATM withdraws and no one really accepts credit, so I think that is why I never really pushed to get a credit card. Knowing I was moving to Mexico, it was really good timing. Thanks to Bryce&#8217;s advice, I signed up for the <a href=\"https://www.chase.com/card-benefits/sapphirereserve/travel\">Chase Sapphire Reserve</a>. I did it online in .2 seconds and got approved right away. I don&#8217;t know how it works, but they clearly don&#8217;t investigate that hard (lol, jk, sort of).</p><p>I was in India at the time of applying and I asked them to FedEx me the card (so expensive). They did (overnighted!). This was shocking and I loved them already. Some reasons I went for the Chase card, thanks to Bryce&#8217;s site:</p><ul><li>50,000 points sign up bonus if you spend a minimum of $4,000 in the first 3 months. I had Ben and I&#8217;s flights to Mexico to book and two months rent to pay on Airbnb so I knew I&#8217;d hit the minimum spend.</li><li>Free <a href=\"https://www.prioritypass.com/en/airport-lounges\">Priority Passes</a>. Now, I&#8217;m one of those fancy people who can go into airport lounges, eat and drink for free, and take a shower. Oh my, how my trips have changed thanks to this gem! Plus, whoever is traveling with me gets to come in, too.</li><li>Car insurance. I can decline car insurance and have Chase cover me in full. We rented for a month in Mexico for $17 USD.</li><li>Adding a second person to my account. I added Ben (who is English and probably couldn&#8217;t get a credit card in England because he lived in India for 10 years) to my account without issue. He got his own Priority Pass and gets car insurance and all the other benefits.</li><li>Travel insurance. I get travel insurance now included!</li><li>3x points on dining and travel and 1x points on everything else. I spend 100% of my money on dining and travel so that&#8217;s perfect for me.</li></ul><p>To be fair, there are other cards but when you look at Bryce&#8217;s card breakdowns in<a href=\"https://10xtravel.com/credit-cards/\"> this handy little chart</a>, this one just worked best for me. The next steps for me with credit cards, are to get more. If you read his free ebook it explains how you can get all these sign-up bonuses and if you want to you can even just cancel the credit card after you get your points. You still get to keep the points. Just stay on top of things and write down dates so you know when to cancel it.</p><p>Step two was to sign up to the loyalty programs of the flights I often take. This took about an hour of just knocking it out and jotting down all the usernames and membership ID&#8217;s and passwords so I have it all in one place. I signed up for Jet Airways, United, Malaysian Airlines, Turkish Airlines, Air France, and Air Canada.</p><p>Step two was what I dreaded: I had to get all my flights for the past 6 months and claim them back. It&#8217;s awesome that airlines let you do this actually, but since I fly a lot it was a headache trying to find all my details. I went back and claimed tens of thousands of miles for various programs. You can only go back six months.</p><p>Now, when I book a flight, I always enter my membership ID. If I don&#8217;t have one for that airline, I sign up for one. I like to stay on top of this so I don&#8217;t have to go back and claim them later.</p><p>All in all, it took me a few minutes to sign up to the Chase credit card. It took me a couple of hours to get my loyalty programs sorted (only because I had so many old flights to claim) and I was already on track to have loads of points. I&#8217;ve read Bryce&#8217;s book twice now so that I know how to use my points, and keep track of when they expire so that I can get my free flights.&#160;I use <a href=\"https://www.points.com/\">Points.com</a>&#160;to keep my accounts organized. You can enter all your loyalty programs there and then see all your points in one place. It&#8217;s free.</p><p>Actually, all this information and Bryce&#8217;s book are all free and it&#8217;s all here for you to just soak up and start following the advice he lays out so you can fly for free. If your dream is to travel, make it happen! Apply for a credit card and get some points, sign up for a loyalty program. Read Byrace&#8217;s ebook and devour his site for information. <a href=\"https://10xtravel.com/contact/\">Reach out to him</a> with questions! I&#8217;m sure he&#8217;d get back to you with personal advice.</p><p>I&#8217;m so excited to finally be trying to do this points thing &#8211; after putting it off so many years. I hope that you sign up and don&#8217;t do what I did as I probably could have flown to Bora Bora like 10 times first class if I&#8217;d done this from the get-go!</p><p>For me, the next step is getting more credit cards and more points (then probably canceling them) and using his <a href=\"https://10xtravel.com/credit-cards/\">credit card guide</a> for the next steps. I have been a member of his Facebook group &#8220;<a href=\"https://www.facebook.com/groups/10xtravel/?source_id=246169735549354\">10xTravel.com Insiders</a>&#8221; and just eat up the information in there from other people just like me who are getting into points. I love seeing their success stories and it just gets me excited to get my first flight booked with points or my first upgrade! I hope that this helps you get stoked for free travel and I hope you join me in his Facebook group to learn more and get started!</p><h3>Pin how to use points and miles for later:</h3><p><img class=\"alignnone size-full wp-image-27881\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/08/the-beginners-guide-to-using-points-and-milesto-travel-for-free1.jpg?resize=735%2C1102&amp;ssl=1\" alt=\"how to use points and miles\" width=\"735\" height=\"1102\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Are Points and Miles Over Your Head? Here’s Your Easy Guide Toward Free Travel"}},"pageContext":{"id":"5b962a0b87be0583274911cc"}}