{"data":{"mongodbDatabaseArticles":{"id":"5b921d2487be0571ac1b0500","content":"<div><p>Back in the 1980s, Malaysian leaders got together looking for ways to attract businesses seeking economic freedom. Hong Kong was the 800-pound gorilla in the Asian offshore sector at the time, and Malaysians wanted in on the game. So they declared Labuan, a small island off the coast of Borneo near Brunei, as the latest offshore jurisdiction.</p>\n<p>The idea was simple: offer <a href=\"http://nomadcapitalist.com/2014/11/21/39-countries-reduced-taxes-business-corporate/\" target=\"_blank\">low and no-tax corporate structures</a> for Asian and foreign businesses and attract investment to the region.</p>\n<p>Thanks to Hong Kong&#8217;s continued economic freedom under Chinese rule, as well as other jurisdictions like Singapore, Labuan has remained largely under the radar. Yet, it has become more popular with some Asian businesses. And its connection with Malaysia makes it an interesting proposition to consider.</p>\n<h2>How to set up an offshore corporation in Labuan</h2>\n<p><a href=\"http://nomadcapitalist.com/offshore-company/\" target=\"_blank\">Setting up a company</a> in Labuan is straightforward. You can do so with only one director and one shareholder; foreigners qualify to be both. Your offshore company can be incorporated in just a couple of days.</p>\n<p>For example, Labuan has full access to the sovereignty of Malaysia. That includes access to Malaysia&#8217;s nearly seventy dual taxation agreements with other countries. A foreigner using a Labuan company can therefore elect to be taxed in Malaysia rather than at home using the tax treaty.</p>\n<p>And tax rates in Labuan are low. Holding companies &#8212; those that hold fixed assets or collect dividends, royalties, or other passive incomes &#8212; are free from tax on all earnings sourced outside of Malaysia. Whatever you earn is yours to keep, and there are no other superfluous taxes or fees.</p>\n<p>For businesses that trade with the public (i.e. an internet business or an airline), there are two options: your company can elect to be taxed at either a flat rate of 3% or to pay an annual tax of 20,000 Malaysian ringgit (around US $6,600). That&#8217;s all. Unlike countries like the United States where you can make a one-time election which you&#8217;re then stuck with, Labuan allows companies to elect the best option for them in each tax year.</p>\n<p>Have a new internet business that only generated $10,000 it&#8217;s first year? Choose the 3% tax rate and pay $300. Have a booming operation bringing in millions? Choose the flat tax payment of $6,600 and keep the rest.</p>\n<p>Like any other offshore jurisdiction, the government does require you to pay an annual fee of around $750. It&#8217;s more expensive than a place like <a href=\"http://nomadcapitalist.com/2013/11/17/top-5-offshore-tax-havens-bank-secrecy/\" target=\"_blank\">Seychelles</a>, but it comes with a better image. The government also requires you to file an annual report with a statement of your accounts. This puts Labuan in line with other stable offshore centers like Hong Kong which require a bit of extra reporting. If you&#8217;re looking for something more than just a boiler plate locale, this can work to your advantage and may be worth the extra expense.</p>\n<h2>How does Labuan compare to other offshore jurisdictions?</h2>\n<p>Unlike places in the Caribbean where many banks could raise some cause for concern, Labuan is home to a long list of familiar banks, from DBS to Bank of America and JP Morgan to BNP Paribas. It&#8217;s a serious financial center, as opposed to some others where hack lawyers quickly churn out corporate paperwork like a mill and charge for introductions to questionable banks.</p>\n<p>The good news is that anyone can come to Labuan and open an account. It&#8217;s more open even than Hong Kong, where <a href=\"http://nomadcapitalist.com/2013/07/11/hong-kong-banks-dont-need-your-money/\" target=\"_blank\">banks often play coy</a> about opening a bank account with them.</p>\n<p>Also, because Labuan is part of Malaysia, you&#8217;ll enjoy being at the confluence of Asian and Islamic culture. Kuala Lumpur has declared its interest in becoming the world&#8217;s Islamic finance capital, and having access to these two spheres of influence can be very helpful.</p>\n<p>Despite the Islamic influence in Malaysia, Labuan mostly uses common law, and non-Muslims are not subject to any Islamic finance dictates. The only real restriction is that you can&#8217;t settle transactions in ringgit.</p>\n<p>In addition to companies like Air Asia, many wealthy Asians &#8212; especially Chinese &#8212; have begun to learn more about Labuan as another option for conducting business overseas. If you&#8217;re looking for an offshore company with a bit more flexibility than some of the banana republic jurisdictions, it might be one worth considering.</p>\n<p>If you are interested in conducting your offshore business in Labuan, <a href=\"http://www.holanomad.com\" target=\"_blank\">contact Nomad Capitalist</a> for our expert advice.</p>\n</div>","title":"Labuan: Asia’s near-secret haven for an offshore corporation"}},"pageContext":{"id":"5b921d2487be0571ac1b0500"}}