{"data":{"mongodbDatabaseArticles":{"id":"5b937b1d87be056953db7d1f","content":"<div><h1 name=\"aeaa\" id=\"aeaa\" class=\"graf graf--h3 graf--leading graf--title\">Nomad Capitalist Andrew Henderson on Launching an International Life</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*PqRFtNkbCRWVBFloZfJ3Cg.jpeg\">Andrew Henderson in Tbilisi,&#160;Georgia<p name=\"5103\" id=\"5103\" class=\"graf graf--p graf-after--figure\">This interview with Andrew Henderson was originally published by Huffington Post, written by a HuffPost contributor and Nomad Capitalist&#8217;s editor.</p><p name=\"0882\" id=\"0882\" class=\"graf graf--p graf-after--p\"><a href=\"http://www.huffingtonpost.com/entry/nomad-capitalist-andrew-henderson-on-launching-an-international_us_58489b44e4b05d636ae936d9\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Published on Huffington Post</strong></a><strong class=\"markup--strong markup--p-strong\"> Thursday, December 8, 2016</strong></p><p name=\"0b45\" id=\"0b45\" class=\"graf graf--p graf-after--p\">Expatriation is a journey packed with excitement and fraught with uncertainty. People who throw themselves into a long term journey abroad often do so for any number of reasons: career opportunities, relationships, study abroad, or simply to travel and find themselves. Despite the commonly held notion among Americans that the US is the best country in the world, a minority of citizens have voted with their feet: the Association of American Residents Overseas estimates that there are currently 8 million US nationals living abroad in 160+ countries. It appears that, on occasion, the grass really IS greener on the other side.</p><p name=\"2cf6\" id=\"2cf6\" class=\"graf graf--p graf-after--p\">However, if you&#8217;re contemplating starting your own international life, where do you start? What&#8217;s the roadmap for identifying the right destination? How do you know you&#8217;ll reach the specific goal you set out to accomplish by going abroad? What principle or philosophy should guide the questions you ask and the decisions you make?</p><p name=\"a90d\" id=\"a90d\" class=\"graf graf--p graf-after--p\">For Nomad Capitalist founder Andrew Henderson, the philosophy is simple: go where you&#8217;re treated best.</p><p name=\"ce68\" id=\"ce68\" class=\"graf graf--p graf-after--p\">I recently had the pleasure of interviewing Andrew. As always, he was on the road&#8202;&#8212;&#8202;wrapping up some affairs in Eastern Europe en route to South East Asia. Such is the life of a perpetual traveler and international entrepreneur.</p><p name=\"1ace\" id=\"1ace\" class=\"graf graf--p graf-after--p\">Andrew has spent the last decade traveling the world. In doing so, he&#8217;s been able to glean the best legal strategies and on-the-ground knowledge to help people lead a financially rewarding and personally enriching international life. In this piece, Andrew shares in great detail his personal experience and advice on how to launch your own journey abroad.</p><p name=\"007d\" id=\"007d\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Please briefly tell us about Nomad Capitalist. What was the initial inspiration behind this venture and what problem did you want to solve in the world?</strong></p><p name=\"fd6b\" id=\"fd6b\" class=\"graf graf--p graf-after--p\">My inspiration for founding Nomad Capitalist was actually my own, personal need. To be completely honest, it was never about performing any kind of business service per se. It simply evolved out of my own needs and experiences.</p><p name=\"86b0\" id=\"86b0\" class=\"graf graf--p graf-after--p\">Before seriously traveling, I had started and sold a number of businesses in the United States. These businesses ranged from a broadcasting company to a car retail business, a swimming pool service to investing into other companies and helping a friend start a financial services and insurance business.</p><p name=\"e3ad\" id=\"e3ad\" class=\"graf graf--p graf-after--p\">Eventually, I had built myself up to where my various US businesses were very location independent. I was able to start traveling more than I was staying in the United States and began working with my clients long distance from European caf&#233;s and Southeast Asian beaches.</p><p name=\"6055\" id=\"6055\" class=\"graf graf--p graf-after--p\">But I wanted more freedom.</p><p name=\"b4a4\" id=\"b4a4\" class=\"graf graf--p graf-after--p\">And that&#8217;s when I decided to cut all my business ties in the US and fully live the nomad lifestyle. Once I sold all of my businesses I not only had the financial means to take an early semi-retirement, but I was free as a bird to go explore the world.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*sgpZct6Odv0V6elvFOaoxg.jpeg\">Kite surefer in Bali: What would you do if you could live a life without limits?&#160;PIXABAY<p name=\"6e5b\" id=\"6e5b\" class=\"graf graf--p graf-after--figure\">Amidst my travels, I took advantage of all the tax benefits that come with the expat lifestyle. I knew I could make the various tax, investment and business laws and opportunities around the world work in my favor, so I went out to take advantage of it and stop paying tax. That is when I had the thought &#8220;Go where you are treated best.&#8221; And that&#8217;s exactly what I did. I began to search for and go to all the places that would treat my money, businesses, lifestyle and investments the best.</p><p name=\"3bc8\" id=\"3bc8\" class=\"graf graf--p graf-after--p\">As I did so, I began a blog to write about my findings: where I was looking at property, in which countries I was considering a second residency or passport, how I found out something was a scam, when I discovered a little known investment opportunity&#8230; I wrote about it all. I was telling my experiences mainly for my personal benefit, but before I knew it I had three million people coming to my website per year and another million between the Podcast and Youtube. It just blossomed into something I would never have imagined.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*4z3SnDygPurUsUV45923LQ.jpeg\">Andrew in&#160;Lesotho.<p name=\"8a3b\" id=\"8a3b\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">You frequently suggest that people should &#8220;go where they are treated best.&#8221; Please elaborate on this point. Do you have any specific examples of how your average American can be treated better abroad than they are at home?</strong></p><p name=\"282f\" id=\"282f\" class=\"graf graf--p graf-after--p\">I often refer to the the phrase &#8220;Go where you&#8217;re treated best&#8221; as my five magic words. If you really let their meaning sink in, you begin to realize how liberating those words can be as a mindset. So many people go through life thinking that they are stuck with a certain set of circumstances, failing to realize that they are the only ones who can ever actually change them. The idea of going where you&#8217;re treated best means proactively pursuing the numberless opportunities the world has to offer.</p><p name=\"1e88\" id=\"1e88\" class=\"graf graf--p graf-after--p\">For example, if you don&#8217;t want to live in a cold and snowy place, there&#8217;s no reason you shouldn&#8217;t pick up and move to a warmer location. Go where the climate treats you best. Or, if you&#8217;re an entrepreneur and your business is getting crushed by taxes and regulations, there&#8217;s any number of countries around the globe with lower taxes and more business friendly environments that will welcome you and your business with open arms. So go where your business will be treated best.</p><p name=\"331e\" id=\"331e\" class=\"graf graf--p graf-after--p\">If you&#8217;re an investor who&#8217;s wary of the US financial system, invest in real estate overseas or open a foreign bank account with high interest rates. There&#8217;s no reason you should keep your money in a system you don&#8217;t trust when there are so many better options out there. Go where your money will be treated best.</p><p name=\"b784\" id=\"b784\" class=\"graf graf--p graf-after--p\">Now, you can say these five magic words to anyone and they will have a different meaning for each person. Two &#8220;average Americans&#8221; will have very distinct needs and desires. For instance, if you&#8217;re working for a social cause specific to the United States, your purpose will best be served by staying and fighting. Your end goals greatly determine you location.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*BdSXhfb-Tk1GBs7cjuCcoQ.jpeg\">Phuket, Thailand: Go where you&#8217;re treated best.&#160;PIXABAY<p name=\"a674\" id=\"a674\" class=\"graf graf--p graf-after--figure\">On the other hand, for people like myself and our avatar&#8202;&#8212;&#8202;younger to middle aged folks who are still working or who are entrepreneurs, business owners or investors&#8202;&#8212;&#8202;then leaving the United States may make a lot more sense for you. If your end goal is greater freedom for you or your business, chances are that there are better locations and opportunities for you abroad.</p><p name=\"9f53\" id=\"9f53\" class=\"graf graf--p graf-after--p\">If you&#8217;re an American, the first step toward finding where you&#8217;re treated best is to leave the United States. This will enable you to take advantage of one of three or four different ways you can legally avoid paying income tax&#8202;&#8212;&#8202;or at least greatly reduce it. Under most of these options, you can live or travel pretty much anywhere and still enjoy the tax benefits.</p><p name=\"98b8\" id=\"98b8\" class=\"graf graf--p graf-after--p\">And this isn&#8217;t just for people from the US. No matter where you live, if it is a high tax paying country, leaving is the first step to getting the biggest benefits. Shifting your mindset to understand that you CAN leave is the first step for anyone looking to go where they&#8217;re treated best. From there, the steps will be different for each person.</p><p name=\"3823\" id=\"3823\" class=\"graf graf--p graf-after--p\">For someone looking for a place where they are treated best from a living perspective, a lot of nomads have decided that locations like Thailand are the place to be. And, let&#8217;s be honest, that extends all the way down to many of the guys who just go to Thailand because they like the dating scene. But,hey, that can be part of the equation too.</p><p name=\"b629\" id=\"b629\" class=\"graf graf--p graf-after--p\">One hidden gem I&#8217;m quite keen on is the region of former communist countries in Eastern Europe. They offer a high quality of living where you can enjoy reasonable prices without having to sacrifice too much. Among my favorites, Belgrade, Serbia and Budapest, Hungary are fantastic.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Ux-Rn6OJYLZYSYEdTJa7ng.jpeg\">Beautiful Budapest. PIXABAY<p name=\"2381\" id=\"2381\" class=\"graf graf--p graf-after--figure\">I also own property in Montenegro and I&#8217;m buying more along the beautiful coast there. The people in Montenegro are extremely friendly, the women are beautiful (which could be an important factor for some), and women tell me that the men there are good looking too. People are friendly from a dating perspective, as well. To top it all off, taxes are pretty darn low (with corporate tax at 9%).</p><p name=\"5f7c\" id=\"5f7c\" class=\"graf graf--p graf-after--p\">Places like these areas are the ones to look for if you want to go where you&#8217;re treated best for lifestyle purposes. Look for a place where you get a nice balance of connectivity and low cost of living without sacrificing everything.</p><p name=\"ea63\" id=\"ea63\" class=\"graf graf--p graf-after--p\">From an investor&#8217;s perspective (and lifestyle), I am a big fan of Georgia. Located in the Caucasus region, Georgia is the place that perfectly fits the &#8220;go where you&#8217;re treated best&#8221; motto. For over a decade now they have made everything so easy, from opening a bank account to starting a company or buying real estate. I own a dozen properties in Tbilisi and I&#8217;m constantly buying more to renovate, sell, use for commercial purposes or even to live in. It takes me 20 minutes to register a property and it costs around $20 USD. I&#8217;m spoiled in Tbilisi. There&#8217;s nowhere else in the world where these types of procedures are this easy.</p><p name=\"842e\" id=\"842e\" class=\"graf graf--p graf-after--p\">For entrepreneurs and investors to go where they&#8217;re treated best, one of the most important characteristics to look for in a country is ease. I am a resident of a country in the European Union (which has some great benefits in terms of travel), but if you want to change one address you have to pay around 600 EUR and obtain four stamps and run all around town to get anything done. When countries make things that difficult I just say forget it.</p><p name=\"fc59\" id=\"fc59\" class=\"graf graf--p graf-after--p\">Value your time and go where the procedures are easy and the taxes are low. For me, I&#8217;ve found that Georgia fits that criteria perfectly.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*s77TW-q-XEWySJuuAhWwnQ.jpeg\">Andrew Henderson struggling to drink a coconut in&#160;Malaysia<p name=\"d8d9\" id=\"d8d9\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Many people are scared after the most recent election and are considering leaving the US. What&#8217;s your advice to young professionals who are seriously considering expatriating?</strong></p><p name=\"c6b4\" id=\"c6b4\" class=\"graf graf--p graf-after--p\">Every time something like this happens&#8202;&#8212;&#8202;whether it&#8217;s Donald Trump getting elected in the US or Brexit in the UK&#8202;&#8212;&#8202;we get so much &#8220;panic traffic&#8221; to our site. In fact, traffic to NomadCapitalist.com went up 1000% after Trump&#8217;s election. In the following week, people were constantly looking for passports and second residencies. For all those people, I would like to clarify two points:</p><p name=\"4798\" id=\"4798\" class=\"graf graf--p graf-after--p\">1) <strong class=\"markup--strong markup--p-strong\">You don&#8217;t have to give up your U.S. citizenship to move.</strong></p><p name=\"c273\" id=\"c273\" class=\"graf graf--p graf-after--p\">There are plenty of US citizens out exploring the world and running successful international businesses who haven&#8217;t set a foot in the US for years&#8202;&#8212;&#8202;myself included. Becoming an expat doesn&#8217;t necessarily have to lead to renouncing your US citizenship. You can get many of the tax benefits most people are looking for simply by living outside the US for at least 330 days a year (check out the <a href=\"http://nomadcapitalist.com/2014/01/15/qualify-foreign-earned-income-exclusion/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Foreign Earned Income Exclusion</a>). Take a year to travel and find a place that you like for your lifestyle, business, investments, etc. If you hate it, then go back to the US, but you&#8217;ll never know if you like this lifestyle or not if you don&#8217;t go.</p><p name=\"1be5\" id=\"1be5\" class=\"graf graf--p graf-after--p\">Obviously expatriating can mean renouncing your citizenship. I don&#8217;t think you should renounce your citizenship unless you are looking into doing it because you are paying a fortune in taxes and none of the tax strategies you have used already have helped you in solving your tax problem.</p><p name=\"0a15\" id=\"0a15\" class=\"graf graf--p graf-after--p\">For example, I have a friend who makes around $1 million USD salary per year in the Middle East. There is no tax there, but because he is a US citizen and because he is an employee and can&#8217;t control how he takes his income he just pays $400,000 USD in taxes every year. He is the perfect example of the kind of person who should consider buying a second passport and renouncing their US citizenship.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*XMSVlFH0R9-3OTBz65g6sQ.jpeg\">Open your mind to new possibilities. PIXABAY<p name=\"17aa\" id=\"17aa\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">2. Change the way you think about the rest of the world</strong></p><p name=\"7a44\" id=\"7a44\" class=\"graf graf--p graf-after--p\">Too many people in the United States have been taught to believe that the West&#8202;&#8212;&#8202;and the United States specifically&#8202;&#8212;&#8202;is the only civilized region of the world. Consequently, many people who are afraid of Trump would still balk at the idea of living in a place like Georgia. They want to move to Canada or England or some other &#8220;first world&#8221; country that&#8217;s &#8220;just as good&#8221; as the United States. What they don&#8217;t understand is that they aren&#8217;t really solving any of their problems by moving to another high tax western country. &#8220;Just as good&#8221; really translates to &#8220;more of the same.&#8221; All they&#8217;re doing is jumping from one frying pan to the next.</p><p name=\"cd65\" id=\"cd65\" class=\"graf graf--p graf-after--p\">I recently addressed this matter in an <a href=\"http://nomadcapitalist.com/2016/02/19/trumps-border-wall-why-americans-never-threaten-to-move-to-mexico/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">article</a> in which I advised people to choose Mexico over Canada. Why? For starters, Mexico is a more affordable place to live, the food is amazing, there are endless sights to explore from beaches to jungles to deserts to ancient ruins, and expats will find that they can enjoy more freedoms under a government that leaves them alone. If you go to Canada, on the other hand, you&#8217;ll get a very similar experience to living in the United States, taxes and all.</p><p name=\"b401\" id=\"b401\" class=\"graf graf--p graf-after--p\">What&#8217;s more, the process of becoming a Canadian is a lot more difficult than it seems. Some people have the idea that they can just move there&#8230; like all the illegal immigrants they like to complain about coming into the US. On the other hand, you can get a residence permit in Mexico in a way that you couldn&#8217;t get in Canada or most places in Europe. Just by being American and by having a little bit of money you can be a resident of Mexico without the need to enter and leave as a tourist.</p><p name=\"0be1\" id=\"0be1\" class=\"graf graf--p graf-after--p\">Change the way you look at the world and begin to look at living abroad as an adventure. You shouldn&#8217;t feel the need to replicate the US in your new location of choice. You are leaving it behind, after all. If you are going to leave, why not make it a grand opportunity to do something different and take advantage of the freedoms that you don&#8217;t already enjoy. Realize that the U.S. is not the pastor of freedom that you think that it is and, if you&#8217;re looking for nearby places, I would recommend Mexico as a start.</p><p name=\"6879\" id=\"6879\" class=\"graf graf--p graf-after--p\">As a rule, I choose not to advise people who want to move to high tax paying countries. I look for applicants who are ready for a real change, not just &#8220;more of the same.&#8221;</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*xMRAejMAbtMyGwbTnxIWQQ.jpeg\">Andrew Henderson in Cape Town, South&#160;Africa<p name=\"b61f\" id=\"b61f\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Please lead us, step by step, through the process of expatriating to one specific country that you think would be a strong candidate for residency and eventual citizenship for the average US citizen.</strong></p><p name=\"4c8e\" id=\"4c8e\" class=\"graf graf--p graf-after--p\">I always recommend Georgia here. As I previously mentioned, everything is so easy there. And, to be honest, that is the main challenge that people who want to leave the U.S. are going to face: too much procedural and administrative barriers.</p><p name=\"6f32\" id=\"6f32\" class=\"graf graf--p graf-after--p\">For example, immigration procedures in the EU are tough. I&#8217;ve been through one residency program in the EU and I&#8217;m currently working on an EU citizenship that involves a very complicated process. We all have enough stress in life to add more headache like that to it all. I do these programs to have firsthand experience. Chances are you don&#8217;t need the experience, just the residency, so let me be your guinea pig and tell you that it&#8217;s not worth the stress of endless bureaucracy.</p><p name=\"4200\" id=\"4200\" class=\"graf graf--p graf-after--p\">For that very reason, the ease of doing practically anything in Georgia is one of the country&#8217;s great appeals.</p><p name=\"6f13\" id=\"6f13\" class=\"graf graf--p graf-after--p\">If you have ability to freelance or start an online business, or you want to start a business overseas to take advantage of the growing market, Georgia is always my first choice and recommendation in that regard as well.</p><p name=\"4d1e\" id=\"4d1e\" class=\"graf graf--p graf-after--p\">Here&#8217;s how it works:</p><p name=\"f4d9\" id=\"f4d9\" class=\"graf graf--p graf-after--p\">First, apply for residency. This is a simple procedure which will then allow you to spend some time in the country and eventually apply for citizenship. You&#8217;ll need to know more specifics on what to do, but you can qualify for citizenship without much hassle. There are a couple of ways to go about this, but Georgians like Americans quite a bit so you shouldn&#8217;t have any troubles.</p><p name=\"4ed2\" id=\"4ed2\" class=\"graf graf--p graf-after--p\">Your next steps depend, again, on your specific goals and motivations for moving abroad. If you plan to expatriate as a means to renouncing your U.S. citizenship, Georgia might still work, but I would also suggest you look at other options. By renouncing your US citizenship and only having Georgian citizenship, you will no longer be able to visit the US, Canada, Australia, New Zealand, Mexico, parts of Central America and (until next year) the EU, the UK or Ireland without a visa.</p><p name=\"efe3\" id=\"efe3\" class=\"graf graf--p graf-after--p\">This does not mean you won&#8217;t be able to travel to these places, only that you&#8217;ll need to get a visa before you do so. Most US citizens aren&#8217;t used to this since a US passport has visa-free access to over 170 countries worldwide. If you&#8217;re not willing to do the paperwork and pay the fees to get a visa to the various countries you want to visit, then Georgia may not be the place for you to obtain citizenship in order to renounce your loyalties to the US.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*P7gS3dQZDlwmGGukkz2a4g.jpeg\">PIXABAY<p name=\"c8b5\" id=\"c8b5\" class=\"graf graf--p graf-after--figure\">However, some of my clients just want to go and live on the beach. Literally. They want to renounce their citizenship and begin living exclusively on beaches. A passport from Georgia and many other countries will give you access to most Caribbean countries, as well as Brazil and other countries in South America and most of Southeast Asia. So, if you&#8217;re an expat with the primary goal of traveling to a sunny place with a beach, then Georgian citizenship would work great for you.</p><p name=\"e6bb\" id=\"e6bb\" class=\"graf graf--p graf-after--p\">Another solution would be to follow my &#8220;<a href=\"http://nomadcapitalist.com/2016/11/06/belt-and-suspenders-strategy/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">belt and suspenders</a>&#8221; strategy, in which you get a citizenship in a place like Georgia that offers you many of the personal and business freedoms you are looking for, plus a residency in an EU country that will give you access to all the other countries you don&#8217;t have visa-free travel privileges to with your new passport.</p><p name=\"f26d\" id=\"f26d\" class=\"graf graf--p graf-after--p\">Georgia is a great country. I don&#8217;t know if it&#8217;s the country that suits every single US citizen, especially because I consider most of Americans (myself included) a bit spoiled in terms of flying and visa-free travel. We are used to getting on a plane and going to basically any country we want to without ever worrying about a visa. Most US citizens were shocked, for instance, when they discovered they couldn&#8217;t go to Brazil for the Olympic games without first getting a visa. While Brazil made an exemption in the end to allow Americans 90 visa-free days only during that period, most people don&#8217;t realize that visas are just a normal part of the traveling life for other passport holders.</p><p name=\"15df\" id=\"15df\" class=\"graf graf--p graf-after--p\">Getting a passport is not always an easy, straightforward process. There are certain procedures you must follow, which is why I always recommend hiring a professional&#8202;&#8212;&#8202;be they a lawyer or someone like me. If you want to go to the Netherlands, for example, there are 22 different procedures you must complete and, at the end of the process, you will have to renounce any other citizenship you may have since the Netherlands does not allow dual citizenship.</p><p name=\"0704\" id=\"0704\" class=\"graf graf--p graf-after--p\">Georgia, again, is a good country in that regard because they allow dual citizenship. If Georgia doesn&#8217;t pique your interest, I am also looking into Serbia as a very attractive and interesting place for citizenship, investment and living.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*MP7A4uCbS38QWMuaN77mSw.jpeg\">Andrew Henderson in&#160;China.<p name=\"19bc\" id=\"19bc\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">What would your advice be to people who would also need to find a new source of income abroad? What are your top five expat destinations for white collar professionals who want to go abroad?</strong></p><p name=\"89ab\" id=\"89ab\" class=\"graf graf--p graf-after--p\">Again, I am not exactly an expert regarding getting a job. I&#8217;ve always been my own boss. If you are in the US and you are looking for a job, I guess Canada, Australia, the UK, New Zealand and Ireland are the places for you. If you have a college or Masters degree, scored well on any career-specific exams, are a native English speaker and you have an in-demand job, such as an accountant, it can be much simpler for you.</p><p name=\"1e54\" id=\"1e54\" class=\"graf graf--p graf-after--p\">But, for me, that is not a lifestyle I recommend since you can end up paying the same amount in taxes in these countries, or even more, than in the US. My suggestion would be to figure out how to turn that white collar profession into some kind of productized service business.</p><p name=\"a212\" id=\"a212\" class=\"graf graf--p graf-after--p\">For example, if you&#8217;re an accountant, figure out how to offer accounting services in some other or multiple countries. One of the biggest challenges I face when I go places is that accounting services from professionals are expensive since there&#8217;s no real competition in these countries for good accountants. I am currently in Montenegro and I&#8217;m starting a Montenegrin company to own a few beach properties. It&#8217;s going cost me more money to hire an attorney in Montenegro to manage three beach properties in terms of tax compliance than it will to hire a US tax attorney every year because there&#8217;s not a whole lot of competition among Montenegrin accountants.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*dW1h5wd_H7wa0pdSZNOv3Q.jpeg\">Kotor, Montenegro. PIXABAY<p name=\"9039\" id=\"9039\" class=\"graf graf--p graf-after--figure\">If I were you, I would look into either finding out how to turn your industry on its ear somewhere new or I would just focus on how to get high paying freelance gigs. In all honesty, that might be the easier thing to do if you&#8217;re just looking into being an expat and living somewhere for lifestyle purposes.</p><p name=\"7c32\" id=\"7c32\" class=\"graf graf--p graf-after--p\">If you are looking into going somewhere to start a business, I would not go to Asia. It&#8217;s mostly too late to start a business in a place like Singapore or Hong Kong. They&#8217;re not looking for you to get into their affairs anymore. Latin America can be quite bureaucratic, quite frankly; but if f you&#8217;re looking for a good lifestyle location in the region, Medellin, Colombia is a good place and Panama City is pretty decent as well. However, those countries are just too bureaucratic for business purposes and aren&#8217;t as advanced as Asian countries.</p><p name=\"fb55\" id=\"fb55\" class=\"graf graf--p graf-after--p\">If you&#8217;re a white collar, focus on Eastern Europe. Estonia for example would be a good place to go. Everyone speaks English, it&#8217;s easier to fit in, there are a lot of opportunities and it is easy to operate. Beyond that I revert to the Balkans.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Wtrl9YezOPFvK81DWCWv6A.jpeg\">Freelancing online gives you location independence. PIXABAY<p name=\"87f0\" id=\"87f0\" class=\"graf graf--p graf-after--figure\">Depending on what you are trying to accomplish, Romania, Latvia and Estonia are great countries for freelancers because the internet is lightning fast, with some of the fastest connections in Europe. Also if you&#8217;re a freelancer and traveling throughout the world, Kuala Lumpur, Malaysia is dramatically underrated in the shadow of over exaggerated Thailand. KL has a great balance of affordability and lifestyle. There are a lot of interesting things to do there and there&#8217;s great connectivity.</p><p name=\"7e8c\" id=\"7e8c\" class=\"graf graf--p graf-after--p\">Other good locations include Belgrade and Bucharest for freelancers and, if you insist on being closer to America, I&#8217;d suggest Medellin and Mexico City. If you are doing the white collar routine where you are used to certain luxuries, those would be my top choices. If you are looking to start a new business and want to be in an efficient tax-free, well-managed, lots-of-going-on kind of place and you&#8217;re not fond of Europe, I would recommend looking at the Gulf region. The UAE is probably still the easiest way to go, although Oman has great potential and is still developing.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*vgXY7W3xzBbOmBcGqnFfIQ.jpeg\">Dubai can be an attractive option for expatriates interested in lucrative salaries. PIXABAY<p name=\"fe0e\" id=\"fe0e\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Digital Nomadism is on the rise. What are your top five picks for expat destinations for people who want to make a living off their laptops? If they are starting totally from scratch, what resources would you suggest for them to get started on learning how to make a living online?</strong></p><p name=\"b52a\" id=\"b52a\" class=\"graf graf--p graf-after--p\">Here is where I go back to Kuala Lumpur, Budapest, Belgrade, Medellin, and Mexico City. I follow a base city + nomad philosophy. I own properties in other countries but I have homes in two, soon to be three, countries and then I travel from there. I also have what I call a focus cities strategy. This involves having cities where you know you&#8217;re way around. For me, that is Belgrade, where I don&#8217;t have an actual base but I know exactly where to go and how to manage my affairs when I go there. I don&#8217;t have to waste time settling in.</p><p name=\"1686\" id=\"1686\" class=\"graf graf--p graf-after--p\">You should have your personal best on each continent. I only spend one month a year in the Americas; it&#8217;s just not that appealing to me, not developed enough and too bureaucratic. However, if you are just living from a laptop and want to be in the Americas, I would recommend Mexico. In Europe you have so many choices. I avoid Spain and Italy because of my aversion to cultures that are so laid back they border on extreme laziness. I tend to look into emerging markets where I like to base myself as a tourist.</p><p name=\"80b9\" id=\"80b9\" class=\"graf graf--p graf-after--p\">For English speaking cities I love Dublin, Amsterdam and London (if you don&#8217;t mind their visa regulations). In Asia, KL is a hidden gem, Singapore can be too expensive, Hong Kong too, especially in terms of rent. I find Thailand a bit overrated, Vietnam can be interesting, Cambodia is great in terms of investment opportunities. Go to a place that has some potential and maybe you will stumble upon the next opportunity. For me, countries like Cambodia, Montenegro, Serbia, Hungary, Colombia and Mexico are the places where I would personally explore and want to be.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*igpuZAQ0kmnOj4dD2WVnkQ.jpeg\">Digital nomads should consider Kuala Lumpur in Malaysia, a highly underrated destination. PIXABAY<p name=\"3fed\" id=\"3fed\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Expatriation is quite daunting to a lot of people for many reasons. Part of this is because they simply lack a social network of expat role models they can emulate. Part of this is also the fact that, due to many technological advancements, expatriation has become much easier, but people simply aren&#8217;t aware that this is the case. Can you go into detail about how technology has made expatriation much easier than it was even a decade ago?</strong></p><p name=\"6d06\" id=\"6d06\" class=\"graf graf--p graf-after--p\">If you are from the US or a western country, chances are that many of your affairs&#8202;&#8212;&#8202;if not all&#8202;&#8212;&#8202;can be managed through various apps and platforms anywhere in the world. Online banking makes it easy to keep track of your accounts, pay your credit cards, etc. The burden of taking care of things at home is gone. Not only that, but you can get international or foreign bank accounts to manage your affairs overseas. Additionally, if you get the right bank accounts, the good banks understand much more now that people travel and so they have become more efficient for overseas banking.</p><p name=\"e30c\" id=\"e30c\" class=\"graf graf--p graf-after--p\">For my business, I regularly use Skype and even Facebook Messenger to talk to my staff and sometimes my partners. Everyone knows about those types of services. From the tech point, we use Facebook, FaceTime and Skype, we deal with clients through Project Management tools on Basecamp, and people can upload their documents to the Cloud and Google Drive. I can&#8217;t really give insight into something new and shocking in this matter.</p><p name=\"c572\" id=\"c572\" class=\"graf graf--p graf-after--p\">The really shocking part of what I do is the fact that you can do it. I can give you all the arguments why I think you should go overseas and why it is in your best interest and how you can stay connected to your old life through social media, but in the end it is up to you. If you don&#8217;t think it is doable, then it isn&#8217;t. That is why when people call and ask me why they need a second passport, I tell them that if they don&#8217;t think they need one, then they really don&#8217;t need one. My job isn&#8217;t to convince you. You have to convince yourself first and be prepared to make the first steps. You have to have that fire in your belly.</p><p name=\"f240\" id=\"f240\" class=\"graf graf--p graf-after--p\">After that, the hardest part is adapting to where you go. This is one reason I suggest going to a country and living there for a time. This will allow you to adjust and establish at least a part of your life there, such as opening a bank account. For instance, I&#8217;ve spent some time living in Malaysia. If you go to Malaysia and live as a tourist without a visa as many people do, you won&#8217;t be able to open a bank account. This means you&#8217;ll have to use a Singapore bank account, which works pretty well, but if you ever have a question you can&#8217;t just walk into a bank and ask about it.</p><p name=\"6654\" id=\"6654\" class=\"graf graf--p graf-after--p\">In that regard, living in a country where they allow foreign residents to open accounts and get leases (which Malaysia does), is important because a lot of these countries don&#8217;t have the tech or you&#8217;re not going to be as comfortable using it. Overall, I think people know how to stay connected with all the tech stuff. The bigger issue is handling it all up in your head.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*KZwa2QczaOuj5mnTplZ0yg.jpeg\">Fear holds many people back from launching international lives.&#160;PIXABAY<p name=\"1f8d\" id=\"1f8d\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Part of the reason people are hesitant to launch an international lifestyle is FOMO: their Fear Of Missing Out on what&#8217;s happening among their friends and social circles in the US. Let&#8217;s flip the script on this issue. What are people missing out on by NOT going abroad and setting up an international lifestyle? After all, it is entirely possible to spend half of the year in the US and half of the year abroad, getting the best of both worlds.</strong></p><p name=\"ec45\" id=\"ec45\" class=\"graf graf--p graf-after--p\">The first huge thing you&#8217;ll be missing out on, which I can&#8217;t emphasize enough, are all the tax benefits. If you don&#8217;t know this already, the US has extremely high taxes. When I look at how successful my businesses were while I was in the US, I can&#8217;t help but think how much more success I could have had or how much more money I could have saved just by moving abroad earlier and saving all those taxes. Imagine if I had reinvested all that money!</p><p name=\"6ac8\" id=\"6ac8\" class=\"graf graf--p graf-after--p\">Or, from a different perspective, I am 32 now and I&#8217;m beginning to think about starting a family and having children. I have that kind of romantic image of children in my head where I want to build generational wealth for them. My family is considered successful, but I still think they are giving their well earned money to the &#8220; whales&#8221; and not thinking about future generations. Imagine how much more I could have done to prepare for my future generations if I had gone abroad sooner. All that money&#8202;&#8212;&#8202;which could easily be a seven figure sum when I add it all up&#8202;&#8212;&#8202;I now consider lost simply because I stayed in the US all those years.</p><p name=\"5c52\" id=\"5c52\" class=\"graf graf--p graf-after--p\">Imagine yourself (legally) putting that money you send to the government every year somewhere else. That&#8217;s the #1 thing you are missing out on by not going abroad: the economics. And I know it can sound kind of silly, but think of it this way: if you save about $200,000 USD per year in taxes by not living in the US, you could have lived in the Four Seasons hotel that entire year for the same amount&#8202;&#8212;&#8202;or, depending on where you go, for just a fraction of that amount.</p><p name=\"8291\" id=\"8291\" class=\"graf graf--p graf-after--p\">Think about that for a second.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*IZDiTF7B4gH6exiuQfOAhQ.jpeg\">Live in luxury abroad.&#160;PIXABAY<p name=\"b6af\" id=\"b6af\" class=\"graf graf--p graf-after--figure\">People can get scared and ask themselves if they can really live the nomad lifestyle or survive in other countries; meanwhile I&#8217;m staying at the Ritz Carlton in Kuala Lumpur in a two bedroom suit for $180 USD a night with breakfast included, delivered to my room by a butler. And all thanks to tax savings the government gives me for staying out of the country!</p><p name=\"039d\" id=\"039d\" class=\"graf graf--p graf-after--p\">Another thing I&#8217;ve discovered living abroad is the cost of being cheap. It&#8217;s another one of those things I can&#8217;t help but think about when I look back at my time getting started as a businessman in the US. What would have happened if I had applied the principles that I apply now of saving time and outsourcing? I know now that I was holding myself back by being cheap and scared.</p><p name=\"7e25\" id=\"7e25\" class=\"graf graf--p graf-after--p\">The hardest lesson my ego has had to learn is that I don&#8217;t know everything and I won&#8217;t know everything just by scouring the internet for free information sheets. I am a reformed info sheet seeker. I&#8217;ve learned the hard way that it&#8217;s much better to go hat (and check) in hand to people who can help me. I also know that it&#8217;s much better to go out and get all the boots-on-the-ground experience in the world than sit and read about it online. The real business success is waiting for those who are willing to go out and find it. You give that up by staying put.</p><p name=\"a51e\" id=\"a51e\" class=\"graf graf--p graf-after--p\">Being cheap and being afraid of real world experience are some of the issues that hold people back from becoming Nomad Capitalists. When people assume that it was easy for me to figure all of this out and they question the principles I use in making an offshore plan for them, I just have to shrug. They&#8217;ll have to learn the hard way like I did. Too bad they won&#8217;t take advantage of my experience.</p><p name=\"9ede\" id=\"9ede\" class=\"graf graf--p graf-after--p\">But what else are you missing out on? You&#8217;re missing out on anything different that you find appealing, the new experiences and actually having a lifestyle that you want without struggling. The world is changing in a very fast way and it&#8217;s fascinating to watch it all happen front and center. It is exhilarating to go to a place like Hong Kong and see how the world is developing, or Georgia and watch a newly capitalistic country begin to flourish.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*b-cFLlt5g1kWcNKuT_svdw.jpeg\">With growth comes opportunities. PIXABAY<p name=\"d9c0\" id=\"d9c0\" class=\"graf graf--p graf-after--figure\">The number of people across the globe who have been lifted from poverty in just our lifetimes is staggering and it&#8217;s transforming the world in a very interesting way. The growth is not in the US anymore and I want to see where it is happening and how it&#8217;s happening across the world. I want to see this great new era and how our entire world is becoming interconnected. And I want to be involved in it from a monetary perspective, as well.</p><p name=\"6d5e\" id=\"6d5e\" class=\"graf graf--p graf-after--p\">Traveling puts you in the middle of the action, not on the sidelines. For instance, I am doing very well with my small scale property business as an investor in Georgia. I&#8217;m also starting to do very well in Montenegro and there is a lot of money to be made. Unlike in the U.S. (or specifically in Cleveland where I am from) where property values go down every year or just flatten out, property values in some of these places are going through the roof.</p><p name=\"9d9f\" id=\"9d9f\" class=\"graf graf--p graf-after--p\">In Istanbul, for example, property values haven&#8217;t gone down a bit for the last 25 years. So, in a sense, you&#8217;re missing out on seeing how other countries operate and taking advantage of those markets and opportunities. People would think you were crazy if you ever said that there are parts of the U.S. where property values haven&#8217;t gone down for 25 years in a row. But there is a reason that that happens in Istanbul. People are going and investing. I want to be a part of that, I want to see what is happening.</p><p name=\"0423\" id=\"0423\" class=\"graf graf--p graf-after--p\">On top of all of this, I love to see other people&#8217;s culture, lifestyle, history, fashion and food. I love to learn what people are thinking in other places and what their perspective is of the world. I want to learn about different approaches and mindsets to business, investment and life.</p><p name=\"abab\" id=\"abab\" class=\"graf graf--p graf-after--p\">If you don&#8217;t care about these kind of things and if you truly believe that New York is the &#8216;centre of the world&#8217; (without actually exploring the world) then I would say this kind of lifestyle just isn&#8217;t right for you. Maybe you shouldn&#8217;t do it. If you do, you should do it for your own reasons. My reasons are not somebody else&#8217;s. What pushes me forward and motivates me may do little for someone else.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*cwIJz7Y5KN1V0Q4aUUR0Gw.jpeg\">How long will New York remain the self-proclaimed &#8220;capital of the&#160;world?&#8221;<p name=\"bc20\" id=\"bc20\" class=\"graf graf--p graf-after--figure\">My reasons, I could say, are primarily economic since I am, after all, a Nomad Capitalist. I want to make a lot more money, I want to pay a lot less tax and I want to go to a country where it is easier to get things done. While buying a property in the U.S. requires you to sign an endless pile of documents, the process in a place like Georgia is so simple that it only takes a few hours. As an investor, that is what I want.</p><p name=\"faea\" id=\"faea\" class=\"graf graf--p graf-after--p\">So what do you want? Knowing that is the most important part to determining what your life abroad will look like. It&#8217;s your choice and you have a lot of options. There are plenty of other countries in the world and plenty of ways to live as a nomad in any of them. If you&#8217;re just getting started, my suggestion would be to find another English speaking country that you like and spend half of your time there and then spend the other half of your time in the emerging world.</p><p name=\"e390\" id=\"e390\" class=\"graf graf--p graf-after--p\">If, for instance, you like the US vibe, explore places like London, Dublin and Canada for half the year. If you&#8217;re attracted to Asia, I would choose Singapore or Hong Kong and spend the other half in the emerging economies.</p><p name=\"3ca0\" id=\"3ca0\" class=\"graf graf--p graf-after--p\">I wouldn&#8217;t choose the option to spend half my time in the US and half somewhere else because you&#8217;d lose out on the tax benefits. Remember, if you&#8217;re a US citizen and you want the tax benefits, you need to be out of the United States most of the time. There are couple of different ways to do it, but plan on being out of the country for most of the year. If you are traveling and do qualify for the tax benefits, those savings alone may actually cover all of your travel costs.</p><p name=\"83a1\" id=\"83a1\" class=\"graf graf--p graf-after--p\">The other reason I wouldn&#8217;t plan to spend as much time in the United States is that there&#8217;s so much to explore beyond the borders of the US. The world is too big to come back to the US. There are plenty of other countries that have the geography, typography or language of the US. Whatever you want from the US you can find somewhere else.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*fMBza100-SZYidR1273nmA.jpeg\">Chiang Mai, Thailand: Highly affordable and popular among digital nomads.&#160;PIXABAY<p name=\"a541\" id=\"a541\" class=\"graf graf--p graf-after--figure\">And don&#8217;t worry about what you&#8217;ve left behind. You will meet plenty of people and make new friendships if you want to. I am not the most social person, per se, but I have a small number of close friends and that works for me. However, if you want to find people you will. I see examples from my co-workers or employees who are following my lifestyle and moving every three months, and they socialize pretty damn fast. You can go to co-working spaces, start up meetings, join Facebook groups, etc. And for business relations, I personally met a lot of influential people through my lawyer.</p><p name=\"5ceb\" id=\"5ceb\" class=\"graf graf--p graf-after--p\">The best suggestion is for you to plan an entire year outside of the US. You can claim the tax benefits for a year and, if you don&#8217;t like it, you can come back as someone with an adventure. If you do like it you will keep doing it and you&#8217;ll become an expert in it. Simple as that.</p><p name=\"3086\" id=\"3086\" class=\"graf graf--p graf-after--p graf--trailing\">I started as a non-stop nomad, now I have different homes, but I still travel a lot from those homes.I am going to be in Georgia in March, then I&#8217;ll spend April in Asia. Then, after two months of being in more emerging economies I&#8217;m flying to London where I will spend some time getting my straight razor shave, shopping in Kensington, staying in nice hotels, speaking English and getting the type of service I miss from time to time. I bounce back and forth. I get a taste of what I like from the US and then I bounce back to the places with a lot of potential. If you&#8217;re interested in doing something similar, check out the <a href=\"http://nomadcapitalist.com/2016/07/20/ways-to-live-digital-nomad/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">four different approaches to traveling abroad</a> and then jump in and you&#8217;ll quickly find the way that best suits you.</p></div>","title":"Nomad Capitalist Andrew Henderson on Launching an International Life"}},"pageContext":{"id":"5b937b1d87be056953db7d1f"}}