{"data":{"mongodbDatabaseArticles":{"id":"5b92396d87be0583cfde67fe","content":"<div><p></p><img class=\"size-full wp-image-18570\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/09/Why-buying-a-house-is-a-bad-investment.jpg\" alt=\"Why buying a house is a bad investment\" width=\"700\" height=\"465\"><p>Dateline: Dusheti, Georgia</p>\n<p>As a lifelong workaholic, I&#8217;ve made the decision that on the rare times I decide to relax, I want to really relax.</p>\n<p>Sometimes, that means a quiet weekend in the countryside in a place like here in Dusheti, where I can put my phone away and meditate alongside the peace of nature. Other times, it means mindless American TV shows.</p>\n<p>Owing to my need to impart business inspiration even into my hobbies and relaxation time, one of my favorite mindless TV shows is <a href=\"http://www.bravotv.com/million-dollar-listing-los-angeles\" target=\"_blank\">Bravo&#8217;s Million Dollar Listing: Los Angeles</a>.</p>\n<p>There&#8217;s something intriguing (and a bit envy-inducing) about the agents so dramatically featured: the old money flair of Josh Flagg, the new money boiler room hustle of Josh Altman, or the international grandeur of two British guys who jumped across the pond to cash in.</p>\n<p>There&#8217;s also something about the fact that Los Angeles real estate has become so ridiculously, mind numbingly expensive, with developers paying anywhere from $3 million all the way up to $9 million to buy a teardown in the better parts of Beverly Hills or the Hollywood Hills.</p>\n<p>In any major city, land prices in desirable areas trade at a premium, but the numbers bandied around on this show &#8212; and reflected in real life on real estate websites &#8212; smack of a total bubble.</p>\n<p>The hills behind my homes in Georgia and Montenegro have vistas just as beautiful as the views people on this TV show were gawking over and justifying $5 million prices for a teardown, and $20 million for completed construction.</p>\n<p>The other day my girlfriend and I sat around with my team and watched the show just to make fun of &#8220;the amazing views&#8221; where the ocean was barely on the edge of the horizon or you could see some nice palm trees on a hill. I recently walked up the street from my house and saw vistas and gorge views that would give those LA views a run for their money.</p>\n<p>But the real issue at hand here is not whether the views and construction, etc. are better in the United States or overseas. The real issue is that people see such real estate purchases as investments.</p>\n<h1>REAL real estate investments</h1>\n<p>I love real estate. If you&#8217;ve read even a little bit of my blog, you know that I am a fan of real estate investing. But not every real estate purchase counts as a real estate investment. If you&#8217;re from the US, you are well aware of the belief that buying a home is one of the best investments you could make.</p>\n<p>It&#8217;s not.</p>\n<p>I wouldn&#8217;t even count it as an investment.</p>\n<p>The US government gives so many special incentives to homebuyers to the point that people think a home purchase is a great idea. Even if that idea comes with a $25 million price tag.</p>\n<p>To make matters worse, real estate agents go around spreading the erroneous belief that a home purchase is an investment. Unlike in the actual investment industry, real estate agents don&#8217;t have an obligation to hand out the facts. They also tend to make promises about a home&#8217;s investment potential without anything to back up their claim. They can say it&#8217;s a great investment when there&#8217;s no investment at all.</p>\n<p>Homes can be a great place to establish roots (if that&#8217;s what you want), decorate to your hearts&#8217; content and install cool sound systems in the ceiling, but they aren&#8217;t an investment. All the decor and unneeded installations are simply you paying for a certain type of lifestyle.</p>\n<p>They&#8217;re not an investment.</p>\n<p>Don&#8217;t make the mistake of thinking they are.</p>\n<p>You can&#8217;t depend on the market to keep up with your profligate spending. If you really looked at a home purchase as an investment, you&#8217;d call it a house and rent it out.You don&#8217;t replace the tires on a rental car and you certainly don&#8217;t put the latest sound system in a rental property. Purchasing a rental property is purely a business decision and you treat it as such.</p>\n<p>That&#8217;s an investment.</p>\n<h1>The worst investment</h1>\n<p>If you&#8217;re still not convinced that buying a house is a bad investment, let me do a little more explaining. If you actually do the math, home ownership is probably the worst investment you could make. Let&#8217;s take a look:</p>\n<ul>\n<li><a href=\"http://www.economist.com/blogs/graphicdetail/2016/08/daily-chart-20\" target=\"_blank\">Average home price</a> in the United States &#8776; $355,000</li>\n<li>Required 20% downpayment = $71,000</li>\n<li>Loan balance = $284,000</li>\n<li>Current <a href=\"https://ycharts.com/indicators/30_year_mortgage_rate\" target=\"_blank\">interest rate</a> for a 30-year fixed mortgage = 3.5%</li>\n<li>Monthly payment &#8776; $1,700</li>\n<li>Total principal and interest paid by the end of the mortgage: $612,000 (or $257,000 more than the original amount)</li>\n<li>Average <a href=\"https://wallethub.com/edu/states-with-the-highest-and-lowest-property-taxes/11585/\" target=\"_blank\">property tax rate</a> is 1.15% &#8776; $122,500 over 30 years</li>\n<li>Maintenance (for upkeep, maintenance, repairs, etc.) at 1% per year = $3,550 a year or $106,500 over 30 years</li>\n</ul>\n<p><strong>Total out-of-pocket costs over 30 years = $841,000</strong></p>\n<p>But the calculation doesn&#8217;t stop there. As <a href=\"https://www.aol.com/article/2014/07/19/the-worst-investment-you-can-make-buying-a-home/20932947/?gen=1\" target=\"_blank\">Brian Lund</a> points out, the real cost of owning a home is the opportunity cost. What would you do with the extra $257,000 you would be saving in interest payments? What would you do with the extra $3,500 per year saved in maintenance fees? And how about that $122,500 you&#8217;d save over the years by cutting out property tax?</p>\n</div>","title":"Why buying a house is a bad investment"}},"pageContext":{"id":"5b92396d87be0583cfde67fe"}}