{"data":{"mongodbDatabaseArticles":{"id":"5b93831987be056953db7e2a","content":"<div><h4 name=\"7996\" id=\"7996\" class=\"graf graf--h4 graf--leading\">No pair is perfect, and that&#8217;s a good&#160;thing.</h4><p name=\"5241\" id=\"5241\" class=\"graf graf--p graf-after--h4\">No matter how well you and your coding partner get along, there will be times when you disagree. Maybe you want to work on different things. Maybe you&#8217;d rather take a different approach to solving a problem. Or maybe you&#8217;re thinking, &#8220;if I were driving, we&#8217;d be done with this by now.&#8221; We&#8217;ve all been there, and you should keep in mind that your partner has been there too. Working with a partner teaches us to be patient and humble, realizing that our way is not always the only, or even the best, way.</p><p name=\"62c3\" id=\"62c3\" class=\"graf graf--p graf-after--p\">The great thing is that <strong class=\"markup--strong markup--p-strong\">even at the times when I have been frustrated, pair programming has been better than working alone</strong>. The insights and experience gained from working (or patiently watching) through these times has been just as valuable as everything else I&#8217;m learning.</p><h4 name=\"206f\" id=\"206f\" class=\"graf graf--h4 graf-after--p\">I didn&#8217;t know&#160;Ruby&#8230;</h4><p name=\"67fa\" id=\"67fa\" class=\"graf graf--p graf-after--h4\">as well as I thought I did. One of the main resources we have been using is <a href=\"https://www.theodinproject.com/home\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">The Odin Project</a>, for learning Ruby. I had actually (mostly) completed their Ruby course prior to starting the Microverse program, so I thought I knew Ruby and object-oriented programming pretty well. Now that I have gone through the material again, I better understand a lot of things I had skimmed over the first time. When my partner and I got to the first projects, I had a much clearer idea of how to approach them than I did the first time. (By way of example, the OOP section of The Odin Project has students build two command-line games, Tic-tac-toe and Mastermind. I had originally written both without creating any classes&#8202;&#8212;&#8202;they were not object-oriented at all!)</p><p name=\"3c1f\" id=\"3c1f\" class=\"graf graf--p graf-after--p\">We&#8217;re now working through the projects related to testing. Remember how I said I mostly completed the course before? While I read the material and understood the basics of RSpec the first time, I had become weary with all the projects and did not complete them. Instead, I skipped straight to the Final Project so that I could then move on to learning Rails. Working with a partner this time makes it much less daunting (plus the program requires us to finish it, which always helps).</p><p name=\"587e\" id=\"587e\" class=\"graf graf--p graf-after--p\">The main takeaway from this is that working with a partner will sharpen your knowledge of the things you think you know.</p><h4 name=\"64f8\" id=\"64f8\" class=\"graf graf--h4 graf-after--p\">Data structures and recursion.</h4><p name=\"4793\" id=\"4793\" class=\"graf graf--p graf-after--h4\">For the&#160;last two&#160;weeks, we&#8217;ve spent about an hour each morning learning about data structures on <a href=\"https://www.learneroo.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Learneroo</a>. I remember covering the basic data structures before, and even building breadth-first and depth-first search functions for binary trees. I didn&#8217;t truly understand them, though, until my partner and I went through them together. We still have quite a bit to learn, but doing it together helps us both process our thoughts and build on each other&#8217;s understanding, so that we comprehend more than either of us would if we studied these things on our own. Recursion, in particular, makes sense to me now in a way that it never did before, and I&#8217;m almost even excited to learn more about data structures. Almost.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*W-MRraxlpVjFUz5fjYd9MQ.jpeg\">JavaScript isn&#8217;t <strong class=\"markup--strong markup--figure-strong\">quite</strong> this&#160;bad.</div>","title":"What I’ve learned from full-time remote pair programming for a month"}},"pageContext":{"id":"5b93831987be056953db7e2a"}}