{"data":{"mongodbDatabaseArticles":{"id":"5b93833587be056953db7e3a","content":"<div><h1 name=\"ac3a\" id=\"ac3a\" class=\"graf graf--h3 graf-after--figure graf--title\">From office-based to nomadic: 5 varieties of remote working in companies</h1><p name=\"26fb\" id=\"26fb\" class=\"graf graf--p graf-after--h3\">I&#8217;ve recently found myself reflecting a lot on being a distributed team, and the nature of a company where the team works from remote locations to accomplish our work.</p><p name=\"a0a2\" id=\"a0a2\" class=\"graf graf--p graf-after--p\">Scaling remote working has been a challenge as the team has grown. Remote companies are still relatively rare, and therefore all of us who are choosing to have a remote-friendly culture, need to both:</p><ul class=\"postList\"><li name=\"d454\" id=\"d454\" class=\"graf graf--li graf-after--p\">work through the normal challenges of growing as a company and as a team</li><li name=\"8bf2\" id=\"8bf2\" class=\"graf graf--li graf-after--li\">also put time into figuring out how remote can scale, where there is no real pre-existing playbook</li></ul><p name=\"8651\" id=\"8651\" class=\"graf graf--p graf-after--li\">One of the significant commitments we&#8217;ve made recently at Buffer, is to approach our company growth goals in a long-term fashion, staying true to our culture of remote working. This means we deliberately make time to try to scale remote working, even if this may at times feel it comes at the expense of short-term financial growth.</p><p name=\"1c4c\" id=\"1c4c\" class=\"graf graf--p graf-after--p\">It is my belief that working to develop a great remote working culture is an investment that will pay dividends for decades to come. If we can make this work over the long-term, we set the company up for many significant advantages and great freedom for us as a team.</p><h3 name=\"e4bb\" id=\"e4bb\" class=\"graf graf--h3 graf-after--p\">The levels of remote&#160;working</h3><p name=\"c238\" id=\"c238\" class=\"graf graf--p graf-after--h3\">In my reflections, I came to the realization that remote working is a scale, and there are actually a number of different options along across spectrum from &#8220;not remote&#8221; to &#8220;fully distributed&#8221;.</p><h4 name=\"cebf\" id=\"cebf\" class=\"graf graf--h4 graf-after--p\">1. Not remote / office-based culture</h4><p name=\"69e7\" id=\"69e7\" class=\"graf graf--p graf-after--h4\">Obviously at the far end of the spectrum we have what is today perhaps the most typical working environment for companies. In this model, you have your whole team in one or more offices.</p><p name=\"1860\" id=\"1860\" class=\"graf graf--p graf-after--p\">This means that you typically have set down working hours (strict or loosely enforced). You will work from the office all day, and not have too much flexibility in your day, nor will you have the option to choose the work environment you enjoy and find yourself most productive within.</p><p name=\"4579\" id=\"4579\" class=\"graf graf--p graf-after--p\">Of course, office-based environments are also awesome for a whole bunch of reasons. You more naturally have close bonds and friendships forming. You can whiteboard and brainstorm, which can be very productive. If you have people who are junior in their role, they can very readily and easily get help so they don&#8217;t get stuck.</p><h4 name=\"6f70\" id=\"6f70\" class=\"graf graf--h4 graf-after--p\">2. Office-based with a work-from-home option</h4><p name=\"1705\" id=\"1705\" class=\"graf graf--p graf-after--h4\">Some companies which operate from a single office, have started to give team members the option to work from home one or more days per week. This is a great start, and perhaps a perfect way to start to experiment with a remote working culture.</p><p name=\"06c6\" id=\"06c6\" class=\"graf graf--p graf-after--p\">This small degree of remote-friendliness will already test the culture and require a few key changes to how work is done within a team. For example, those days that team members are working from home, the team will need to mostly communicate through <a href=\"https://open.buffer.com/remote-work-tools/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">email, chat tools, or some other means</a> than the face-to-face methods which can be relied on without thinking about it in an office environment.</p><p name=\"7ce1\" id=\"7ce1\" class=\"graf graf--p graf-after--p\">One key challenge when you start to experiment with this setup will be avoiding the people who work from home feeling left out of discussions that lead to key decisions. When you have the majority of the team in one place and a few people not in the office, it&#8217;s easy for those people to feel like second class citizens.</p><h4 name=\"a6d4\" id=\"a6d4\" class=\"graf graf--h4 graf-after--p\">3. A remote team, in a single time&#160;zone</h4><p name=\"7e0a\" id=\"7e0a\" class=\"graf graf--p graf-after--h4\">This is where things start to get more truly remote. In this category you&#8217;ll have companies which are more truly remote. However, some remote companies still choose to have the team mostly in one time zone, or very few largely overlapping time zones.</p><p name=\"dd04\" id=\"dd04\" class=\"graf graf--p graf-after--p\">This is a truly remote setup, so the way work is done certainly is different from a team based within an office. Text-based communication and collaboration tools will come in here.</p><p name=\"bdc0\" id=\"bdc0\" class=\"graf graf--p graf-after--p\">At the same time, in this setup, you still have a lot of hours of overlap, if not full overlap, with everyone in the team. So at least you can rely on someone being available when you need to get work done. Therefore, a lot of the day-to-day work can still be done in a synchronous fashion and work well.</p><h4 name=\"06c5\" id=\"06c5\" class=\"graf graf--h4 graf-after--p\">4. A world-wide remote team spread across numerous time&#160;zones</h4><p name=\"e8a5\" id=\"e8a5\" class=\"graf graf--p graf-after--h4\">A step further is to have a team where everyone is spread across different time zones. This means that asynchronous collaboration becomes even more vital. You&#8217;ll likely just have a few hours of overlap with other people in your team, and so this setup requires a little more structure to make communication and collaboration efficient.</p><p name=\"60a4\" id=\"60a4\" class=\"graf graf--p graf-after--p\">Sometimes companies set up this way, will choose to concentrate certain roles in the same time zone. Other times, it will be a completely location-independent setup. In either case, you generally have team members staying permanently in their location, for a long duration of time. So you can at least have some consistency of the setup of each team, and can set up some forms of synchronous communication at the times of overlap.</p><p name=\"3b3d\" id=\"3b3d\" class=\"graf graf--p graf-after--p\">The challenges with a fully remote setup like this are numerous, however <a href=\"https://open.buffer.com/distributed-team-benefits/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">there are also many benefits</a>. One key one is around-the-clock coverage of customer support or engineering.</p><h4 name=\"b0e2\" id=\"b0e2\" class=\"graf graf--h4 graf-after--p\">5. A fully distributed team with nomadic team&#160;members</h4><p name=\"8b29\" id=\"8b29\" class=\"graf graf--p graf-after--h4\">The most extreme case of remote working, in my mind, is a fully remote team where some of the members of the team are nomadic and traveling.</p><p name=\"6aac\" id=\"6aac\" class=\"graf graf--p graf-after--p\">Since Buffer&#8217;s distributed team setup is based around our vision to create a workplace of the future, and also around our value to live and work smarter, this is the ultimate level I am currently striving for us to reach.</p><p name=\"9261\" id=\"9261\" class=\"graf graf--p graf-after--p\">Currently, we see some challenges in reaching this level of freedom for team members, and a collaboration system that can be efficient with this setup. A key milestone I believe of this level will be that work continues regardless of people moving locations. Of course, moving to a new place can affect productivity and this is for people to be mindful about. However, I do believe there is a way that collaboration can happen, where aside from those productivity challenges, work can happen in the exact same way, regardless of location. This is what is needed to truly be able to work efficiently with nomadic people in the team.</p><p name=\"f454\" id=\"f454\" class=\"graf graf--p graf-after--p\">I believe open source can be a great inspiration for the kind of asynchronous collaboration that is needed for this setup. Synchronous chat tools are problematic. At the same time, to cultivate culture and create bonds, synchronous chat tools and video calls can be effective here too. The key, it seems, is to separate &#8220;how work happens&#8221; from those synchronous communications.</p><p name=\"f3f6\" id=\"f3f6\" class=\"graf graf--p graf-after--p\">Do you do remote working at your company? Which level are you at, or do you see yourself a different level I&#8217;ve not covered here? What do you think is worth striving for? I&#8217;d love to hear from you in the comments.</p></div>","title":"From office-based to nomadic: 5 varieties of remote working in companies"}},"pageContext":{"id":"5b93833587be056953db7e3a"}}