{"data":{"mongodbDatabaseArticles":{"id":"5b95f50e87be05832749013f","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Overcoming Culture Shock in Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter wp-image-9961 size-full\" title=\"Overcoming Culture Shock in Thailand\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/05/CS.png?resize=563%2C373&amp;ssl=1\" alt=\"Overcoming Culture Shock in Thailand\" width=\"563\" height=\"373\"></p>\n<p>I remember when I started shopping at our local Thai market. Chris and I were settling into our new townhouse in Chiang Mai and adjusting to life abroad. The conventional nine to five was far behind us and we were still excited and intrigued by everything. I was trying to buy a few items for dinner, but things were&#8230;different. Stumbling through the market, not knowing where things were or what they were called, was the first of many times I dealt with culture shock in Thailand.</p>\n<p><strong></strong></p>\n<p>I was trying to find my way around the produce and meat aisles, racking my brain in search of the stalls where I had seen piles of chicken carcasses and big beef bones last week. Surely I&#8217;ll find something as simple as chicken stock.</p>\n<p>I was the only farang shopping at this particular market, and I could feel the eyes on me as I browsed through the narrow aisles. I recognized the vegetable stall I shopped at before and made a detour. The vendor acknowledged me and silently handed over a small basket so I could collect my vegetables. I pointed to one I was unfamiliar with and asked (in Thai) what it was called.</p>\n<p>&#8220;Arrai na?&#8221; &#8220;Excuse me?&#8221; The vendor had no idea what I had just asked. I repeated myself, but my choice of vocabulary and foreign accent failed me. Even though I had spent countless afternoons studying Thai, it turns out I said the simple phrase all wrong!</p>\n<p>I just wanted to slink away, but I still had to pay for the forgotten basket of produce I was holding. I asked the price and fumbled with coins and bills as payment, my math a bit fuzzy. I would have given anything to be able to hand over a credit card.</p>\n<p>I moved on, already reluctant to continue shopping. A bit later I tried to order a bag of spicy papaya salad. Again, I spoke in Thai, requesting that it be made spicy. But as I was accepting my bag of som tum, I noticed it lacked the tell-tale bright red chilies that make it hot. I must have messed up again!</p>\n<p>So I left, bothered by the accumulated grocery bags heavily hanging on my arms and upset with my poor Thai communication skills. I had walked halfway home before I realized I had forgotten the chicken stock.</p>\n<p>I felt defeated over something as simple as grocery shopping. I couldn&#8217;t understand the few Thai signs that labeled various stalls, I had trouble counting and handling cash, and I couldn&#8217;t communicate with the vendors. How long would I feel this way? Would I allow anxiety to prevent me from doing something so fundamental as shopping for groceries?</p>\n<p>What I was experiencing was culture shock in Thailand. There were many more instances where Chris or I felt overwhelmed or confused by what was going on around us. And as much as we learned about Thailand before moving here, we hadn&#8217;t learned much about daily life in Thailand and the ups and downs that would frequent us.</p>\n<p><img class=\"aligncenter wp-image-9950 size-full\" title=\"The Ups and Downs of Culture Shock\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/05/Culture-Shock.png?resize=562%2C407&amp;ssl=1\" alt=\"Culture Shock in Thailand\" width=\"562\" height=\"407\">So what can we share with aspiring expats to prepare them for challenges they may face while adapting to life abroad? Here are the problems we first wrestled with and how we eventually overcame culture shock in Thailand.</p>\n<h2><p id=\"You8217ll_Be_Misunderstood\"><p>You&#8217;ll Be Misunderstood</p></p></h2>\n<p>Chiang Mai&#8217;s Old City area is very expat friendly and even Thailand&#8217;s second declared language is English. However, we should have never thought we could just waltz into Thailand without serious consideration for the language barrier. Being misunderstood happens, just as I was unable to properly communicate with the vendors at my local market. We&#8217;ve noticed that it is particularly challenging any time we ventured farther from the Old City. Often, it&#8217;s even worse when we attempted to speak Thai! It was all too frequent to be met with confused or blank faces.</p>\n<p>The best thing we did for ourselves was made friends with Thai locals: our favorite smoothie lady; the guy that gasses up our motorbike; the guesthouse owner we now hang out with at least once a week. Whatever Thai we learned was reinforced through our new friends. It&#8217;s a great way to gain confidence living in Thailand and learn about what goes on in life below the surface.</p>\n<h2><p id=\"Not_Everything_is_Cheap\"><p>Not Everything is Cheap</p></p></h2>\n<p>Not everything is cheap, and don&#8217;t let anyone tell you otherwise.</p>\n<p>Yes, the local beer and food are cheap. Yes, housing, utilities, and public transportation are hardly bank-breaking. And yes, the clothes and gadgets sold at outdoor markets are a steal.</p>\n<p>But the reality is that prices jumped once we stepped foot in any comfortably air-conditioned indoor shopping center. We expected the cost of groceries, clothes, electronics, and general household goods to be a mere fraction of what we were used to seeing back home, but they weren&#8217;t!</p>\n<p>This was probably our biggest surprise after moving to Thailand. We heard so much about how cheap it was to live here, so we had assumed everything was cheap. We admitted to <a title=\"Thailand Budget Mistakes\" href=\"https://www.tielandtothailand.com/thailand-budget-mistakes/\">blowing our budget</a> the first few months as we tried settling down. Buying necessities and things we believed would make us comfortable cost more than we realized, which made us panic when we went over our budget.</p>\n<p>We later learned that we should have budgeted about one and a half to two times more per month for the first two or three months. This would have allowed us to be comfortable (that&#8217;s what&#8217;s it&#8217;s all about, right?) without feeling guilty about spending the money.</p>\n<p>Not everything is cheap, but we eventually found the little mom and pop places or specialty shops that sold things for less compared to the big and convenient grocery, home appliance, and department stores. We just needed time to find them ourselves or to learn about them from fellow expats.</p>\n<h2><p id=\"Boredom_Will_Eat_You_Alive\"><p>Boredom Will Eat You Alive</p></p></h2>\n<p><img class=\"aligncenter wp-image-9953 size-full\" title=\"www.friedchickenandsushi.com\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/05/culture-shock-comic-sized.jpg?resize=560%2C206&amp;ssl=1\" alt=\"Culture Shock Comic\" width=\"560\" height=\"206\"></p>\n<p>So we quit our jobs and lounged around all day, but we gradually found ourselves becoming lonely and bored.</p>\n<p>The truth is, without the co-workers we saw on a daily basis or the friends we could call up whenever we wanted company, we felt alone. And boredom inevitably cropped up after we &#8220;retired&#8221; from a busy work schedule. Lounging around, watching TV, browsing the internet, or exploring the city could only be done about a hundred times before we wanted, no needed, change.</p>\n<p>We tried filling our days with entertainment. We found new Western restaurants to eat at (our old pastime), we took out-of-town trips to explore more of Thailand, and we went out for drinks more often. We were stuck in permanent weekend mode and were spending money every. single. day.</p>\n<p>Eventually we realized that we didn&#8217;t have to keep up a full schedule like we did back home. We learned to take a step back from our go-go-go lifestyle and deliberately embraced one that was much slower. We focused our energy on personal growth and learning things we hadn&#8217;t made time for before. Once we told ourselves that it was ok to live on our own terms, we were able to find that happy balance and relax.</p>\n<h2><p id=\"Missing_the_Comforts_of_Home\"><p>Missing the Comforts of Home </p></p></h2>\n<p>We missed simple things like full-sized couches (wooden chairs just don&#8217;t quite make the cut) and shower stalls (as opposed to &#8220;wet bathrooms&#8221; where you can wash your body and the entire bathroom at one time!) We missed having plush carpet to walk on and wished we didn&#8217;t have to <a title=\"Five Things to Get Used to in Thailand\" href=\"https://www.tielandtothailand.com/things-to-get-used-to-thailand/\">deal with helmet hair</a> every time we hopped on the motorbike.</p>\n<p>And as much as we love Thai cuisine, eventually we wanted to taste the familiar flavors of home. We are extremely lucky that Chiang Mai has an amazing selection of Western cuisine, but that also made it all too easy to deviate from the affordable local food and explore the more expensive foreign options. And what used to be a money-saving technique (and a hobby) by cooking our meals at home was more costly and troublesome than we had anticipated. Many of our go-to recipes often required hard to find ingredients (like cheese) or certain cooking methods (like roasting), and those don&#8217;t work well in Thailand!</p>\n<p>We eventually made little changes to our living arrangements and lifestyle. If bringing the gas stove inside made me a happier cook, I did it. If installing a shower curtain prevented us from going bonkers over wet toilet paper, we did it. If indulging in tapas or pasta once or twice a week satisfied our European food fix while eating at budget-friendly local Thai restaurants the rest, we did it!</p>\n<p>We learned to make small, inexpensive changes or trade-offs that eventually made us happier and more comfortable.</p>\n<h2><p id=\"A_Look_Back_on_Overcoming_Culture_Shock_in_Thailand\"><p>A Look Back on Overcoming Culture Shock in Thailand </p></p></h2>\n<p>The irony about culture shock in Thailand was that, at first, we didn&#8217;t recognize it as the problem. But once we realized that something had to give to make this new relationship abroad work, and that something was us, things started falling into place.</p>\n<p>Thailand didn&#8217;t change for us. But by accepting change in ourselves and learning to become resourceful and flexible, we were able to overcome culture shock. That&#8217;s ultimately a major part of a successful transition into life in a new country.</p>\n<p>What have you heard, if anything, about culture shock in Thailand? Is this something you&#8217;ve experienced before in another country and know what signs to look for?&#160; What ways do you think you can prepare for it before making the big jump?</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Overcoming Culture Shock in Thailand"}},"pageContext":{"id":"5b95f50e87be05832749013f"}}