{"data":{"mongodbDatabaseArticles":{"id":"5b92397487be0583cfde6805","content":"<div><p>I asked one of the few people working outside the train station &#8220;hvor er Storting gate&#8221;, or &#8220;where is Parliament Street?&#8221;</p>\n<p>Without missing a beat, the guy looked up at me and replied, &#8220;it&#8217;s the second street over there on the left&#8221;.</p>\n<p>Months of listening to old cassettes &#8211; yes, that was the only product available for learning Norwegian back then &#8211; seemed to have all been for naught as no one in Norway wanted to speak Norwegian with me.</p>\n<p>As one of the world&#8217;s wealthiest countries (and not a bad place to <a href=\"http://www.nomadcapitalist.com/offshore-banking/\">bank offshore</a>), Norway has encouraged learning English and most of the population speaks it rather fluently.</p>\n<p>Not only that, but I recall having very intriguing conversations with Norwegians about US politics. One guy in particular knew more about John McCain than any US person I&#8217;d ever met.</p>\n<h2>Do expats and PTs need to learn a foreign language?</h2>\n<p>For those looking to <a title=\"3 new Flag Theory strategies for expats living overseas\" href=\"http://nomadcapitalist.com/2015/01/28/3-new-flag-theory-strategies-expats-living-overseas/\">live overseas</a> as a perpetual traveler or an expat, the English speaking ability of the locals might be a concern.</p>\n<p>Nevertheless, I&#8217;ve often suggested not to let language get in your way of living an offshore lifestyle. If you move to a larger city, for example, your chances of not only finding expats who speak your language, but locals who speak English as well are much greater.</p>\n<p>Here in Kuala Lumpur, practically everyone speaks English to some degree, and if you stay in the city, you don&#8217;t need to learn Bahasa Malay. English is a de facto official language.</p>\n<p>Malaysia encourages everyone to learn English and there are plenty of other countries you may be surprised to know have similar English fluency. In fact, there are nearly <a href=\"https://en.wikipedia.org/wiki/List_of_territorial_entities_where_English_is_an_official_language\" target=\"_blank\">two dozen countries</a> where this is the case, in addition to some 58 countries where English is the official language.</p>\n<p>While I have recommended learning a foreign language &#8211; <a title=\"The 5 best languages to learn for business in a changing world\" href=\"http://nomadcapitalist.com/2013/11/03/top-5-best-language-learn/\" target=\"_blank\">preferably Chinese or Spanish</a> &#8211; being a perpetual traveler can make learning a second language difficult.</p>\n<p>For example, I don&#8217;t place learning Malay high on my priority list, even though I spend a good deal of time here. I&#8217;m a huge advocate for <a title=\"Living in Kuala Lumpur, Malaysia: a hidden gem for the Asia expat\" href=\"http://nomadcapitalist.com/2013/11/15/living-in-kuala-lumpur-malaysia-a-hidden-gem-for-the-asia-expat/\">living in Kuala Lumpur</a> and don&#8217;t mean to insult the locals, but outside of similarities with Bahasa Indonesia, there isn&#8217;t a lot of utility for Malay in global business or when traveling elsewhere.</p>\n<p>On the other hand, I&#8217;m currently re-learning some of the Russian I picked up as a child since Russian is widely useful in Eastern Europe and Central Asia.</p>\n<p><strong>If you&#8217;re looking to become an expat or a nomad, where can you move if you only speak English and want to blend in without learning a new language?</strong> I researched some of the most expat-friendly countries that speak English, and you&#8217;ll be pleasantly surprised.</p>\n<p>Of course, you could easily live in the United States, United Kingdom, Ireland, Australia, or New Zealand and speak English with only a few misunderstandings outside of debating whether you should deposit your banana peel in the trash can or rubbish bin.</p>\n<p>Singapore and the Philippines largely speak English, as well.</p>\n<p>But, interestingly enough, all of the seven countries I selected for this list have a higher percentage of English speakers than Canada, where 80% of the population speaks English as a first or second language. That&#8217;s despite these countries NOT using English as their official language.</p>\n<p>Let&#8217;s examine these seven multilingual countries where the locals speak English.</p>\n<h2>Expat countries that speak English</h2>\n<p><strong>1. Bermuda</strong><br>\nIt only makes sense that Bermuda, as a British Overseas Territory, would be among the list of countries that speak English. Bermuda is one of the <a title=\"The 5 most livable countries with no income tax\" href=\"http://nomadcapitalist.com/2013/11/24/top-5-livable-countries-income-tax/\">most livable countries with no income tax</a>, although it&#8217;s extremely expensive to live there (think $12-a-gallon milk). If you have the cash and want to live on a highly developed island with close travel connections to the United States, Bermuda may be for you. It is also an excellent offshore banking hub. And at 97%, more Bermudans speak English than do mainland Americans.</p>\n<p><strong>2. Dominica</strong><br>\nAs the home to the world&#8217;s most affordable <a title=\"Dominica Economic Citizenship and Second Passport\" href=\"http://nomadcapitalist.com/second-passport/dominica/\">citizenship by investment program</a>, Dominica isn&#8217;t just a place to <a href=\"http://www.nomadcapitalist.com/second-passport\">get a second passport</a>&#8230; it&#8217;s also a Caribbean paradise. Unlike St. Kitts and Nevis, where English is also very widely spoken, Dominica does have an income tax, so be careful spending too much time there.</p>\n<p><strong>3. The Netherlands</strong><br>\nIf you have ever dreamed of spending your days strolling along the romantic canals of Amsterdam, you&#8217;ll be happy to know that 90% of Dutch speak English. More than 15 million of them, in fact. While becoming a permanent resident of the Netherlands may not be the best move for tax purposes, Western citizens can easily spend half of their year in Europe&#8217;s Schengen area, giving you plenty of time to enjoy a second home in Amsterdam.</p>\n<p><strong>4. Malta</strong><br>\nAs Europe&#8217;s tax haven, Malta allows <a href=\"http://www.nomadcapitalist.com/offshore-company/\">offshore companies</a> domiciled there to claim a huge credit on taxes they pay and get their corporate tax rate as low as 5%. Setting up a company in Malta also allows non-EU citizens residency in the country and access to all of Europe. On top of Malta&#8217;s benefit as an offshore hub for easy banking, low taxes, and openness to industries like gambling, 89% of all Maltese speak English. It makes living in Malta more than just a Mediterranean paradise.</p>\n<p><strong>5. Bahamas</strong><br>\nObtaining a residence permit for the Bahamas is easy, and living in the Bahamas is tax-free. Considering millions of tourists and an endless number of cruise ships head there each year, it doesn&#8217;t sound like a bad life. Beyond the beaches, 87% of Bahamans speak English well.</p>\n<p><strong>6. Sweden</strong><br>\nSimilar to Norway, most Swedes speak fluent English. Like many smaller wealthy European countries, they realized long ago that is was pretty essential for doing business with the world. 86% of Swedes speak English, with almost everyone under 50 in cities like Stockholm speaking it.</p>\n<p><strong>7. Denmark</strong><br>\nAs one of Europe&#8217;s most multi-cultural countries, English functions in some ways as a de facto lingua franca in Denmark after the official language of Danish. 86% of Danes speak English relatively well, just as all Scandinavians do. While Denmark may be one of the most socialist countries on earth, its economy now consistently ranks higher than that of the United States for <a href=\"http://www.heritage.org/index\" target=\"_blank\">economic freedom</a>. Expats may be turned off by the stunningly high prices in cities like Copenhagen (I paid $20 for a glass of wine last year), but they won&#8217;t likely be turned off by the lack of English skills.</p>\n<p>How large a role does language play in your travel or expat plans? Leave a comment below and discuss.</p>\n</div>","title":"No language barrier: 7 expat-friendly countries that speak English"}},"pageContext":{"id":"5b92397487be0583cfde6805"}}