{"data":{"mongodbDatabaseArticles":{"id":"5b937b2c87be056953db7d31","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"b479\" id=\"b479\" class=\"graf graf--h3 graf--leading graf--title\">Dating as a Digital&#160;Nomad</h1><h2 name=\"8398\" id=\"8398\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">My quest for love takes me across continents.</h2></p><p name=\"4702\" id=\"4702\" class=\"graf graf--p graf-after--figure\">In the last year, I&#8217;ve never spent more than a few weeks in the same city as someone I&#8217;ve dated. While my friends at home have on-and-off flings with their exes, my relationships tend to end with someone getting on an airplane.</p><p name=\"39b8\" id=\"39b8\" class=\"graf graf--p graf-after--p\">I am a digital nomad. I make a living by working on my computer as a consultant, and I make a life by bouncing between countries, cultures, and time zones.</p><p name=\"132b\" id=\"132b\" class=\"graf graf--p graf-after--p\">I don&#8217;t have a home, but I have worked from beaches where the sand is as white as pearls and the water is so clear that you can see the fish swimming at your feet. I touched the wall in a place where kings and queens were held as prisoners in England. I&#8217;ve walked through the ruins of ancient temples in Thailand. I&#8217;ve eaten at a Ramadan Bazaar in Malaysia (which, in my defense, was an accident&#8202;&#8212;&#8202;I forgot that most of the people there were fasting). But the thing that&#8217;s most incredible about my travels is the people that I&#8217;ve met and the people that I&#8217;ve loved.</p><p name=\"b674\" id=\"b674\" class=\"graf graf--p graf-after--p\">When you&#8217;re on the road and spending a lot of time with other travelers, things move very fast. You meet someone, and a few hours later, you&#8217;re sharing things that you haven&#8217;t even told your friends from back home.</p><p name=\"8da1\" id=\"8da1\" class=\"graf graf--p graf-after--p\">My first relationship as a digital nomad started two weeks before I left the United States. It was in the middle of a major life change; I&#8217;d given up my well-paying corporate job to freelance, given my landlord my notice, and prepared for life abroad. We had known each other for years, but it wasn&#8217;t until I was about to leave that I really got to know him on that level. I fell for him in between late-night cuddles and walks in the park; and when I got on an airplane to the Philippines a few weeks later, I cried throughout the 28-hour journey.</p><p name=\"6353\" id=\"6353\" class=\"graf graf--p graf-after--p\">Just a few weeks later, I met an Australian man while shooting hoops in the pool of a hostel. After a couple of drinks, I was confessing to some of the hard things I&#8217;d gone through in my life&#8202;&#8212;&#8202;like the fact that I&#8217;d been in foster care and homeless by the time I was eighteen. He told me about his time living as an expat in America and told me a story about his late grandmother&#8217;s wedding ring (one that he now wears regularly); later that night, we were tangled up in the sheets of a hostel private room. Thoughts of the boy I left behind in America were quickly forgotten.</p><p name=\"926c\" id=\"926c\" class=\"graf graf--p graf-after--p\">There&#8217;s something magical about those moments; for a brief moment in time, you&#8217;re in the same place and same mindset of another person. You&#8217;re both traveling to a foreign place. You&#8217;re both experiencing the same new things. And often, you both gave up things to be there. All those self-help books and rules about &#8220;don&#8217;t do this until date three, don&#8217;t do that until you&#8217;ve hit second base&#8221; go out the window. You don&#8217;t have enough time together to worry about playing games; instead, you form a real connection between humans that transcends cultural and geographical boundaries.</p><p name=\"5305\" id=\"5305\" class=\"graf graf--p graf-after--p\">A German guy that I met in Manila had to use Google Translate to understand my text messages to him. He spoke English fluently, but he had a hard time reading and writing. We still had amazing conversations; he&#8217;d just come from living in New Zealand for six months and already missed it. He taught me that it&#8217;s not the length of time that someone&#8217;s in your life that matters, but the marks they leave when they&#8217;re there.</p><p name=\"74d3\" id=\"74d3\" class=\"graf graf--p graf-after--p\">Sometimes, people are just there for fun. I hooked up with a guy from Denmark in a cave during a boat party. I didn&#8217;t learn his name until he came up on my suggested friends on Facebook a few weeks later.</p><p name=\"6473\" id=\"6473\" class=\"graf graf--p graf-after--p\">But as quickly as the moment comes, it&#8217;s gone before your mind can even register that it&#8217;s there.</p><p name=\"087a\" id=\"087a\" class=\"graf graf--p graf-after--p\">I once nearly missed my flight to Malaysia because I was out with a Czech guy the night before. We went out for one drink together, which ultimately led to tequila shots, dancing, skinny dipping, sex on the beach, and sex in a hostel shower. I kissed him goodbye, then had to get ready to get on a bus to the airport. While I got over my endorphin high, I ended up missing my bus. I didn&#8217;t end up in my airplane seat until three minutes after it was supposed to depart.</p><p name=\"5a73\" id=\"5a73\" class=\"graf graf--p graf-after--p\">At home, relationships are like volcanos. They build up slowly over time until they explode into the thing that we call love. But for the people that live on the road, our relationships are like earthquakes; they come quickly and without warning. Sometimes, they gently rattle our lives. Other times, they leave your life with such an upheaval that you&#8217;ll never be the same.</p><p name=\"3f10\" id=\"3f10\" class=\"graf graf--p graf-after--p\">Fortunately, by the time it&#8217;s over, you&#8217;re in different countries. You don&#8217;t have to avoid certain places because of your exes. There aren&#8217;t any worries about awkward run-in&#8217;s. And usually, you don&#8217;t have enough time together to form any bad opinions about the person.</p><p name=\"4b0e\" id=\"4b0e\" class=\"graf graf--p graf-after--p\">There was an English man that I was attracted to in Nacpan. One of the first things I said to him was that he looked like Ed Sheeran. Besides being attractive, he was charming and intelligent with just enough of a flair for adventure. We kissed behind the hostel, and then we snuck out to have sex behind a farm.</p><p name=\"5391\" id=\"5391\" class=\"graf graf--p graf-after--p\">When it was over, we were covered in mud; so, we decided to go skinny dipping. After a little coaxing, I took off my clothes, and together, we ran into the ocean. He promised that it would feel freeing&#8202;&#8212;&#8202;and he was right. It was one of the most freeing things I&#8217;d ever done in my life. We looked up at the stars and all the galaxies swirling around in the sky. When I looked down, I could see glowing plankton in the water&#8202;&#8212;&#8202;and when you moved your hand, it lit up like stardust. We made out again in the water, naked and surrounded by the stars and glowing plankton.</p><p name=\"102d\" id=\"102d\" class=\"graf graf--p graf-after--p\">The next day, I found out that he had a long-term girlfriend that he cheated on with me.</p><p name=\"7d86\" id=\"7d86\" class=\"graf graf--p graf-after--p\">It gets lonely at times. My worst moment hit me in Phuket. Prior to that, I&#8217;d been staying in hostels, where you&#8217;re sleeping in dorms shared between 8&#8211;20 people and surrounded by parties and chatter. When it got to be too much, I checked into a hotel.</p><p name=\"47bb\" id=\"47bb\" class=\"graf graf--p graf-after--p\">For the first time in weeks, I heard nothing but total silence. And for the first time, I felt lonely. I had no reason to feel that way. I was constantly meeting new people and surrounded by other travelers. I never felt like I had to hide who I was because people were constantly coming and going. I&#8217;d told them my stories and heard some of theirs.</p><p name=\"f2e7\" id=\"f2e7\" class=\"graf graf--p graf-after--p\">But none of us really knew each other.</p><p name=\"3138\" id=\"3138\" class=\"graf graf--p graf-after--p\">We didn&#8217;t have inside jokes. We couldn&#8217;t call each other out when someone started acting like a fool, because we didn&#8217;t know each other well enough. And I couldn&#8217;t rely on them without taking a chance on a stranger.</p><p name=\"963b\" id=\"963b\" class=\"graf graf--p graf-after--p\">Yet the happiest moments of my life had happened while I was surrounded by them. I wouldn&#8217;t have jumped off a cliff in Boracay if an Irish man that I had a crush on hadn&#8217;t joked that he&#8217;d push me off the ledge. These people were with me when I tried balut (fertilized duck egg) for the first time.</p><p name=\"ec4d\" id=\"ec4d\" class=\"graf graf--p graf-after--p\">They were also there during the darker periods of travel. I saw a dead man lying in the streets of Manila&#8202;&#8212;&#8202;his eyes wide open and shocked, as though he&#8217;d seen a ghost before he passed. I saw a man with down syndrome get beat up by a child no older than twelve, who then proceeded to take all his money. And I saw poverty&#8202;&#8212;&#8202;entire families living in shacks with no running water or electricity, children pulled out of school to work, and a 12-year-old girl dating a man in his mid-fifties because it was the only chance for a better life. The travelers that I surrounded myself with had seen the same things that I did&#8202;&#8212;&#8202;and we comforted each other when we were too shell-shocked to speak.</p><p name=\"e406\" id=\"e406\" class=\"graf graf--p graf-after--p\">And they were there for the quieter moments&#8202;&#8212;&#8202;such as conversations about food, telling jokes, and swapping stories about our travelers. These people knew me in a way that my friends back home never would.</p><p name=\"8f3a\" id=\"8f3a\" class=\"graf graf--p graf-after--p\">Sometimes, I think about what life will be like when I return home. I think about the modern conveniences that I&#8217;ve missed&#8202;&#8212;&#8202;like hot water, electricity that doesn&#8217;t go out every other day, and being able to get food delivered. I think about my friends and wonder how their lives are going without me. But most of all, I think about what it&#8217;ll be like to date again. I think of the dating rules that I&#8217;ll have to learn again and what it&#8217;ll be like to take the slow path to love. I think of all the memories I&#8217;ve made abroad and the crazy stories I have to tell&#8230; and how I&#8217;ll never be able to tell them to certain people without them thinking I was a lunatic.</p><p name=\"81a2\" id=\"81a2\" class=\"graf graf--p graf-after--p\">I&#8217;ve learned that it&#8217;s not the length of time that you&#8217;ve known someone that matters; it&#8217;s the moments you&#8217;ve shared that defines how people stay in your heart. And maybe there are some people that we&#8217;re not meant to get over. Maybe they&#8217;re meant to stay in our hearts&#8202;&#8212;&#8202;if not to be in our lives, but to teach and remind us how to love.</p><p name=\"6358\" id=\"6358\" class=\"graf graf--p graf-after--p\">I think about all these things and how I&#8217;ll someday need to take these memories and life lessons back home. It terrifies me because I&#8217;ll never be the same.</p><p name=\"38c7\" id=\"38c7\" class=\"graf graf--p graf-after--p graf--trailing\">So, I do what I do best: I keep running.</p></div>","title":"Dating as a Digital Nomad – Tessa Clare – Medium"}},"pageContext":{"id":"5b937b2c87be056953db7d31"}}