{"data":{"mongodbDatabaseArticles":{"id":"5b9248ac87be056953db7bd4","content":"<div><p>The <a href=\"http://www.theatlanticcities.com/housing/2013/10/san-francisco-exodus/7205/\">Bay Area</a>, center of tech, has become too expensive to live for many. Most other big cities like <a href=\"http://www.allmediany.com/articles/8419-a-mass-exodus-is-killing-new-york-city\">New York</a>, <a href=\"http://www.nytimes.com/2013/10/13/opinion/sunday/londons-great-exodus.html\">London</a>, <a href=\"http://www.businessinsider.com/global-cities-too-expensive-paris-2013-6\">Paris</a> are not far behind. Big cities are increasingly becoming a playground for the rich. If you're building a start-up, you don't have time to play and you're probably not rich (yet).</p> <p></p> <p>Remote working can be the answer to the problem. It makes the labor force more flexible and can help spread out our resource usage over larger geographic areas than just cities. It used to be an oddity to go the other side of the world and work from there, limited to mostly <a href=\"http://tropicalmba.com/\">TropicalMBA</a>-type internet marketers. But increasingly tech start-ups are considering it, simply because it's cheaper than renting an office. And with automation pushing labor costs lower, it may become the inevitable future of employment. And with that, a force for good.</p> <p>Good because working remotely can enable a lower cost of living for employees, make their work more efficient, put them in a more inspiring environment and offer them a better quality of living than in a busy metropolitan area with bad air quality, long commutes and expensive housing.</p> <p>Remote working also has one incredible competitive advantage. Your hiring pool becomes potentially worldwide. For example, if you're looking for a front-end developer, why limit yourself to recruiting the best front-end dev in your town, when you can hire the best in the world?</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Remote working is the future"}},"pageContext":{"id":"5b9248ac87be056953db7bd4"}}