{"data":{"mongodbDatabaseArticles":{"id":"5b95eeb987be0583274900ef","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">First Impression of Chiang Mai</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/first-impression-of-chiang-mai/\"><img class=\"aligncenter size-full wp-image-7514\" title=\"Great First Impressions!\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impression.jpg?resize=563%2C367&amp;ssl=1\" alt=\"First Impression of Chiang Mai\" width=\"563\" height=\"367\"></a></p>\n<p>We first stepped foot in Chiang Mai one year ago to date and it turned out to be one of the most pivotal moment in our lives. This was because our first impression of Chiang Mai confirmed that this was the city where we would begin our lives as expats.&#160; The blend of East-meets-West culture and the variety of things to do or buy, the genuinely down to earth locals, and the overall navigability of the Chiang Mai streets were all exactly what we were looking for in a new home. We immediately loved it!</p>\n<p><strong></strong></p>\n<p><img class=\" aligncenter\" title=\"We Love Chiang Mai, Thailand\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-49.jpg?resize=563%2C440&amp;ssl=1\" alt=\"Great First Impression of Chiang Mai\" width=\"563\" height=\"440\"></p>\n<p>We weren&#8217;t so sure if Thailand would work out as our new home overseas, so we did what few people do and used our honeymoon as an opportunity to strategically scope out Bangkok, Krabi, and Chiang Mai. Crazy, we know! Although Bangkok was incredibly exciting and Krabi&#8217;s beaches blew us away, we just weren&#8217;t convinced either city was right for us.&#160; But during the final leg of our trip, our first impression of Chiang Mai had us convinced that we had chosen a great place for us to move abroad.</p>\n<h2><p id=\"Our_First_Impression_of_Chiang_Mais_Demographics\"><p>Our First Impression of Chiang Mai&#8217;s Demographics</p></p></h2>\n<p>Ironically, our first impression of Chiang Mai&#8217;s blend of foreigners and locals reminded us of our home back in the States.&#160; There was such a variety of people, from single Australian backpackers to entire German families, from younger Chinese tour groups to older American expats, that the melting pot of cultures gave us that familiar feeling of home.&#160; Even though Chiang Mai has a huge tourism industry while being home to many expats, Thai people were still the majority throughout every part of town. It was a nice reminder that we were, in fact, still in Thailand.</p>\n<p><img class=\"aligncenter size-full wp-image-7500\" title=\"Chiang Mai is Full of Beautiful People\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-44.jpg?resize=563%2C356&amp;ssl=1\" alt=\"Chiang Mai Demographics\" width=\"563\" height=\"356\"></p>\n<p>Even still, the constant influx of foreigners had made their mark on Chiang Mai&#8217;s city life. Care for a chimichanga, falafel,&#160;or a pulled pork BBQ sandwich? Absolutely! Want to watch the latest American movie at the theater? Don&#8217;t mind if we do! We loved experiencing first hand that Chiang Mai was particularly well equipped in providing Western goods and services, and that we had access to non-Thai food and entertainment in the Old City if we were in need of some variety.&#160; It was also great to see that many stores, road signs and menus were written in English.&#160; Because Chiang Mai catered well to the needs of its foreign tourists and expats, we foresaw settling into our new home to be fairly easy.</p>\n<p><img class=\" aligncenter\" title=\"No Shortage of Western Food in Chiang Mai!\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-45.jpg?resize=563%2C421&amp;ssl=1\" alt=\"First Impression of Chiang Mai Food\" width=\"563\" height=\"421\"></p>\n<h2><p id=\"Our_First_Impression_of_Chiang_Mais_Locals\"><p>Our First Impression of Chiang Mai&#8217;s Locals</p></p></h2>\n<p>The majority of our time was spent in the Old City, which is considered the touristy area of Chiang Mai.&#160; Our first impression of Chiang Mai&#8217;s shopkeepers, street vendors, and bar owners within the Old City was overall very good. They were friendly and personable and weren&#8217;t rough around the edges like those we met in the touristy areas of Bangkok and Krabi.</p>\n<p><img class=\" aligncenter\" title=\"Happy Residents of Chiang Mai\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-50.jpg?resize=563%2C408&amp;ssl=1\" alt=\"Chiang Mai Food Stalls\" width=\"563\" height=\"408\"></p>\n<p>We were also barely hustled in Chiang Mai! How could we potentially call a place home when we were constantly badgered for money and treated like walking wallets? As we walked along Chiang Mai&#8217;s moat and explored its inner streets, we enjoyed sightseeing with barely a shout from a taxi or tuk-tuk driver. And while we dined in many of the open-air restaurants along Chiang Mai&#8217;s moat, few vendors approached our dinner table with trinkets for sale, which was very unlike the constant interruptions we received in the first two cities we visited.</p>\n<p>Best of all, not a single tailor shop salesman, with their slicked back hair and sly handshake, tried getting us to come into their shop and buy a $100+ suit, which was our biggest grievance in Bangkok and Krabi! In Chiang Mai, we felt like we could finally truly relax.</p>\n<p><img class=\" aligncenter\" title=\"One of Chiang Mai's Famous Walking Street Markets\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-25.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Chiang Mai Sunday Walking Street\" width=\"563\" height=\"422\"></p>\n<h2><p id=\"Our_First_Impression_of_Chiang_Mais_Connectivity\"><p>Our First Impression of Chiang Mai&#8217;s Connectivity</p></p></h2>\n<p>We weren&#8217;t quite sure how &#8220;off the grid&#8221; we would be once we arrived in Thailand, but our first impression of Chiang Mai&#8217;s technology infrastructure had us quite impressed. We were pleasantly surprised at how easily accessible and readily available the internet was at any of the dozens of hotels, coffee shops, and restaurants we visited.</p>\n<p><img class=\"aligncenter size-full wp-image-7508\" title=\"Chiang Mai is a Perfect Base for Digital Nomads\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions.jpg?resize=563%2C407&amp;ssl=1\" alt=\"First Impression of Chiang Mai WiFi\" width=\"563\" height=\"407\"></p>\n<p>In fact, Chiang Mai&#8217;s WiFi connections were strong, reliable, and comparable to the Western standards that we were familiar with. We also had the chance to visit the malls (yes, plural) and saw plenty of stores were selling state of the art electronics and home appliances. Contrary to what some people may think, Chiang Mai does not feel like a third world country!</p>\n<h2><p id=\"Our_First_Impression_of_Chiang_Mais_Traffic\"><p>Our First Impression of Chiang Mai&#8217;s Traffic</p></p></h2>\n<p>We were in for a surprise the first time we saw Thai traffic. Between people driving on the left side of the road, seeing an incredible number of motorbikes (with families of five, no doubt) whipping around cars, and the general consensus that road rules really are just guidelines, Thai traffic was overwhelming.</p>\n<p><img class=\"aligncenter size-full wp-image-7502\" title=\"Definitely Recommend Sticking with a Motorbike!\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-47.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Chiang Mai Traffic\" width=\"563\" height=\"422\"></p>\n<p>Although Bangkok&#8217;s traffic was mind-boggling, our first impression of Chiang Mai&#8217;s traffic had us signing with relief. We saw an immediate improvement in driver mentality and traffic intensity. We didn&#8217;t dare rent a car or motorbike in Bangkok, but we were comfortable enough to do so in Chiang Mai. It took a little while to understand the rules of the road and the &#8220;driving dance&#8221; it entails, but we got it soon enough and we whizzing around like the locals.</p>\n<p><img class=\"aligncenter size-full wp-image-7503\" title=\"First Attempt at Chiang Mai Driving!\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impressions-12.jpg?resize=563%2C421&amp;ssl=1\" alt=\"Chiang Mai Motorcycle Rental\" width=\"563\" height=\"421\"></p>\n<h2><p id=\"Our_First_Impression_of_Chiang_Mais_City_Layout\"><p>Our First Impression of Chiang Mai&#8217;s City Layout</p></p></h2>\n<p>We loved Chiang Mai&#8217;s layout because everything is centered on the Old City. Surrounding Chiang Mai&#8217;s Old City square moat is a two-way mini beltway in which the outer loop goes clockwise and inner loop goes counterclockwise. It is incredibly easy to access the side streets or to make a u-turn. Furthermore, larger roads branch out from the Old City&#8217;s mini beltway like spokes on a wheel and then further connect to inner and outer ring highways.</p>\n<p><br>\n<a href=\"https://maps.google.com/?ie=UTF8&amp;t=p&amp;ll=18.781354,98.994884&amp;spn=0.081261,0.096474&amp;z=13&amp;source=embed\">View Larger Map</a></p>\n<p>As visitors, our first impression of Chiang Mai was that it was also easy to navigate without a car or motorbike.&#160; We admit the sidewalks were (and still are) in poor condition, but we managed to explore much of the Old City on foot. We always knew where we were in relationship to the square moat. When we got tired, a quick hail to one of the tuk-tuks was all it took to get a short ride back to our hotel.</p>\n<p><img class=\"aligncenter size-full wp-image-7525\" title=\"Chiang Mai's Iconic Moat\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/10/Chiang-Mai-First-Impression-Moat.jpg?resize=563%2C433&amp;ssl=1\" alt=\"Chiang Mai Moat\" width=\"563\" height=\"433\"></p>\n<h2><p id=\"Your_First_Impression_of_Chiang_Mai_was_that_Good_Huh\"><p>Your First Impression of Chiang Mai was that Good, Huh?</p></p></h2>\n<p>Absolutely. The five days we spent in Chiang Mai changed our lives forever. Our first impression of Chiang Mai convinced us that it was well worth our time and money to make a trip to Thailand and see for ourselves what the city had to offer before we made the big move. And now, here we are, enjoying a life we could have never had back in the States.</p>\n<h3 class=\"sd-title\"><p id=\"Like_this\">Like this:</p></h3><p class=\"likes-widget-placeholder post-likes-widget-placeholder\"><p class=\"button\"><p>Like</p></p> <p class=\"loading\">Loading...</p></p><p class=\"sd-text-color\"></p><a class=\"sd-link-color\"></a><p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"First Impression of Chiang Mai"}},"pageContext":{"id":"5b95eeb987be0583274900ef"}}