{"data":{"data":{"edges":[{"node":{"id":"5b92397b87be0583cfde680d","title":"America’s bad excuse for citizenship-based taxation","source":"nomadcapitalist","summary":"No other country, “civilized” or not, has such a requirement.\nI would argue that Belgium and Norway are better places to live, eat well, raise a family, and bank – Norway is even better at managing their fiscal affairs.\nIt’s bad enough American embassies are about the only ones that take up multiple city blocks surrounded by huge fences and nasty-looking armed guards.\nOnce inside, you get barked at by staff who get vacation days on both US holidays and whatever country they’re working in.\nIf I ever get stuck in a war zone, I wouldn’t trust the US consulate to keep me safe.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2013/06/eritrea-us-citizenship-based-taxation.jpg"}}},{"node":{"id":"5b92397a87be0583cfde680c","title":"Five US Tax Myths about expats, nomads, and renunciation","source":"nomadcapitalist","summary":"In this article, I want to address some of the most popular myths about citizenship-based taxation for expats, digital nomads, and renunciants in the United States.\nHowever, as is so often the case, his US tax advisor was totally clueless as to the many tax strategies available for expats and had not advised his client.\nFor two years in a row, I have gladly paid zero dollars and zero cents in US taxes; that’s $0 in federal income tax, $0 in state income tax, and $0 to Social Security and Medicare.\nIn fact, the United States is one of the friendlier developed countries for digital nomads.\nFor the reasons listed above and others, many expats and nomads assume that they don’t qualify for many of the tax exemptions available to others.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/06/us-tax-myths.jpg"}}},{"node":{"id":"5b92397987be0583cfde680b","title":"How to Go Where You’re Treated Best","source":"nomadcapitalist","summary":"Nomad Capitalist, however, is all about my five magic words: “go where you’re treated best”.\nMost people don’t go where they’re treated best because the idea of doing anything outside of Adelaide, or Salt Lake City, or Manchester seems frightening.\nThat’s why, today, I want to reiterate the importance of going where you’re treated best.\nGo where you are treated best.\nIf you want to learn more about going where you’re treated best for your specific situation, my best blog posts are a great place to start getting inspiration.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/05/how-to-go-where-youre-treated-best.jpg"}}},{"node":{"id":"5b92397987be0583cfde680a","title":"Why I decided to get citizenship through investment","source":"nomadcapitalist","summary":"A lawyer friend of mine helped one of his clients obtain his first economic passport more than a decade ago.\nWhat economic citizenship has taught meOne of the things you’ll see in this blog series is that I’m open to changing my mind when circumstances change.\nFirst, each article will feature notes from my journal as I underwent the citizenship by investment process.\nIt will also cover issues surrounding second citizenship such as citizenship renunciation, financial matters, visas, travel and more.\nGet your own economic citizenship and second passportMy goal in doing this series is to help as many people as possible become global citizens by obtaining second citizenship.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/10/Economic-citizenship-series-passport.jpg"}}},{"node":{"id":"5b92397787be0583cfde6809","title":"Where to incorporate your Amazon FBA business to reduce taxes","source":"nomadcapitalist","summary":"However, if you’re trying to decide where to set up a company to reduce your taxes and liability, there are a few factors that you need to consider.\nMore importantly, there are also things that you can do to help reduce, or even eliminate, the tax that you pay.\nWhen you trade online, there is a high possibility that you’re going to run into jokers and fraudsters.\nIf you live in The USA that company could be an LLC (limited liability company.)\nTaxWhere you live and how you run your business largely dictates how much tax you’re going to pay.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/05/where-to-incorporate-amazon-fba-business.jpg"}}},{"node":{"id":"5b92397687be0583cfde6808","title":"9 Expat-Friendly Countries with No Capital Gains Taxes","source":"nomadcapitalist","summary":"Paying capital gains tax is not only a pain, but it also discourages investment and stops capital from reaching its highest use.\nAround the world, there are dozens of countries that impose no taxes on capital gains in one way or another.\nThe fact that Belize boasts zero capital gains taxes for residents or non-residents alike doesn’t hurt its appeal, either.\nAs part of its tradition of respect for capital, Hong Kong does not tax capital gains.\nUnrestricted shares and options are, however, free from capital gains taxes.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/03/belize-no-capital-gains-tax.jpg"}}},{"node":{"id":"5b92397587be0583cfde6807","title":"How to choose the best second passport","source":"nomadcapitalist","summary":"When you’re looking at getting a passport, especially when you’re looking at getting a second passport (which is what we talk about here at Nomad Capitalist) you need to be looking at more than just where you can go with the passport for visa-free travel.\nPersonally, I think it’s important to figure out which citizenship is actually best for you, especially when it comes to a second citizenship.\nOn the other hand, U.S. citizenship isn’t necessarily the best citizenship out there.\nWhat else can your second passport offer you?\nIf you’re looking to get a second passport, the most important thing (if you’re already a U.S., Canadian, or Australian citizen) isn’t where you can go but what else that passport has to offer.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/04/How-to-choose-the-best-second-passport-.png"}}},{"node":{"id":"5b92397487be0583cfde6806","title":"This is the fastest improving passport in the world","source":"nomadcapitalist","summary":"Also, because they are so good for visa-free travel now, most western passports have nowhere to go but down.\nWhat makes a Serbian passport good?\nHowever, the Serbian passport has taken off substantially since then.\nThen came Japan, a notoriously hard country for Tier B and Tier C passport countries to visit.\nHere’s the Problem…You can’t easily get a Serbian passport.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/05/serbia-fastest-growing-passport.jpg"}}},{"node":{"id":"5b92397487be0583cfde6805","title":"No language barrier: 7 expat-friendly countries that speak English","source":"nomadcapitalist","summary":"If you move to a larger city, for example, your chances of not only finding expats who speak your language, but locals who speak English as well are much greater.\nIn fact, there are nearly two dozen countries where this is the case, in addition to some 58 countries where English is the official language.\nI researched some of the most expat-friendly countries that speak English, and you’ll be pleasantly surprised.\nBermudaIt only makes sense that Bermuda, as a British Overseas Territory, would be among the list of countries that speak English.\nDenmarkAs one of Europe’s most multi-cultural countries, English functions in some ways as a de facto lingua franca in Denmark after the official language of Danish.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/03/countries-that-speak-english-expats.jpg"}}},{"node":{"id":"5b92397287be0583cfde6804","title":"Lessons Learned from Obtaining Economic Citizenship","source":"nomadcapitalist","summary":"This is Week TwentyTwo of the 26 week series #MyEconomicCitizenship .\nEach week I give you a glimpse into my life as I share the ups and downs experienced in pursuit of a second passport through economic citizenship.\nEach feature includes my weekly journal walking you through the process of obtaining economic citizenship, followed by an in-depth look at some of the most important topics people considering economic citizenship should understand.\nTo read the entire series, just click hereDateline: Tbilisi, GeorgiaBecoming an economic citizen has been an interesting process for me.\nWhen I started out, the idea was to work with Peter McFarland and Associates to get an economic citizenship in order to increase my flexibility.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/04/Lessons-learned-from-obtaining-economic-citizenship.png"}}},{"node":{"id":"5b92397187be0583cfde6803","title":"How to Use an Offshore Company for Cryptocurrency Tax Benefits","source":"nomadcapitalist","summary":"How to Use an Offshore Company for Cryptocurrency Tax BenefitsDateline: Kuala Lumpur, MalaysiaGo to any financial website, entrepreneurial blog, or social media platform where the nomad community is present these days and you will hear the constant buzz about one thing: cryptocurrency.\nThe first cryptocurrency — Bitcoin — emerged in 2008 in the wake of the financial crisis and Occupy Wall Street protests when faith in big banks was at its lowest.\nStructureIn regards to your overall offshore structure, setting up a cryptocurrency company in and of itself is not the issue.\nIf it were up to most folks involved in cryptocurrency, Bitcoin and other crypto ownership would remain anonymous.\nOne thing that people often ask me is how to avoid tax on their cryptocurrency gains?","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/03/cryptocurrency-for-nomads-1.jpg"}}},{"node":{"id":"5b92397087be0583cfde6802","title":"How to open offshore accounts and bank remotely","source":"nomadcapitalist","summary":"And, yes, these are used as excuses to tighten up control and to marginalise the banks that are providing offshore accounts remotely.\nBut with tighter scrutiny and control measures, not only is it becoming more difficult for these banks to offer remote account opening, it’s becoming more difficult to go through the process of opening offshore accounts.\nNow I know some folks in Belize, where bank accounts are becoming harder and harder to manage remotely.\nOf course, it means that you have to have an attorney in the country where you want to set up your offshore accounts.\nGo the extra mileSo, in short, opening offshore accounts remotely isn’t a great strategy.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/04/How-to-open-an-offshore-account-and-bank-remotely.png"}}},{"node":{"id":"5b92396f87be0583cfde6801","title":"Global FATCA: How automatic information sharing affects your bank account","source":"nomadcapitalist","summary":"Somehow, the government that runs everything else inefficiently is incredibly effective when it comes to getting to all your personal financial information.\nNow, however, not only has resistance all but disappeared, but a new global FATCA is on its way.\nMany countries liked the idea of FATCA simply because they hoped it meant they could get reciprocal information on their own citizens.\nAnd, since the Unites States is not the only indebted country in the world, desperate for more information on their wealthy, global citizens, new global FATCA is at our doorstep.\nSo, we know their intentions, but how exactly will this new global FATCA work?","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/10/Global-FATCA.png"}}},{"node":{"id":"5b92396f87be0583cfde6800","title":"How to choose the best offshore service providers","source":"nomadcapitalist","summary":"However, it’s also a result of hiring the right professionals.\nI’ve made no secret of the fact that hiring the right lawyers is a crucial element to success offshore.\nHaving tried both ways — not just in the offshore world, but in businesses overall — I can tell you that having the right professionals to help you is crucial.\nWhat criteria should you use to find the best offshore service providers?\nMore importantly, by doing new things, I get to try out new programs and new offshore service providers.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/07/best-offshore-service-providers.jpg"}}},{"node":{"id":"5b92396d87be0583cfde67ff","title":"10 ways to use the Law of Abundance with Flag Theory","source":"nomadcapitalist","summary":"10 ways to use the Law of Abundance with Flag TheoryDateline: Barcelona, SpainMy new year’s resolution last year was to focus more on action, and I invited readers like you to share in that with me.\nThat’s why I announced a goal to help fellow Nomad Capitalists plant 5,000 flags and diversify with offshore bank accounts, passports, and more.\nI realized that I had grown up focusing on the opposite of abundance, which they called the “Law of Scarcity”.\nHowever, I’ve come to realize that flag theory and internationalization can actually help you bypass the negativity and “go where you’re treated best”.\nTravel to open a bank accountRemote openings for offshore bank accounts are great.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/01/law-of-abundance-flag-theory.jpg"}}},{"node":{"id":"5b92396d87be0583cfde67fe","title":"Why buying a house is a bad investment","source":"nomadcapitalist","summary":"REAL real estate investmentsI love real estate.\nBut not every real estate purchase counts as a real estate investment.\nTo make matters worse, real estate agents go around spreading the erroneous belief that a home purchase is an investment.\nUnlike in the actual investment industry, real estate agents don’t have an obligation to hand out the facts.\nThe worst investmentIf you’re still not convinced that buying a house is a bad investment, let me do a little more explaining.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/09/Why-buying-a-house-is-a-bad-investment.jpg"}}},{"node":{"id":"5b92396b87be0583cfde67fd","title":"Back to the Gold Standard: Will there be a Gold Backed Currency?","source":"nomadcapitalist","summary":"Back to the Gold Standard: Will there be a Gold Backed Currency?\nIn fact, no currency in the world today is on the “gold standard”.\nThe gold standard is a monetary policy in which a currency is based on a quantity of gold.\nUnder a gold standard, anyone holding paper money can turn it in for a fixed amount of gold from the country’s gold reserve.\nHow to Benefit from a New Gold StandardWhile there is no gold standard for you to participate in anywhere in the world, you can diversify your wealth into new asset classes and internationally to achieve some of the benefits of an actual gold standard.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/08/gold-backed-currency-yuan.jpg"}}},{"node":{"id":"5b92396a87be0583cfde67fc","title":"How to Get a US E-2 Visa: the Ultimate Guide","source":"nomadcapitalist","summary":"The E-2 Investor VisaThe E-2 Treaty Investor visa allows an investor to live in the US in exchange for a significant investment made to the country’s economy.\nUsually, a treaty trader visa or a treaty investor visa, like E-1 or E-2, is one of the best options.\nUnlike other investor visa programs, passive investments, like stocks and bonds, will not grant you eligibility for the E-2 visa.\nOne of the biggest benefits of the E-2 visa over the EB-5 visa is the travel flexibility.\nWhile the legal fees for the E-2 visa tend to be lower than for the EB-5 visa, you have to consider that you will have to renew the E-2 visa every few years, depending on which E-2 country you hold citizenship to.","info":{"author":"Andrea Pockovic","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/08/how-to-get-an-e2-visa-usa.jpeg"}}},{"node":{"id":"5b92396987be0583cfde67fb","title":"“Hell Yes!”: 2 hard lessons I learned while going offshore","source":"nomadcapitalist","summary":"Lesson #2: Say “hell yes!” or “no”This is one that has cost me a lot of money, and one that I’ve been rather vocal about in recent years.\nI first heard the actual phrase “hell yes or no” from friend-of-a-friend Derek Sivers, and I’ve adapted it to my own experiences.\nWhile David’s intentions were good, he is in a situation where it’s hard to say “hell yes!” to going offshore.\nAnd for Rich, saying “hell yes!” was immediate.\nInstead, try saying “hell yes!” or “no”.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/06/hell-yes-or-no-offshore.jpg"}}},{"node":{"id":"5b92396887be0583cfde67fa","title":"The World’s Highest Government Bond Interest Rates","source":"nomadcapitalist","summary":"However, my curiosity got the best of me and I decided to create a list of the world’s highest government bond interest rates.\nArgentinaGovernment Bond Interest Rate: 26.2% (One year)Argentina is no stranger to hyperinflation or economic collapse.\nBahrainGovernment Bond Interest Rate: 6.4% (Two years)More promising is the Gulf nation of Bahrain.\nNamibiaGovernment Bond Interest Rate: 8.1% (One year)The Namibian dollar may have the worst peg on the planet.\nTurkeyGovernment Bond Interest Rate: 23.3% (One year)Admittedly, one of my favorite things to do at one point was check the USD/TRY exchange rate as Turkey’s lira plunged.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/08/highest-yields-government-debt.jpg"}}},{"node":{"id":"5b92396787be0583cfde67f9","title":"5 tax strategies for digital nomads and location independent entrepreneurs","source":"nomadcapitalist","summary":"5 tax strategies for digital nomads and location independent entrepreneursLast updated January 7, 2017Dateline: Brasov, RomaniaIn British electronica trio Years and Years‘ newest single, King, vocalist Olly Alexander sings about the shackles of a bad relationship and how he wants out.\nHere’s the dirty little secret: many digital nomads and location independent entrepreneurs are not in tax compliance back home.\nOn top of that, most digital nomads I’ve met in my travels haven’t properly structured their affairs to legally reduce or eliminate taxes.\nWhich is why we’ve taken the time to tell you about these five important tax strategies for digital nomads.\nThat’s why obtaining a second residency can be an important step for digital nomads.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/04/digital-nomad-tax-strategies-2.jpg"}}},{"node":{"id":"5b92396787be0583cfde67f8","title":"Two ways for entrepreneurs to KEEP more of their money","source":"nomadcapitalist","summary":"He moved to Asia, where he could have the same lifestyle or better but without the huge tax bill.\nHe’s also investing his money with much better rates of return so he will hit his goal of being a multimillionaire much faster.\nNow I’m reading that the numbers aren’t that much different even if you’re earning right up to low six-figure salaries.\nHe’s reduced his tax burden, he’s saving a lot of money, he lives where he wants, and he doesn’t need to show off to anybody.\nYou can learn more about how to cut your tax bill legally at NomadCapitalist.com.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/04/entrepreneurs-money-freedom.jpeg"}}},{"node":{"id":"5b92396787be0583cfde67f7","title":"Which countries allow Dual Citizenship and which don’t?","source":"nomadcapitalist","summary":"Germany*.As of 2007, Germany recognizes dual citizenship, but only with other countries within the EU and Switzerland.\nIreland does allow dual citizenship.\nDue to many Kosovars having Serbian citizenship, and even third citizenships in places they migrated to (such as Germany), Kosovo allows dual citizenship.\nAs part of an argument with Hungary over its citizenship by descent policies, Slovakia limits dual citizenship in many cases.\nWhile children born on Venezuelan soil are entitled to Venezuelan citizenship (regardless of their parents’ nationalities), dual citizenship is only possible until age 25.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/04/which-countries-allow-dual-citizenship.jpg"}}},{"node":{"id":"5b921d3087be0571ac1b050c","title":"Products and Services","source":"nomadcapitalist","summary":"If you are searching for an immediate solution and results, and you would rather see your problems solved than keep researching, the best option for you is to talk to a specialist.\nNomad Capitalist’s founder and CEO, Andrew Henderson, is talking to a selected number of people every month to help them get beyond research and into achieving results.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2f87be0571ac1b050b","title":"Nomad Capitalist Reviews and Testimonials","source":"nomadcapitalist","summary":"As someone who was setting up their marketing consultancy so it could operate anywhere in the world, I can’t say how happy I am that I found the Nomad Capitalist team.\nFrom day 1, Andrew and the team were all about understanding about what I needed and were very clear about what had to be setup.\nThey made sure that my biggest concerns (being able to access my money whenever I needed it!)\nwere all taken care of and offered some great services on getting my plans and paperwork sorted!\nCan’t recommend enough.","info":{"author":"Ross O'Lochlainn, Andrew Brown, Steve, Patty Kilberg, Joshua Rea, Conner Hogan, Reid Kirchenbauer, Nathan Rose, James Lucas, Jiah Kim","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2e87be0571ac1b050a","title":"Nomad Capitalist Podcast","source":"nomadcapitalist","summary":"Welcome to the Nomad Capitalist Podcast","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2c87be0571ac1b0509","title":"Keep more of your money. Build your freedom.","source":"nomadcapitalist","summary":"Five million people come to us every year seeking legal strategies to reduce their tax bill, create personal freedom, and become global citizens.\nMore money.\nMore freedom.\nMore options.","info":{"author":"Joshua Rea, Nathan Rose, Steve, Patty Kilberg, Ross O'Lochlainn","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2c87be0571ac1b0508","title":"The five highest bank interest rates in emerging markets","source":"nomadcapitalist","summary":"Tired of earning tiny interest rates in your local bank?\nLooking for some of the highest interest rates in the world?\nOf course, these high emerging market interest rates come with serious caveats: concerns about bank stability, troubled foreign currencies, and even the Mafia stealing your money.\nThe five highest emerging market bank interest rates5.\nHowever, Turkish banks are paying some of the world’s highest interest rates these days in order to attract deposits in Turkish lira.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/04/turkey-bank-high-interest-rates.jpg"}}},{"node":{"id":"5b921d2b87be0571ac1b0507","title":"Offshore Banking: How to legally open an offshore bank account","source":"nomadcapitalist","summary":"Open an offshore bank account.\nThat means the offshore bank account I opened offered a return nearly ten times higher than any bank in the USA.\nYou Can Open an Offshore Bank Account yourself…… But you need to be extremely careful about where you do it.\nThe truth is, certain offshore bank accounts (even those widely regarded as the best offshore bank accounts) might not be best for you.\nGetting the Right HelpCould you open an offshore bank account by yourself?","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2a87be0571ac1b0506","title":"How to Legally Lower Your Taxes","source":"nomadcapitalist","summary":"The only difference between death and taxes is that death doesn’t get worse every time Congress meets.\nBy moving your money offshore in a safe, intelligent and legal way, you can employ the same strategies that the global elite does to reduce your tax burden.\nEvery day, people like you and me are saving money on their taxes by employing offshore strategies.\nConsider the following case studies:Arthur is a client who came to me interested in saving money on his taxes.\nHe was expecting to pay 20% of the 300,000 pounds that he’d earned in 2015 to taxes and wanted to find another way so that his business could continue to thrive.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2a87be0571ac1b0505","title":"Why and How I Renounced My US Citizenship: My Expatriation Story","source":"nomadcapitalist","summary":"In the months since I’ve renounced, I’ve talked about the decision with my close colleagues, friends, and advisors.\nIt took me years of really going through the process to come to the conclusion, but the time had finally come.\nThe idea that the renunciation process will be adversarial is untrue.\nWhat I love about the renunciation process is that it’s actually a very dignified process.\nThe renunciation process, on the other hand, is actually done in an office and you sit there and talk to them in a dignified process.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/03/why-i-renounced-us-citizenship-1.jpg"}}},{"node":{"id":"5b921d2887be0571ac1b0504","title":"A word of caution on Panama banks and offshore accounts","source":"nomadcapitalist","summary":"Of course, anyone who recalls what happened to Panama banks knows that things didn’t end well.\nIn the end, Panama — and Panama banks — learned the lesson that so many other countries learn: taking peoples’ money doesn’t lead to economic progress.\nHowever, even after Panama banks took action to remove themselves from the lists of uncooperative bank jurisdictions, the OECD wanted more.\nPanama banks made a completely one-sided deal to slit their own throat.\nToday, Panama banks might as well be in Uncle Sam’s back pocket.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/02/caution-offshore-accounts-at-Panama-banks.jpg"}}},{"node":{"id":"5b921d2787be0571ac1b0503","title":"Who is Andrew Henderson?","source":"nomadcapitalist","summary":"Hi, I’m Andrew Henderson.\nBut who is Andrew Henderson?\nYou’re probably wondering, can Andrew Henderson help ME?\nThe aforementioned Panama lawyer takes on as many clients he can, and anyone who will pay the bill.\nDoing this “offshore stuff” is kind of like that old example of doubling a penny every day.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/01/as-seen-on-big-nomad-capitalist-reviews.jpg"}}},{"node":{"id":"5b921d2587be0571ac1b0502","title":"10 countries with the safest offshore banks in the world","source":"nomadcapitalist","summary":"While we do talk about emerging offshore banking jurisdictions that offer higher interest rates and will play a larger role in the future, those seeking conservative banking options will appreciate knowing the safest offshore banking countries.\nWe’ve analyzed the report and listed countries with the greatest number of the world’s safest banks.\n10 safest countries for offshore banking10.\nCanadaFor Americans, Canada might not be the first thing that comes to mind when thinking of “offshore banking”—nevertheless, it has some of the world’s safest banks.\nAccording to Global Finance, the tiny Asian financial center is home to three of the world’s safest banks: DBS (#12), OCBC (#13), and UOB (#14).","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/04/Safest-banking-offshore.jpg"}}},{"node":{"id":"5b921d2487be0571ac1b0501","title":"The best offshore banks for 2015 (even for Americans)","source":"nomadcapitalist","summary":"Forgive me if that sounds harsh, but the reality is that many Western banks could go bust at any minute.\nThe reality is that any foreign bank in a jurisdiction other than your own can be considered an “offshore bank”.\nOffshore banks have long had a reputation for being in shady, lawless “third world countries” on half-deserted islands.\nWhere are the best offshore banks?\nMiddle Eastern banks are frequently capitalized far better than Western banks that are stuffed with worthless paper.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/03/the-best-offshore-banks-world.jpg"}}},{"node":{"id":"5b921d2487be0571ac1b0500","title":"Labuan: Asia’s near-secret haven for an offshore corporation","source":"nomadcapitalist","summary":"Hong Kong was the 800-pound gorilla in the Asian offshore sector at the time, and Malaysians wanted in on the game.\nHow to set up an offshore corporation in LabuanSetting up a company in Labuan is straightforward.\nDespite the Islamic influence in Malaysia, Labuan mostly uses common law, and non-Muslims are not subject to any Islamic finance dictates.\nIf you’re looking for an offshore company with a bit more flexibility than some of the banana republic jurisdictions, it might be one worth considering.\nIf you are interested in conducting your offshore business in Labuan, contact Nomad Capitalist for our expert advice.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2013/04/labuan-malaysia-offshore.jpg"}}},{"node":{"id":"5b921d2287be0571ac1b04ff","title":"Nomad Capitalist Blog","source":"nomadcapitalist","summary":"A passport portfolio probably sounds like a fantasy, but for more and more internationally oriented capitalists, this is becoming not only a reality, but a brilliant way to save time and money by circumventing immigration laws that get in the way of doing business or...","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/11/Emerging-market-business-opportunity-in-Georgia.jpg"}}},{"node":{"id":"5b921d2287be0571ac1b04fe","title":"Offshore Company: How a foreign corporation can reduce taxes","source":"nomadcapitalist","summary":"Offshore company requirements for US citizensThe US government has some tight restrictions on offshore companies.\nYou can reduce taxes with an offshore corporation, but you won’t benefit from a low tax if you get whacked with penalties and fees.\nTry as those homebodies might to reduce taxes, tax-free compound interest from your offshore company will blow their onshore earnings out of the water.\nWell, offshore corporation misinformation isn’t the only thing you need to be wary of…There are plenty of cheap “start an offshore company” service providers advertising on the internet.\nThe next step after “reduce taxes” shouldn’t be “reduce jail time.” You’re asking for trouble if you don’t vet these cheap offshore corporation services before buying in.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d2087be0571ac1b04fd","title":"Second Passport: How to get dual citizenship","source":"nomadcapitalist","summary":"A number of countries don’t allow dual citizenship and will require you to relinquish your current citizenship.\nWhile I talk extensively about why some US citizens may want to expatriate, giving up one citizenship for the next doesn’t exactly meet the standards of a “second citizenship”.\nYou will never qualify for a second citizenship if you’re not a legal resident; that means simply staying in a country on tourist visas won’t help you.\nHere are the some of the easiest places to become a citizen through “boots on the ground” second residency.\nBelgium used to offer citizenship after just three years of living there and having some economic activity in the country.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2013/03/singapore-passport.jpg"}}},{"node":{"id":"5b921d2087be0571ac1b04fc","title":"Still the easiest place in the world to open an offshore bank account","source":"nomadcapitalist","summary":"Still the easiest place in the world to open an offshore bank accountDateline: Tbilisi, GeorgiaI spent much of the flight from Kuala Lumpur to Istanbul reading a personal development a friend recommended to me.\nWhile offshore banking around the world — from the Caribbean to Asia — has become more and more difficult (especially for US persons), Georgia is hands down the easiest place in the world to open an offshore bank account today.\nHow easy is it to open an offshore bank account?\nSo, what is the easiest way to open an offshore bank account here?\nHow to open a bank account in GeorgiaYou don’t need a lot to get started banking in Georgia.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/12/georgia-easiest-country-open-bank-account.jpg"}}},{"node":{"id":"5b921d1f87be0571ac1b04fb","title":"5 Reasons Every Crypto Investor Needs a Second Residency and Second Passport","source":"nomadcapitalist","summary":"Here are the top five reasons every serious crypto investor needs a second residency or passport:1.\nIf you’re a US citizen, getting a second passport should be your top priority because the US government will follow you no matter where you go.\nHaving a second passport as a US citizen is a way to have a call option.\nUS citizens, especially, need a second passport, but you never know what other countries are going to do that will create the need for a second passport.\nThe bigger question is, where do you get a second residence or passport?","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/04/crypto-investor-second-passport-bitcoin.jpg"}}},{"node":{"id":"5b921d1e87be0571ac1b04fa","title":"Four reasons to use a Hong Kong corporation for your business","source":"nomadcapitalist","summary":"However, if you’re a serious entrepreneur or run an already successful business, a Hong Kong corporation could be the answer for you.\nStingy banks aside, having a Hong Kong corporation can be a great option for your offshore company.\nA Hong Kong corporation doesn’t pay tax on business outside of Hong KongIt’s possible to avoid Hong Kong corporate tax altogether using a trading company.\nOf course, Americans must maintain their accounting records to US GAAP standards, but having a Hong Kong corporation gives you more flexibility.\nHong Kong is a strong, stable jurisdiction for banking and corporationsI sometimes find it a bit funny that people bash on Hong Kong for its ties to China — which has nothing to do with Hong Kong corporations — but are perfectly willing to form their business on some random island.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2013/07/reasons-to-use-hong-kong-corporation.jpg"}}},{"node":{"id":"5b921d1e87be0571ac1b04f9","title":"How to Renounce Your US Citizenship: the Ultimate Guide","source":"nomadcapitalist","summary":"But he did get away with it… because the ability to renounce your citizenship is an inherent right available to everyone.\nThe first component of the renunciation trend we have to understand is what it actually means to renounce citizenship.\nIf they choose to renounce their citizenship to free themselves of these obligations, it follows that they also relinquish their claim to any of the rights that come with their citizenship.\nMore than any other factor, FATCA is what has inspired so many people to take drastic action and renounce their US citizenship.\nYou can learn more about each test in our article on the tax problems for those who renounce US citizenship.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/01/renounce-us-citizenship-guide-1.png"}}},{"node":{"id":"5b921d1c87be0571ac1b04f8","title":"3 new Flag Theory strategies for expats living overseas","source":"nomadcapitalist","summary":"Here are three strategies I believe you can use to maximize your freedoms while living overseas…The No Capital Cities StrategyPersonally, I love big cities.\nNow, take a huge influx of capital, small land area, and an often tropical climate and imagine what happens when people jam in there.\nInstead of living in Panama, live in Colombia.\nThe Regional Influence StrategyEvery time I travel through Central America, I notice one thing: it feels a bit like the United States.\nIn summary, if you’re looking to avoid the far reach of the United States, move far away from the United States.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/01/flag-theory-strategies-russia-usa.jpg"}}},{"node":{"id":"5b921d1b87be0571ac1b04f7","title":"Flag Theory and Perpetual Travel","source":"nomadcapitalist","summary":"Put simply, Flag Theory is the idea that you must “go where you’re treated best.”Every time you base a part of your life in a new country, you plant a “flag.”Some concepts behind flag planting have been around for decades (we’ll go over three flag theory and five flag theory a bit later).\nHill added two additional flag planting strategies to the original Three Flag Theory.\nThis flag is similar to the first flag planting strategy from three flag theory, but adds an important element: your country of citizenship should not control your movements.\nAdditional ways to plant flags — Nomad Flag TheoryBoth Three Flag Theory and Five Flag Theory are fine starting points.\nAs you continue to understand what Flag Theory really means, you’ll see many opportunities around the world for flag planting.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d1a87be0571ac1b04f6","title":"The fastest countries in the world to become a citizen","source":"nomadcapitalist","summary":"The fastest ways to become a citizen and get your second passportBefore we review a few specific countries, let’s discuss each of the fastest ways to obtain citizenship…1.\nMake an investmentIt goes without saying that if you have significant cash to invest, the passport process can be sped up.\nFew countries still offer instant citizenship for foreign spouses, but there are still a few attractive options.\nThe following is a list of the countries where it is the easiest to become a citizen.\nOptions that No Longer ExistIt’s important to note that Argentina does NOT offer citizenship in two years, despite what some might say.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/07/Passport5.jpg"}}},{"node":{"id":"5b921d1987be0571ac1b04f5","title":"Countries with no property taxes where you REALLY own your home","source":"nomadcapitalist","summary":"Brief history of countries with property taxesAs far back as Egypt, Babylon and Persia, countries have used property taxes to collect money from the well-off.\nProperty taxes are a reality of life for almost every property owner in the world.\nList of Countries with No Property TaxYes, there actually ARE countries with no property taxes.\nCook IslandsIn addition to no wealth taxes or capital gains taxes, the Cook Islands in the South Pacific doesn’t assess property taxes.\nCARIBBEAN REGIONCayman IslandsThe Cayman Islands once again makes the list as a longstanding name in the offshore world: No property taxes, no personal income taxes, no capital gains taxes, no corporate taxes, no payroll taxes and no withholding taxes on domestic of foreign entities.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2014/05/Home-House-Real-Estate.jpg"}}},{"node":{"id":"5b921d1887be0571ac1b04f4","title":"Expatriation: How to Renounce your Citizenship","source":"nomadcapitalist","summary":"This Expatriation page won’t help you if you’re looking to leave your country but keep your citizenship.\nExpatriation isn’t right for everyone, but if you’re US citizen or green card holder who is considering renouncing your citizenship, you’re in the right place.\nThe Big Misconceptions About Expatriation That Hold Others BackThere are a number of misconceptions floating around about expatriation and renouncing your citizenship.\nThere are likely better ways for you to legally reduce your taxes without having to renounce your citizenship.\nEither you need to renounce to accomplish what you want in life, or you don’t need to renounce.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d1787be0571ac1b04f3","title":"18 tax-free countries where you can get second residency","source":"nomadcapitalist","summary":"Second Residency in Tax-Free CountriesThese countries have zero income tax, plain and simple.\nCosta RicaCosta Rica has long been the second residency of choice for American retirees and investor expats.\nHowever, Paraguay also makes for an attractive second residency with the potential to get a passport later.\nYou might be asking, “what about second residency in Hong Kong?” Hong Kong is still an excellent flag to plant for some entrepreneurs, although I recommend it less these days, especially as Hong Kong banks have become impossible.\nHowever, Hong Kong is not the easy second residency it once was.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/09/tax-free-countries-second-residency-macau.jpg"}}},{"node":{"id":"5b921d1487be0571ac1b04f1","title":"How to get the best of everything in life by planting flags","source":"nomadcapitalist","summary":"For years, I’ve been a big advocate of Eastern Europe as one of the underrated “hidden gems” for business.\nOne thing that I feel is constantly worth reminding people about is just what “go where you’re treated best” means: seeking out the best opportunities wherever they are, whether that is in one place or ten places.\nThis is the original Five Flags Theory on steroids, and it means planning each aspect of your life to get the best of everything.\nInstead of tolerating those services in Europe, I’ve arranged my life to include two annual medical and dental visits each year.\nFor the ultra-rich, it was and still is possible to move to Monaco, but even Monaco doesn’t offer the best of everything.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2017/06/how-to-get-the-best-of-everything.jpg"}}},{"node":{"id":"5b921d1387be0571ac1b04f0","title":"Privacy Policy and Cookie Policy","source":"nomadcapitalist","summary":"To have your personal data corrected if it is inaccurate and to have incomplete personal data completed3.\nTo move, copy or transfer your personal data (“data portability”)8.\nPrivacy Policy UpdatesWe may update this Privacy Policy from time to time as we add new products, as we improve our current offerings and as technologies and laws change.\nYou can determine when this Privacy Policy was last revised by referring to the “Last updated” legend at the top of this page.\nAny changes will become effective upon our posting of the revised Privacy Policy.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}},{"node":{"id":"5b921d1387be0571ac1b04ef","title":"The world’s most capitalist countries","source":"nomadcapitalist","summary":"For as much as the West and its politicians claim to stand behind capitalism, Western countries are some of the least capitalistic on earth.\nCapitalist countries where the free market is still alive and respectedYet, capitalism is still thriving in other parts of the world.\nSome of the world’s poorest people believe that capitalism and free markets is what will drive them to prosperity.\nHowever, some of the world’s most substantial investments are going to countries you would never think are capitalist.\nThe world’s most capitalist countries are the ones you’d least expect.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2015/01/bangladesh-most-capitalist-countries.jpg"}}},{"node":{"id":"5b921d1187be0571ac1b04ed","title":"Should you set up a Singapore company for your business?","source":"nomadcapitalist","summary":"Singapore and Hong Kong are Asia’s two economic powerhouses and occupy the top two spots on the Economic Freedom Index.\nWhile the country also uses a territorial tax system, Singapore views money earned in or remitted to Singapore by a Singapore corporation as local income, and subject to tax.\nHowever, your first S$100,000 (roughly US$75,000) in profits are tax-exempt for the first three years your Singapore corporation is open for business.\nSingapore differs from Hong Kong in that Singapore seems to encourage more of an on-the-ground presence.\nI personally believe a Labuan corporation in Malaysia gives a Singapore company a run for its money.","info":{"author":"Andrew Henderson","top_img":"http://nomadcapitalist.com/wp-content/uploads/2013/12/singapore-offshore-corporation.jpg"}}},{"node":{"id":"5b921d1187be0571ac1b04ec","title":"About Nomad Capitalist","source":"nomadcapitalist","summary":"My storyBeginning of my journey:After starting and selling two successful businesses in the United States, I left the country to travel the world.\nI had invested a sizable portion of my money in mutual funds and real estate.\nOn top of this, I had also just taken a huge loss in taxes after selling the businesses.\nThe feeling of losing the fruits of my labor to something out of my control was quite devastating.\nI’ve spent the past 10 years finding solutions to these issues.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2016/04/Andrew-Henderson-Nomad-Capitalist.png"}}},{"node":{"id":"5b921d1087be0571ac1b04eb","title":"The Nomad Capitalist Team","source":"nomadcapitalist","summary":"AndrewHaving traveled to 89 countries, Andrew is a lifelong entrepreneur and now the most sought-after offshore expert in the world.\nAs some who values freedom and options, he spends his time researching the latest offshore investments, banking, and second residencies and citizenships.\nHe puts together unique Nomad Strategies for each of our clients to make sure they can “go where they’re treated best”.\nAndrew loves efficiency, big cities, spicy food, and elegant interior design.\nAfter years as a perpetual travel, he splits his time between homes around the world, including in Kuala Lumpur, Tbilisi, and Montenegro.","info":{"author":"","top_img":"http://nomadcapitalist.com/wp-content/uploads/2018/07/2016-nomad-capitalist-logo-black-enlarged.png"}}}]}},"pageContext":{"source":"nomadcapitalist","alias":"financial","label":"财务自由"}}