{"data":{"mongodbDatabaseArticles":{"id":"5b95ea6f87be05832748ffa7","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/usasafe1c.jpg\" alt=\"usa safety&gt;&lt;br /&gt; Last month, I wrote an article about why, despite what you see in the news, &lt;a href=\">Europe is safe to visit. Someone asked (with a degree of snark) if I would I write a similar article about the U.S. too?</p><p>Well, it&#8217;s a valid question. As an American writing for a mostly American audience, I tend to write mostly about what&#8217;s beyond our shores. But I have thought about this question before &#8211; especially since 45% of the people who read this website are outside the US. So let&#8217;s turn the tables on my post and ask:</p><p>&#8220;Is the United States safe to visit?&#8221;</p><p>When most people ask me this question, I feel they are really asking me two things: (1) Does gun violence happen so often I should worry about being shot? and (2) Will everyone hate me because I&#8217;m a foreigner (or, especially, a non-white foreigner)?</p><p>These are valid concerns. After all, just like how we in the United States have a perception that the rest of the world is unsafe and unwelcoming, so too the rest of the world has that perception of the United States.</p><p>In their news, they hear about our mass shootings and <a href=\"https://www.nytimes.com/2016/06/14/upshot/compare-these-gun-death-rates-the-us-is-in-a-different-world.html\">gun violence</a>, as well as reports of <a href=\"https://vittana.org/42-shocking-police-brutality-statistics\">police brutality</a> <a href=\"https://mic.com/articles/129981/10-police-brutality-statistics-that-are-absolutely-shocking#.kDNC1dVFc\">toward minorities</a> and <a href=\"http://www.thedailybeast.com/cheats/2017/02/23/indian-americans-shot-mistaken-for-arabs\">murders</a> (or <a href=\"http://timesofindia.indiatimes.com/nri/us-canada-news/Sikh-youth-mistaken-for-Muslim-abused-at-US-store/articleshow/55534866.cms\">beatings</a>) of Indian students confused for Muslims and <a href=\"https://www.nytimes.com/2017/02/26/world/asia/after-shootings-indians-are-wary-of-move-to-us-in-age-of-trump.html\">wonder if they are welcome</a>. They see the election of President Trump, <a href=\"https://www.theatlantic.com/news/archive/2017/05/under-trump-immigrants-arrests-are-up-but-deportation-is-down/527103/\">the huge rise in deportations</a>, the (yet still illegal) Muslim travel ban, heightened security measures at airports, and people being detained and go, &#8220;Maybe the United States isn&#8217;t the safe and welcoming country we thought it was. How are much are those flights to Europe, honey?&#8221;</p><p>The media cuts both ways.</p><p>I won&#8217;t deny the statistics: <a href=\"http://www.cbsnews.com/news/how-u-s-gun-deaths-compare-to-other-countries/\">The US has the highest rate of death by guns in the developed world</a> (outside of war zones, of course), we have nearly the highest <a href=\"https://en.wikipedia.org/wiki/List_of_countries_by_incarceration_rate\">incarceration rate</a> in the world, <a href=\"http://www.voanews.com/a/us-hate-crimes-rising-particularly-in-big-cities/3756604.html\">hate crimes have gone up</a> <a href=\"http://www.reuters.com/article/us-usa-crime-hate-idUSKBN16L0BO\">since the election</a>, and we average roughly <a href=\"https://www.theguardian.com/us-news/ng-interactive/2015/oct/02/mass-shootings-america-gun-violence\">one mass shooting five out of every six days</a> (and <a href=\"http://edition.cnn.com/2016/06/13/health/mass-shootings-in-america-in-charts-and-graphs-trnd/\">90% of the mass shootings in the world happen here</a>).</p><p>And when these incidents and attitudes are projected around the world in conjunction with our recent political strife, it creates the perception of the United States as a dangerous and unwelcoming place.</p><p><a href=\"http://www.independent.co.uk/travel/news-and-advice/trump-slump-travel-ban-muslims-us-tourism-holidays-foreign-visitors-a7666461.html\">Already tourism has fallen</a> and <a href=\"https://www.theguardian.com/travel/2017/feb/28/us-tourism-experiences-a-trump-slump\">airline bookings are down</a>.</p><p>But, just like Europe, <strong>the United States is safe to visit</strong>.</p><p>There&#8217;s no reason to avoid visiting here &#8212; even if the TSA makes it more of hassle and, well, our political landscape is less than ideal.</p><p>First, the United States is very big and very, very diverse. It&#8217;s larger than Europe (the sovereign states not the continent) and Australia. You can drive 15 hours here in still be in the same state. It&#8217;s huge. A lot of visitors fail to understand that. A Chicago friend told me how two visitors from France wanted to go to Disney for the weekend. They thought it was a short drive because in Europe a multi day drive gets you most of the way across the continent! Most visitors just don&#8217;t understand how vast the US is geographically until they arrive. Even I never got sense of just how big the country is until I drove across it. You can see it on a map but until you&#8217;ve spent a few days driving, that sense of size is hard to comprehend.</p><p>And due to this size, there is a lot of cultural (and political) variation. While Americans do share common bonds and beliefs, it often feels like the US is really a collection of micro-countries. The culture of Alabama is different than the culture of NYC, which is different than the culture of Chicago, Hawaii, Alaska, middle-of-nowhere Wyoming, or Florida. Heck, southern Florida is a world away from the Florida Panhandle, and Austin is a blue (liberal) dot in the red (conservative) sea of Texas. Cuisine, slang, dress style, accents, attitude, how people walk &#8211; it&#8217;s all different from region to region and state to state.</p><p>Second, despite what you hear, <a href=\"https://www.usnews.com/news/articles/2016-09-26/us-crime-rate-rises-slightly-remains-near-20-year-low\">crime in America is near a 20-year low</a>. It&#8217;s been declining for many years. Here&#8217;s a visual representation of the article:</p><p><img src=\"https://media.nomadicmatt.com/usasafecrimestat.png\" alt=\"usa safety graph\"><br> Graph: <a href=\"https://commons.wikimedia.org/wiki/File:US_crime_rate_increase_since_1960.png\">1</a></p><p>(And the recent uptick is mostly due to a increased violence in few cities. The broader nationwide trend is still down.)</p><p>For example, I live in NYC. <a href=\"https://www.neighborhoodscout.com/ny/new-york/crime\">Crime is down 50% over the last 15 years</a>. I never worry about being robbed or mugged while in Manhattan. Sure, some of the other boroughs are still unsafe, it&#8217;s not all rainbows and unicorns throughout the city, but, overall, NYC is a lot safer than it used to be. Twenty years ago, you would never go through Central Park at night. Now, people go there regardless of the time of day.</p><p>Also, <a href=\"http://www.businessinsider.com/death-risk-statistics-terrorism-disease-accidents-2017-1?r=US&amp;IR=T&amp;IR=T\">you have less of a chance of dying in a terrorist attack in the United States</a> than dying by a bathtub.</p><p>I&#8217;m not saying there is nothing to worry about. There is crime (but <a href=\"https://www.nytimes.com/2015/10/09/upshot/gun-deaths-are-mostly-suicides.html\">most gun violence in the US is gang related, people killing friends, or suicides</a>). <a href=\"http://www.huffingtonpost.com/evan-defilippis/do-we-have-a-gang-problem_b_5071639.html\">Chicago, Philly, and Detroit have gang related crime problems</a>. Racism is still a big problem. Police brutality is a problem. Mass shootings happen too often.</p><p>The United States is not perfect.</p><p>But, just as in Europe, the likelihood that something is going to happen to you is very slim. The media sensationalizes attacks throughout the world! When attacks happen in Paris, do you say, &#8220;Honey! Paris was attacked! Let&#8217;s not go to Lisbon&#8221;? No, because you know that these places are far apart and that an attack in one place doesn&#8217;t mean you can&#8217;t go somewhere else.</p><p>The United States is 3.8 million square miles and filled with dozens of climates, hundreds of cultures, thousand of cities and towns, and 321 million people. Problems in one state or city don&#8217;t mean you can&#8217;t visit another part of the country.</p><p>Not coming here because &#8220;Americans don&#8217;t like foreigners&#8221; ignores the fact only 26% of Americans voted for Trump, and there&#8217;s currently a huge debate between the right and left about so-called &#8220;<a href=\"http://www.npr.org/sections/codeswitch/2017/01/29/512002076/why-sanctuary-cities-are-safer\">sanctuary</a> <a href=\"https://www.washingtonpost.com/news/wonk/wp/2017/01/27/trump-says-sanctuary-cities-are-hotbeds-of-crime-data-say-the-opposite/\">cities</a>&#8221; (those that limit their cooperation with the federal government over immigration law enforcement). Remember that when the travel ban briefly went into effect, <a href=\"http://edition.cnn.com/2017/01/30/politics/travel-ban-protests-immigration/\">there were</a> <a href=\"https://www.theguardian.com/us-news/2017/jan/29/protest-trump-travel-ban-muslims-airports\">nationwide protests</a> <a href=\"http://www.voanews.com/a/thousands-protest-globally-against-trump-travel-ban/3706760.html\">against it</a>. It was never supported by a majority of the American people.</p><p>Not coming here because of what you read in the news is to say everyone is the same and not recognize the vast cultural differences in the country. It is like saying you won&#8217;t go to the Middle East because everyone there is a terrorist.</p><p>I know that as a white guy I can&#8217;t speak to what life is like here as a person of color. I&#8217;ve met many, many, many non-white travelers tell me how wonderful the found the United States and how welcoming everyone is, how people smile, say hello, and go out of the way to help but I don&#8217;t know what it&#8217;s like to travel around as a non-white person. I know there is systemic racism in the country, but just as people aren&#8217;t the government, so too we shouldn&#8217;t stereotype and say that all Americans are racist. Attitudes about immigrants, gays, Muslims, and everyone else vary a lot depending on where you are.</p><p>(But, rather than being some white guy talking abut race, <a href=\"http://girlgonetravel.com/2016/11/10/traveling-while-brown-through-trumps-america-tips-advice-and-words-of-empowerment/\">here is a link to an article about traveling the U.S. when you aren&#8217;t white.</a> It will give a better perceptive on the subject.)</p><p>What you see on TV is only a small, small, small sliver of the people who live in the country. Because remember if it bleeds, it leads and the stories that pain the United States as this violent place fits nicely into the existing narrative it has. (Just like the world being unsafe fits into the narrative we Americans have). The United States is not all filled with gun carrying, immigrant hating, racist, ignorant, fearful yokels.</p><p>Can I say there won&#8217;t be any gun violence while you&#8217;re here? No.</p><p>Can I say you won&#8217;t experience racism? No. (My friend&#8217;s Asian girlfriend was recently told to go back home.)</p><p>Can I say something bad won&#8217;t happen to you? No.</p><p>But all countries have their problems and the media hypes up everything. Americans, like people everywhere, are generally good people who are just trying to get through the day. They are people with friends and families and are welcoming towards strangers. We aren&#8217;t foreign haters &#8211; and we don&#8217;t live in Westworld where everyone is shooting everyone all the time.</p><p>Be safe. Be aware. Use your common sense.</p><p>But don&#8217;t skip this place I call home. It&#8217;s an often-overlooked destination that&#8217;s cheap to travel around and incredibly diverse (both culturally and geographically).</p><p>So, just like with Europe, ignore the news, book your flight, and come visit the United States!</p></div>","title":"Is it Safe to Travel to the United States?"}},"pageContext":{"id":"5b95ea6f87be05832748ffa7"}}