{"data":{"mongodbDatabaseArticles":{"id":"5b9629da87be0583274911bb","content":"<div><p>Hong Kong has an overwhelming amount of choice for a quick bite to eat, but with this&#160;guide to Hong Kong&#8217;s best hidden eateries, we&#8217;re letting you in on all the secrets.</p><h2>guide to Hong Kong&#8217;s best hidden eateries</h2><p>I frowned at the mystery meat floating in my broth and looked at my friend, Jeff, questioningly. He shook his head and smirked, and I steeled myself to take a nibble. Ah &#8211; pig lung. An unpleasant chewy texture, accompanied by a violent urge to spit it out again immediately.</p><p><img class=\"aligncenter size-full wp-image-21973\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Food-Jeffs.jpg?resize=1024%2C683&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"683\"></p><p><img class=\"aligncenter size-full wp-image-21982\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Tripe-Broth-Justins.jpg?resize=1024%2C668&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"668\"></p><p>We were in Jeff&#8217;s favorite restaurant, in Kowloon Bay, eating a selection of popular classic local dishes. Apart from the pig lung broth, we were tucking into some delicious crispy fried white fish with a chili sauce, soft tofu seasoned with salted fish, steamed water cabbage with soy sauce and a big tub of steamed white rice. The rice is served with a tall glass of lard that you spoon into your bowl and then mix with soy sauce.</p><p><img class=\"aligncenter size-full wp-image-21980\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Restaurant-Jeffs.jpg?resize=1024%2C683&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"683\"></p><p>The whole meal was basically a heart attack waiting to happen! But as with most unhealthy things, it was unbelievably delicious (well&#8230;apart from the pig lung!). The restaurant itself was packed, filled with chatter, arguments, and laughter &#8211; so much so that we basically had to shout to hear each other. A classic Hong Kong scene.</p><h3><a href=\"https://s.openrice.com/QrKS0y0S000\">&#31895;&#33756;&#39208;Tso Choi Restaurant</a>, G/F 17A Nga Tsin Wai Rd, Kowloon City</h3><p>To truly visit Hong Kong, you need to see it through what it is best known for &#8211; it&#8217;s food. There is a wealth of variety and deliciousness in the cuisines available here. Although visitors should beware that traditional Cantonese food is known for its utilization of every part of the animal, which can bring up some interesting dishes!</p><p>In my quest to find the best truly local Hong Kong eateries I enlisted the help of 3 local foodies; Jeff, Justin, and Chia. I asked each of them to take me to their best-loved restaurant, to try their favorite dishes &#8211; leaving myself entirely in their hands.</p><h3>The second must-visit eatery is in Tai Po Market, deep in the New Territories.</h3><p>Justin assured me that their famed clay rice bowls are well worth the long journey. Clay rice bowls are a Cantonese delicacy, dating back almost 2000 years, where rice is slow cooked in clay bowls with dried meats that infuse their flavor. There is a constant queue for the restaurant, so I would recommend getting there early if you&#8217;re going for dinner (aim for 6ish). You order while waiting in line, for maximum efficiency &#8211; we ordered a cured meat pot and a beef pot.</p><p>We were soon settled in and ordered our starters; rice noodle rolls (cheong fun) with bbq meat and the seemingly ubiquitous Cantonese mystery meat broth. The cheong fun served with sweet soy sauce was the best I had ever tasted &#8211; the perfect mix of sweet, salty and sticky.</p><p><img class=\"aligncenter size-full wp-image-21972\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Cheong-Fun-Justins.jpg?resize=1024%2C653&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"653\"></p><p>The mystery meat turned out to be beef tripe and pig intestines. After intense internal debate, I once again bullied myself into trying a bowl. The chewy texture of the tripe was unpleasant to begin with, but the taste was so good that I was soon able to overlook it and wolf it down. The intestines were a whole other story and were left untouched.</p><p><img class=\"aligncenter size-full wp-image-21979\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Meat-Clay-Pot-Justins.jpg?resize=1024%2C718&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"718\"></p><p>Then came the clay pots. The beef pot was served with a raw egg cracked over it that was cooked by the heat of the rice. Tasty, but nothing extraordinary. The star of the show was definitely the cured meat pot. Cooked with sweet Cantonese sausage, salted duck and bbq pork, the rice had soaked up all that salty, oily goodness. There was fierce competition for seconds and no hope for thirds!</p><h3><a href=\"https://s.openrice.com/QrKS0rYq000\">&#38515;&#28450;&#35352; Chan Hon Kee </a>&#8211; &#160;G/F, No. 91B Wan Tau Street, Tai Po</h3><p>The next day we came to my favorite eatery, chosen by Chia. Concealed in the back streets of Sham Shui Po, with not another non-Chinese face to be seen, this little dai pai dong (open air food stall) was overflowing with character.</p><p>The kitchen was set up on the road with tables and chairs taking up the sidewalk surrounding it. Chia, my sister Katie, and I grabbed a table near the kitchen and ordered dishes entirely based on the waitress&#8217;s recommendations &#8211; although Katie firmly vetoed the stir fried seafood intestines (I was so glad to have brought along someone significantly less adventurous than myself!).</p><p><img class=\"aligncenter size-full wp-image-21981\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Street-eating-Chias.jpg?resize=1024%2C673&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"673\"></p><p><img class=\"aligncenter size-full wp-image-21971\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Bowl-cleaning-Chias.jpg?resize=1024%2C646&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"646\"></p><p>While we waited for our food we washed our bowls, plates, and chopsticks in the hot tea provided. This wasn&#8217;t a reflection on the cleanliness of the place, it is a custom performed in all traditional restaurants &#8211; typically by the youngest of your party.</p><p><img class=\"aligncenter size-full wp-image-21978\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Kitchen-Chias.jpg?resize=1024%2C670&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"670\"></p><p><img class=\"aligncenter size-full wp-image-21977\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Kailan-and-squid-Chias.jpg?resize=1024%2C709&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"709\"></p><p><img class=\"aligncenter size-full wp-image-21974\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/Ginger-Chicken-Chias.jpg?resize=1024%2C646&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"1024\" height=\"646\"></p><p>After only a couple of minutes, a large plate of steamed ginger chicken arrived, served with a deliciously salty ginger sauce. This was closely followed by a plate of piping hot, deep fried battered white fish with a soy-vinegar dip, and stir fried kailan with steamed squid. All the dishes were shared and disappeared speedily down our gullets while we caught up, shared stories and people watched. The best thing about this dai pai dong? Watching the sun go down over the city, the streetlights and neons signs light up and knowing you&#8217;re right at the heart of it all.</p><h3><a href=\"https://s.openrice.com/QrKS0aJ4000\">&#24375;&#35352;&#22823;&#25490;&#27284;</a>, G/F, No. 219 Kei Lung Street, Sham Shui Po</h3><p>As you&#8217;ve probably guessed, this foodie exploration is not for the faint-stomached. Had it not been for my local foodies accompanying me, I doubt I would have been able to find these places myself.&#160;</p><p>However, despite all the restaurants being in a totally Chinese environment, each of these places has either an English menu, or a picture menu that you can point at (so you don&#8217;t have to worry about accidentally ordering 5 plates of chicken brains).&#160;</p><p>Each of them is worth visiting not only for their food but also for their uniquely Hong Kong setting. It really is adventure at its best &#8211; through the stomach!</p><p>This article is from fellow travel blogger, Ellie Stokes. You can check our her <a href=\"http://elinorastokes.com\">blog</a> and follow her on <a href=\"http://www.instagram.com/elinorastokes\">Instagram</a>. Thanks, Ellie!</p><h2>Pin it for later:</h2><p><img class=\"aligncenter wp-image-21976 size-large\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/03/hong-kong-best-food.jpg?resize=697%2C1024&amp;ssl=1\" alt=\"You&#8217;ve Got Me Wonton More: A Guide to Hong Kong's Best Hidden Eateries\" width=\"697\" height=\"1024\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"You’ve Got Me Wonton More: A Guide to Hong Kong’s Best Hidden Eateries"}},"pageContext":{"id":"5b9629da87be0583274911bb"}}