{"data":{"mongodbDatabaseArticles":{"id":"5b9248af87be056953db7bd6","content":"<div><p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/Screen-Shot-2014-01-28-at-05.19.53-1024x217.png\"> <p>After <a href=\"/bootstrapping-startup-thailand/\">6 months of Thailand</a>, I had to leave as my visa expired. I decided to visit Vietnam's capital to see how the remote working scene was here. My arrival in Ho Chi Minh (Vietnam's business capital), has been bumpy to say the least. If you're used to the always smiling Thai, then Vietnam will be a shock to you. From the perspective of a Westerner, the average Vietnamese will come across as impolite, rude and unfriendly.</p> <p>For a week, I booked a private room in a family-run hostel in Ho Chi Minh's District 1. I'd come home at midnight to find the WiFi not working. Being a nightly worker, this killed my productivity. After a few days and talking to fellow guests having the same issue, I asked the staff what was up. I was told that they shut down the router because \"the router had to sleep\". I was stunned. I told them I was sure the router was okay with staying up late too and I'd keep it company. After much verbal struggles and threatening to check out, they'd agree to keep it on but I had to explicitly run down and request every single family member to put it on again. And then it was 3AM and I'd lose connection until 7AM. What the fuck.</p> <h2>That common room wasn't very common</h2> <p>My hostel had advertised with their fabulous common room, where you could meet fellow travelers and have a drink. I wanted to check it out and found out the common room was actually the family's living room. Alright, that happens sometimes in Thailand too, as the classic definition of a hostel is, and the family is usually sweet. I sat down with my laptop, doing some of my work and talking to fellow guests, when I was shaken up by severe shouting. I looked up from my screen and there was the 70-year old family elder standing wide-legged in front of me with his finger pointed at my face shouting in a mix of Vietnamese and English to \"move my chair\". Stunned, I told him he might want to consider asking that a bit more friendly since I was a paying guest of this hostel.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0792-1024x764.jpg\"> <h2>Getting killed on the streets</h2> <p>Walking outside, I knew the chaos that traffic can be in Cambodia and Thailand. But they will usually stop or slow down when you pass the street. Vietnamese do not stop or slow down. That's it. You pass the street, and they'll just run you over. They will horn and you have to get out of their way. It doesn't matter if it's a motorbike or a big truck. I've had to do Matrix-like jump dives left and right to avoid trucks. You're best of crossing the street in a hyperfast continuous pace and pray nobody hits you. But they will at some point. Even sidewalks are off-limits. While you're walking, motorbike drivers will drive straight at you and expect you to move while shouting. As expected, if you don't, yup...they'll run you over.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0757-1024x764.jpg\"> <h2>...or robbed</h2> <p>If you survive the traffic, then prepare to get robbed. The first I heard entering Vietnam from a Vietnamese person was \"don't take out your iPhone in the street, they'll steal it\". The second thing I heard entering Vietnam was \"that bag of yours, don't take it out, they'll steal it too\". That made it feel great. How am I supposed to walk around with iPhone earphones on like I do everywhere? And how am I supposed to even leave my hotel, to work somewhere if I can't take my bag with my laptop in it? I ignored the warnings as they'd make life unlivable here. After a week, I've still got my stuff but when I talk to other travelers I seem to be in the minority. And the warnings literally haven't stopped. I've had about 10 Vietnamese come up to me and tell me about the dangers of walking around with my iPhone headphones out and backpack. If you the Vietnamese say it, this can't be wrong right?</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0753-1024x764.jpg\"> <h2>Leaving the center</h2> <p>Now, I was staying in Ho Chi Minh's District 1. It's like the tourist traps of San Francisco's Fisherman's Wharf, London's Leicester Square or Amsterdam's Dam Square. Tourist-traps usually have nothing to do with the city they're in and the service there is mostly terrible. I figured that might be the deal with Ho Chi Minh's District 1. So trying to escape the trap, I ventured into District 2 and 3. But even there I kept running into trouble. I'd pass street cleaners with big brooms, who'd literally broom the dirt straight over my feet. The street-food vendors would do the same and throw their buckets of dirty dish water over my legs. What the actual fuck. There seemed to be either some foreigner-hatred here or a total disregard for other people. To keep it positive, I assumed the latter. I looked it in the mirror to make sure I wasn't wearing an American flag on my head.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0739-e1390880226663-1024x764.jpg\"> <h2>It was a clash of cultures</h2> <p>This seemed to be the modus operandi of Vietnamese. When I was sitting in a crowded coffee place with friends, suddenly people came in to replace ALL chairs with different colored ones. They demanded everyone to stand up and in the packed place they started moving all the chairs around. A normal person would wait until closing time and do it then. But what is normal in Vietnam?</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/toiletsvietnam2-1024x221.jpg\"> <p>What is normal is that every toilet in Vietnam has footprints on it. I am aware many SE Asian cultures still use squat toilets, but when you encounter a seated toilet it's expected you don't actually stand on it, right? It was another thing that symbolized the utter non-awareness of other people they seemed to have.</p> <p>Thinking about this, it seemed obvious that I was suffering from a culture clash between me and them. Since it wouldn't be possible that everybody I met would actually be this rude, it must have been the way I perceived them, right? Their way of communication and body language might have just been different. And since my perspective was western, that's probably what I was experiencing. Six months in Thailand was easy, partly because they're so buddhist and partly because it's a country so overrun with westerners that it has adopted many western values regarding communication and behavior. So westerners like Thais. The Vietnamese contact with western values on the other hand, was in the form of guns and napalm bombs. I understand. The cultural anthropologist in me wanted to believe this hypothesis. But was this it?</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0723-1024x764.jpg\"> <h2>I wasn't the only one that felt this way</h2> <p>I talked to other travelers about it and everyone seemed to have the same experience. They liked the country, but liking the people was difficult. Even the Chinese travelers agreed! And the first hit for Google autocomplete for Vietnamese was \"rude\". A famous travel blogger expressed his sincere thoughts entitled <a href=\"http://www.nomadicmatt.com/travel-blogs/why-ill-never-return-to-vietnam/\">\"Why I'll never return to Vietnam\"</a>:</p> <blockquote><p> \"The simple answer is that no one ever wants to return to a place where they felt they were treated poorly. When I was in Vietnam, I was constantly hassled, overcharged, ripped off, and treated badly by the locals.\" &#8212; Matt (<a href=\"http://www.nomadicmatt.com/travel-blogs/why-ill-never-return-to-vietnam/\">on NomadicMatt.com</a>) </p></blockquote> <p>The internet seemed to be <a href=\"//www.google.com/search?num=30&amp;hl=en&amp;gl=US&amp;q=why+are+vietnamese+so+rude&amp;oq=why+are+vietnamese+so+rude&amp;gs_l=serp.3..0.4617.7316.0.7427.26.16.0.7.7.1.137.1412.12j4.16.0....0...1c.1.32.serp..5.21.1207.H8j4XPViyOs\" class=\"broken_link\">filled with stories like this</a>. The people in Ho Chi Minh were actually supposed to be some of the nicest in Vietnam, with most reports talking about problematic run-ins with the people from Hanoi instead.</p> <p>Now I had been all over Asia, from Japan to Singapore, studied in South Korea and never ever have I experienced this kind of en masse rude behavior. Actually every time I traveled to a non-Western culture, everyone was just as friendly or friendlier than at home...except Vietnam.</p> <p>Even Vietnamese themselves thought they were unfriendly:</p> <blockquote><p> Oh my god, since I&#8217;m a Vietnamese (that is currently living in Vietnam) I feel asshame reading this. I&#8217;m very sorry for the kind of treatment that you guys encountered in Vietnam, especially in the modern cities. I know that people can be unfriendly and rude, and I do admit that&#8217;s the average kind of treatment I would receive myself, too. &#8212; Lien Pham (<a href=\"http://johnnyvagabond.com/travel-tips/7-things-vietnam/\">comment on JohnnyVagabond.com</a>) </p></blockquote> <p>All I could do, was sit on the side of the river, and think about how I was going to deal with this... :)</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0687-1024x764.jpg\"> <h2>I was going to figure it out...</h2> <p>I don't like leaving a place on a bad foot like that blogger did. I was going to figure out what the Vietnamese were about. They could shout all they want at me, but I was going to smile back at them, hug them and kiss them to convince them of my love for all the people of the world.</p> <p>Easier said than done though... How do you meet people when they don't want to meet you? Well, that took awhile.</p> <h2>Getting close to the Vietnamese</h2> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_1047-1024x764.jpg\"> <p>As I always like to work at night, I tried to find a nice place that was open 24/7. I found one coffee bar in Ho Chi Minh that was. It was called <a href=\"//www.facebook.com/pages/Th%E1%BB%A9c-coffee/290629544371823\">Thuc Coffee Bar</a>, and there was actually two of them in Pasteur Street. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0980-e1390880280594-1024x764.jpg\"> <p>And it was literally just that, a tiny bar with coffee. There was people sitting all night, smoking, talking, dancing, and me on my laptop. I didn't really have any other choice. I'd be there every night for two weeks to finish my projects, and that's when things started to happen. </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0998-e1390880534894-1024x764.jpg\"> <p>After a few days of seeing me come back every night, some of the Vietnamese started opening up to me. They started smiling at me, telling me about their lives and introducing me to their friends! They offered me drinks and invited me to parties at their homes. I met visual artists, videographers and an entire rock band who showed me their music. And they were all super sweet.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_1004-e1390883849596-1024x764.jpg\"> <h2>So what's the deal here</h2> <p>The deal is that Vietnamese are a strange bunch. Unlike most countries I've visited, if you're a stranger to people, they will not show any interest whatsoever to you, they will shout at you, they will be rude and they will probably not help you when you fall off your motorbike. And that's shit. Part of that is cultural differences, and part of that is just fucked. Like they should seriously figure that shit out.</p> <p>But then when you transform from stranger into their friend, literally everything changes. They're sweet, curious and welcoming. So they take a while to warm up to people. Way, way, way longer than any other culture I've interacted with so far.</p> <p>It's something the Vietnamese may want to consider for their future though. Be a little bit nicer, forthcoming and helpful to strangers and you'll attract more tourists, more business and more capital to your country. I know you're nice when we're friends, but just that is not enough in the 21st century. The world's full of fast encounters with strangers and if we're all gonna act like dicks to each other, we're not going nowhere. And yes that's a critique of culture. Where do I get the nerve? </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2013/10/IMG_0947-1024x764.jpg\"> <h2>Vietnamese are a beautiful mystery</h2> <p>If I was politically correct, I wouldn't have written this post. If anything, I'm trying to stir the debate up with a title like this. And I'm generalizing millions of people. Sure. Sue me.</p> <p>But I actually left on a good foot with the Vietnamese. They became my friends and we still keep in contact. They're a special people, not overrun so much by tourists yet, they're cold on the outside, warm on the inside. And that in itself, is enough of a beautiful mystery, to make it worth visiting. Just have some patience, with those Vietnamese. And Vietnamese, have some patience with us. And maybe a smile?</p> <p><a href=\"/why-i-want-to-live-in-singapore/\">Next I fly to Singapore, the city where (I think) I want to live &#187;</a></p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Why are the Vietnamese so rude?"}},"pageContext":{"id":"5b9248af87be056953db7bd6"}}