{"data":{"mongodbDatabaseArticles":{"id":"5b9248d587be056953db7bfd","content":"<div><p>To reduce procrastination and become faster at launching my projects, I've set the goal to launch <a href=\"/12-startups-12-months\">12 startups in 12 months</a>. This month, I'm launching the third project. It's called <strong><a href=\"//tubelytics.com/\">Tubelytics</a></strong> and it's a <strong>real-time analytics dashboard</strong> for YouTube publishers. If you'd like to use it, you can <a href=\"http://tubelytics.com/\">sign up</a> here.</p> <h2>The problem</h2> <p>A few years ago I started the <a href=\"http://pandamixshow.com/\">Panda Mix Show</a>. It's a YouTube network with multiple music channels featuring weekly mixes in different electronic music genres. All its channels together now feature over 500,000 iTunes &amp; YouTube subscribers (the majority 350,000+ of them on YouTube) and 100+ million plays.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-06-02-at-22.57.25-1024x882.jpg\"> <p>But it's a lot of YouTube channels. The problem is, it's always been difficult for me to track all my channels together. YouTube offers their own analytics service, but all your channels need to be connected to a single account. Many companies simply don't have that control over all their YouTube channels. So, you'd have to sign in and out of each channel to check its stats. That quickly becomes a pain. Added to that, it was impossible to see how my channels were performing vs. competing channels.</p> <h2>The solution</h2> <p>I built a dashboard-type SaaS app that solves this. It lets you make groups of YouTube channels (called \"projects\") and track their metrics. It polls YouTube's public API for metrics constantly and displays it. And if today's data is already there, it shows real-time views and subscribers for the day with a live counter.</p> <p>For example, here is <a href=\"http://vice.com/\">VICE</a>'s channels together:</p> <a href=\"http://tubelytics.com/get-started/project/demo/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/frontpage-static-1024x548.png\"></a> <p>And here is one of YouTube's EDM music networks channels growth:</p> <a href=\"http://tubelytics.com/get-started/project/demo/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"frontpage-feature-intro\"><img src=\"/wp-content/uploads/2014/05/frontpage-feature-intro-1024x989.png\" alt=\"frontpage-feature-intro\"></a> <h2>The market</h2> <p>So who might actually use this?</p> <p>I built Tubelytics to scratch my own itch, but there's a lot of other businesses out there like mine. Think big media companies (like <a href=\"http://dreamworks.com/\">Dreamworks</a>) that own thousands of YouTube channel properties but have no idea how they're performing as a whole. And record labels (like <a href=\"http://wmg.com/\">Warner Music</a>), since music is YouTube's second most popular content (after gaming), labels want to see which artists' channels are fastest growing and who they should scout. Multi-channel networks (like <a href=\"http://monstercat.com/\">Monstercat</a>) might want to keep an eye on how regularly each of their channels is uploading.</p> <p>There's lots of use cases which probably will come out after this launch.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/press-screenshot-landing-1024x531.png\"> <p>YouTube does offer its own internal analytics app already. Since it naturally has access to more/better data, it's no use competing with that. However, it doesn't give you a live dashboard, email alerts, real-time tracking, competitor tracking and to be fair it's a little clunky. So I think I have a shot here.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-29-at-18.56.50-1024x579.png\"> <p>In fact, I know because I've already signed up many users in the last few months while I was running a beta-run of the site. People from <a href=\"http://monstercat.com/\">Monstercat</a>, <a href=\"http://sonymusic.com/\">Sony Music</a>, <a href=\"http://www.endemolusa.tv/\">Endemol Beyond</a> and <a href=\"http://wmg.com/\">Warner Music</a> have already used it. Most of them are free users (as beta testers) but some of them have become paying users too. Awesome! Finally I have users <i>before</i> I launch something :)</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screen Shot 2014-06-02 at 1.03.29\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-06-02-at-1.03.29-1024x243.png\" alt=\"Screen Shot 2014-06-02 at 1.03.29\"> <h2>Challenges</h2> <p>Like any project, this one has its own challenges. The first one is the quality of the data. I poll the data from YouTube's public API. Now YouTube's API is notoriously prone to errors. For example, when polling for views for a certain channel, YouTube will give you the channel's total views (e.g. 100,498,373). But the next day, it might have decreased with a million (e.g. 99,348,292). That's YouTube correcting for fake views. That makes it hard to figure out how many views that channel actually got in that day.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-06-01-at-20.08.00.png\"> <p>To fix this, I implemented an algorithm to detect invalid data and some error correction routines to be able to still display the right amount of views. It does a pretty good job and makes the data about 95% accurate. Good enough for most use cases.</p> <h2>Try it out</h2> <p><strong><a href=\"//tubelytics.com/\">Try it here</a></strong> for yourself. You can get a free 14-day trial without entering your credit card.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/press-screenshot-3-1024x578.png\"> <p>The press release can be found <a href=\"http://tubelytics.com/assets/press.html\">here</a>. As always, I'd love to hear any feedback you may have over email or Twitter.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"My 3rd startup: Tubelytics, the real-time dashboard for YouTube publishers"}},"pageContext":{"id":"5b9248d587be056953db7bfd"}}