{"data":{"mongodbDatabaseArticles":{"id":"5b95ea2687be05832748ff85","content":"<div><strong>Hostel prices</strong> &#8211; An average price of a hostel here is 10-25 EUR per night for a dorm bed. Consider coming in the fall or winter months for cheaper prices (plus fewer crowds). The few hostels that are located on the island do not have private rooms.<p>&#8211; An average price of a hostel here is 10-25 EUR per night for a dorm bed. Consider coming in the fall or winter months for cheaper prices (plus fewer crowds). The few hostels that are located on the island do not have private rooms.</p><p><strong>Budget hotel prices</strong> &#8211; You can find rooms at 2-star hotels starting at 25 EUR a night. Hotel rooms at this price point include a private bathroom, mini-fridge, air-conditioning, a TV and many offer free breakfast for their guests.  During the summer, expect to pay much more as Crete is a popular destination during July and August. An alternative to hotels is Airbnb.  Shared rooms start at 10 EUR and entire homes (including studio apartments) can be rented for as little as 40 EUR per night.</p><p><strong>Average cost of food</strong> &#8211; Sit down restaurants with drink will cost about 20 EUR for a nice dinner, even in the tourist area. A meal at a very luxurious restaurant will begin at 30 EUR. If you really want to eat cheap, eat gyros (like kebabs). A Gyro is around 3 EUR and will easily fill you up. If you cook your meals, expect to pay 35-45 EUR per week for groceries that will include pasta, vegetables, chicken, and other basic foods.</p><p><strong>Transportation costs</strong> &#8211; Crete has a bus system that is easy and cheap to use. Within the main towns, buses only cost 1.80 EUR per trip. There is also ferry service offered to other islands. The ferry also covers the southern part of the island, since there are very few roads. Taxis are available on the island, though they are not cheap. Also, keep in mind that prices will be higher during the night. The best way to get around Crete, however, is to rent a car; the island is fairly large and the buses don&#8217;t go to many of the smaller sites. Rentals prices will vary, but expect to pay around 30 EUR per day for a car. As for flying, there are three airports on the island and daily flights to Athens can be found for as little as 30 EUR.</p></div>","title":"Crete Travel Guide: What to See, Do, Costs, & Ways to Save"}},"pageContext":{"id":"5b95ea2687be05832748ff85"}}