{"data":{"mongodbDatabaseArticles":{"id":"5b9248d787be056953db7c00","content":"<div><p><code>To reduce procrastination and become faster at launching my projects, I've set the goal to launch <a href=\"/12-startups-12-months\">12 startups in 12 months</a>. Each month will see me build something from start to finish. Each project should take up max. 2 weeks and solve someone's problem (often mine). This month, I'm launching the first project, <strong><a href=\"http://playmyinbox.com/\">Play My Inbox</a></strong>, which plays music from your inbox.</code></p> <h2>The problem</h2> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/Screenshot-2014-02-18-03.31.29-copy4-1024x441.png\"> <p>I have a habit with friends. For years, we've always been emailing each other music tracks from YouTube we love. We have email threads for genres like hip-hop, acid house and techno and each thread contains the best stuff we find. It's great cause it's my friends recommending me music I probably like too. For good reason, we all shy away from Facebook's mass-sharing drivel and prefer this organic (and private) method. Me and my friends must not be the only ones who do this through email, but to be frank, I really don't know!</p> <p>Now, the issue here is that Gmail's interface is not ideal for playing videos, and it's a lot of effort to keep up with the music flowing through all email threads daily. </p> <h2>The solution</h2> <p>I wanted to build something that'd keep me up to date on the music in my inbox and play them for me automagically non-stop.</p> <p>The first working version looked a little raw:</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"https://levels.io/wp-content/uploads/2014/02/Screenshot-2014-02-18-02.49.552-1024x302.png\"> <p>But after 14-days of working on it on-and-off, with a lot of polishing (and a pretty backdrop from <a href=\"http://unsplash.com/\">Unsplash</a>) it turned into this:</p> <p><a href=\"http://playmyinbox.com/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"https://levels.io/wp-content/uploads/2014/02/Screenshot-2014-02-18-03.40.14-1024x595.png\"></a></p> <h2>Challenges</h2> <p>Privacy is a huge deal for this app and will probably limit its usage since people won't give access to their inbox that easily. To mitigate that, I only request the minimum time of access to people's inbox, which is 60 minutes. After that, Gmail's access token expires. Additionally, it only searches for mails with YouTube/SoundCloud links and only saves those links, the sender/recipient names and subject line to display them below the music.</p> <h2>What it does</h2> <ul> <li>It authenticates to Gmail with <a href=\"//developers.google.com/gmail/xoauth2_protocol\">XOAuth2</a></li> <li>It fetches email through IMAP, only fetching messages with YouTube URLs</li> <li>It stores the YouTube/SoundCloud URLs, subjects and recipients to display</li> <li>It pulls every music track's details from the <a href=\"//developers.google.com/youtube/\">YouTube API</a> and <a href=\"http://developers.soundcloud.com/docs\">SoundCloud API</a></li> <li>It displays all music on a single automagically playing page with thread and search filters</li> <li>It polls the server live for new music and updates the page while they're being received</li> <li>It notifies the user by email once it's finished checking all messages</li> </ul> <h2>Try it yourself</h2> <p><strong><a href=\"http://playmyinbox.com/\">Try it here</a></strong> and I'd love to hear your feedback and any feature requests you may have.</p> <h2>Update</h2> <p>A month after this post, I've written a <a href=\"/debriefing-play-my-inbox/\">debriefing on how the launch went</a>.</p> <p><a href=\"/go-fucking-do-it/\"><strong>See the startup I built next: Go Fucking Do It &#187;</strong></a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Play My Inbox, collect music from your inbox and playlist them"}},"pageContext":{"id":"5b9248d787be056953db7c00"}}