{"data":{"mongodbDatabaseArticles":{"id":"5b9624ec87be058327490f39","content":"<div><p>In <a href=\"http://www.foxnomad.com/2009/04/29/common-sense-advice-on-handling-most-joint-injuries-on-your-own/\">Part 1 of handling most joint injuries on your own</a> I emphasized the importance of self-administering first aid within the first 48 hours. Taking care of an injury immediately after it occurs the right way, in large part determines how long you&#8217;ll be able to travel with ease again.</p>\n<p>Once you&#8217;ve done that now you can start pampering yourself and making sure that your injury heals all the way.</p>\n<p><strong>4. Stretch</strong></p>\n<p>Start slowly moving the injured joint in all of its natural directions with controled movements. At the first sign of pain stop your stretch and carefully move your joint back to rest. In the first 48 hours you want to stop blood flow to the injury sight, after this time you want blood to move freely to clean out scar tissue and prevent the joint from getting stiff.</p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/05/stretch1.jpg\" alt=\"stretch\" width=\"690\" height=\"530\"></p>\n<p><strong>5. Massage</strong></p>\n<p>Gently massage the muscles in and around the joint. This helps promote blood flow and release endorphins, a natural pain killer. Besides it feels good and can be shared if you&#8217;re traveling with a loved one or family. Remember, don&#8217;t do anything that causes pain and listen to your body, which brings me to my next point.</p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/05/massage1.jpg\" alt=\"massage\" width=\"690\" height=\"460\"></p>\n<p><strong>6. Don&#8217;t Overdo It!</strong></p>\n<p>Listen to your body! If something hurts don&#8217;t do it. If you just feel that you are limited by your injury or just can&#8217;t do everything you&#8217;ve planned, than don&#8217;t. I am one to push myself through most anything &#8211; I&#8217;ve had quite a resume of injuries &#8211; but a lingering injury that will hurt for months or years down the road isn&#8217;t worth it. You may end up doing more harm and need some serious treatment.</p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/05/headphones1.jpg\" alt=\"headphones\" width=\"690\" height=\"458\"></p>\n<p><strong>The Goal Is 100%<br>\n</strong></p>\n<p>Aim to get your injury manageable enough to get going again but keep treating yourself until completely healed. Don&#8217;t neglect your bum shoulder or ankle just because it isn&#8217;t aching anymore. Often ligaments and tendons, which receive poor blood supply, take weeks or months to heal fully. Stop taking care of them (stretching, massage, and listening to your body) and you increase your chances of re-injury or chronic pain down the line.</p>\n<p>Take care of yourself and your body will take care of you for many more travels to come!<br>\n</p>\n<p>[photos by: <a href=\"https://www.flickr.com/photos/glenscott/\">hey mr glen</a>, <a href=\"https://www.flickr.com/photos/wanhoff/\">thomasvanhoff</a>, <a href=\"https://www.flickr.com/photos/ina_j/\">_Ina_</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Common Sense Advice On Handling Most Joint Injuries On Your Own – [Part 2 of 2]"}},"pageContext":{"id":"5b9624ec87be058327490f39"}}