{"data":{"mongodbDatabaseArticles":{"id":"5b95eabe87be05832748ffcd","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/pinterest/cheapaccommodation.jpg\" alt=\"How to Find Cheap Accommodation\" width=\"675\" height=\"1012\">I don&#8217;t really like staying in hotels. I generally avoid them because of how much they cost. I just don&#8217;t see the point of paying $100+ per night for a room I will barely be in most of the day. It seems like a waste of money &#8212;&#160;no matter how nice a hotel can be. So I stick to the other end of the spectrum: I stay in hostels, with their dorm beds and cheap prices.</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-pick-a-good-hostel/\">I love hostels</a>, even if <a href=\"https://www.nomadicmatt.com/travel-blogs/hostel-shit-story/\">my roommates tend to shit in the room</a>.</p><p>But what about other types of places to stay? What are some forms of accommodation that don&#8217;t rely on you sharing a room with eight&#160;snoring strangers? What can you do if you don&#8217;t want that but also don&#8217;t want to pay the money for a hotel room? Continuing what seems to be my &#8220;<a href=\"https://www.nomadicmatt.com/travel-blogs/the-ultimate-guide-to-traveling-when-you-have-no-money/\">think</a> <a href=\"https://www.nomadicmatt.com/travel-blogs/cheap-places-to-visit-on-the-us-dollar/\">outside</a> <a href=\"https://www.nomadicmatt.com/travel-blogs/find-time-to-travel/\">the</a> <a href=\"https://www.nomadicmatt.com/travel-blogs/the-myth-travel-is-expensive-how-5-days-in-stockholm-cost-me-100-dollars/\">box</a>&#8221; theme of the last few months, here&#8217;s a list of all the different types of accommodation that are easy on your wallet you can choose from:</p><h3>Staying with Locals</h3><p><img src=\"https://media.nomadicmatt.com/altaccommodation2.jpg\" alt=\"stay with someone for free\"><br> I&#8217;ve talked about this many times before, but since this method is always good to know, it goes on this list too. One of the best ways to save money on accommodations is by not paying for it. Hospitality networks allow you to stay with locals who open up their home to you. Not only is this a great way to save on accommodation but you also get to interact with a local who can show you where to go&#160;and&#160;what to do, and teach you about the local culture. There are a few websites that make this happen:</p><p>All of these services connect travelers with people in various cities that offer a no-cost place to stay. Sometimes it&#8217;s a bed, sometimes it&#8217;s a couch, sometimes it&#8217;s literally just space. The purpose of these websites is to help travelers not only save money but also learn about the local culture by connecting them&#160;with someone who lives where you are visiting.</p><p>I like Couchsurfing the best as they have the largest and most active user network. Plus, members run meet-ups, so even if you don&#8217;t use the site for accommodation, it is still a wonderful way to meet people and get involved in local activities.</p><p>A lot of people get nervous about using these sites.&#160;&#8220;Are they safe?&#8221; they wonder. I&#8217;ve never had a problem or have even heard of a major problem beyond &#8220;my host was kind of lame.&#8221; All the sites have levels of verification to ensure the crazies stay away, and you can read reviews left by other users. Additionally, these sites are also not just for solo travelers. While it varies by hosts, many take couples and families. (Servas and Hospitality Club tend to be more open to families.)</p><h3>Home Exchange</h3><p><img src=\"https://media.nomadicmatt.com/altaccommodation3.jpg\" alt=\"stay in someone's home for free\"><br> This method works best for older travelers who already own a home. Home exchange programs have been around for a long time but are growing in popularity due to good marketing and word-of-mouth. Home exchanges are just like they sound: for a set amount of time, you exchange homes with a family from another country.</p><p>Most people don&#8217;t do this because they worry about security &#8212;&#160;but remember, the other family trusts you with their home, too. Moreover, websites that facilitate home exchanges usually have various levels of verification and security similar to Couchsurfing. Families talk to each other over phone and email, and there&#8217;s no commitment if you find that it&#8217;s not right for you.</p><p>For more information on home exchanges, check out the popular website <a href=\"http://www.homeexchange.com/\">Home Exchange</a>. This website was featured in the movie The Holiday, which did a lot to alleviate people&#8217;s fears over the process and bring this travel option into the mainstream. Another&#160;home exchange website is&#160;<a href=\"http://www.ihen.com/\">IHEN</a>.<br> </p><h3>House Sitting</h3><p>If swapping homes isn&#8217;t your thing, then <a href=\"https://www.nomadicmatt.com/travel-blogs/house-sitting/\">consider house-sitting as an alternative</a>. In exchange for watching and maintaining someone&#8217;s home while they are on holiday, you&#8217;ll get a free place to stay in the area you are visiting.</p><p>After signing up for one of these services (most have a sign-up fee), you get access to the database of available houses. Find a place, contact the homeowner, work out an arrangement, sign any documents (it&#8217;s important to ensure everyone is legally protected and your responsibilities are clearly spelled out), and you&#8217;re off. House-sitting jobs tend to be best for people who can stay in a destination for at least a couple of weeks, though there are occasionally short-term stints.</p><p>You can also use these house-sitting sites to find a place:</p><h3>Apartment Rentals</h3><p><img src=\"https://media.nomadicmatt.com/altaccommodation6.jpg\" alt=\"rent a local apartment\"><br> <a href=\"https://www.nomadicmatt.com/travel-blogs/guide-renting-apartments/\">Apartment rentals and I have a mixed history</a>. I used to hate them as they were too quiet and made me feel too far removed from everything, but over the years I&#8217;ve grown to appreciate them more as I desire a kitchen, calm surroundings, a place to do work, and privacy. While recently in London, I stayed at an apartment near Paddington Station. I was in town for a conference and the company <a href=\"http://www.wimdu.com/\">WIMDU</a> offered to host me. While the apartment was small, having recently become a health nut, it was nice to have a kitchen to cook my meals, do a bit of a workout, and have my own space.</p><p>Like I said, I&#8217;ve warmed up to serviced apartments. They are a nice bridge between a hostel and hotel, though they can get a bit expensive if you are a solo traveler. They are roughly double the cost (if not more) than a hostel dorm room. However, if you are part of a group or a couple and are looking for a respite from the dorms and hordes of travelers but don&#8217;t want a hotel room, this is your ideal accommodation option. Another reason to use this method? You get a kitchen, allowing you to cook and reduce your food costs.</p><p>My favorite rental websites are:</p><h3>WWOOFing</h3><p><img src=\"https://media.nomadicmatt.com/altaccommodation7.jpg\" alt=\"wwoofing\"><br> <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-travel-and-work-around-the-world-with-wwoof/\">Discussed in this informative and detailed post</a>, this program will let you stay on a farm and trade your labor for free accommodation. It&#8217;s a multi-purpose option: it lets you do something while you are traveling, give back to the community, and save money on room and board. You can use this option even if you have no farm experience and you don&#8217;t always have to be milking the cow. Many times, the work you are given is simply keeping things clean and organizing supplies!</p><h3>Farm Stays</h3><p><img src=\"https://media.nomadicmatt.com/altaccommodation4.jpg\" alt=\"stay and work on a farm for free\"><br> Want to live on a farm but not work like you would with <a href=\"http://www.wwoof.net/\">WWOOFing</a>? Try a farm stay. Farm stays allow you to stay on working farms, learn how a farm works, possibly get involved in the workings of the farm (milk that cow!), and enjoy a number of organized outdoor activities. Facilities range from basic camping to luxury rooms depending on the farm, but in general it&#8217;s like you&#8217;re staying at a bed and breakfast. Prices vary widely depending on where you are in the world, but generally expect to pay the price of a budget hotel (so at least $40 USD per night).</p><p>Here&#8217;s a list of resources to find a farm stay:</p><h3>Monastery Stays</h3><p><img src=\"https://media.nomadicmatt.com/altaccommodation5.jpg\" alt=\"stay in a monastery for free\"><br> Want something totally off the beaten track? Stay in a monastery. Accommodation in these monasteries is often very spartan, containing no more than a bed and desk, with simple meals prepared by the monks and nuns. Monasteries are very family friendly and quiet (most also have curfews). While many monasteries cost at least $50 USD a night per person (many have dorms for half that price), most simply ask for donations or are free, making them an amazing budget option too.</p><p>Resources for finding a monastery stay:</p><h3>Homestays</h3><p>Similar to apartment rentals and Couchsurfing, homestays are just like they sound: you stay at someone&#8217;s home for a set amount of time, but the difference between this and the other options is that for a set price (usually a couple of hundred dollars per week), meals and language lessons with your hosts are also included. You find a lot of these in developing countries, particularly Central and South America, where they are very widespread.</p><h3>Use Hotel Points</h3><p>Really want to stay at fancy hotels and not pay for them? Use hotel points! <a href=\"https://www.nomadicmatt.com/travel-blogs/travel-hacking-1-million-miles-per-year/\">Sign up for branded hotel credit cards, get free points, and then use them for free stays</a>. It&#8217;s what I do, because as much as the W Hotel makes my heart skip a beat, their prices give me a heart attack. Using hotel points, I stayed at a W Hotel in Barcelona (500 euros per night) for free, and spent a week at the Courtyard Marriott in Hong Kong. Most <a href=\"https://www.nomadicmatt.com/travel-tips/picking-a-travel-credit-card/\">branded credit cards</a> come with at least two&#160;and sometimes up to five&#160;free nights. (Note: this method works best if you are American.)</p><p>****</p><p>Like everything when it comes to travel, if you are open and willing to try something a little different, you&#8217;ll end up being able to not only save money but also experience something a bit more interesting and fun.</p><p><strong>Note:</strong> Big and special thanks to <a href=\"http://www.wimdu.com/\">Wimdu</a> for providing me with a voucher for my stay in London. I found their booking process simple and easy (though the layout could be a bit sleeker), the host was responsive to all my inquiries, and I had no issues with the service. This is the second time I&#8217;ve used them and certainly not the last.</p></div>","title":"Cheap Accommodation: Beyond the Hotel"}},"pageContext":{"id":"5b95eabe87be05832748ffcd"}}