{"data":{"mongodbDatabaseArticles":{"id":"5b9624dc87be058327490f25","content":"<div><p><em><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/cost4travel-logo1.jpg\" alt=\"cost4travel logo\" width=\"292\" height=\"65\">Stephane Pingaud recently got in touch with me about a new project called cost4travel. I was intrigued and wanted to learn more about this free service. Stephane shares some information about this new service which I think many travelers will find useful.</em></p>\n<p><strong>In a &#8216;tweet&#8217; of characters or less, what is cost4travel?</strong></p>\n<p>cost4travel provides a way for travelers to record and reference their travel costs, so that other travelers can budget realistically for their future trips.</p>\n<p><strong>How did cost4travel come to be?</strong></p>\n<p>cost4travel is the result of a personal travel experience (a 2 month, country-wide, backpacking family trip in Thailand, back in summer 2007) during which we asked ourselves many times: are we being ripped off by this speed boat owner, scooter rental agency or dive shop, shall we search for cheaper accommodation? etc.</p>\n<p>Upon my return to Europe, I felt the web would be an ideal platform to let travelers exchange and share between each other travel cost-specific information, to the benefit of the entire traveling community.</p>\n<p><strong>What differentiates cost4travel from other travel price comparison tools online (i.e. Kayak)?</strong></p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/cost4travel-screenshot1.jpg\" alt=\"cost4travel screenshot\" width=\"424\" height=\"261\">Travel meta-search engines, while very useful in the travel booking process, do not offer a complete picture of the travel costs to be expected from upcoming trips. They rely on suppliers&#8217; data gathered by spiders, and cover only the flight, accommodation and car rental components of travel, and do not offer qualitative reviews.</p>\n<p>For these reasons, we saw an opportunity in developing what I&#8217;d call a &#8216;social&#8217; travel search engine, where price information will come from the travelers themselves, not the suppliers. It would also cover an extensive range of travel-related products, from flights to accommodation, taxis, ferries as well as related services like restaurants, sports &amp; activities, insurance, visa fees etc.</p>\n<p>(The first version of www.cost4travel.com only covers flights, accommodation, car rental, ferry, train, bus &amp; taxi and finally restaurants. We will add other services as we progress, starting with attractions.)</p>\n<p><strong>What stage is cost4travel now?</strong></p>\n<p>cost4travel is not yet a company; we&#8217;re still at project phase, managed entirely and exclusively by the two co-founders. If the adoption rate and data contribution are satisfactory, we hope to be able to secure a partnership with investors and establish the company.</p>\n<p>We have a first (beta) version online, open to anyone, that shall help us define with the validity of the concept with the traveling community; it allows travelers to centralize and organize the costs of their trips in one place, and therefore be always up-to-date to what they&#8217;ve spent on their travel. With this information, we&#8217;re building cost4travel&#8217;s cost database which will in the future help travelers search for the lowest, highest and average prices for selected travel products, destinations and dates, by fellow travelers, and read associated comments.</p>\n<p>However, the version currently online does include a very basic search module, which offers travelers the means to view specific trip and travel reports as data is initially inputted. It goes without saying the number of&#160; trips from other travelers you can search is very limited due to the fact the number of travelers using the site to centralize and organize their own travel cost reports is still very low (we launched last week).</p>\n<p>The site is only in &#8216;international&#8217; English and targets any traveler worldwide who&#8217;s got a basic knowledge of that language; we&#8217;re planning to localize the site in many languages when we have secured financing and can therefore get more resources.</p>\n<p><strong>What do you hope or envision cost4travel to become in the coming months?</strong></p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/10/cost4travel-co-founders1.jpg\" alt=\"cost4travel cofounders\" width=\"386\" height=\"275\">Our immediate goal is to get enough visibility with travelers in North America and western Europe in order to establish whether the concept of our web site can fly, i.e. leisure &#8211; and possibly un-managed business &#8211; travelers do want to better organize their travel costs and control their travel budget. If they do, we grow our cost database and therefore are in a position to provide relevant results to travelers that will use our future &#8216;social&#8217; search engine.</p>\n<p>If they do, it&#8217;ll also mean that:</p>\n<ol>\n<li>Potential investors will be interested in cost4travel, leading to company creation and first round funding.</li>\n<li>We will be able to speed up our development cycle, initiate the development of mobile applications, introduce a loyalty program for travelers, look at innovative product features etc.</li>\n</ol>\n<p>I hope to be able to tell you in January that all these things are completed and/or their way.</p>\n<p><strong>Are there any cool features you&#8217;d like to share that you haven&#8217;t mentioned yet?</strong></p>\n<p>The truth is that the key features of our site is My Trips, which lets travelers create trips online, upload travel costs associated to these trips and then manage those as well as individual cost items as needed. For instance, you can check how much how much you paid in flights, hotels, car rental , restaurants etc for a specific year(s). This is the feature which will enable travelers to get a good grasp on their travel budget.</p>\n<p>Now, regarding the feature that I have not mentioned yet, you&#8217;ve got My Alerts. All My Alerts does is to inform by email whenever someone has uploaded to cost4travel a travel cost for a service and a destination that you&#8217;re interested in, and obviously give you the details of that cost, and associated comments.</p>\n<p>Thanks again Stephane, best of luck with cost4travel. I&#8217;d encourage any readers who check out the site to leave your feedback here in the comments to get your take on the site and thoughts on the idea itself.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Interview With Stephane Pingaud About New Service Cost4Travel"}},"pageContext":{"id":"5b9624dc87be058327490f25"}}