{"data":{"mongodbDatabaseArticles":{"id":"5b96248f87be058327490ead","content":"<div><p><img src=\"https://foxnomad.com/wp-content/uploads/2009/08/sad-face-on-plate1.jpg\" alt=\"sad face on plate\" width=\"346\" height=\"259\">A number of you are planning to travel the world one day, which won&#8217;t happen unless you can overcome these <a href=\"../2009/07/30/2009/07/23/2009/07/12/7-reasons-you-wont-travel-the-world/\">7 obstacles</a>. Here are <a href=\"../2009/07/30/2009/07/23/2009/07/16/overcoming-7-major-obstacles-to-traveling-the-world-1-you-are-comfortable-at-your-job/\">Part 1</a>, <a href=\"../2009/07/23/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-2-you-think-its-too-expensive/\">Part 2</a>, and <a href=\"http://www.foxnomad.com/2009/07/30/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-3-you-dont-know-where-youd-go/\">Part 3</a> of this series.</p>\n<p>Dealing with the practical issues of <a href=\"http://www.how-to-travel-the-world.com/\">how to travel the world</a> are usually at the forefront of obstacles we focus on, but can be much easier to overcome than intangible emotional dilemmas. Once you&#8217;ve decided to leave your job, have started selling and saving, and mapped out where you want to go, the reality that you won&#8217;t be where you are right now will hit.</p>\n<p>Fortunately technology is on your side and you&#8217;ll be more social than you think once you set off on your trip. Don&#8217;t try to fight it, you will miss people but accepting that makes it easier to overcome this obstacle to traveling the world.</p>\n<p><strong>Don&#8217;t Deny It</strong></p>\n<p>You won&#8217;t worry too much about not having a day job or the book shelf you sold but rather all of the people who won&#8217;t be coming with you. Whether your family is nearby or not there will be friends, coworkers, and people that it will be hard to say goodbye too. To overcome this obstacle the best thing you can do is accept this. <strong>Fighting it will increase the stress you face leading up to your trip making it an obstacle again. </strong></p>\n<ul>\n<li><img src=\"https://foxnomad.com/wp-content/uploads/2009/08/blindfolded-woman1.jpg\" alt=\"blindfolded woman\" width=\"330\" height=\"220\">Remember that others around you will be feeling the same way and will let you know. Don&#8217;t get confrontational or blow off your friends and family when they tell you that you&#8217;re going to be missed. Again, denying or fighting it only makes it an even bigger obstacle to overcome. <strong>Besides, it&#8217;s much easier (and nicer) to say &#8220;I&#8217;ll miss you too.&#8221;</strong></li>\n</ul>\n<p><strong>Embrace Technology</strong></p>\n<p>I consider a laptop to be an essential travel item. You should strongly consider bringing one with you as you travel the world since it gives you so many ways to see, hear, and stay in touch with everyone &#8211; not to mention it makes it easy for everyone else to get a hold of you too. Load up your laptop with these <a href=\"http://www.foxnomad.com/2009/01/22/essential-software-tools-for-digital-nomads/\">essential software for digital nomads</a> and learn <a href=\"http://www.foxnomad.com/2008/10/15/how-to-bum-a-wi-fi-signal-on-the-road/\">how to bum a wi-fi signal from the road</a>.</p>\n \n<p><strong>You Will Be More Social</strong></p>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/08/two-brown-butterflies1.jpg\" alt=\"two brown butterflies\" width=\"213\" height=\"160\">Extroverted or introverted you will be more social after you start traveling. Traveling solo forces you out of your shell and exploring the world with a partner or some friends makes you much more approachable (and people will approach you!) Traveling by nature is a social activity and you&#8217;ll be surrounded by people most times you visit anywhere and certainly will bump other travelers that are doing just what you are.</p>\n<p>It&#8217;s hard to alleviate the anxiety of missing people by telling yourself &#8220;well I&#8217;ll meet other people&#8221; before you actually do &#8211; so immerse yourself with some <a href=\"http://www.nomadicmatt.com/travel-blogs/perpetual-nomads-you-should-read/\">perpetual nomads you should read</a>.</p>\n \n<p><strong>Some Other Ways To Keep In Touch</strong></p>\n<ul>\n<li>Encourage your friends and family members to come and visit you on stops along your trip. It will be fun to see each other again and they&#8217;ll get to taste a part of your journey. They might be inspired to travel around the world too!</li>\n<li>There are plenty of travel bloggers around the world (you may be following some) and they/we&#8217;re generally a friendly bunch. See if any are along your route and would like to meet up for coffee or a meal.</li>\n<li>Of course Facebook and Twitter. (You can find me on both <a href=\"http://www.foxnomad.com/contact/facebook/\">Facebook</a> and <a href=\"http://www.foxnomad.com/contact/twitter/\">Twitter</a>.)</li>\n</ul>\n<p><strong>Let The Obstacle Overcome Itself</strong></p>\n<p>Missing your family and friends and worrying about it are part of the process &#8211; and overcomes itself &#8211; if you let it. The tools to stay in touch are at your fingertips and there&#8217;s no rule of the universe that says once you leave to travel you&#8217;ll never see anyone you knew ever again.</p>\n<p>Of course you can always go back to visit, or in many cases, you will be back to visit. The less you push back the smaller this obstacle becomes until there isn&#8217;t too much to overcome. What gets tricky is not the people who are here today but the little ones who might be on the way or have just arrived. We&#8217;ll overcome that obstacle next Thursday in Part 5.</p>\n<p>[photos by: <a href=\"https://www.flickr.com/photos/helga/\">helgasms!</a>, <a href=\"https://www.flickr.com/photos/lunay/\">lunae</a>, <a href=\"https://www.flickr.com/photos/55638904@N00/\">positivelypurple</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Overcoming 7 Major Obstacles To Traveling The World – #4 You’ll Miss Your Family and Friends"}},"pageContext":{"id":"5b96248f87be058327490ead"}}