{"data":{"mongodbDatabaseArticles":{"id":"5b95ef6f87be058327490112","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">9 Myths About Thailand That Worry Your Family</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/myths-about-thailand/\"><img class=\"aligncenter\" title=\"9 Myths About Thailand That Worry Your Family\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/12/Myths-About-Thailand.jpg?resize=563%2C389&amp;ssl=1\" alt=\"Myths About Thailand\" width=\"563\" height=\"389\"></a></p>\n<p>As your family and friends find out that you&#8217;re moving to Thailand, are they convinced you will be stranded in some undeveloped country with limited access to running water and electricity? Do they keep mixing up Thailand and Taiwan? Does it make you want to scream from the mountaintops that Thailand is awesome? In case you&#8217;ve heard similar silliness, we&#8217;ve created a list to help ease your family&#8217;s and friends&#8217; worries. It&#8217;s time we put some myths about Thailand to rest, because there is more to Thailand than what western media will have you know!</p>\n<h2><p id=\"01_Thailand_has_an_Underdeveloped_Infrastructure\"><p>01</p> Thailand has an Underdeveloped Infrastructure</p></h2>\n<p>Does your family believe in the myths about Thailand&#8217;s poorly developed infrastructure? There is no need to worry about freely moving throughout the country or getting out should an emergency arise. In fact, Thailand has over twenty airports, eight of which are international:</p>\n<ul>\n<li><p>Suvarnabhumi International Airport (BKK)</p></li>\n<li><p>Don Mueang International (DMK)</p></li>\n<li><p>Chiang Mai International Airport (CNX)</p></li>\n<li><p>Chiang Rai International (CEI)</p></li>\n<li><p>Hat Yai International Airport (HDY)</p></li>\n<li><p>Phuket International Airport (HKT)</p></li>\n<li><p>Samui International Airport (USM)</p></li>\n<li><p>U-Tapao International Airport (UTP)</p></li>\n</ul>\n<p>There are also trains, extensive bus routes, and modern highways throughout Thailand. The accessibility of this international travel hub should be the least of anyone&#8217;s worries.</p>\n<h2><p id=\"02_Thailand_is_Very_Unsafe\"><p>02</p> Thailand is Very Unsafe</p></h2>\n<p>Thailand is a safe country for expats and travelers, especially for women traveling solo. Thai people are welcoming, respectful, and generally non-violent towards foreigners. The biggest concerns are scams in touristy areas, such as getting charged much more than one should, and crimes of opportunity, like petty thefts.</p>\n<p>Despite off-and-on and sometimes volatile political protests in certain areas of Bangkok, daily life is largely unaffected elsewhere in Thailand. Protests and demonstrations are easily avoidable with a little planning and forethought.</p>\n<p>Road accidents are common in Thailand. Wear proper safety gear while on a motorbike, always be aware of your surroundings, and use common sense, just as you would back in your home country.</p>\n<p>Many serious incidents are easily preventable and occur when a person develops a false sense of security while living or traveling abroad.</p>\n<h2><p id=\"03_You8217ll_Live_in_a_Bamboo_Hut_with_Dirt_Floors\"><p>03</p> You&#8217;ll Live in a Bamboo Hut with Dirt Floors</p></h2>\n<p>Don&#8217;t believe the myths about Thailand having dodgy living accommodations. Thailand offers the same amenities of Western countries, and there are plenty of modern options available. Our <a title=\"Ban Jed Yod Serviced Apartments\" href=\"https://www.tielandtothailand.com/apartment-at-ban-jed-yod/\" target=\"_blank\">first apartment</a> came with a flat screen TV, a bathtub, a king sized bed, and plenty of storage areas, all for $330 USD a month. Our <a title=\"Our New House in Chiang Mai\" href=\"https://www.tielandtothailand.com/new-house-chiang-mai/\">current house</a> is set on a private lot, two bedrooms, two bathrooms, and a Western kitchen for $450 USD per month.</p>\n<h2><p id=\"04_You8217ll_Be_Eating_Nothing_ButCarry_Out\"><p>04</p> You&#8217;ll Be Eating Nothing But&#160;Carry Out</p></h2>\n<p>Yes, there are stir fries and plenty of dishes with rice and noodles, but don&#8217;t let myths about Thailand&#8217;s cuisine fool you into thinking it&#8217;s the same as the generic takeaway from that run of the mill Chinese delivery place.</p>\n<p>Thai food is known for its sweet, salty, tangy, and spicy balance. It also has <a title=\"Khao Soi\" href=\"https://www.tielandtothailand.com/khao-soi-northern-yellow-curry-noodles/\" target=\"_blank\">rich curries</a> and grilled meats that are phenomenal. Find a nearby Thai restaurant that has good reviews and take your family there.</p>\n<h2><p id=\"05_You_Won8217t_Be_Able_to_Find_Anything_You_Need\"><p>05</p> You Won&#8217;t Be Able to Find Anything You Need</p></h2>\n<p>Most of our friends and family back home couldn&#8217;t believe that Chiang Mai was equipped with many malls, shopping centers, and superstores. Many supercenters actually dedicate entire floors to electronics, clothing, or beauty stores with familiar Western brands and products. These are some main stores:</p>\n<ul>\n<li><p>Tesco Lotus</p></li>\n<li><p>Big C Supercenter</p></li>\n<li><p>Robinson Department Store</p></li>\n<li><p>Makro</p></li>\n<li><p>Tops Market</p></li>\n<li><p>Central Department Store</p></li>\n<li><p>Home Pro</p></li>\n<li><p>Index Living Mall</p></li>\n</ul>\n<p>This was one of the myths about Thailand we fell for originally. After visiting one of these western superstore equivalents, we were pleasantly surprised at how many products looked familiar.</p>\n<h2><p id=\"06_Thailand_is_For_Drunks_and_Sex_Tourists\"><p>06</p> Thailand is For Drunks and Sex Tourists</p></h2>\n<p><a href=\"https://www.tielandtothailand.com/myths-about-thailand/\"><img class=\" aligncenter\" title=\"9 Myths About Thailand: Your Family Can Relax\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/12/TielandtoThailand.com-591.jpg?resize=563%2C332&amp;ssl=1\" alt=\"Myths About Thailand\" width=\"563\" height=\"332\"></a></p>\n<p>While there is a dark side in Thailand that caters to substance abusers and sexpats, myths about Thailand being good for nothing else should not deter you from living here. Thailand boasts beautiful waters for diving and snorkeling, beaches for yoga retreats, and mountains and jungles for trekking. Cities like&#160;<a title=\"Hua Hin as a Second Home\" href=\"https://www.tielandtothailand.com/hua-hin/\" target=\"_blank\">Hua Hin</a> and <a title=\"First Impression of Chiang Mai\" href=\"https://www.tielandtothailand.com/first-impression-of-chiang-mai/\" target=\"_blank\">Chiang Mai,</a> are family friendly and are much slower-paced than the bustling tourist areas and red-light districts of Bangkok. Peel back the layers and you&#8217;ll find Thailand is a wonderfully diverse and beautiful place to live.</p>\n<h2><p id=\"07_You_Can8217t_Afford_to_Live_in_Thailand\"><p>07</p> You Can&#8217;t Afford to Live in Thailand</p></h2>\n<p>Myths about Thailand&#8217;s affordability being an issue are silly. Many things are incredibly affordable. For less than $5 you can&#8230;</p>\n<ul>\n<li><p>Gas up your scooter</p></li>\n<li><span><a></a><p>Enjoy a Thai <a title=\"$5 Massage\" href=\"https://www.tielandtothailand.com/five-dollar-foot-massage/\" target=\"_blank\">massage</a> </p></span></li>\n<li><p>Watch a new release at the movie theater</p></li>\n<li><p>Buy a pair of shoes</p></li>\n<li><p>Fill up on a Thai meal for two, with beer</p></li>\n</ul>\n<p>Try doing any of these things back home without blowing $20 or more! Avoid <a title=\"Budget Mistakes\" href=\"https://www.tielandtothailand.com/thailand-budget-mistakes/\" target=\"_blank\">budget blunders</a>&#160;just as you would back home and you&#8217;ll be fine. Although<a href=\"https://www.tielandtothailand.com/cant-recommend-living-on-usd500-per-month-in-chiang-mai/\"> we don&#8217;t recommend living on $500 per month</a> like some people suggest, a couple can live comfortably&#160;in Thailand for around $1,000 USD per person.</p>\n<h2><p id=\"08_Thailand8217s_Medical_Care_is_Dirty_and_Dangerous\"><p>08</p> Thailand&#8217;s Medical Care is Dirty and Dangerous</p></h2>\n<p>The next time someone tells you myths about Thailand&#8217;s medical or dental work being unsterilized, unsafe, or shotty, be sure to drop these facts:</p>\n \n<p>These procedures can be done by English-speaking doctors, many of whom are trained in Western countries and practice with the most advanced medical equipment and techniques.</p>\n<h2><p id=\"09_You_Won8217t_be_Connected_With_the_Rest_of_the_World\"><p>09</p> You Won&#8217;t be Connected With the Rest of the World</p></h2>\n<p>Thailand is an easy place to conduct business and maintain constant communication with your loved ones back home. You can stay connected with loved ones through countless WiFi hotspots available most often at coffee shops, restaurants, hotels, and guesthouses in major towns and cities.</p>\n<p>While some countries are notorious for unreliable internet connections, Thailand is ahead of the game. Don&#8217;t let the myths of Thailand&#8217;s lack of electricity and infrastructure lead you to believe there is also no internet!</p>\n<h2><p id=\"What_Do_Your_Toughest_Critics_Have_to_Say_Now\"><p>What Do Your Toughest Critics Have to Say Now?</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-8316\" title=\"Get Rid of Those Bad Thoughts\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/12/TielandtoThailand.com-10.jpg?resize=563%2C373&amp;ssl=1\" alt=\"Spreading Rumors and Myths About Thailand\" width=\"563\" height=\"373\"></p>\n<p>For the doubters amongst your friends and family who truly believe the myths about Thailand, this list should begin to chip away at their skepticism and show what Thailand really has to offer as an expat living destination.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"9 Myths About Thailand That Worry Your Family"}},"pageContext":{"id":"5b95ef6f87be058327490112"}}