{"data":{"mongodbDatabaseArticles":{"id":"5b92489687be056953db7bbb","content":"<div><p>I just spent the last week moving ALL my sites to be HTTPS by default. It's tedious to set up and pricey ($10/y per domain). But it's worth it. And if you're a maker of sites and apps that people from all over the world use (like many of you reading this are), I think it's your responsibility to set it up by default now. It gives your users increased privacy and security and it even has advantages for us too.</p> <h2>Better security</h2> <p>With HTTPS enabled by default, your users are more secure. Because if you're letting users login with passwords for example, they're transferred over an unsecure connection. Even personal data like addresses can be sensitive. Many of us are building apps that include chat functionality, the stuff said there can be sensitive too. This gets especially dangerous with people increasingly working on public/shared WiFi's (e.g. coffee shops, hotels) where snooping passwords is literally as easy as installing <a href=\"http://wireshark.org/\">Wireshark</a>. I've tried it and I was able to read the packets of most of the people on my hotel's network. That's insane in 2015.</p> <h2>Better privacy for your users</h2> <p>With internet spreading to more places in the world, there's a higher chance your site will be used in places that have less freedom of speech than your country. If snooping on other people's connections is so easy without HTTPS, I think it's our responsibility as a site/app builders to at least try to protect our users's security with HTTPS:</p> <blockquote><p> Whenever you use an HTTP website, you are always vulnerable to problems, including account hijacking and identity theft; surveillance and tracking by governments, companies, and both in concert; injection of malicious scripts into pages; and censorship that targets specific keywords or specific pages on sites. </p></blockquote> <p>&#8212; Peter Eckersley on <a href=\"//www.eff.org/deeplinks/2014/11/certificate-authority-encrypt-entire-web\">EFF.org</a></p> <p>Even non-interactive sites should think about this, because the URLs people visit on your site without HTTPS are shared publicly. Stuff like which news a user reads and their particular choice of any other media consumption (think adult content), should be private by default as it increases the odds of being profiled by governments, companies. Even if they have no bad intentions, everyone has a legal right to privacy. For example, reading lots of articles on Wikipedia about terrorism might get you profiled as a terrorist. Luckily <a href=\"http://memeburn.com/2013/08/wikipedia-to-roll-out-https-by-default-on-some-time-in-august/\">Wikipedia already set HTTPS default 2 years ago</a>.</p> <h2>Better referral data</h2> <p>You know how in Google Analytics, you're getting less and less referral info these days? Well that's also because HTTP referrers cannot share it with HTTPS hosts and vice versa. It means that if your users come from a HTTPS site previously (like <a href=\"//google.com/\">Google</a> itself), you won't be able to see any referral info. If the referral is HTTPS and you are HTTPS, you can though. With more sites switching to HTTPS as default in the future, this seems like a good choice.</p> <h2>Google ranks you better</h2> <blockquote><p> (..) we&#8217;re starting to use HTTPS as a ranking signal. For now it's only a very lightweight signal (..) But over time, we may decide to strengthen it, because we&#8217;d like to encourage all website owners to switch from HTTP to HTTPS to keep everyone safe on the web. </p></blockquote> <p>&#8212; Zineb Ait Bahajji and Gary Illyes on <a href=\"http://googleonlinesecurity.blogspot.com/2014/08/https-as-ranking-signal_6.html\">Google's security blog</a></p> <p>Google has stated it will now reward HTTPS-default sites with higher ranking in search results. It also rewards fast sites (with low loading times) and sites that are responsive (with a mobile-friendly layout). So that means combining those, theoretically gives you a boost.</p> <h2>There's one disadvantage:</h2> <p>Load times increase over HTTPS. Right? It makes things slower. But does it always have to be like that? No. Actually <a href=\"//www.httpvshttps.com/\">HTTPS can be faster than HTTP</a>:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/05/Screenshot-2015-05-01-19.25.52.png\"> <p>There's a secret though, that site uses <a href=\"http://en.wikipedia.org/wiki/SPDY\">Google's new protocol SPDY</a> which is lightning fast and secure.</p> <h2>Setting it up HTTPS with SPDY</h2> <p>You can <a href=\"/add-https-to-nginx-for-free-and-help-make-the-world-more-secure/\">set up SSL on NGINX for free</a> too, although I'd recommend just paying NameCheap $10/y to buy the Comodo SSL certificates as they're less troublesome to set up and more reliable. </p> <p>Also <a href=\"http://centminmod.com/nginx_configure_https_ssl_spdy.html\">SPDY works with NGINX now</a>, so that's easy to set up too. Bjorn Johansen wrote a nice article on how to <a href=\"//bjornjohansen.no/install-latest-version-of-nginx-on-ubuntu\">get the latest version of NGINX with SPDY</a> and then <a href=\"//bjornjohansen.no/enabling-spdy-nginx\">enabling SPDY</a>. It's literally changing this:</p> <blockquote><p> listen 443 ssl; </p></blockquote> <p>into </p> <blockquote><p> listen 443 ssl spdy; </p></blockquote> <p>Have a lot of NGINX virtual server configs to change this? Try this (watch out for those curly quotes, WordPress somehow changes them, no idea why, they should be ordinary single quotes).</p> <blockquote><p> find . -name 'nginx.conf' -exec sed -i 's/443 ssl/443 ssl spdy/g' {} \\; </p></blockquote> <p>Yes people, DevOps is getting really easy these days :D</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Now is probably the time to make HTTPS the default on all your sites and apps"}},"pageContext":{"id":"5b92489687be056953db7bbb"}}