{"data":{"mongodbDatabaseArticles":{"id":"5b962a3987be0583274911d1","content":"<div><p>This post is an incredibly detailed guide, step by step, for <strong>how to apply for an Indian visa from USA for US citizens</strong>. I have applied myself and taken notes and screenshots of every step of the way. You don&#8217;t find a more detailed guide than this online. <strong>If you are from the UK, check out my article <a href=\"https://hippie-inheels.com/how-to-apply-for-an-india-visa-from-the-uk/\">how to apply for an Indian visa for UK citizens</a> </strong>where my English boyfriend documented another detailed step by step guide. This post is updated often to stay up to date.</p><blockquote><p>This paper visa application is if you are&#160;going LONGER than 60 days.&#160;If you are going for less, you need a 60 day e-visa. Disregard everything below and use <a href=\"https://www.ivisa.com/india-visa-application/?utm_source=hippie_inheels\">iVisa</a> for a stress free e-visa or go through the&#160;<a href=\"https://indianvisaonline.gov.in/visa/tvoa.html\" target=\"_blank\" rel=\"noopener noreferrer\">government site</a>. iVisa charges a fee but takes care of everything for you so you don&#8217;t have to deal with the Indian embassy. The major benefit of iVisa is you can do it way ahead of time but they will submit later so you can full 60 days &amp; a &#8220;zero frustration&#8221; policy aka they do everything for you.</p></blockquote><p>PS: If you are planning an epic trip to India, you need to download my India Guide which will guarantee that! Read more about it and get a copy <a href=\"https://hippie-inheels.com/guide-to-india-ebook/\">here</a>.</p><h1>How to Apply for Indian Tourist Visa from USA &#8211; Step by Step guide</h1><p>Everything is being outsourced to <a href=\"http://www.in.ckgs.us/\" target=\"_blank\" rel=\"noopener noreferrer\">Cox and King</a>. Any questions I had while writing this, I called up Cox and King to get the answers so that all information is correct.</p><p>This is a step by step guide on how to apply for Indian tourist Visa from USA.&#160;Again, you can check the post about how to get a visa for India from the UK on this post.</p><h2>How to Apply for Indian Tourist Visa from USA</h2><p><strong>Step 1.</strong> Start at the <a href=\"http://www.in.ckgs.us/visa/visa-process.shtml\" target=\"_blank\" rel=\"noopener noreferrer\">India Visa Center&#160;for Cox and King&#160;</a>website to see what type of visa you need. I&#8217;m only discussing tourist visas in this post, so be sure that&#8217;s the type you&#8217;ll want. [If you need a visa type other than tourist, you still do all these steps but will have more questions and more forms to fill out]. Next, under &#8220;visa&#8221; in the top left dropbox, click &#8220;visa application &#8211; get started&#8221;. You&#8217;ll then fill in the page that pops up with some initial information. This is the easy part! You will be told your &#8220;mission&#8221; here based on the state you input. Remember this! For Ohio, mine was New York. Also, you&#8217;ll get a &#8220;temporary application ID&#8221;. You need to write this down and keep it.&#160;<strong>At the end of the form when you review everything, it will ask if it&#8217;s all correct. Once you say YES, you cannot change anything later. You will have to start over on a new form.</strong></p><p><strong>Step 2.</strong> Make sure your passport is okay for use: &#8220;Original, signed passport valid for 6 months from day of application, and with at least two blank visa pages for Indian visa stamps. Amendment pages are not acceptable for visa stamps.&#8221;</p><p><strong>Step 3.</strong> Start the application paperwork that redirects to the Indian site. It is &#8220;step 2&#8221; and Cox and King automatically takes you here after you save your initial information on Cox and King. You will be redirected to the Indian website for this part. It will ask if this is okay, say &#8220;yes&#8221;. Click the big orange button that says &#8220;click here&#8221;.&#160; You must fill out the parts for step 2, then come back to Cox and King right after: &#8220;You must return to the CKGS website within 1 and a half hour otherwise your Current Session will expire and you will have to fill in the Government Application form again.&#8221;</p><p>Another page will pop up which is the actual application, as I just mentioned. You want to click the orange button that says &#8220;regular visa application&#8221;.</p><p>Fill out the information very carefully. Once you go to page two of this form, a NEW application ID will come up. This is not the same as your original temporary application ID. You NEED to save this. It&#8217;s very important. I will now talk a bit about the questions asked on the India visa form.</p><p><img class=\"aligncenter size-full wp-image-5882\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-08-12-at-4.58.10-PM.jpg?resize=560%2C304&amp;ssl=1\" alt=\"how to apply for indian tourist visa from usa\" width=\"560\" height=\"304\"></p><p><strong>Step 4.</strong> At the very top is a &#8220;select missions office&#8221;.&#160; You were told this in step 1 but if you forget, you can go to find your jurisdiction by clicking&#160;<a href=\"https://www.in.ckgs.us/indian-embassy-consulate-locations-jurisdiction\" target=\"_blank\" rel=\"noopener noreferrer\">this link</a>.&#160;See which state you apply from is correlated to which embassy. For example, Ohio is to send documents to New York. So on your application over temporary ID select USA: <strong>NY.</strong></p><p><img class=\"aligncenter wp-image-5970\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/Screen-shot-2014-08-19-at-12.44.28-PM.png?resize=560%2C350&amp;ssl=1\" alt=\"applying for an indian visa from usa\" width=\"560\" height=\"350\"></p><blockquote><p>These following steps walk you through how to fill out the India visa application on their website, although they change it every few months and you may see some different ordering of the questions. It&#8217;s the same gist, though!</p></blockquote><p><strong>Step 5</strong>. While filling out this application, refer to <a href=\"http://www.in.ckgs.us/faq\" target=\"_blank\" rel=\"noopener noreferrer\">FAQ About the Visa Application&#160;form</a> and read number 9. It starts with how many months should I enter if I go only two weeks? Note from C&amp;K: &#8220;If the applicant has a middle name, it needs to be written as the &#8220;Given name&#8221; in the online application and it MUST match up with the name in the passport.&#8221;&#160;Lastly, on&#160;that&#160;page it will ask if you have another passport and once you click &#8220;no&#8221; if you don&#8217;t, the other questions will disappear and you&#8217;ll copy the captcha &#8220;access&#8221; code and click &#8220;Save and Continue&#8221;.</p><p><strong>Step 6.</strong> Fill out page 2 with your address (click box for &#8220;same&#8221; if permanent and present are same), parents details, etc until it&#8217;s finished and refer to those FAQ for any section you are unsure of.</p><p><strong>Step 7.</strong> Click save and continue and move on to page 3. Type of visa:&#160;<strong>tourist visa.&#160;</strong>Places to visit, just say the cities in India you are interested in, whatever fits in the box. Duration of visa in months:&#160;<strong>6 (is what I&#8217;ve always done, but they do offer more now).&#160;</strong>The number of entries: <strong>multiple </strong>(this is for backpackers who may cross over to Nepal or something. You could pick single entry if you KNOW 100% you are going into India one time only in that 6 months.) Purpose:&#160;<strong>Tourism.&#160;</strong>Next when you&#8217;re flying there and what airport you plan to fly into. The middle parts are easy, then at the end you put your contact person in India. You can put a hotel, but put an accurate address. If you don&#8217;t have anywhere planned to stay, find a hotel online and enter&#160;something.&#160;If you are visiting a friend, put their information. Lastly, a reference to a friend in America that can vouch you&#8217;re not a terrorist.</p><p>* Remember the date issued STARTS the 6 months you have in India, not the date you arrive in India. Also, it says to make sure you put your e-mail and cell phone number, which should be in the application form.</p><p><strong>Step 8.</strong> Upload photo. I had issues with this (shocking, I know) but it did work after two tries. Later, you will glue your same printed 2&#215;2 on the application.&#160; When you click save and continue, it takes you to the page of &#8220;is everything correct?&#8221; &#160;This is that last chance to make changes or you have to do the WHOLE thing over if you notice something after printing. Check and double check then verify and continue. Now print it.<strong>&#160;It should also show you a FILE NUMBER/ Reference ID / Application number. </strong>This is not the same as the temporary ID and needs to also be written down and kept in case you need to print another copy of this later. Note from C&amp;K: &#8220;Please make sure that the Application Form prints completely with the port of entry and exit completely printed at the bottom as well as the bar code.&#8221;&#160;</p><p><strong>Step 9.</strong> Be sure to sign on BOTH PAGES: Under the photo on the first page, and at the bottom of the second page. Other than the signature do NOT write on the application. Do NOT make handwritten changes on the application or it will not be accepted, so the website says.</p><p><strong>Step 10</strong>. Attach your 2&#215;2 photo on glossy paper with a<b>&#160;white background and no glasses</b> to the designated spot. Use paper clips or glue but do NOT staple. Your face should be in 80% of the frame.</p><p><strong>Step 11</strong>. Gather your proof of residence document &amp; any other you need. Here is a <a href=\"https://www.in.ckgs.us/visa/visa-application-guide.shtml\" target=\"_blank\" rel=\"noopener noreferrer\">list of documents needed via Cox and King</a>; at the top select &#8220;tourist visa&#8221;. It will show you a list of everything you need to include in your packet and actually walk your through filling out the forms. It will take you through the &#8220;additional particulars form&#8221; and show you the rest of what you need to send and fill in, like the &#8220;Religious undertaking letter&#8221;. Always print each form it prompts you to fill out. For proof of residence (if you need it) Here is what they call proof: &#8220;State Issued Identity cards i.e. Valid driving license, Utility Bills for water, Gas, Electric, Sewage, copy of valid lease, with signature of Landlord AND tenant to be provided. Do not cut any document to smaller size like Driving size, passport copy. Utility bill must be from last 90 days.&#8221; Here are some documents which they will NOT take:&#160;Cell phone bill, credit card Statement, bank Statement, cable bill, insurance forms, any address with a P.O. Box. A commenter added that if you send a photocopy of your driver&#8217;s license- they want it in COLOR.</p><p><strong>Step 12.</strong> <strong>If you are a minor (under 18)</strong> refer back to the FAQ&#8217;s on the documents page (from step 3 on the website), which adds a few extra documents.Applicants who have dual citizenship with the US and another country must apply on their US passport, if living in the US except for applicants who <strong>hold dual citizenship with Pakistan</strong>. Pakistani citizens who have also acquired US citizenship must apply for a visa on their Pakistani passport only.&#160;If the applicant is a student, retired, self-employed / freelancer or house-wife, bank statement for the last three months is required to be submitted.</p><p><strong>Step 13.</strong>&#160;Payment. Again, it will redirect you here. You will choose your shipping options. You can easily pay by a USA card.&#160;There is only one order form per applicant allowed, so if you are sending two passports, you fill out two of these forms. For shipping, your shipping address MUST be the same address as your permanent address listed in the application, or it will be denied.</p><p><img class=\"aligncenter size-full wp-image-27255\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2014/08/India-tourist-visa-from-usa-2.jpg?resize=971%2C1024&amp;ssl=1\" alt=\"\" width=\"971\" height=\"1024\"></p><p><strong>NOTE!! I talked on the phone to a Cox &amp; King rep who confirmed EACH person MUST pay $15 even if two, three, or four passports come in together, all of them must pay $15 each to get their passports sent back. They must be sent separately and have their own barcodes.</strong></p><p><strong>Step 14.&#160;</strong>Once you&#8217;ve paid, you MUST print and send a copy of that payment receipt with your bundle of visa documents. It will now populate a list of everything you need to send &#8211; although you can also use your new &#8220;application ID&#8221; to login to your account and re-print any forms you forgot. You must print your shipping label and a barcode which will be pasted to the FedEx envelope.</p><p>&#160;</p><p><strong>Step 15. </strong>Gather all the documents for the parcel to be sent out. So far you have your <strong>application with photo and signatures, your proof of residency, your order form, your additional particulars form, your PASSPORT, a copy of the payment receipt, the visa checklist, and your courier service form.</strong> Double check the address for your jurisdiction and paste the address on the front. Note on address writing: &#8220;At this time all CKGS Application Center, USA locations, are unable to use manual hand written labels from any courier.&#160;Please provide a computer generated label from the courier website or retail store with your postal application.&#8221; &#160;If you need to&#160;reprint the label, enter the requested information or you can ask FedEx to make you a label at a fee.&#160;The address you return the passports to must be the same address you use for proof of residency.&#160;</p><p>Tips: when you ship your package from FedEx make sure the envelope has a plastic seal so rain or snow doesn&#8217;t ruin your documents and separate the packets within the envelope for different applicants applying together. I did the overnight option, but I&#8217;ve also done the airway bill option (cheaper but more work).</p><p><strong>Step 16.</strong>&#160;IF YOU DO NOT PAY $15,&#160;<strong>Put inside the package a pre-paid self address traceable envelope and airbill.&#160;</strong></p><p>A note on sending more than one at a time:&#160;<strong>&#160;&#8220;</strong>If there is a group / family of four applicants and applying for the same service (only Visa or only OCI) applicants can send 1 prepaid return envelope but if they are applying for different services then they need to send different return prepaid envelopes. In 1 envelope we can send only 4 passports; if there are more than four passports we require separate envelopes.&#8221; If you are a family of four needed the same type of visa you can send them together with one envelope for them to be sent back in.&#160;</p><p><strong>Step 17. </strong>IF YOU DO NOT PAY $15,<strong>&#160;</strong>It&#8217;s a FedEx airbill you need if you think you can get it returned cheaper than $15 or if it makes sense because you have multiple passports. If you go into the shop they will help&#160;you. Here is a note from the folks at Cox and King about your airbill: &#8220;<strong>Applicants must not provide a handwritten or manual FedEX air bill</strong>. Airbills with credit card information, handwritten airbills or blank airbills with information typed in cannot be used by CKGS office. All such passports will be held back in CKGS office and may lead to delays. CKGS strongly recommends using a traceable airbill from FedEX. CKGS also recommends that return shipping package is insured.&#8221;&#160;You CANNOT pay with credit card; I actually set up an account with FedEx and the money was deducted from my bank account, but from what I remember it wasn&#8217;t easy and for one passport, $15 is a good price (and half what Travisa charged).</p><p><strong>Step 18.&#160;</strong>On the outside of the envelope, they ask you specify department name. For visa applications, write VISA. Send your package and track it via step 6 on the website. It may take longer as offices are merging and Cox and King is officially taking all other visa companies outsourced applications. <strong>According to the Cox and King rep I spoke with, it should take from 5 business days up to two weeks max.</strong></p><p>Omg, thank god I&#8217;m finally done writing this! Why can&#8217;t they make getting a visa easier!? I have to say, the whole system is a nightmare &amp; the people at the call center are confused on what&#8217;s right and wrong. Finally, though this post is accurate and up to date! I hope it helps someone.</p><p>Now that you have your passport and visa, here are <a title=\"15 Documents To Take While Traveling (Especially to India)\" href=\"https://hippie-inheels.com/documents-to-take-while-traveling/\" target=\"_blank\" rel=\"noopener noreferrer\">15 documents you need to take with you abroad</a>. This has nothing to do with the visa, so not to confuse, but it&#8217;s photo ID you&#8217;ll need abroad, copies of things in case you lose your credit card, etc.</p><ul><li>Disclaimer: The Cox &amp; King&#160;site &amp; India Visa regulations change often so make sure that you&#8217;ve completed everything per their standards, not the standards of this post. This is only a guide to help not a direct source of Cox and King information. I did call them a couple times to verify things but they are located at a call center in Bombay and nothing they say can be proven! Prepare to be on hold about 20 minutes.</li></ul><p>Does all of this seem like too much hassle? If you come to India for less than 60 days, you can get an evisa and avoid this. iVisa charges a fee but takes care of everything for you if going for less than 30 days:&#160;<a href=\"https://www.ivisa.com/india-visa-application/?utm_source=hippie_inheels\" target=\"_blank\" rel=\"noopener noreferrer\">click here for iVisa</a>.&#160; They have a &#8220;zero frustration&#8221; policy aka they do everything for you.</p><h2>Ready for the next step of planning you India trip?</h2><p>I&#8217;ve been in India for over five years and have traveled a huge amount of this country. My blog has over 800 articles with tips on travel, most of them about India. From how to dress to how to book a train and where to stay in every town &#8211; it&#8217;s all here. I&#8217;ll link some tops blog posts to get your trip started as well as resources for planning out more on travel insurance and flights.</p><h3>Pin How to Apply for Indian Tourist Visa from USA<p> for later:</p></h3><p><img class=\"aligncenter size-full wp-image-24402\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2014/08/Apply-India-Visa-For-USA-Citizens.jpg?resize=564%2C1128&amp;ssl=1\" alt=\"How to Apply for Indian Tourist Visa from USA\" width=\"564\" height=\"1128\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Step by Step: How to Apply for Indian Tourist Visa from USA"}},"pageContext":{"id":"5b962a3987be0583274911d1"}}