{"data":{"mongodbDatabaseArticles":{"id":"5b95eaf787be05832748ffe8","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/travelboycotts2.jpg\" alt=\"travel related protest\"><br> Recently, Mississippi and North Carolina both passed anti-LGBT laws, and many tourists, bloggers, and celebrities promptly said, &#8220;Well, as a sign of protest, I won&#8217;t go there because I don&#8217;t want to support a state whose laws I disagree with!&#8221; This reminded me of when people refused to go to Burma because of the junta, declined to visit the United States when George Bush was president, or refused to visit to Cuba because of Fidel Castro. (There are really dozens of examples that could be listed.)</p><p>While people have the right to do whatever they want and if you want to take a personal stance, do so but I think tourism-based economic protests are a mistake because they hit the wrong target; they aren&#8217;t effective; and, travel and human interaction brings about more change than a reflective boycott. Moreover, governments can and do change: laws are passed and repealed, voters eject politicians and vote in new ones, and revolutions and sanctions topple dictators.</p><p><strong>Point #1: Boycotts hit the wrong people.</strong><br> We might not agree with certain laws or a current government, but if traveling abroad and defending the United States during the Bush years has taught me anything, it is that people are not always their governments, lumping everyone together is misguided, and you end up hurting the people who you agree with.</p><p><a href=\"http://www.nytimes.com/2016/04/14/opinion/why-should-my-store-be-boycotted-over-a-law-i-despise.html\">Like, for example, one of the bookstores I spoke at during my book tour</a>!</p><p>This North Carolina store is suffering because authors are canceling the events this place needs to survive. Small independent bookstores are already suffering, and this is just another nail in the coffin. They are collateral damage to a law they do not agree with.</p><p>Governments don&#8217;t always reflect the will of all their people (or even a majority). Behind boycotts are real people and businesses who suffer. People struggling to put food on the table and meet payroll. They might not support their government or certain controversial laws, yet we lump them all together and these people become the collateral damage of our economic boycotts. We create pain for the people at the bottom &#8211; those with the most to lose and usually the least say in things.</p><p>And, though the shouts of travel boycotters sometimes add to the pressure on elected officials, I&#8217;ve yet to see one country or state reverse course simply because of this reason no matter how strong the plea. (In fact, the governor of Mississippi has come out saying growth is up and everything is fine!)</p><p>I used to say, &#8220;I&#8217;m never going to Burma because I hate the government&#8221; and because I wanted to take a stand. But I also found it silly that people said, &#8220;I don&#8217;t like Bush, so I refuse to go to the United States,&#8221; as if this was enough to pressure Bush to change or as if we were all die-hard Bushites. In the end, this made me realize that most citizens of Burma didn&#8217;t choose to live under a military dictatorship any more than I chose Bush as president.</p><p>And all my protest was doing was denying people the money they needed to survive and the global perspective that could have added fuel to their desire for change.</p><p><strong>Point #2: They are not enough.</strong><br> What caused Burma to change, Iran to open up, or South Africa to end apartheid? It wasn&#8217;t a drop in tourist numbers. It was governmental, domestic, and corporate sanctions.</p><p>Indiana softened its anti-LGBT law when corporations and conferences pulled out en masse. South Africa&#8217;s apartheid government collapsed when governments and major banks and other corporations stopped doing business with it and lending it money. Iran finally yielded under the weight of sanctions that drove it toward bankruptcy.</p><p>Those changes were a combination of domestic activism and international pressure not tourist boycotts.</p><p>I think it&#8217;s foolish to think that somewhere there&#8217;s a government official watching reports of tourist boycotts and declaring, &#8220;Tourist numbers are down 10%! We must change!&#8221; If they cared about that, they would have done something different in the first place.</p><p>Governments care about big business, tax revenue and those at the top. When you cause pain there, you cause change.</p><p><strong>Point #3: Travel brings change</strong><br> If you really want to do good, you can&#8217;t shut off people from the world &#8212; you must embrace them and show them a better way. The way we effect change is by traveling and educating people about the wider world to change their mind.</p><p>Staying home isn&#8217;t going to effect change. It simply hurts those who might not have control over their government. Travel opens people to new ideas, cultures, and ways of thinking. If you really want to bring about change, go there and kill them with kindness.</p><p>I mean, don&#8217;t we travel to see the world, learn, and help foster cultural understanding? You can&#8217;t do that by staying home. You can only do that by going to the destination.</p><p></p>****I don&#8217;t support the laws passed by these two states. I don&#8217;t support the Castro regime. I certainly didn&#8217;t support Bush. Nor do I support the current governments in Thailand or Egypt or censorship laws in China.<p>I don&#8217;t support the laws passed by these two states. I don&#8217;t support the Castro regime. I certainly didn&#8217;t support Bush. Nor do I support the current governments in Thailand or Egypt or censorship laws in China.</p><p>Do I agree with the treatment of women in many Arab countries, or Japan&#8217;s policy of &#8220;forgetting&#8221; its genocide in China during WWII? No, of course not!</p><p>But I believe boycotting travel to countries because of one law or its current choice of leader is misguided. If we were to compile a list of places with one policy or leader that we don&#8217;t agree with, we would never go anywhere. There would always be a red line keeping us home. If you feel the need to &#8220;take a stand&#8221;, do so but remember people are not always their current government&#8217;s policy. I think it&#8217;s much better to engage people on the ground, change opinions, and pressure your own government or companies to take action.</p><p>We&#8217;ll create greater change than if we just sit at home.</p></div>","title":"Why Travel Boycotts are a Bad Idea"}},"pageContext":{"id":"5b95eaf787be05832748ffe8"}}