{"data":{"mongodbDatabaseArticles":{"id":"5b9248ea87be056953db7c11","content":"<blockquote><p>I just graduated with a Master's degree in Business Administration from <a href=\"http://rsm.nl/\">Rotterdam School of Management</a> with my thesis entitled <a href=\"http://www.scribd.com/doc/106817696/Hooghoudt-P-J-T-M-2012-How-Technology-Changed-the-Music-Industry-The-New-Appropriability-Regime-and-Its-Influence-on-Artists%E2%80%99-Commercialization\">\"How Technology Changed the Music Industry: The New Appropriability Regime and Its Influence on Artists&#8217; Commercialization Strategy, Business Models and Skill Sets\"</a>.</p><p>I interviewed 12 respondents that all participated in the music industry in different ways and even though the sample size is limited, my thesis offers some interesting information for artists on where the music industry is at right now and where it may be headed in the future. </p><p>It also provides some practical advice on how artists should position themselves in a new realm which is dominated by high volumes of music and competition, record labels that lost their power and an industry in which no definitive business models can be relied upon yet.</p><p><strong>TL;DR: It's now cheaper to make music resulting in more musicians, more music produced, higher competition and thus more independent artists, new business models and an enormous entrepreneurial opportunity to present all that music to listeners.</strong></p> <p>Due to easier access to the means of music production and distribution, the amount of artists participating in the music industry has increased substantially with a much higher competition among artists than before. Artists may now need to work harder than before to reach the same level of success. The audience appears to the beneficiary of this effect, since with more competition, the overall quality of music may be on the rise. However, it may also make it more difficult for listeners to find music they like, simply because there is so much music available now. </p> <p>Due to easier to access to more music, listeners may have now become less loyal to artists since the switching cost of becoming a fan of a new artist is so low. It also appears that listeners are less susceptible to marketing because they have more access to real information on artists than before due to the internet. On the other hand, online communities and social networks like Facebook have made it possible for fans and artists to directly communicate with each other creating the potential for a more close artist-fan relationship than before. The worldwide reach of the internet has also given artist easier access to foreign markets. This may actually pose a challenge for them though. If an artist has 100,000 fans spread over 100 countries, performing in those foreign markets can quickly become a loss-making activity. </p> <p>With regards to the role of record labels, it appears that artists do not necessarily need them anymore to reach success. Artists can now operate more independently, but by far they can not operate completely independently nor should they. They may not have to contract themselves to a record label anymore, but they will still need third-parties such as promotion agencies, graphic designers,music video directors and music pluggers to reach a larger audience than they can on their own. In addition, results show that most artists should in fact not strive to operate completely independently, since this will mean they well need to undertake many non-music tasks which distracts them from making music, which is more important than ever due to the high competition among artists.</p> <p>With regards to business models, findings show that music sales as a revenue generating business model is no longer a viable model in the long-term, with most revenue now being generated by artists performing live shows. There are many new business models now, of which music streaming through platforms such as YouTube and Spotify appears to be the most promising. These platforms pay artists per play they receive and the platforms generate revenue from subscriptions and advertising. If the amount of revenue generated and the pay out to artists from these platforms keeps rising, it will become a very substantial revenue stream for artists in the future. Crowdfunding is also a viable new model as it allows artists to collect money from a large crowd of people for their music projects. However, artists do already need to be established and have a large following for this to be a substantial revenue stream.</p> <p>Artists should focus on making music primarily but it may help to have some non-music skills. One of the most important of these are business skills, which can help an artist to negotiate with third parties such as publishers, licensors or event organizers. Secondly, an artist that has some ability to market themselves may be beneficial because it appears that many labels have cut marketing expenses and may not market their artists or their music releases sufficiently. Finally, having social and networking skills to be able to talk to people that can further the careers of artists appears to be beneficial too.</p> <p>Practical implications for artists are that because they face more fierce competition than before they will now need to focus on creating a higher quality product, e.g. great music, while not giving in to the need of trying to do everything themselves but instead outsource non-core tasks to third-party agencies. Artists should embrace new business models and try them, since there is not yet a definitive replacement for the core revenue model that used to be music sales. Finally, due to the high volume of music available, there appears to be a strong necessity now for filters to help listeners find the music they like. These filters can be in many forms such as websites, streaming music channels and other platforms. Creating such a filter appears to be a very interesting entrepreneurial opportunity.</p></blockquote> ","title":"How technology changed the music industry"}},"pageContext":{"id":"5b9248ea87be056953db7c11"}}