{"data":{"mongodbDatabaseArticles":{"id":"5b9248cd87be056953db7bf6","content":"<div><p>When I was a kid, I'd wake up at 7AM every day. If it'd be weekend, I'd run downstairs to watch cartoons. And when we got a computer when I was 6, I'd run to that and go online on the 33k6 dial-up model. Then something changed when I turned 12. For the first time, I woke up at noon. It was Saturday, so I didn't have to go to school.</p> <p><strong>But then it started.</strong> I started having trouble waking up for school too. The alarm clock rang at 7 and the miserable feeling of having to wake up would struck.</p> <p>I'd be late for school, all the time. If I was late for school, I had to get a yellow note from the front desk. I became friends with the school's front desk lady because I'd see her more than my teachers. Also she was really nice. Being late meant staying an hour longer after the last class hour. So instead of 3pm, you couldn't leave until 4pm. Almost every day I'd have to stay late.</p> <p><strong>It got worse when I became older. </strong>Me and my brothers got internet and would build our own computers and we'd stay up until late in the night to discover everything about, well, internet and computers.</p> <p>That was somehow fine when it was weekend. But when Monday happened, we'd be in the wrong sleep cycle again and couldn't wake up for school.</p> <p><strong>My parents had insane trouble trying to get us into bed before 10pm every night. And the trouble of getting us out of bed at 7am was even worse.</strong></p> <p>The neighbors would talk with our parents about it and would call us lazy, unmotivated, depressed and probably mentally ill.</p> <p><strong>To try and get us to bed my mom would take severe action.</strong> She'd disconnect the internet router, so we couldn't internet anymore. We'd simply reconnect it. Then they moved the router to their bedroom. So I'd sneak into their bed room after they fell asleep and reconnect it. We lived in an old house so the floor would crack a lot, but I knew exactly where the cracks were, so I could avoid them. We'd then internet all night. Great profit.</p> <p>Then they figured that out. So my mom would take our power cables. So our computers wouldn't go on. So we'd stock up on power cables. When my mom found out, they chose to shut down all the power of the house except the kitchen. So before that night, I got a screwdriver and put 150 screws in the power cabinet, so she couldn't open it. It worked.</p> <p>This was a battle that took years. Anyone would call us addicted to computers and the internet, and no respect for authority. I'd say we just did whatever we wanted.</p> <p>I was relatively okay, but it became so bad with my brother that he couldn't even wake up before 11am, so my parents installed a 120 dB police siren in his room that was connected with a cable to the kitchen, so they could wake him up from there in the morning.</p> <p>But that didn't work. He slept through the police siren.</p> <p>I wasn't much better.</p> <p><strong>So what did we do in those nights?</strong></p> <p>Well, as a teenager, I was learning Photoshop and making weird graphics art (back in those DeviantArt peak days of 1998 to 2003). It was awesome, I didn't like to do anything more than make stuff on the computer. And my brother was learning 3D Studio Max and making 3d models and animating them into cool short films. This wasn't a job. I mean we were teens. We just did whatever we liked for fun. This was like besides playing Quake 2. It was just really fun to make stuff. Back then, nobody took any of that serious in any way. I mean this was 2001 and creative computer stuff didn't really made good money back then. Definitely not like it does now.</p> <p>This \"doing our own stuff\" thing worked best if we just followed our own natural sleeping cycle. We wouldn't get creative until after dinner time, then the creativity and ideas would slowly grow and then peak around 2AM. We'd reach the famous flow state, or the zone. Then we'd sleep and continue in the next day.</p> <p>My dad would give us rants that \"we'd need to get a normal sleeping cycle because in your life you need structure\". He worked in a hospital and had to wake up every day at 7am and would come home 6pm. My mom would feel the same as she was already thinking how if we'd ever got a job, we'd get fired there if we could never get out off bed.</p> <p>Which made sense. Because then, we both got kicked out of high school.</p> <p>Now, somehow, with a lot of twists and turns we both managed to get a degree. I got an MBA from a great university because I wanted to prove I wasn't stupid, but that the system just sucked. And my brother got a 3d animation degree. And we both ended up in creative fields where we could make stuff that'd make us happy.</p> <p><strong>The natural pull that computers, the internet and making stuff creatively had on us turned out exceptionally well for the rest of our lives.</strong> I know this is <a href=\"//en.wikipedia.org/wiki/Survivorship_bias\">survivorship bias</a>, you don't hear the stories of the fuck ups. But still I don't believe it's completely that. It's good to follow what you're pulled towards by nature.</p> <p>Here's the interesting part. We make good money. Actually, we make much better money than we'd do in a traditional 9 to 5 job. We can set our own hours. We're happier too. <strong>And we sleep whenever we want.</strong></p> <p>Increasingly, <a href=\"http://www.huffingtonpost.com/paula-davislaack/new-survey-explains-the-importance-of-sleep_b_8684482.html\">research is proving the importance of sleep</a>. One of the best ways to reduce stress, anxiety, and increase your general health is sleep. Not sleeping enough can increase inflammation, diabetes and even raises your odds of getting cancer. <a href=\"http://www.sleepeducation.org/news/2014/10/22/sleep-loss-contributed-to-plane-crash-that-killed-five\">Sleep deprivation has taken down airplanes.</a> <a href=\"http://www.gallup.com/poll/166553/less-recommended-amount-sleep.aspx\">Over 40% of the U.S. is sleep deprived</a>, and yet we're trying to fix their health with lots of pills.</p> <p>It's not a far stretch to assume that a lot of the sleep deprivation may come from people just having different natural sleep cycles. Forcing everyone into one homogenous cycle of waking up at ~7am and going to bed at ~11pm seems like it's great for society, but horrible for people.</p> <p>What would happen if we let people sleep whenever they want? Would stress levels decrease, would we have less health costs? My personal anecdotal evidence would say yes.</p> <p><strong>And it's not just anecdotal, we're starting to see proof for genetical differences in sleep cycles.</strong> People are varied. Lots of famous people are coming out how they work best at night, or in the morning, or whenever is best for them. Differences. We're not all the same. Some of the most important people in the world aren't:</p> <blockquote><p> Two nights ago, I didn&#8217;t go to bed until 4:30 in the morning. A couple of days before that, I went to bed at like 9:30 in the morning.(..) But I&#8217;m a night owl in general. I like the night, it&#8217;s quiet, there&#8217;s not that much traffic. It&#8217;s easier to live. </p></blockquote> <p>&#8212; <a href=\"//en.wikipedia.org/wiki/Edward_Snowden\">Edward Snowden</a> in an interview with <a href=\"http://fokus.dn.se/edward-snowden-english/\">Fokus</a></p> <p>Except a lack of sunlight (which you can counter by eating healthy, <a href=\"//www.google.com/search?q=golite+philips\" class=\"broken_link\">getting sunlight-emulating lights</a> and taking Vitamin D supplements), there's really not much unhealthy about living at night. Most of it are myths. <a href=\"http://www.jillianmichaels.com/fit/lose-weight/myth-too-late-to-eat\">It's not unhealthy to eat at night</a>. And actually <a href=\"http://www.medicaldaily.com/night-owls-smarter-new-study-suggests-late-bed-late-rise-leads-greater-workplace-success-244753\">night owls are more intelligent</a>.</p> <p>There's more: night owls are also more productive, and outlast morning people in mental performance:</p> <blockquote><p>There was no real difference between the early birds and the night owls in their performance on the morning test. But the evening test was a different story: night owls were less sleepy and had faster reaction times than early birds. (Just to emphasize, 'evening' was a relative term: it was a different actual time for each group, but the exact same 10.5-hours-after-waking for both early birds and night owls.) So even though both groups were sleeping and waking according to their preferred schedule, night owls generally outlasted early birds in how long they could stay awake and mentally alert before becoming mentally fatigued. The fMRI supported the behavioral results: 10.5 hours after waking up, the early birds had lower activity in brain regions linked to attention and the circadian master clock, compared to night owls.</p></blockquote> <p>&#8212; <a href=\"http://www.newsweek.com/brains-early-birds-and-night-owls-221768\">The brains of early birds and night owls</a> in <a href=\"http://www.newsweek.com/brains-early-birds-and-night-owls-221768\">Newsweek</a></p> <p>There's more research coming out about the benefits of power naps too. Power naps are literally, sleeping whenever you feel asleep. Take a small nap. Listening to your own body and mind and reacting on them. That again means, freedom of sleep.</p> <p>But people still aren't getting it.</p> <p><strong>I still regularly come across people who imply I'm lazy because I sleep whenever I want.</strong> A lot. They see me as a bum. Someone without strong character. People who know me, <a href=\"/12-startups-12-months/\">know how hard I work</a>, when I work.</p> <p>I was just in a bed and breakfast and after leaving my room at noon, the owner is like:</p> <blockquote><p> \"You must have a good life right, sleeping all day, waking up late?\"</p> <p>No, wait, I actually worked until 4AM, had 7.5 hours of sleep just like you and now I'm here. I'm more productive like that.</p> <p>&#8212;\"Ah, the easy life\"</p> <p>Wait, no wait, why don't you STFU! (I didn't say that, I should have) </p></blockquote> <p>It comes from this world view that everyone should be doing what everyone else does. And there's a strong moral superiority people feel against you if you can't wake up early. Waking up early is perceived as a quality.</p> <p>\"It builds character\"</p> <p>In Dutch, we say \"A man in the evening, is a man in the morning\", roughly translating that if you're up late, you should also be man enough to be up early. Why? That's ridiculous. There's no reason to think of waking up early as a quality. Why should I suffer with sleep deprivation to get respect from it? More ridiculousness.</p> <p><strong>The moral superiority of early risers against night owls must have some biological roots. Traditionally, human tribes needed to keep everyone in check. </strong> There was some benefit to people being awake at the same time. You know, it syncs up people to live together, work together.</p> <p><strong>But wait, no, time has changed and now there's gigantic disadvantages to syncing up everyone to do everything at the same time.</strong></p> <p>Does it make sense for everybody to get into a car at 8AM? And drive back home at 5PM?</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"1378403020353.cached\"><img src=\"/wp-content/uploads/2015/12/1378403020353.cached.jpg\" alt=\"1378403020353.cached\"> <p>No it doesn't. Cities are getting too crowded and we're struggling with overpopulation. So why not let everybody be awake whenever they want. Time is a construct. Let people freely interpret it. That will balance out the strain on a system's resources, like infrastructure, like highways, like shops and services.</p> <p>In my country, the Netherlands, it's even worse. The religious political parties have something called the \"Opening Times Law\", which makes it extremely hard for any business to be open after 8pm. So most shops pretty much close at that time. This is another reason why I love Asian cities, almost all of them have 24/7 mini grocery stores on every corner of the street. Stuff like that enables a more modern way of living. Where we're awake whenever we want. And again it takes the pressure of overpopulated cities.</p> <p>Do you think it's a coincidence that religious political parties like to keep this structure of time in place? No, because religion likes to dictate values and limit freedoms for arbitrary reasons. But that's stupid. Let's get past that.</p> <p><strong>So, to anyone who still tells people that sleep late, wake up late, or sleep whenever they want that they're lazy.<br> </strong></p> <p>You're wrong and your world view is archaic.</p> <p>Go fuck yourself. And just let me work at night :)</p> <img src=\"/wp-content/uploads/2015/12/maxresdefault.jpg\" alt=\"maxresdefault\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-5290 responsively-lazy\"> <p>Update: Apparently there's more people annoyed by this, <a href=\"//twitter.com/swizec\">@swizec</a> wrote <a href=\"http://nightowlsbook.com/\">a whole book about it</a>.</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Stop calling night owls lazy, we’re not"}},"pageContext":{"id":"5b9248cd87be056953db7bf6"}}