{"data":{"mongodbDatabaseArticles":{"id":"5b95eae687be05832748ffe0","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/equaltravelers.jpg\" alt=\"a group selfie\"><br> I was looking over my <a href=\"https://www.nomadicmatt.com/travel-blogs/interview-with-rolf-potts/\" target=\"_blank\">interview with Rolf Potts</a> recently and thinking our talk about the false distinctions travelers make among themselves. We often compete to prove who&#8217;s a better traveler or how we aren&#8217;t like &#8220;the tourists.&#8221; In what is a make-believe competition, you see many people trying to prove their status and superiority by talking about how much longer they&#8217;ve been on the road or where they&#8217;ve been, or by emphasizing the number of local buses they have taken.</p><p>But let me tell you something: all travelers are created equal.</p><p>While I&#8217;d rather take advice from someone who has been traveling for 10 years over someone who left just yesterday, the older traveler (and Rolf would probably agree) is no &#8220;better&#8221; a traveler than the younger traveler. You are not a better traveler simply because:</p><h3>You&#8217;ve been traveling for over two years!</h3><p>Really? Wow! That is truly impressive, but do you want a cookie for that? When people ask me how long I&#8217;ve been on the road, I rarely answer this question in hostels, because I hate the &#8220;Wow! That&#8217;s awesome!&#8221; response &#8211; where then someone chimes in and goes &#8220;Oh yeah, I&#8217;ve been on the road for X years.&#8221; There is always someone who has been going longer than you. Dan and Audrey from <a href=\"https://uncorneredmarket.com/\" target=\"_blank\">Uncornered Market</a> put my decade of travel to shame &#8211; so do a million other people I have met on the road.</p><p>The length of your travels does not mean anything and you should never make someone feel bad for being a beginner. We are all beginners at one point &#8211; and there&#8217;s always someone who has been out there longer than us.</p><h3>You&#8217;ve been to over X countries</h3><p>Travel is not about quantity; it&#8217;s about quality. In my first three years backpacking the world, I&#8217;ve only been to about twenty-five or so countries. There are many people who have been to a lot more in a lot less time. But traveling more slowly (that is, spending more time in each place) is, for me, a much better way to learn about the places I visit. Travel is not a contest. I know terrible travelers who have been to all the countries in the world and know amazing travelers who have only been to a couple. It&#8217;s the type of person you are not the quantity of countries you&#8217;ve been to.</p><h3>You don&#8217;t go there &#8212; it&#8217;s too touristy</h3><p>There&#8217;s a reason why people go to <a href=\"https://www.nomadicmatt.com/travel-guides/indonesia-travel-tips/bali/\" target=\"_blank\">Bali</a> or <a href=\"https://www.nomadicmatt.com/travel-guides/france-travel-tips/paris/\" target=\"_blank\">Paris</a>, hike the Inca Trail, or head to Vegas &#8212; these places are fun, or beautiful. They may be commercial, overpriced, and full of &#8220;tourists,&#8221; but they are still exciting places to go visit. The number of small villages you have under your belt is not proportional to how great of a traveler you are. Sure, I think people should get off the tourist trail as often as possible. Explore the unexplored. Wander into neighborhoods to see the rhythm of local life. Find a map, pick a random place, and go there. Some of my best travel memories are when I went to lesser-known cities. But I also have great memories from popular places like the Gold Coast, Amsterdam, Khao San Road, and Barcelona.</p><h3>You only do what the locals do</h3><p>You can eat at all the local restaurants you want and take as many local buses as you can, but that doesn&#8217;t mean you know the local way of life. If you really want to live like a local, buy an apartment and get a job. Don&#8217;t spend three days in a place &#8212; spend three months. Then maybe you&#8217;ll be a local.</p><p>But&#8230; while the world may be filled with different cultures and foods, the more you travel, the more you realize people are essentially the same. It doesn&#8217;t matter if you live in Egypt, Mongolia, <a href=\"https://www.nomadicmatt.com/travel-guides/united-states-travel-guide/\" target=\"_blank\">America</a>, or <a href=\"https://www.nomadicmatt.com/travel-guides/france-travel-tips/\" target=\"_blank\">France</a> &#8212; everyone gets up, goes to work, wants to be happy and live well, and hopes their children have a better life.</p><h3>You don&#8217;t do tours</h3><p>Talking trash about tour group travelers doesn&#8217;t make you better than them; it just makes you an ass. People who say this often forget that the boat ride they took in Phuket or that trip to Fraser Island in Australia was also a tour. Not all tours are big double-decker buses filled with sandal-wearing tourists. They can be little backpacker tours too.</p><p>Most <a href=\"https://www.nomadicmatt.com/travel-blogs/the-value-of-tour-groups/\" target=\"_blank\">tours aren&#8217;t inherently bad</a>. I&#8217;ve taken quite a few and enjoy them. It all depends on the group and the company you go with.</p><p></p>***<br> Travel is a highly personal experience. Everyone takes their own path around the world. No two journeys are alike and therefore no two journeys can be compared. Travel is about opening your mind up to new experiences and people. The competition mindset simply closes you off to that.<p>Travel is a highly personal experience. Everyone takes their own path around the world. No two journeys are alike and therefore no two journeys can be compared. Travel is about opening your mind up to new experiences and people. The competition mindset simply closes you off to that.</p><p>If you are a &#8220;real&#8221; traveler, you know that all travelers are equal and these false mindsets don&#8217;t matter. Remember that there is always someone out there who has been to more places, seen more things, and spent more time on the road than you.</p><p>And if someone is judging your travels or trying to put you down, they aren&#8217;t worth the energy. Like a destination that you have grown tired of, simply move on &#8212; and find people worthy of your time and who will lift you up, not put you down.</p><h3>How to Travel the World on $50 a Day</h3><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\"><img class=\"\" src=\"https://media.nomadicmatt.com/bookimages/howtotraveltheworld_v3cover.jpg\" alt=\"how to travel the world on $50 a day\" width=\"200\" height=\"273\"></a>My New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences.</p><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"All Travelers are Created Equal"}},"pageContext":{"id":"5b95eae687be05832748ffe0"}}