{"data":{"mongodbDatabaseArticles":{"id":"5b92489087be056953db7bb9","content":"<div><blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\">Punk died the moment we learnt that the world WAS in fact getting better, not worse <a href=\"//twitter.com/MaxCRoser\">@MaxCRoser</a> <a href=\"//t.co/sea5fHMsSE\">https://t.co/sea5fHMsSE</a></p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/655283730060283904\">October 17, 2015</a></p></blockquote> <p></p> <p>I like punk rock. I like it because it's probably one of the most honest music genres out there. Acoustic pop songs are too weak, and not honest, because, well, the human state isn't always weak. You need aggression. But then metal is too aggressive, and that's not reflective of the human state either. The human state, for me, is somewhere in the middle. And punk is that sweet spot. It's about dissatisfaction, self-deprecation, the rejection of the status-quo and highlighting the idiosyncrasies of mainstream culture.</p> <p><a href=\"//www.youtube.com/watch?v=vBot8SOLWBQ\">Fight Club is punk</a> in many ways.</p> <p>My favorite punk song is <a href=\"//www.youtube.com/watch?v=qnFVMkTWaBw\">The Decline</a> by NOFX, it's an 18-minute long epic critique on American society and a tale of its decline. But it applies to most of the world as American culture has been exported everywhere now. It's the West. And in many ways <a href=\"//www.google.com/search?q=china+capitalism\" class=\"broken_link\">the East now too</a>.</p> <p></p> <blockquote><p> <a href=\"//en.wikipedia.org/wiki/The_Decline\">The Decline</a> is an EP by NOFX. (..) The Decline is largely a satire of American politics and law, with an overwhelming concern for blind behaviors of the masses, such as complacency, indifference, gun violence, drug-use, and conformity, as well as destruction of constitutional rights, and condemnation of the religious right. </p></blockquote> <p>It's a song that's been in my playlist since I was 14. NOFX argues that if we let 300+ million people dictate a country's fate, we're bound to move into populism and stupidity (just like <a href=\"//en.wikipedia.org/wiki/Idiocracy\">Idiocracy</a> argues). People become complacent, indifferent, conformist and homogenous, TL;DR everyone becomes the same. Government becomes populist and extremist, to try and attract as much votes and power as possible. The media becomes stupid, to try and get as many eyeballs as possible.</p> <p>Every year I listen to this song though, especially recently, the feeling grabs me that something is changing in the 15 years since NOFX wrote it. Society has changed in most of the areas they attacked it. </p> <h2>We're starting to become more varied</h2> <p>Our consumption of media has become so much more varied than before. We've started to throw out our television subscriptions, replacing them with Netflix and whatever we find on YouTube. And I'll admit, a lot of us still watch the same stuff (hello Game of Thrones), but a lot of also don't. The new generation doesn't care for the evening news, we read whatever we find on the web.<br> You've probably experienced a night of Wikipedia binge-reading where you start at <a href=\"//en.wikipedia.org/wiki/Barack_Obama\">Obama</a> and end up at <a href=\"//en.wikipedia.org/wiki/Cosmic_dust\">cosmic dust</a>. For the first time the masses have the chance to lose themselves in their random curiosity and, if they desire, shape their own unique identity.</p> <h2>The end of conformity</h2>   <p></p> <p>The internet is killing conformity. The web is full of niches (<a href=\"//en.wikipedia.org/wiki/The_Long_Tail_(book)\">the long tail</a>) with thousands of people discussing subcultures we've never heard of. It's made small niches profitable. It has made people less homogenous (less the same), less conformist as we're less scared to be different. </p> <p>Because no matter how weird we are, on the internet there's always at least a thousand like us, somewhere in the world. </p>   <p></p> <p>LGBT culture has had an extreme rise since the internet came along. <a href=\"//en.wikipedia.org/wiki/Same-sex_marriage_in_the_United_States\">Gay marriage is now legal in the US.</a></p> <p>Sexual subcultures that used to be fringes are now even discussed in the mainstream, like <a href=\"http://www.thedailybeast.com/articles/2015/06/02/polygamy-is-more-popular-than-ever.html\">polygamy</a> and <a href=\"http://www.alternet.org/story/147084/kinky_sex%3A_when_did_bdsm_become_so_wildly_popular\">BDSM</a>.</p> <p>All of that is, well, incredible. And impossible if we didn't have the internet. Being different is finally \"cool\".</p> <h2>The death of advertising</h2>   <p></p> <p>Our consumerism was fueled by rampant predatory advertising on television, radio and outdoors. And yes, it followed our way into the web in the last two decades. But things are changing. People are sick of being manipulated by ads, buying stuff they don't want and are installing ad blockers. <a href=\"http://digiday.com/publishers/global-rise-ad-blocking-4-charts/\">In many countries now over 1/3 of people have ad blockers installed.</a></p> <p>It's not just on the web though. <a href=\"http://www.theguardian.com/cities/2015/aug/11/can-cities-kick-ads-ban-urban-billboards\">Cities around the world are now banning outdoor advertising.</a></p> <p>That's amazing news.</p> <h2>Consumerism is dying</h2>   <p></p> <p>Less ads, in turn, might lead to less consumerism. And thanks to everything becoming digital, <a href=\"http://www.theminimalists.com/\">minimalism is now a huge trend</a>. We're not buying stuff so much anymore. <a href=\"http://www.cbsnews.com/news/is-consumerism-dead/\">Consumerism is dying</a>.</p> <blockquote><p> A new study by the communications group Havas Worldwide says there's a global shift underway in patterns of consumption, and especially away from the \"shop till you drop\" mentality. The survey of more than 10,500 people, ages 16 or older, in 29 global markets found that 70 percent believe over-consumption is putting many societies and the planet at risk. </p></blockquote> <p>Nobody cares how many cars you own, <a href=\"http://www.csmonitor.com/Business/2015/0318/Is-Uber-making-car-ownership-obsolete\">we get an Uber everywhere anyway</a>. And except for a smartphone, computer, desk, bed and kitchen, we don't need a lot anymore to live our lives.</p> <p>A more extreme trend of anti ownership are <a href=\"//nomadlist.com/\">minimalists that are traveling the world perpetually as nomads</a> with just a smartphone and laptop. And with Airbnb, they don't need to own houses anymore either, they can stay in other people's houses.</p> <h2>Debt is not cool anymore</h2>   <p></p> <p>The <a href=\"//en.wikipedia.org/wiki/Financial_crisis_of_2007%E2%80%9308\">2008 Financial Crisis</a> is probably one of the best examples that NOFX's The Decline was right all along. Our infinite growth fueled by higher and higher consumption and more and more debt wasn't sustainable. It was credit everywhere, from personal credit cards, to businesses, to banks. It was a culture of debt. Now, 7 years later, we're still dealing with the fallout from that economic crisis and trying to pay for everything we spent that we actually couldn't afford.</p>   <p></p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/image00.png\"> <h2>Politics is more democratic than ever</h2>   <p></p> <p>The internet has made democracy better. As much as it's horrible to see <a href=\"http://www.tennessean.com/story/news/2015/10/17/edward-snowden-attorney-us-return-pick-your-misdemeanor/73958266/\">Edward Snowden fleeing to Russia</a> and <a href=\"http://www.theguardian.com/uk-news/2015/oct/15/julian-assange-shoulder-pain-mri-scan-embassy-metropolitan-police\">Julian Assange still being stuck in an embassy building in London</a>, they were able to leak information about governments that the public deserved to hear. Without Snowden and Assange we wouldn't have proof about NSA's rampant eavesdropping. But without the internet, this leaked data wouldn't even have come out.</p> <p>Governments now are starting to have a healthy fear of the public monitoring them. As they should. <a href=\"//www.reddit.com/r/worldnews/comments/3p6rs8/smoking_gun_emails_reveal_blairs_deal_in_blood/cw3qemd\">There's an example of it today on Reddit</a>:</p> <a href=\"//www.reddit.com/r/worldnews/comments/3p6rs8/smoking_gun_emails_reveal_blairs_deal_in_blood/cw3qemd\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/Screenshot-2015-10-18-04.28.27.png\"></a> <p>\"Why try to beat them when, a million others tried?\" NOFX sings, but we are finally beating them. The public is becoming the government. And that was way overdue.</p> <h2>The war on drugs is over</h2>   <p></p> <p>You only have to look at the mess that much of South America is to see the destruction that the war on drugs had. From Colombia to Mexico, the last three decades have been terrorized by, on one hand, drug cartels and, on the other, police enforcers trying to hunt them down. The real victims were the people in the crossfire.</p> <p>But this is changing too. The war on drugs seems to be ending. Starting with the legalization of marijuana in the US which is quickly spreading over its states:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/Screenshot-2015-10-18-01.21.47.png\"> <h2>Mass incarceration</h2>   <p></p> <p>Apart from terrorizing the countries where the drugs were made, the drug war had the side effect of putting crazy amounts of people into prison in America, and the rest of the world. Mostly private (commercial) prisons that had a profit motive to get more people locked up. The <a href=\"//en.wikipedia.org/wiki/Prison%E2%80%93industrial_complex\">prison-industrial complex</a>.</p> <p>The mass incarceration of non-violent criminials has finally become something politicians want to change. <a href=\"http://www.wsj.com/articles/obama-decries-mass-incarceration-in-call-for-prisons-overhaul-1436917797\">Obama</a> has started to call it out and the next steps are drafting bills to get less people locked up for less time and get them back into society faster.</p> <h2>The world is getting better</h2> <p>It's a really great time we live in and we should be grateful for it.</p> <p>And it goes further than just what's being sung in punk ruck songs.</p> <p>If we look at social economic data, you can reach the same conclusion. There's an called <a href=\"//twitter.com/MaxCRoser\">Max Roser</a> whose mission seems to be to prove exactly that. Showing that the world is getting better. He argues how we've never had a time with this little <a href=\"http://ourworldindata.org/VisualHistoryOf/Violence.html\">violence</a>, <a href=\"http://ourworldindata.org/VisualHistoryOf/Poverty.html\">poverty</a>, <a href=\"http://ourworldindata.org/VisualHistoryOf/Hunger.html\">hunger</a> and <a href=\"http://ourworldindata.org/VisualHistoryOf/Health.html\">good health</a>.</p> <h2>Conclusion</h2> <p>Improvement of life on earth is a never-ending quest, but we should be aware of how great our current state is already is. Because the human state is one of dissatisfaction and so it's hard to grasp the simple fact: we've never had it this good. </p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Punk died the moment we learnt that the world WAS in fact getting better, not worse"}},"pageContext":{"id":"5b92489087be056953db7bb9"}}