{"data":{"mongodbDatabaseArticles":{"id":"5b92397987be0583cfde680a","content":"<div><p><strong>To show that economic citizenship is a legitimate path</strong><br>\nGoogle &#8220;how to buy a passport&#8221; and all sorts of otherwise credible news agencies from CNBC to CNN to Bloomberg have written about the process of investing to get citizenship. None of them, however, seem to smile upon the practice. Instead they paint it as anything from a jestful foible of the rich to a slap in the face to common decency.</p>\n<p>The reality is that making a donation or an investment in a country is perfectly legal. Even Hillary Clinton acknowledged that when she went to Dominica in 1993 in an attempt to bully the country into shutting down its passport program. The government told her they&#8217;d be happy to if the US government offered to cover their income from selling passports, an offer which was declined.</p>\n<p>Just because bureaucrats who want to seal off the exits don&#8217;t like something, that doesn&#8217;t make it illegal. Unfortunately, there are so many scammy websites offering to make you an ambassador from some African country for $5,000 or to get you Panamanian citizenship in six weeks if you ask nicely, that the general public is easily convinced that citizenship by investment is a scam used by evil tax evaders.</p>\n<p>Hopefully, this blog series will introduce a new level of transparency and allow people who need a quick second passport to find the right option for them.</p>\n<p><strong>It&#8217;s fun for me</strong><br>\nI often caution against &#8220;Shiny Object Syndrome&#8221;. Thousands of people every year email us asking how to get a Paraguay passport. The first question my team asks almost every time is &#8220;Why do you need one?&#8221; Many people don&#8217;t know the answer.</p>\n<p>The idea of chasing a particular object rather than a desired result can lead to failure, let alone a lot of wasted time and money. After all, nobody really wants a Paraguayan passport; they want what it offers.</p>\n<p>That&#8217;s not to say that geeking out on this process isn&#8217;t enjoyable. If you&#8217;ve already got a lot of the bases covered, getting a passport can be fun. A lawyer friend of mine helped one of his clients obtain his first economic passport more than a decade ago. Since then, that same client has purchased six other economic citizenships.</p>\n<p>At some point, it becomes fun. I&#8217;ve toyed with the idea of getting a passport from every continent (although I hear Antarctica has a pretty inefficient immigration authority.) The point is, it&#8217;s important to enjoy the process. Focus on achieving your goals, but enjoy yourself along the way.</p>\n<h1>What economic citizenship has taught me</h1>\n<p>One of the things you&#8217;ll see in this blog series is that I&#8217;m open to changing my mind when circumstances change. Five years ago, I was enamored by the idea of buying a passport, but too cheap to actually do it. (Not to mention my family saying, &#8220;do you know what you could buy for $100,000?!&#8221;)</p>\n<p>In fact, you could probably find an example of me advising against citizenship by investment in one of my earliest articles. In the years I&#8217;ve been living the Nomad Capitalist lifestyle, I have increasingly realized that reaching my goals &#8212; from reducing taxes to greater personal freedom &#8212; has a price. Today, more than any time in my personal history, I&#8217;m devoted to spending what it takes to solve problems and, yes, enjoy myself a little.</p>\n<p>I started the citizenship process by choosing Dominica as my passport of choice because I believed it was the best value for my particular circumstances. Over the course of my journey, I experienced frustrations and challenges that tested my decision and forced me to re-evaluate my choice. You&#8217;ll read about that in the course of the series as I post a new article every week.</p>\n<p>One thing I&#8217;ve learned is that adapting is important as a Nomad Capitalist. Trends, laws, and attitudes change every day. If you want to &#8220;go where you&#8217;re treated best&#8221;, you need to be open to new ideas. It&#8217;s hard to achieve your goals when being dogmatic.</p>\n<p>As this blog series unfolds, you&#8217;ll see that a few of my opinions on some &#8220;gray area&#8221; issues have changed as I have been presented with more facts.</p>\n<h1>What this blog series is about</h1>\n<p>Over the next 26 weeks, I&#8217;ll be publishing a new article each week. Each article will focus on two areas. First, each article will feature notes from my journal as I underwent the citizenship by investment process. I will be sharing, in chronological order, the goings-on, challenges, and solutions during the entire process, from the early stages, to collecting paperwork and documents, to the interview process, to actually getting the passport and what comes next.</p>\n<p>The second part of each article will address a specific question or concern about the second passport process such as &#8220;how do I renounce my citizenship?&#8221; or &#8220;what happens to my Social Security checks if I get a second passport?&#8221; Many of these are questions and thoughts I had myself during the process and had to research for myself.</p>\n<p>I realize that many people looking to get a second passport aren&#8217;t exactly sure how the process works up close; this blog series will give you a look behind the scenes. It will also cover issues surrounding second citizenship such as citizenship renunciation, financial matters, visas, travel and more.</p>\n<h1>Get your own economic citizenship and second passport</h1>\n<p>My goal in doing this series is to help as many people as possible become global citizens by obtaining second citizenship. I live this stuff, in part, so that I can better help individuals like you reduce taxes, obtain a second passport and experience more freedom.</p>\n<p>If you&#8217;d like to work with me directly to create a wholistic global citizenship strategy, then <a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\" target=\"_blank\">click here</a>. We&#8217;ll go through an entire deep dive process to determine exactly what you need &#8212; from passports to residency to where you&#8217;re going to live &#8212; all so we can get you to your end goals.</p>\n<p>If you&#8217;re just interested in getting a passport and already know which passport is the right choice for you, then you can go directly to Peter MacFarlane &amp; Associates&#8217; website and contact them by clicking here.</p>\n<p>If you&#8217;re still determining which approach you should take, feel free to <a href=\"http://nomadcapitalist.com/my-economic-citizenship/\" target=\"_blank\">keep reading this series</a> to garner all the knowledge you need to form a vision and actionable plan for the future.</p>\n</div>","title":"Why I decided to get citizenship through investment"}},"pageContext":{"id":"5b92397987be0583cfde680a"}}