{"data":{"mongodbDatabaseArticles":{"id":"5b937aef87be056953db7cf3","content":"<div><h1 name=\"0ef0\" id=\"0ef0\" class=\"graf graf--h3 graf--leading graf--title\"><strong class=\"markup--strong markup--h3-strong\">Here&#8217;s why the life of a digital nomad isn&#8217;t always what it&#160;seems</strong></h1><p name=\"8484\" id=\"8484\" class=\"graf graf--p graf-after--h3\">An increasing number of people are choosing to work online with no fixed location offline. The media call them &#8216;digital nomads&#8217;, but their media portrayal doesn&#8217;t always match reality&#160;&#8230;in surprising ways.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*aTCW8gAqfspYubgJ.\"><p name=\"2270\" id=\"2270\" class=\"graf graf--p graf-after--figure\">Type &#8216;digital nomad&#8217; into Google Images and you&#8217;ll see one picture that keeps reoccurring.</p><p name=\"df43\" id=\"df43\" class=\"graf graf--p graf-after--p\">Digital nomads are typically portrayed relaxing on a beach with a laptop in front of them and sometimes a cocktail by their side. The location is always tropical, usually in East Asia, and the nomad is usually young and presumably Western.</p><p name=\"25fb\" id=\"25fb\" class=\"graf graf--p graf-after--p\">There are some obvious problems with this image. Digital nomads can work almost anywhere on Earth, but beaches tend to be quite far down the list of suitable workplaces.</p><p name=\"42de\" id=\"42de\" class=\"graf graf--p graf-after--p\">For a start, there are a few things here that don&#8217;t mix well&#8202;&#8212;&#8202;like the glare of the sun with laptop screens, sand with laptops in general, and work with alcohol. Plus, beaches tend to have poor internet connections and a lack of power sockets.</p><p name=\"cd20\" id=\"cd20\" class=\"graf graf--p graf-after--p\">There are over 30,000 digital nomads connected in just one Facebook group called <a href=\"https://www.facebook.com/groups/DigitalNomadsAroundTheWorld\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Digital Nomads Around the World</a>. When asked recently about the misconceptions people have about them and their lifestyles, the group didn&#8217;t hold back.</p><p name=\"761b\" id=\"761b\" class=\"graf graf--p graf-after--p\">Many digital nomads do love visiting the beach when they can, but see this stereotypical image as a symptom of a much deeper problem with the assumptions people make about their lifestyles.</p><p name=\"8bb5\" id=\"8bb5\" class=\"graf graf--p graf-after--p\">Among the most common misconceptions is that digital nomads are essentially always on vacation and their lifestyle is the result of luck or pre-existing wealth.</p><p name=\"d124\" id=\"d124\" class=\"graf graf--p graf-after--p\">Far from being the preserve of the privileged, the barriers to entry are constantly lowering for those who wish to become digital nomads, but they are keen to point out that they have to work hard and deliver real value to their employer or customers in order to sustain the lifestyle.</p><p name=\"3cba\" id=\"3cba\" class=\"graf graf--p graf-after--p\">Fortunately, location-independence can actually reduce costs and increase productivity, potentially enabling digital nomads to offer products and services more competitively than fixed-location workers.</p><p name=\"ebc7\" id=\"ebc7\" class=\"graf graf--p graf-after--p\">One of the ways this is happening is through Estonia&#8217;s e<a href=\"https://e-estonia.com/e-residents/apply/?utm_source=Medium&amp;utm_campaign=India%20in%20EU%20Segment%202&amp;utm_medium=Blog\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">-Residency programme</a>, which offers a transnational digital identity to anyone in the world interested in setting up and running a location-independent business online. E-Residency helps solve many of the administrative challenges of location-independence so it&#8217;s <a href=\"https://medium.com/e-residency-blog/a-lot-of-digital-nomads-love-estonia-heres-why-the-feeling-is-mutual-78afd191f6a8#.x7wfqvwlw\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">popular with digital nomads</a> and is already helping <a href=\"https://medium.com/e-residency-blog/estonian-e-residency-is-lowering-business-costs-around-the-world-d78d957a82fe#.qz90h7zbc\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">lower business costs around the world</a>.</p><p name=\"087f\" id=\"087f\" class=\"graf graf--p graf-after--p\">As the freedom to work without a fixed location becomes more accessible, the diversity of the digital nomad community is constantly increasing&#8202;&#8212;&#8202;and not just because many prefer snow than sand beneath their feet.</p><p name=\"b6cc\" id=\"b6cc\" class=\"graf graf--p graf-after--p\">The desire to travel may be a strong motivator, but the increased freedom to travel and plan their own work is a byproduct of life as a digital nomad. In reality, there&#8217;s an enormous variation in how much travelling digital nomads actually choose to do.</p><p name=\"6f35\" id=\"6f35\" class=\"graf graf--p graf-after--p\">Instead, many people choose to set up location-independent businesses because it provides better access to payment providers, legal frameworks and public services than in their own country where administrative costs and hassles could make their work more difficult or impossible. That&#8217;s even before they face the additional challenges of crossing borders with their work.</p><p name=\"4096\" id=\"4096\" class=\"graf graf--p graf-after--p\">This is especially true for digital nomads who choose to become e-residents of Estonia because their business is then located inside the European Union, yet can be managed from anywhere on the planet through <a href=\"http://www.wired.co.uk/article/estonia-e-resident\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">the world&#8217;s most advanced digital infrastructure</a>, which has been designed to eliminate bureaucracy.</p><p name=\"e46f\" id=\"e46f\" class=\"graf graf--p graf-after--p\">As a consequence, possibly one of the most underlooked aspects of location-independence is how it is being embraced by entrepreneurs in developing countries where people have the most to gain from transitioning away from fixed-location businesses.</p><p name=\"b2dc\" id=\"b2dc\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Emerging markets</strong></p><p name=\"e941\" id=\"e941\" class=\"graf graf--p graf-after--p\">Serbia is not usually associated with digital nomads&#8202;&#8212;&#8202;or travellers in general&#8202;&#8212;&#8202;and it&#8217;s an unusually harsh -11 degrees there at the moment.</p><p name=\"8858\" id=\"8858\" class=\"graf graf--p graf-after--p\">Yet a cafe in the capital, Belgrade, location-independent entrepreneurs Nemanja Cerovac and Aleksandar Abu-Samra are sitting in a quiet corner surrounded by other digital nomads with their laptops out.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*gX5QAcKAa5mm0_S3.\"><p name=\"e8af\" id=\"e8af\" class=\"graf graf--p graf-after--figure\">They laugh when asked if they have ever taken their laptops to the beach&#8202;&#8212;&#8202;and not just because Serbia is landlocked and currently covered in snow.</p><p name=\"8df6\" id=\"8df6\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;The digital nomad lifestyle is really not like that,&#8221; says Abu-Samra. &#8220;Sure, you can go to the beach, but you first have to work hard and make sure you bill enough customers.&#8221;</p><p name=\"9ffa\" id=\"9ffa\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;Digital nomadism can be a very lonely lifestyle,&#8221; adds Cerovac, &#8220;especially if you are sitting on the beach all the time. A very small percentage of digital nomads actually enjoy that. It&#8217;s not a holiday, even if you do get to enjoy moving location when you want.&#8221;</p><p name=\"2454\" id=\"2454\" class=\"graf graf--p graf-after--p\">Cerovac and Abu-Samra grew up on opposite sides of a frontline, but later met at university in Belgrade while Serbia was increasingly reconnecting with the world. They studied software engineering together and became passionate about how new digital technology can be used to better connect people around the world.</p><p name=\"64e6\" id=\"64e6\" class=\"graf graf--p graf-after--p\">After graduating, they both went their separate ways to travel the world and build up their career experience, but stayed in touch through Skype, social media and other new technologies. As they constantly searched new cities for convenient places to work as digital nomads, they realised which business they wanted to build together and returned to Belgrade to make it a reality.</p><p name=\"f6c8\" id=\"f6c8\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;The biggest problem facing digital nomads is loneliness,&#8221; says Cerovac. &#8220;If you are inside your home or at the beach then you are alone and that&#8217;s a feeling many people don&#8217;t expect. I think we are now starting to see more people in the community talking about this problem.&#8221;</p><p name=\"4012\" id=\"4012\" class=\"graf graf--p graf-after--p\">Their new venture, <a href=\"http://www.laptopfriendly.co\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">LaptopFriendly</a>, has begun helping digital nomads find suitable work places where there is good WiFi and a welcoming atmosphere, from cafes and restaurants to hotel lobbies and galleries. More importantly, they aim to provide the advantages and vibe of coworking spaces so that digital nomads can sit together at large tables and collaborate both online and off.</p><p name=\"4175\" id=\"4175\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;We never wanted to stay in our hostel or AirBnB to work when travelling,&#8221; says Abu-Samra. &#8220;We wanted to explore the city and find a good spot in public. This is a big issue though as most places would either have bad WiFi or a passive-aggressive attitude towards people who get their laptops out. We realised the good ones were really hard to find.&#8221;</p><p name=\"62f0\" id=\"62f0\" class=\"graf graf--p graf-after--p\">The digital nomads now using LaptopFriendly in Serbia are a combination of locals and travellers, but all of them run their businesses online with customers and suppliers around the world.</p><p name=\"ee04\" id=\"ee04\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;We have writers, programmers, architects, developers, marketers, customer support staff, activists, journalists, salespeople,&#8221; says Cerovac. &#8220;By working together and connecting, they are also collaborating and solving problems that remote workers face.&#8221;</p><p name=\"819c\" id=\"819c\" class=\"graf graf--p graf-after--p\">One of the solutions now increasingly being discussed among their digital nomads is acquiring <a href=\"https://e-estonia.com/e-residents/about/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">E-Residency of Estonia</a> to receive a government-backed transnational digital identity then using it to set up and run a location-independent business.</p><p name=\"df30\" id=\"df30\" class=\"graf graf--p graf-after--p\">Cerovac and Abu-Samra say they are pleased with the progress Serbia has made and thankful that digital expats are helping tell the rest of the world what an exciting place it is to live, work and travel. However, they need to base their company inside a country that can easily accept international payment providers and cope with the added complexity that will arise when they start travelling again.</p><p name=\"6c02\" id=\"6c02\" class=\"graf graf--p graf-after--p\">Cerovac and Abu-Samra now plan to become e-residents of Estonia to help their business grow, although one digital nomad who frequently appears at their table has already signed up.</p><p name=\"b419\" id=\"b419\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why location-independence can be a business advantage</strong></p><p name=\"8caf\" id=\"8caf\" class=\"graf graf--p graf-after--p\">Aleksandar Nenov lives to the north of Belgrade in Novi Sad where&#8217;s he helping add more locations to LaptopFriendly. He also regularly travels into Belgrade where he joins other digital nomads through the site when he needs to sit down and work.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*dhkc2Sqog8SDTr_x.\"><p name=\"8a08\" id=\"8a08\" class=\"graf graf--p graf-after--figure\">According to Nenov, a common misconception is that digital nomads are just looking for enough work to sustain their travels. In reality, many digital nomads are using their location-independence to build successful and highly competitive businesses.</p><p name=\"26aa\" id=\"26aa\" class=\"graf graf--p graf-after--p\">Nenov has now built a location-independent businesses through Estonian e-Residency, as the programme enables him to easily deal with customers and suppliers around the world.</p><p name=\"3eb2\" id=\"3eb2\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;I really like the freedom e-Residency provides,&#8221; Nenov explains. &#8220;My personal goal is simply to have the freedom to choose when to stay in my own country and when to move if I wanted to.&#8221;</p><p name=\"bb2f\" id=\"bb2f\" class=\"graf graf--p graf-after--p\">Nenov runs <a href=\"https://www.cloudwebops.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">CLOUDWEBOPS O&#220;</a>, which provides professional services to help technology startups and businesses worldwide grow through the effective use of Amazon Web Services (AWS). It was the first company to support AWS in south-east Europe and <a href=\"https://aws.amazon.com/heroes/europe/aleksandar-nenov/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Nenov has now been recognised by Amazon as an AWS Community Hero</a> for his work expanding the use of cloud computing in the region.</p><p name=\"f341\" id=\"f341\" class=\"graf graf--p graf-after--p\">E-Residency of Estonia enables him to manage a remote team of four people across Serbia and Bosnia-Herzegovina, hire other digital nomads abroad when needed and serve clients around the world, including the US, Canada and Australia.</p><p name=\"35ca\" id=\"35ca\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;I have excellent connections and collaboration with clients, which I have never physically met,&#8221; says Nenov.</p><p name=\"23af\" id=\"23af\" class=\"graf graf--p graf-after--p\">Nenov first discovered e-Residency through Facebook and then traveled to Estonia to sign up and meet with business service providers, including <a href=\"https://www.leapin.eu/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">LeapIN</a> to set up and administer a business and <a href=\"https://www.lhv.ee/en/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">LHV</a> to provide him with a business bank account.</p><p name=\"70a1\" id=\"70a1\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;Estonia is doing a lot of stuff in a completely new way,&#8221; says Nenov. &#8220;Everything is transparent and everything is simplified. My business bank account is now integrated with payment services like <a href=\"http://www.transferwise.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">TransferWise</a> and <a href=\"https://www.paypal.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Paypal</a> so it is all very easy to use.&#8221;</p><p name=\"9d8b\" id=\"9d8b\" class=\"graf graf--p graf-after--p\">While in Estonia, Nenov says he was particularly amazed by <a href=\"http://ulemistecity.ee/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">&#220;lemiste City</a>, a business park that is home to an impressive array of technology companies for a small nation, as well as the <a href=\"https://e-estonia.com/e-estonia-showroom/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">e-Estonia Showroom</a> where international visitors can learn more about the success of the digital nation.</p><p name=\"1684\" id=\"1684\" class=\"graf graf--p graf-after--p\">He returned from his trip as a friend of Estonia and an enthusiastic supporter of the e-Residency programme. He now encourages other digital nomads and entrepreneurs to <a href=\"https://e-estonia.com/e-residents/apply/?utm_source=Medium&amp;utm_campaign=India%20in%20EU%20Segment%202&amp;utm_medium=Blog\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">apply for e-Residency</a> to enjoy the same benefits and is particularly active in Facebook groups, including <a href=\"https://www.facebook.com/groups/eResidents/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Estonian e-residents</a> and <a href=\"https://www.facebook.com/groups/1601456366849020/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">e-resident entrepreneurs</a>.</p><p name=\"e2b8\" id=\"e2b8\" class=\"graf graf--p graf-after--p\">Like many digital nomads, Nenov agrees that the life of a digital nomad may not be quite what it seems to many at first, but the greater freedom and opportunities for remote employees and entrepreneurs make it far more rewarding.</p><p name=\"892a\" id=\"892a\" class=\"graf graf--p graf-after--p\">Nenov will spend the summer in a small town in Greece where he will continue work on growing his businesses in a property he has rented.</p><p name=\"5034\" id=\"5034\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;It&#8217;s close to the beach,&#8221; he smiles.</p><p name=\"bc6d\" id=\"bc6d\" class=\"graf graf--p graf-after--p graf--trailing\"><strong class=\"markup--strong markup--p-strong\">The Republic of Estonia is offering e-Residency to digital nomads and other location-independent entrepreneurs around the world. </strong><a href=\"https://medium.com/e-residency-blog\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Read why here</strong></a><strong class=\"markup--strong markup--p-strong\"> or </strong><a href=\"https://e-estonia.com/e-residents/apply/?utm_source=Medium&amp;utm_campaign=India%20in%20EU%20Segment%202&amp;utm_medium=Blog\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">start your application</strong></a><strong class=\"markup--strong markup--p-strong\">.</strong></p></div>","title":"Here’s why the life of a digital nomad isn’t always what it seems"}},"pageContext":{"id":"5b937aef87be056953db7cf3"}}