{"data":{"mongodbDatabaseArticles":{"id":"5b96297287be05832749118f","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Riviera Maya</h1><p class=\"p2\"><b>Tell us a little about&#160; yourself and tell us why you&#8217;re an expert on luxury travel in Riviera Maya.</b></p><p class=\"p2\">We have always said we have been very blessed to live in such a beautiful place in Dorset, UK based on the Jurassic Coast and coming from a rich background of food and luxury lifestyle. We together we have been travelling around the 9-5 life for six years now, from the luxurious to on a budget we have seen some pretty cool places and tasted some of the most fabulous foods, but Riviera Maya, Mexico in particular has so far stolen the soft spot in our hearts. Check out our guide to Riviera Maya <a href=\"http://flashpackingduo.com/things-to-do-in-riviera-maya/\">here</a>!</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-13253\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/rivieramaya1.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"560\" height=\"420\"></p><p class=\"p2\"><b>What makes Riviera Maya a perfect destination for travellers seeking a glamorous trip?</b> </p><p class=\"p2\">If you are looking for the luxurious then Riviera Maya, Mexico is somewhere you must visit, with Beautiful silky white beaches, sun kissed tans and fabulous designer swimsuits everywhere you turn. With such rich array of fresh seafood on offer and some of the best cocktails we have tried, the quiet calm of untouched islands or a rich party ambience, Upmarket Boutiques and vibrant cities, it&#8217;s hard to see why you wouldn&#8217;t!!</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-13255\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/rivieramaya4.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"560\" height=\"420\"></p><p class=\"p2\"><b>What 5 star Hotel is the best in&#160;Riviera Maya?</b></p><p class=\"p2\">The <strong><a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/http://www.hotelscombined.com/Hotel/Blue_Diamond_Riviera_Maya_All_Inclusive_Adults_Only.htm\" target=\"_blank\" rel=\"noopener\">Blue Diamond</a></strong> is 40 minutes south of Cancun, this adults only luxury hotel is nestled within a lush tropical jungle garden and only a 10 minute walk to the turquoise Caribbean Sea. Once we had settles in we didn&#8217;t want to leave the room, which were all decorated crisp white with everyone having their own individual creation inside and all the latest technologies and some even having their own outside (built in) bathrooms or you can go super luxury treating yourself to their presidential suite which came with its own private pool! </p><p class=\"p2\">This hotel had everything we wanted from their own spa, a la carte restaurant, impeccable service and we especially loved the morning walks along the river pathways which the hotel had been built around.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-13249\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/akumal1.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"560\" height=\"420\"></p><p class=\"p2\"><b>What about boutique hotels in Riviera Maya, of them all, which would you send your friends or family to stay at?</b></p><p class=\"p2\">Easy.. <strong><a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/http://www.hotelscombined.com/Hotel/Grand_Palladium_Colonial_Resort_Spa.htm\" target=\"_blank\" rel=\"noopener\">Grand palladium colonial resort</a></strong> and spa is especially ideal for those who have kids. This hotel is so big you would never have to leave! This hotel is located on its very own private beach offering a huge array of water activities from Pedi courses, kayaking down to water yoga (yes, we had to go it a go). The highlight for us was the service provided here, they have a theatre which is open every night with a different act, we would walk past every morning to see them resetting the whole stage with new props and backgrounds etc. and the effort that went into them was superb. You would only have to order your drink once and the waiters will be making sure you do not have an empty drink all night. So for all this we couldn&#8217;t recommend it enough.</p><p class=\"p2\"><b>Are there any fun activities for the adventurous traveler&#160;in Riviera Maya?</b></p><p class=\"p2\">Riviera Maya has a catalogue of activities for any traveler, Hiring a Catamaran with your friends, private big game fishing trips, snorkelling the fantastic coral reefs along this stretch of coast or swimming with the elusive whales sharks just to name a few. You can spend the day at the archeological site of Tulum Mayan Ruins or soak in the atmospheres of Xel Ha &amp; Excarat, Mexico&#8217;s famous ecological parks with natural lagoons, wildlife and entertainment or simply lay back and enjoy the rays of the sun at one of the many finest beaches of offer, as we said there is something for everyone.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-13254\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/rivieramaya2.jpg?resize=560%2C420&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"560\" height=\"420\"></p><p class=\"p2\"><b>Where are the best hang outs during the day in&#160;<b>Riviera Maya?</b></b></p><p class=\"p2\">Forget your shopping trip and get out of the city, pack your beach bag and head to Akamul Beach , this pristine beach is the definition of pure perfection! This once upon a time small fishing village has in recent years earned its rights up there with the finest of beaches in Mexico and were not surprised.&#160; Located south of Riviera Maya, this small bay offers up some of the best snorkelling and diving experiences, with only a couple dive shops you are not overwhelmed with choices. Once you have settled down on the warm white sand, dip our toes in the water and within minutes you will be surrounded by an array of turtles chomping on the grass beds that draw so many sea life to this bay. And best of all.. it&#8217;s FREE! There is no one walking the beaches haggling you for tours as it is all right there at hand, if you did want to try your hand at diving then as we mentioned there are amenities for it but snorkelling is the activity of choice here.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-13256\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/rivieramaya5.jpg?resize=420%2C560&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"420\" height=\"560\"></p><p class=\"p2\"><b>If you have a big date night, what are the most delicious restaurants in&#160;<b>Riviera Maya</b> and what are their best dishes?</b></p><p class=\"p2\">Now this restaurant is located in Playa Del Carmen, just around the corner from Legends sports bar. If you&#8217;ve got cash to plash and get those taste buds tingling then Oh Lala should do the trick! With International cuisines at a pretty penny, using only the best locally sourced ingredients and a very extensive wine list. This place had a fantastic atmosphere and we had great fun watching the chefs showing their skills in the open kitchen, we went the full works with 3 courses and all being as good as the next, starting with Tuna Focaccia, &#160; Rock lobster for our main (to share and was the best lobster we have ever had and we live by the sea!) ending with a pistaccio gelato which when you closed your eyes tated like you had bitten in to a fererro rocher! If you do find yourself looking for that special meal then we highly recommend this place.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-13252\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/mexico-276.jpg?resize=420%2C560&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"420\" height=\"560\"></p><p class=\"p2\"><b>Let&#8217;s talk desserts- what place makes the best?</b></p><p class=\"p2\">Did you hear about the fererro rocher gelato&#8230; ask if you can book a table just for dessert and you have found your place! </p><p class=\"p2\"><b>Time for a great sunset view&#8230; where would you go? </b></p><p class=\"p2\">Mexico in itself is a magical place, filled with beautiful beaches each one being a great sunset view but our spot has to be the south beach of Tulum. With stretches of brilliant white sand and the vibrant colours of the caribbean sea, it is a picture perfect backdrop to a beautiful sunset, with many visitors of the day already on their next adventures you will find this beach at sunset has a feel of exclusivity.</p><p class=\"p2\"><img class=\"size-full wp-image-13250 alignleft\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/01/gravatar-1.jpg?resize=150%2C103&amp;ssl=1\" alt=\"luxury guide to riviera maya\" width=\"150\" height=\"103\">Claire and Dom are the authors behind the adventure travel blog <a href=\"http://www.flashpackingduo.com\">Flashpacking Duo</a>. They have travelled as much as 9-5 lifestyle allows, visiting places across Europe, Asia and the Americas. This year they are embarking on a 3 year round the world trip, visiting over 15 countries , covering 3 continents. You can follow along with their adventures on <a href=\"https://twitter.com/flashpackingduo\">Twitter</a>, <a href=\"https://www.instagram.com/flashpackingduo/\">Instagram</a> and <a href=\"https://www.facebook.com/flashpackingduo/\">Facebook</a>.</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Riviera Maya"}},"pageContext":{"id":"5b96297287be05832749118f"}}