{"data":{"mongodbDatabaseArticles":{"id":"5b95ea2887be05832748ff86","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/rolfpotts001.jpg\" alt=\"Rolf Potts\"><br> Rolf Potts is one of the most famous modern travelers writers out there. He burst onto the scene with his book,<a href=\"http://www.amazon.com/gp/product/0812992180?ie=UTF8&amp;tag=nommatstrasit-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0812992180\"> Vagabonding,</a> and since then, the book has become a must travel for first time travelers. Rolf has, in many ways, become the face of modern backpacking. He recently took time out of his busyschedule to sit down and discuss backpacking.</p><p><strong>Nomadic Matt: You are sort of considered the godfather of backpacking. Every long-term traveler knows about you. How do you feel about having that distinction?</strong><br> <strong>Rolf Potts:</strong> That&#8217;s a humbling thought, though obviously I didn&#8217;t invent or even revolutionize the backpacking phenomenon; I just recast it into 21st century terms, for people who want to use long-term travel as a way to live life to its fullest. The core philosophy of vagabonding goes back through Walt Whitman and John Muir to Ecclesiastes and the Upanishads, so I&#8217;m certainly standing on the shoulders of giants.</p><p><strong>Did you think your first book, Vagabonding, would be so successful? It&#8217;s considered a must read for new travelers on the road.</strong><br> When I was writing Vagabonding in a little room in <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\">Thailand</a> seven years ago, I didn&#8217;t really focus on whether or not it would be successful; I was just trying to communicate an ethic of travel &#8212; and of life in general &#8211;that would encourage people to make the most of their time on earth. That the book has since struck a nerve with travelers has been really gratifying for me &#8212; not just in terms of its success, but in the grassroots nature of that success. The book never had a promotional budget, so I&#8217;d like to think its success was earned on the strengths of its ideas, at a word-of-mouth level.</p><p><strong>You touch on the tourist vs. traveler debate in the introduction to your new book. While I prefer backpacking because it is more low impact, everyone has their own style and, to me, just getting someone out there is a victory in itself. Why do you think this debate persists so much?</strong><br> <a href=\"https://www.nomadicmatt.com/travel-blogs/of-backpackers-and-tourists/\">The tourist v. traveler debate</a> is a status ritual, and as such it has more in common with the petty obsessions of home than the realities and possibilities of the road. Ideally, travel should be an act of humble curiosity, and when you start to worry about where you stand in relation to other travelers you kind of lose the point. In a sense, the tourist/traveler debate is an exercise in insecurity &#8212; a kind of comfort blanket that people cling to amid the uncertain social atmosphere they enter when they leave home. I think it&#8217;s pointless to constantly evaluate your travels in relation to other people; your energy is better spent just quietly making yourself a better, more mindful traveler on your own terms.</p><p><img src=\"https://media.nomadicmatt.com/rolfpotts2.jpg\" alt=\"Rolf Potts\" width=\"219\" height=\"323\"><strong>I often find backpackers in Southeast Asia have this holier than thou attitude about travel. Why do you think that there is a perception among backpackers that they are somehow better travelers?</strong><br> Well again, <a href=\"https://www.nomadicmatt.com/travel-blogs/15-things-i-hate-about-backpacking/\">it&#8217;s all a part of this status game</a>. Backpackers tend to be younger &#8212; and status is huge part of youth-culture, from fraternity houses to all-ages punk clubs. Ideally travel allows you to remove yourself from the pissing contests of whatever subculture you left behind, but of course travel can at times become its own subculture, with its own prejudices. I find it ironic that backpacker arrogance expresses itself most explicitly in backpacker ghettos &#8212; places that have a very tenuous connection to the host culture. If you really are such a super-traveler, odds are you&#8217;ll be off on your own, having quietly life-enriching experiences far from the backpacker ghettos, where there&#8217;s no need to haughtily compare itineraries over banana pancakes and Bob Marley tunes.</p><p><strong>So often travelers have &#8220;the beach&#8221; outlook. That somewhere out there is a travel utopia where they will be the only non local and everything will be perfect. What perpetuates this myth? Do you think its detrimental to the travel experience? That it creates too high expectations?</strong><br> I don&#8217;t think this attitude is all that new. People have always hit the road with unrealistic picture-postcard expectations that don&#8217;t always match reality. The secret, of course, is to be open to reality instead of trying to steer it to your expectations. The story of &#8220;The Beach&#8221; is about a group of people who try to create their own expectation-driven reality, to an ultimately self-defeating degree. In reality, utopia means &#8220;no place,&#8221; and there&#8217;s so much more to learn and enjoy in a real place &#8212; flawed or not &#8212; than a &#8220;no place.&#8221; So again we go back to the importance of being humble on the road, of not letting your ego or your expectations cheat the raw and exhilarating experience of reality. It&#8217;s much better to experience a complicated and less-than-perfect reality on its own terms than to constantly flog half-baked fantasies over your travel experiences.<br> <strong><br> </strong><img src=\"https://media.nomadicmatt.com/rolfpotts3.jpg\" alt=\"Rolf Potts\" width=\"219\" height=\"323\"><strong>I was once read that your favorite country was Mongolia and your least favorite was Vietnam. Is that true and, if so, why? If not, what countries fall into those categories?</strong><br> My perception of these places is very much tied to specific experiences. In 1999 I had a frustrating string of experiences over the course of a couple weeks in Vietnam. (<a href=\"https://www.nomadicmatt.com/travel-blogs/why-ill-never-return-to-vietnam/\">Matt says: Me too!</a>) I&#8217;d just spent some amazing time in <a href=\"https://www.nomadicmatt.com/travel-guides/cambodia-travel-tips/\">Cambodia</a> and Thailand and Laos, and I felt my time had been better spent in those places. But I realize that this could have just been a case of bad luck for me when I was in Vietnam. I have plenty of travel friends who absolutely love <a href=\"https://www.nomadicmatt.com/travel-guides/vietnam-travel-tips/\">Vietnam</a>, and I respect that. Perhaps someday I&#8217;ll go back and the country will redeem itself. As for Mongolia, I was just amazed by its landscape, and by the people who inhabit it. I come from the Great Plains, so I think I was naturally fascinated by the Mongolian steppe.</p><p>There are plenty of other places I love to visit, however. Paris, where I teach a creative writing workshop each summer, is an absolutely gorgeous city. India is a continent to itself. I love visiting New York, and I love road-tripping the American West. Burma is a special place for me, as is Laos. But it&#8217;s hard to pick favorites, since there are so many amazing places out there.<br> <strong><br> What do you think of the flashpacking trend? Backpacking has this mythos around that it&#8217;s not real if you have more than two pennies to your name but I think gizmos and gadgets make travel easier today, as long as you don&#8217;t get too tied to them.</strong><br> I think &#8220;<a href=\"https://www.nomadicmatt.com/travel-blogs/are-we-all-flashpackers-now/\">flashpacking</a>&#8221; is sort of an annoying word (kind of like &#8220;staycation&#8221;), but in practice I think it&#8217;s great. And I&#8217;m not convinced there&#8217;s a solid line between flashpacking and standard backpacking; I think backpack travelers can fit into any number of economic categories. Sure, there are some people who are convinced you aren&#8217;t really traveling unless you&#8217;re sleeping in ditches and squeaking by on $2 a day, but I think that&#8217;s kind of a silly orthodoxy. If you like sleeping in ditches, go for it &#8212; but backpackers who stay in hostels or home-stays or decent hotels have just as much potential for <a href=\"https://www.nomadicmatt.com/travel-blogs/oh-the-places-youll-go/\">amazing travel experiences</a>. And I think it&#8217;s unavoidable that gadgets are going to be more intrinsic to how we all travel; the trick is in challenging yourself to know when not to use the gizmos, when to cut that electronic umbilical cord and immerse yourself in your surroundings.</p><p><strong>If you could only tell one thing to a new traveler, what would it be?</strong><br> Slow down and enjoy yourself. Take your time, and don&#8217;t set limits. <a href=\"https://www.nomadicmatt.com/travel-blogs/new-traveler-advice/\">New travelers tend to be both excited and nervous about the journey ahead</a>, and I think that is totally great and normal. Just don&#8217;t let that excitement and anticipation trick you into thinking you have a jam all your travel dreams and ambitions into one journey. You&#8217;ll be ten times as travel-savvy after your first two weeks on the road, so be flexible and don&#8217;t micromanage things. Don&#8217;t just take a journey; let it take you.<br> <br> For more information about Rolf Potts, visit his website <a href=\"http://www.vagablogging.net/\">Vagablogging</a>. If you are interested in purchases his books, check out his classic, <a href=\"http://www.amazon.com/gp/product/0812992180?ie=UTF8&amp;tag=nommatstrasit-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0812992180\">Vagabonding</a>, and his new book, <a href=\"http://www.amazon.com/gp/product/1932361618?ie=UTF8&amp;tag=nommatstrasit-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1932361618\">Marco Polo Didn&#8217;t Go There</a>, at Amazon.</p><p>Photo Credits: <a href=\"http://rolfpotts.com/images/press/pages/FritzLiedtke-Potts-026.htm\">1</a></p></div>","title":"Interview with Rolf Potts"}},"pageContext":{"id":"5b95ea2887be05832748ff86"}}