{"data":{"mongodbDatabaseArticles":{"id":"5b92489f87be056953db7bc8","content":"<div><p>The <a href=\"http://www.cuasia.co/\">Coworking Unconference 2017</a> in Chiang Mai invited me to speak.</p> <img src=\"/wp-content/uploads/2017/02/C4RkmCnUkAEV1Zj.jpg\" alt=\"\" width=\"1024\" height=\"1024\" class=\"alignnone size-full wp-image-7616 responsively-lazy\"> <p>Since it's a coworking space conference and I've been to many coworking spaces <a href=\"/reset-your-life\">traveling the last few years</a>. I wanted to analyze their business and see what was up. So I did somewhat of a case study as I used to do in <a href=\"//rsm.nl/\">my business school</a> classes. Most of these conferences are endless circlejerks on \"building ecosystems\" and more vagueities, but what does it matter if you don't make money? Not much. Here's a transcript of my presentation. It ties a bit into a post <a href=\"/startup-retreats/\">where I analyzed remote work retreats</a>, which I also analyzed from an economics perspective (maybe this is a nice idea for a series?).</p> <p>Mind you: it's from the perspective of a future remote worker / digital nomad like me. Not a freelancer from Boston who works in a coworking on Boston. I believe remote workers dispersing around the world are the future though, not people from Boston, living in Boston, working in a coworking in Boston. But okay. Let's continue.</p> <a href=\"http://nomadlist.com/levelsio\"><img src=\"/wp-content/uploads/2017/02/Screenshot-2017-02-09-18.47.57.png\" alt=\"Screenshot 2017-02-09 18.47.57\" width=\"3238\" height=\"2042\" class=\"alignnone size-full wp-image-7453 responsively-lazy\"></a> <p>Here's <a href=\"http://nomadlist.com/levelsio\">my travel profile on Nomad List</a>. In the last few years I've been all over the world and have worked from tens of coworking spaces from South America to East Asia.</p> <img src=\"/wp-content/uploads/2017/02/2Hubud3.jpg\" alt=\"2Hubud3\" width=\"2048\" height=\"634\" class=\"alignnone size-full wp-image-7417 responsively-lazy\"> <img src=\"/wp-content/uploads/2017/02/A-SPACE-_Pieter-Levels-4-1.jpg\" alt=\"A-SPACE-_Pieter-Levels-4\" width=\"3648\" height=\"2432\" class=\"alignnone size-full wp-image-7412 responsively-lazy\"> <p>I'm like your customer zero. </p> <h2 id=\"coworking\">You</h2> <p>Now let's talk about what you do! You're the owners of coworking spaces.</p> <img src=\"/wp-content/uploads/2017/02/hatelove-1.jpg\" alt=\"hatelove\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-7410 responsively-lazy\"> <p>I have a love and hate relationship with coworking spaces.</p> <img src=\"/wp-content/uploads/2017/02/20150415145824-friends-un-male-meal-group-drink-talking-summer-restaurant-laughing-happy-men-guys-1.jpeg\" alt=\"20150415145824-friends-un-male-meal-group-drink-talking-summer-restaurant-laughing-happy-men-guys\" width=\"822\" height=\"462\" class=\"alignnone size-full wp-image-7409 responsively-lazy\"> <p>The first few days you arrive, you actually get stuff done. Then you inevitably meet people (which is good), but then it just becomes a social cafeteria. It's all jibber jabber and chitty chat and you can't actually get stuff done anymore.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4333.jpg\" alt=\"IMG_4333\" width=\"955\" height=\"500\" class=\"alignnone size-full wp-image-7389 responsively-lazy\"> <p>Then you get the bullshit startup events, startup coaches, incubators that never deliver, people talking about synergies and networking events. And you REALLY stop getting ANYTHING done.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4335.jpg\" alt=\"IMG_4335\" width=\"600\" height=\"400\" class=\"alignnone size-full wp-image-7387 responsively-lazy\"> <p>But then they're also great. They're the place where you feel community. Where you make friends (and sometimes lovers!).</p> <img src=\"/wp-content/uploads/2017/02/Everest-Base-Camp61.jpg\" alt=\"Everest-Base-Camp61\" width=\"1536\" height=\"1152\" class=\"alignnone size-full wp-image-7397 responsively-lazy\"> <p>For nomads, coworking spaces are like a Mount Everest Basecamp in a foreign world. They make you feel safe and sound when you arrive. They do have a function.</p> <h2>But is coworking a good business? Nobody wants to tell me...</h2> <p>I'm interested in business models and economics. I studied it. So when I meet owners of businesses I ask them about revenue, margins, customers, problems with a business. I've asked coworking space owners. And everywhere you go they're consistently vague. \"Yeah it's going great, we're creating an ecosystem, and a community\". Okay, but what does that mean? How much money are you making? What's the margin?</p> <p>Is. It. A. Good. Business? Yes, or no?</p> <p>Since nobody likes to tell me. I googled it.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4344.png\" alt=\"IMG_4344\" width=\"2208\" height=\"1242\" class=\"alignnone size-full wp-image-7378 responsively-lazy\"> <p>60% of coworking spaces actually lose money.</p> <h3>Margins</h3> <p>And what are the margins?</p> <p>We can make a napkin calculation:</p> <p><strong>An average space has 100 members. Let's say they pay a range of $50 to $150 per month. An average of $100/month. So now we're making $10,000. How about rent? Well that's a few thousand. Let's say $3,000. Then staff? 3 people * $1500, that's $4500. Now we're at $7500 already. Ok so we have $2500 left. Now take $1500 tax off that. We make maybe $1000 pure profit. That's 10%.</strong></p> <p>What if you have 250 members? That's $25,000/month revenue. Much better. But now we need a bigger building with higher rent. Let's say $7,500. We have $17,500 left. Now we need 2.5x staff, 8 people * $1500, that's $12,000. We have $4,500 left. Take tax off and we're left with maybe $2,500 profit. Better but again a meager 10%.</p> <p>These numbers are guesstimates and probably off. But most data shows the same. Coworking space margins are very tight.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4338.png\" alt=\"IMG_4338\" width=\"1393\" height=\"1007\" class=\"alignnone size-full wp-image-7384 responsively-lazy\"> <p>There's different types of businesses.</p> <h3>High margin, low volume</h3> <img src=\"/wp-content/uploads/2017/02/Gucci-handbag-boutique-Neiman-Marcus-Scottsdale.jpg\" alt=\"Gucci-handbag-boutique-Neiman-Marcus-Scottsdale\" width=\"2670\" height=\"1768\" class=\"alignnone size-full wp-image-7431 responsively-lazy\"> <p>There's high margin, low volume businesses. It costs maybe $30 to make a Gucci bag. But you sell it for $3000. So they make $2970 in profit. So that's a giant margin of profit. They're low volume though. Only a few people can afford to buy them. But that's fine because when they sell one bag, it's a lot of money. If you sell 100 bags per day, you make $300,000/day profit.</p> <h3>Low margin, high volume</h3> <img src=\"/wp-content/uploads/2017/02/air_asia.jpg\" alt=\"air_asia\" width=\"1200\" height=\"675\" class=\"alignnone size-full wp-image-7430 responsively-lazy\"> <p>Then there's low margin, high volume businesses. It costs $30 to fly from Bangkok to Chiang Mai. And Air Asia sells you that flight for $31. So they make $1 dollar. That's a tiny margin of profit. But if you fly 1,000 flights per day with 300 people. That's 300,000 * $1 = $300,000/day profit.</p> <p>So, Gucci has 100 customers per day, Air Asia has 300,000 customers per day, but they make the same profit! This is the power of margins vs. volume. Not one is better than the other. It's just economics.</p> <img src=\"/wp-content/uploads/2017/02/coworking-space.jpg\" width=\"1280\" height=\"854\" class=\"size-full wp-image-7429 responsively-lazy\"> <h3>You are low margin, low volume</h3> <p>Now let's talk about you. You're a coworking space. You're in the worst kind of business. You are low margin, and low volume. You don't get a lot of customers, maybe 250 per month. And your price is quite low, maybe $200 per month. You can scale up to higher volume, but you're competing with lots of others.</p> <p>It doesn't stop here.</p> <h3>Low barriers to entry</h3> <p>What else? In terms of economics, coworking spaces have a low barrier of entry. That means it's relatively easy to rent a space, put some furniture in it, call it a coworking space and get people in the door. That means it's relatively easy for people to compete with you. To compare, an industry with a high barrier of entry would be chemical engineering. You need a chemical plant (expensive), top talent staff (hard to get and expensive) etc. Coworking spaces are the opposite.</p> <h3>Low differentiation</h3> <p>Coworking spaces are also low in differentiation. That means most look, feel and are the same. It's hard to distinguish yourself, or at least nobody is really differentiating right now at all. Low differentiation means people can easily copy what you're doing.</p> <h3>Economies of scale</h3> <img src=\"/wp-content/uploads/2017/02/operations-economies-scale-diagram.jpg\" alt=\"operations-economies-scale-diagram\" width=\"675\" height=\"508\" class=\"alignnone size-full wp-image-7489 responsively-lazy\"> <p>Then there's a thing called economies of scale. That means if you produce a lot of a product or service, it gets cheaper because you can multiply things and do the same thing every time and make it cheap. That's the idea Ford's introduced when he made the T-Ford car factories in the early 20th century. It's all modular. So it becomes cheap. Every car is the same. It's not custom. Because custom is expensive.</p> <p>A graphic designer does not have economies of scale. If they have 1 client, it takes 1 hour. If they have 10 clients, it takes 10 hours.</p> <p>Air Asia has economies of scale. If they have 1 person flying, it's expensive. If they have 300,000 people flying, suddenly it becomes cheap because they can duplicate the product experience and make it modular.</p> <p>Even Gucci has economies of scale. Their bags are the same every time. So the more they make, their production will get cheaper.</p> <p>Now let's talk about you. Coworking spaces don't really have economies of scale. Unless you automate your staff, you'll have to hire double your staff count for double the customers. You'll need to pay almost double the rent probably for double the customers. If you open 100 other coworking spaces with the same formula, sure, you'll have some economies of scale in using the same processes. But how are you going to open 100 spaces with these low margins? You're not.</p> <h2>What does this all mean for you?</h2> <p>Economic theory states that you can:</p> <img src=\"/wp-content/uploads/2017/02/6af.jpg\" alt=\"6af\" width=\"640\" height=\"360\" class=\"alignnone size-full wp-image-7428 responsively-lazy\"> <p>Coworking is a bad business to be in and it will not make you rich. Worse it will probably cost more than it will make you. </p> <p>But....you're a coworking space owner, and it's been an amazing journey of doing a space. You've met so many cool people. You've built a community in your space. And you feel like you're helping people in your city.</p> <p>And you are. Your work is essential. I love coworking spaces. They're very necessary.</p> <img src=\"/wp-content/uploads/2017/02/3025038-poster-p-3-do-remote-workers-actually-work.jpg\" alt=\"3025038-poster-p-3-do-remote-workers-actually-work\" width=\"1280\" height=\"720\" class=\"alignnone size-full wp-image-7426 responsively-lazy\"> <p>Because if we didn't have coworking spaces, we'd be working like this! Or we'd be stuck at home. Coworking spaces have a function for public good. </p> <h2>So how we can fix the economics of coworking spaces?</h2> <p>If we don't fix the economics, spaces simply become stagnant or go bankrupt once more spaces open in the same city and the market saturates. And we don't want that. So let's see if we can fix it.</p> <p>From economics, there's a few options here:</p> <ul> <li>Get VC funding, and revenue isn't important anymore (but growth is)</li> <li>Become non-profit, and profit isn't important anymore (but subsidies are)</li> <li>Increase your margins, and make more money</li> <li>Vertically integrate, and make more money</li> </ul> <h3>Option 1: Get VC funding</h3> <img src=\"/wp-content/uploads/2017/02/IMG_4340.jpg\" alt=\"IMG_4340\" width=\"1200\" height=\"630\" class=\"alignnone size-full wp-image-7382 responsively-lazy\"> <p>The first option is to fly to San Francisco. And talk to this old rich white guy.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4339.jpg\" alt=\"IMG_4339\" width=\"2000\" height=\"1333\" class=\"alignnone size-full wp-image-7383 responsively-lazy\"> <p>You shake his hands. And he'll give you $750 million dollars to build a network of coworking spaces around the world.</p> <p>Your spaces will look terrific and better than most:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4341.jpg\" alt=\"IMG_4341\" width=\"1200\" height=\"630\" class=\"alignnone size-full wp-image-7381 responsively-lazy\"> <p>The question is how long you can go for, because you're not making any money (after taxes). You're now burning other people's money:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4342.png\" alt=\"IMG_4342\" width=\"2208\" height=\"1242\" class=\"alignnone size-full wp-image-7380 responsively-lazy\"> <p>And that rich old white guy will be breathing in your neck to grow bigger, faster and open more spaces every week.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4343.png\" alt=\"IMG_4343\" width=\"2208\" height=\"1242\" class=\"alignnone size-full wp-image-7379 responsively-lazy\"> <p>You can do this for a few years. Until money runs out, you burn out and growth stops. It's not a business that's scalable enough for venture capital. It's a business with a low barrier of entry, low margins, low differentiation and high competition. Unless VC-funded coworking spaces can figure out how to change that. They're fucked, and will disappear as fast as they came.</p> <h3>Option 2: Become non-profit</h3> <img src=\"/wp-content/uploads/2017/02/San_Francisco_City_Hall_2-1.jpg\" alt=\"San Francisco City Hall from east end of Civic Center Plaza\" width=\"1524\" height=\"1047\" class=\"size-full wp-image-7476 responsively-lazy\"> <p>The second option is non-profit. Coworking spaces can be argued to be a function for the public good. Like libraries, streets and street lighting and public transport. </p> <p>I'm from a small town in the Netherlands called Nijmegen. It has the typical issues that a small town in 2017 has. Its center is empty and desolate as most traditional shops have gone bankrupt in favor of online shopping. What remains is giant international clothing brands like Zara and H&amp;M. And some vintage hipster coffee shops.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2017/02/VD-failliet.jpg\"> <p>Those empty spots could be bought up by the city government and cheaply changed into very basic coworking spaces for its citizens. Kinda like libraries are now. </p> <p>This has giant economic benefits. Imagine someone from a small town could work for a big company in Amsterdam, remotely. Or London. Or San Francisco. They wouldn't have to live there. But they could work for them and get paid well by them. Then after their work day ends, they leave the city coworking space in their small town. Walk to the ATM. Take out their salary and spend it locally in the restaurant, coffee place and cinema.</p> <p>This means small rural towns can blossom economically again, while the big towns can keep pushing the development of big companies. This way, money does trickle down. </p> <p>Therefore the economic benefits are way bigger than the cost it would be for cities to build coworking spaces in their cities.</p> <h3>Option 3: Increase your margins</h3> <img src=\"/wp-content/uploads/2017/02/IMG_4345.jpg\" alt=\"IMG_4345\" width=\"1600\" height=\"786\" class=\"alignnone size-full wp-image-7377 responsively-lazy\"> <p>The third option is to simply make coworking spaces a high margin business. There's two ways to do that. </p> <h4>Upsell with complementary services</h4> <img src=\"/wp-content/uploads/2017/02/download.png\" alt=\"download\" width=\"500\" height=\"472\" class=\"alignnone size-full wp-image-7424 responsively-lazy\"> <p>You can upsell your low-margin product (coworking) with high-margin complementary services. You're probably already doing that. </p> <img src=\"/wp-content/uploads/2017/02/IMG_4347.jpg\" alt=\"IMG_4347\" width=\"736\" height=\"687\" class=\"alignnone size-full wp-image-7375 responsively-lazy\"> <p>You probably have a coffee bar in your space.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4346.jpg\" alt=\"IMG_4346\" width=\"736\" height=\"546\" class=\"alignnone size-full wp-image-7376 responsively-lazy\"> <p>Maybe people can have lunch too.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4350.jpg\" alt=\"IMG_4350\" width=\"500\" height=\"350\" class=\"alignnone size-full wp-image-7372 responsively-lazy\"> <p>You might offer members a service to receive postal mail and packages.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2017/02/IMG_4351.jpg\"> <p>Some spaces offer their members visa services. For example, extending their tourist visa or arranging a business visa and work permit.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4352.jpg\" alt=\"IMG_4352\" width=\"1694\" height=\"1133\" class=\"alignnone size-full wp-image-7370 responsively-lazy\"> <p>Some more professional spaces even offer in-house lawyers.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4354.jpg\" alt=\"IMG_4354\" width=\"1108\" height=\"800\" class=\"alignnone size-full wp-image-7368 responsively-lazy\"> <p>What I don't see yet but what many members ask for is local personal assistants. Think all the stuff people can have help with. Especially locally if you're a foreigner. Help with your business, or help with finding an apartment. Etcetera.</p> <h4>Attract higher-spending customers</h4> <p>The problem with most freelancers (and digital nomads) is that they're quite cheap. For good reason. They don't like to spend a lot of money, because, well, the don't usually make a lot of money! Most nomads <a href=\"http://www.forbes.com/sites/forbesleadershipforum/2015/12/22/globetrotting-digital-nomads-the-future-of-work-or-too-good-to-be-true/#525abf31523d\">make less than $12,000/year</a>. Getting them to spend lots of money on your (complementary) products and services will only make them leave.</p> <p>But what if you can get higher spending customers?</p> <p>There's a few groups that coworking spaces are hardly tailoring to.</p> <h5>Remote startups</h5> <img src=\"/wp-content/uploads/2017/02/IMG_4357.jpg\" alt=\"IMG_4357\" width=\"994\" height=\"590\" class=\"alignnone size-full wp-image-7365 responsively-lazy\"> <p>This is the company that makes WordPress. It's called Automattic and with 500 employees, it's the largest 100% remote company in the world right now.</p> <img src=\"/wp-content/uploads/2017/02/wordpress-bg-medblue-1.png\" alt=\"wordpress-bg-medblue\" width=\"1200\" height=\"630\" class=\"alignnone size-full wp-image-7469 responsively-lazy\"> <p>But like any remote company, sometimes it's good to still meet in real life. That's why Automattic organizes regular team retreats. Product teams come together and once a year the whole company meets up somewhere in the world. This is a company with a giant budget for this kind of stuff. And all they need is someone (you) to come up to them, tell them you can accommodate their product teams. Rent them an entire room in your coworking space for a month. Get them sleeping accomodation. Organize tours and activities when they're not working. Charge a good price for all of this. This is a big company that's happy to pay if you solve a problem for them.</p> <p>There will only be more remote companies in the future. And they'll love for you to help them make it easier to have their teams meet up IRL somewhere in the world easier. Call it retreats, whatever you call it, it solves their issues.</p> <p>Remote companies like this will spend $100,000's on salaries, and a part of that can go to out off work retreats like this. </p> <h5>Tech companies</h5> <img src=\"/wp-content/uploads/2017/02/Screenshot-2017-02-12-22.33.17.png\" alt=\"Screenshot 2017-02-12 22.33.17\" width=\"2784\" height=\"1552\" class=\"alignnone size-full wp-image-7494 responsively-lazy\"> <p>Now, 500 people is big. But Facebook has 15,000 employees. Google has 75,000 employees. Apple has 115,000 employees. That's giant. These companies are also composed of product teams. And again, you can do the same thing. They're going to embrace remote work increasingly too. Let them set up (permanent) satellite offices in or near your coworking space. Again, you can accomodate that. You know the area. Google will want a Bali remote campus in 5 years. Help them set it up. Remote work (and working from tropical locations) is and will increasingly be a work perk that big tech companies will use to hire the top talent. Play into that by offering them services to set that up. You're the expert at it and you can sell that to them.</p> <p>Tech companies pay <a href=\"//news.ycombinator.com/item?id=11314449\">$150,000 to $400,000</a> now for their top talent per year. Again, part of that budget can go to you. That's crazy amounts of money.</p> <h5>Big corporations</h5> <img src=\"/wp-content/uploads/2017/02/map.jpg\" alt=\"map\" width=\"2400\" height=\"1485\" class=\"alignnone size-full wp-image-7495 responsively-lazy\"> <p>There's relatively few tech companies. But there's a great amount of traditional big corporations who are trying to retain talent. </p> <img src=\"/wp-content/uploads/2017/02/IMG_4358.jpg\" alt=\"IMG_4358\" width=\"1000\" height=\"667\" class=\"alignnone size-full wp-image-7364 responsively-lazy\"> <p>They know their companies are boring AF.</p> <img src=\"/wp-content/uploads/2017/02/IMG_4359.jpg\" alt=\"IMG_4359\" width=\"1800\" height=\"1200\" class=\"alignnone size-full wp-image-7363 responsively-lazy\"> <p>And they want to look more like this:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4330.jpg\" alt=\"IMG_4330\" width=\"640\" height=\"640\" class=\"alignnone size-full wp-image-7392 responsively-lazy\"> <p>You have the power to help them get there. Contact these comapnies and suggest them to work from your space for 2 weeks or a month. Charge them good money for it. They'll love it. And you'll be raking in money.</p> <h5>See my point?</h5> <p>You just went from $12,000/year digital nomads that don't spend money to $400,000/year tech company employees. Go to where the money is.</p> <h3>Option 4: Vertically integrate</h3> <img src=\"/wp-content/uploads/2017/02/IMG_4361.png\" alt=\"IMG_4361\" width=\"2208\" height=\"1242\" class=\"alignnone size-full wp-image-7361 responsively-lazy\"> <p>The fourth option to survive as a coworking space is to vertically integrate. </p> <p>Right now you offer your customer one service: coworking. Vertical integration means you see what other products or services your customer buys that are somewhat related to you.</p> <p>What does your customer do in a day? Let's see.</p> <ul> <li>Sleep</li> <li>Have breakfast</li> <li>Work somewhere</li> <li>Buy coffee/tea</li> <li>Have lunch</li> <li>Work some more</li> <li>Have dinner</li> <li>Do social stuff</li> <li>Do leisure and sports</li> </ul> <p>If you're a coworking space, you're probably only making money on one or two parts of this day. Working and maybe coffee and lunch (if you have a coffee or lunch bar in your space). There's potential here for more coverage. Because every part of your customer's day means you can take another 10% to 30% on top.</p> <p>How does vertical integration look like in real life?</p> <img src=\"/wp-content/uploads/2017/02/C4RkGuJWIAAerUE.jpg\" alt=\"\" width=\"1200\" height=\"900\" class=\"alignnone size-full wp-image-7615 responsively-lazy\"> <h4>Well...I went to Tokyo</h4> <p><img src=\"/wp-content/uploads/2017/02/IMG_4375.jpg\" alt=\"IMG_4375\" width=\"750\" height=\"487\" class=\"alignnone size-full wp-image-7347 responsively-lazy\"><br> Earlier this year I went to Tokyo. I stayed in a hotel called the <a href=\"//www.booking.com/hotel/jp/green-plaza-shinjuku-capsule.en-gb.html?aid=356980;label=gog235jc-hotel-XX-jp-greenNplazaNshinjukuNcapsule-unspec-th-com-L%3Aen-O%3AosSx-B%3Achrome-N%3AXX-S%3Abo-U%3AXX-H%3As;sid=430ed85393d4c0c6fe5e4fe6fe3169d3;dist=0&amp;sb_price_type=total&amp;type=total&amp;\">Green Plaza Capsule Hotel</a>:</p> <img src=\"/wp-content/uploads/2017/02/Screenshot-2017-02-12-23.28.52.png\" alt=\"Screenshot 2017-02-12 23.28.52\" width=\"2668\" height=\"1950\" class=\"alignnone size-full wp-image-7515 responsively-lazy\"> <p>It was this 7-story building:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4374.jpg\" alt=\"IMG_4374\" width=\"400\" height=\"300\" class=\"alignnone size-full wp-image-7348 responsively-lazy\"> <p>I came there to sleep. So, the first floor was capsules to sleep in:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4381.jpg\" width=\"600\" height=\"400\" class=\"size-full wp-image-7341 responsively-lazy\"> <p>But then I explored and there was more. I went up and there was a spa floor:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4379.jpg\" alt=\"IMG_4379\" width=\"600\" height=\"400\" class=\"alignnone size-full wp-image-7343 responsively-lazy\"> <p>I kept going up and exploring this building further. The next floor was full of massage shops:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4380.jpg\" alt=\"IMG_4380\" width=\"1020\" height=\"729\" class=\"alignnone size-full wp-image-7342 responsively-lazy\"> <p>After having a massage I went further up. There was a restaurant floor with all the Japanese food you can imagine, from sushi to ramen:</p> <img src=\"/wp-content/uploads/2017/02/IMG_4373.jpg\" alt=\"IMG_4373\" width=\"560\" height=\"375\" class=\"alignnone size-full wp-image-7349 responsively-lazy\"> <p>The last floor was a relax area with a small business center with desks and fax machines. Kinda like a coworking space. And yes it had WiFi:</p> <img src=\"/wp-content/uploads/2017/02/2025_capsule_hotels_01.jpg\" alt=\"2025_capsule_hotels_01\" width=\"650\" height=\"351\" class=\"alignnone size-full wp-image-7396 responsively-lazy\"> <p>This building had everything to survive in. I stayed inside for 3 days.</p> <p>I had just stepped into a possible prototype of what future living would look like. Multi function living contained in one building or small area. I'm not saying this is necessarily a great future, but it's inevitable. The reasons why this happens in Tokyo are pretty dark: salarymen work so hard, that they don't have time to go back to their families, so they stay over in the city and sleep in these kinds of buildings.</p> <p>But what if we take the positives from this? Stay in these buildings for awhile if you'd like to focus and get stuff done. All your needs are taken care of within tens of meters.</p> <p><strong>This was the epitome of vertical integration.</strong> You cover every need of your customer. You take a % of every transaction. Even if the margins might still be low (10%), you now get way more transactions for one customer. Not just coworking, but sleeping (coliving), breakfast, lunch, dinner, spa, massage, leisure etc. Now you have an actual business that makes good money.</p> <p>Where a coworking space makes $25,000/m with 250 members paying $100/m. A vertically integrated building like this makes $250,000/m with 250 people paying $1,000/m (probably more) as it captures the majority of their spending. Even if the margins stay at 10%, that means a coworking space makes $2,500/m profit, while a building like this with the same amount of people using it makes $25,000/m profit. And a lot of this building can be automated (as is already standard in Japan).</p> <h2>Conclusion</h2> <p>There's many ways to make coworking spaces economically viable. The most promising for me are vertical integration, attracting higher-spending corporate customers and adding more complementary services to your space.</p> <p>We need coworking spaces to exist. But we also need them to evolve with their time and market demand. And if you just remain coworking only, you'll probably have a bleak future ahead. It won't be enough. So do some experiments and try new stuff.</p> <p>I've met coworking owners who are considering building cowork/colive villages, even whole islands. It sounds interesting for sure. With an entire new generation going remote, this is a giant market of people. And ordinary cities might not be the best way for them to work anymore. They want to get stuff done. And optimize their time. Cater to them.</p> <p>Good luck :)</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Most coworking spaces don’t make money; here’s how they can adapt to survive the future"}},"pageContext":{"id":"5b92489f87be056953db7bc8"}}