{"data":{"mongodbDatabaseArticles":{"id":"5b95ef7687be058327490113","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Funny and Embarrassing Thai Massage Stories</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-13004\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/Funny-Thai-Massage-Stories-Header2-1000px.jpg?resize=998%2C617&amp;ssl=1\" alt=\"Funny and Embarrassing Thai Massage Stories\" width=\"998\" height=\"617\">One of the perks of living in Thailand is the accessibility to affordable massages. We&#8217;ve had our fair share of both good and bad massages in Thailand, but every once in a while we&#8217;ll have a funny or surprising thing happen during our hour of supposed bliss. Here&#8217;s a&#160;collection&#160;of short stories for your entertainment:</p>\n<p><strong></strong></p>\n<p><strong>Massages in Thailand are pretty dang awesome and&#160;range from luxurious treatments at professional spas to no-frills massages at quaint roadside parlors.</strong> We tend to go for the latter and pay between 150 to 300 baht&#160;for an hour massage and leave a little extra for tip.</p>\n<p>We&#8217;ve had really good massages that have put us to sleep. Others have been unmemorable and a few not so good. Once we were subjected to an hour long massage of painful leg hair pulling (for Chris) and&#160;excessive shin bone rubbing (for me), but we were too embarrassed for our masseuses to tell them&#160;to stop! But&#160;boy&#160;do we have some stories&#8230;</p>\n<h2><p id=\"Birthday_Suit_Massage\"><p>Birthday Suit Massage</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-12976\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/CM-Massage-1000px-4.jpg?resize=1000%2C689&amp;ssl=1\" alt=\"Funny and Embarrassing Thai Massage Stories \" width=\"1000\" height=\"689\"></p>\n<p>For my last birthday, Chris treated me to a full day of massages. We ended up going to three different places, one of which was a high-end spa where we splurged on a&#160;package featuring a body scrub, foot massage, and an oil massage.</p>\n<p>We shared a fancy room that had two massage tables, a shower in one corner, and a soaking tub in another. <strong>We were asked to undress and&#160;put on&#160;plastic shower caps (how sexy) and these itty bitty black pairs of disposable underwear </strong>before crawling under our sheets on the massage beds.</p>\n<p>Our body scrub came first. When it was finished, instead of&#160;being wiped down&#160;with a cool damp cloth as expected, we were asked to clean off in the&#160;shower. The awkward part was that both masseuses remained&#160;in the room.</p>\n<p>Rinsing off wouldn&#8217;t have been so bad if the enclosed shower actually offered privacy. Although the&#160;bottom half was frosted glass, the top half was completely clear. <strong>There&#8217;s nothing like sporting your&#160;birthday suit on your birthday in front of two strangers!</strong></p>\n<p>After cleaning up, we put on a second yet equally ridiculous pair of disposable underwear, crawled back under the&#160;sheets, and got a foot massage followed by a full body oil massage.</p>\n<p>When everything was&#160;over, the masseuses left the room and finally allowed us to change in privacy. That&#8217;s when I looked over at Chris and realized that <strong>the black disposable underwear he was&#160;wearing were&#160;completely and utterly see-through.</strong>&#160;His pair had stretched much more on him than they had on me and left&#160;nothing to the imagination. He could have been strutting around in his birthday suit as far as I could tell!</p>\n<h2><p id=\"Kick_Yourself_Where_Massage\"><p>Kick Yourself Where? Massage</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-12980\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/CM-Massage-1000px-1.jpg?resize=1000%2C722&amp;ssl=1\" alt=\"Funny and Embarrassing Thai Massage Stories \" width=\"1000\" height=\"722\"></p>\n<p>So this is actually a story that one of our good friends shared with us. He&#8217;s a professional masseuse and pretty particular about the massages he gets. However, if a massage place has great reviews, he&#8217;ll consider it and treat himself.</p>\n<p>So he&#160;researched some of the higher-end spas and booked a Thai massage at a place with great&#160;ratings. His first impressions confirm his online findings: Professional staff? Check. Calming atmosphere? Check. Clean and freshly spa scented? Check.</p>\n<p>But not long after he had stretched himself on his massage table did things start going down hill. He could tell immediately that his masseuse didn&#8217;t know what she was doing. <strong>She was contorting him in very odd ways, which says a lot even for a Thai massage.</strong> At one point, she managed to bend his leg in a way where he actually kicked himself right in his man parts. Most guys can&#8217;t&#160;do this even if they tried!</p>\n<p>Massages are supposed to be a therapeutic or relaxing experience, not a kick in the balls, pun fully intended. Certainly she couldn&#8217;t do it&#160;again&#160;because<strong>&#160;it takes skill&#160;to get that kind of&#160;leverage on&#160;a full-grown man&#160;and make him kick himself!</strong>&#160;But nope, this woman managed to do it a second time with the other leg. To this day our friend&#160;doesn&#8217;t know if she was blissfully unaware of the torture or if it was done intentionally.</p>\n<h2><p id=\"Sister_Massage\"><p>Sister Massage</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-12977\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/CM-Massage-1000px-3.jpg?resize=1000%2C675&amp;ssl=1\" alt=\"Funny and Embarrassing Thai Massage Stories \" width=\"1000\" height=\"675\"></p>\n<p>Last year my parents and younger sister visited Thailand and one afternoon we stopped at a little massage shop after exploring the town on foot. We requested two oil massages (for me and my sister) and two foot massages for my parents. My parents were seated in the front area&#160;of the massage shop and my sister and I were taken to the back.</p>\n<p><strong>Going to the back of a shop for an oil massage is not unusual, except that the two of us were led to a full-sized mattress to share.</strong> This was odd because typically each customer receives their own personal narrow mattress.</p>\n<p>It wasn&#8217;t a big deal, but then one of the masseuses closed the curtains around the massage area&#160;indicating that we were to undress right there together and not separately in a changing room. Again, a little odd, but nothing I couldn&#8217;t handle. After all, I grew up sharing a room with my sister for 10+ years.</p>\n<p>An oil massage begins with you laying on your stomach and getting massaged on your back, shoulders, and legs. Then you flip over and it&#160;continues on your arms, chest, and the front of your legs, face and head. <strong>I&#8217;ve had one or two masseuses who&#8217;ve massaged my chest muscles, but it&#8217;s pretty rare since I have boobs.</strong>&#160;If they do it, they&#160;place a small towel over my chest and then pull down the sheet to work around my pec muscles.</p>\n<p>But this time there was no small&#160;towel provided for modesty. Nope! The one time I&#8217;m sharing the same massage space with another person is when I&#8217;m completely topless and getting&#160;my&#160;pecs massaged. <strong>It was utterly shameful knowing that my sister was receiving the same treatment just an arm&#8217;s length away</strong>&#160;and it was everything I could do to keep my eyes shut and act like this was totally normal.</p>\n<p>Of course there are embarrassing things that happen in an industry when customers are nearly naked. Which leads me to my last massage story&#8230;</p>\n<h2><p id=\"Newbie_No_PantsMassage\"><p>Newbie No Pants&#160;Massage</p></p></h2>\n<h2><span><img class=\"aligncenter size-full wp-image-12978\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/06/CM-Massage-1000px-5.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Funny and embarrassing Thai massage stories\" width=\"1000\" height=\"667\"></span></h2>\n<p>During the last few days my family was in Thailand, I took them&#160;to a massage shop that Chris and I have been to several times. This particular place is set up with several small rooms, each featuring two or three individual&#160;mattresses with&#160;curtain separators in between.</p>\n<p><strong>Somehow my mom and sister were whisked away to share one room and I was left to share a room with Chris and my dad.</strong> This wasn&#8217;t so bad except that when I wanted to go to the far massage table for a little privacy, therefore putting Chris between me and my dad, my massage lady insisted that I stay in the middle.</p>\n<p>Ok, alright. I reluctantly pulled the curtains closed around me, got out of my robe, and wiggled under my massage table sheet wearing only my underwear. But my massage lady proceeded to throw&#160;open&#160;the curtains and started my session&#160;without having any privacy between Chris or my dad.</p>\n<p><strong>Of course I&#8217;m dreading the moment when halfway through the massage I&#8217;d be asked&#160;to flip over on my back.</strong> This is where the masseuse lifts up the cloth covering my body, and although she&#160;can&#8217;t see me, for a moment I&#8217;ll be completely exposed to either Chris (ok) or my dad (not ok).</p>\n<p><strong>In the middle of this thought I hear my dad&#8217;s masseuse give out a squeal followed by a few ooo-eee&#8217;s! and Thai chatter.</strong> Evidently, this was my dad&#8217;s first full body oil massage and when they instructed him to undress, well, he did. Completely. His masseuse lady&#160;must have been going through the motions of&#160;adjusting the sheet that was draped&#160;over him and was completely caught off guard by his blinding white butt cheeks.</p>\n<h2><p id=\"We8217re_sure_there_are_a_million_Thai_massage_stories8230\"><p>We&#8217;re sure there are a million Thai massage stories&#8230;</p></p></h2>\n<p>This is about the time when I wish I could speak Thai well enough to have my masseuse tell me some massage stories from their point of view.&#160;Do you have any funny or embarrassing Thai massage stories? Do tell!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Funny and Embarrassing Thai Massage Stories"}},"pageContext":{"id":"5b95ef7687be058327490113"}}