{"data":{"mongodbDatabaseArticles":{"id":"5b92397b87be0583cfde680d","content":"<div><p>Places like <a title=\"Tax freedom starts with a territorial tax system\" href=\"http://nomadcapitalist.com/2013/05/10/tax-freedom-starts-with-a-territorial-tax-system/\">Singapore</a> (that don&#8217;t even tax your overseas earnings when you do live there) or Switzerland certainly <a title=\"Are taxes the price we pay for civilization?\" href=\"http://nomadcapitalist.com/2013/08/14/are-taxes-the-price-we-pay-for-civilization/\">aren&#8217;t civilized</a> &#8211; their low tax rates make them backwards hellholes.</p>\n<p>Of course, what the tax justice folks <a title=\"Are taxes the price we pay for civilization?\" href=\"http://nomadcapitalist.com/2013/08/14/are-taxes-the-price-we-pay-for-civilization/\">call &#8220;civilization&#8221;</a> isn&#8217;t good infrastructure and long life expectancy. It&#8217;s a system that redistributes money from people like you and I to their favorite pet projects &#8211; or right into their own pockets.</p>\n<p>They&#8217;re always on the lookout for fresh, unsympathetic victims to wring more money out of.</p>\n<p>Unfortunately, expats are not very sympathetic figures. Some Americans would call them <a title=\"When your country isn&#8217;t worth fighting for\" href=\"http://nomadcapitalist.com/2013/05/08/when-your-country-isnt-worth-fighting-for/\">traitors</a> simply for having a job outside of the United States.</p>\n<p>However, when the tax justice guys tell you that you must be a <a title=\"You are nothing but a milk cow\" href=\"http://nomadcapitalist.com/2013/04/25/you-are-nothing-but-a-milk-cow/\">tax slave</a> for life merely for being born within a set of lines called &#8220;the United States&#8221;, consider this. No other country, &#8220;civilized&#8221; or not, has such a requirement.</p>\n<p>If more taxes are better, lots more are lots better. High-tax places like Belgium, Norway, and the United Kingdom would be even more &#8220;civilized&#8221; than the US because they impose a heavier tax burden on their people.</p>\n<p>Yet once you pack your bags and fly out of Brussels or Oslo or London for good, you simply let the tax authorities know and the bills stop coming.</p>\n<p>Amazing how <a title=\"Are taxes the price we pay for civilization?\" href=\"http://nomadcapitalist.com/2013/08/14/are-taxes-the-price-we-pay-for-civilization/\">&#8220;uncivilized&#8221;</a> that is.</p>\n<p>I would argue that Belgium and Norway are better places to live, eat well, raise a family, and <a title=\"Offshore Banking\" href=\"http://nomadcapitalist.com/offshore-banking/\">bank</a> &#8211; Norway is even better at managing their fiscal affairs. But that&#8217;s another topic entirely.</p>\n<p>The bottom line is that the US government believes &#8211; and their citizenry backs them up &#8211; that merely carrying a US passport is a prescription for lifetime tax enslavement. Some sort of bizarro birthright you get for birth onto American soil.</p>\n<p>Yet those overseas services are rarely valuable. I&#8217;ve used US consulates in other countries and found the experience <a title=\"If only the free market ran US consular services\" href=\"http://nomadcapitalist.com/2013/08/28/if-only-the-free-market-ran-us-consular-services/\">pretty horrifying</a>.</p>\n<p>It&#8217;s bad enough American embassies are about the only ones that take up multiple city blocks surrounded by huge fences and nasty-looking armed guards. Ever see an Irish embassy? You can walk right in.</p>\n<p>I guess the Irish &#8211; and almost everyone else &#8211; have been too busy minding their own business and being polite to the own citizens to start a bunch of budget-draining wars that kill innocent people and piss off the very people they claim are out to get them.</p>\n<p>If they only knew better.</p>\n<p>Yet I don&#8217;t see thousands of Irish people dying every year because their government didn&#8217;t save them when they got caught in a bind overseas.</p>\n<p>Entering a US consulate is like entering prison. While the government tells you you&#8217;ll buckle under to their spy-state madness if you &#8220;have nothing to hide&#8221;, they&#8217;ve got plenty to hide. You&#8217;re stripped of any electronic device, pen, pointy object, and just about anything else, and molested upon entry.</p>\n<p>Once inside, you get barked at by staff who get vacation days on both US holidays and whatever country they&#8217;re working in. That means that in addition to being slow, apathetic government workers, they have the added benefit of working even fewer days a year and a bonus of getting to scream at and threaten you. Literally.</p>\n<p>To say that Americans should be on the hook to Uncle Sam&#8217;s tax scam for life is beyond insulting. The fact that no other country does it means it&#8217;s not the price we pay to live in the civilized world, but the price we pay to be accidental citizens of the most arrogant country in the world.</p>\n<p>I for one have doubts I&#8217;ll need the government&#8217;s protection. They do a pretty bad job at it to begin with. Despite feeling my crotch and snarking at me during &#8220;random&#8221; (read: every single time) checkpoints at the airport, I doubt they&#8217;ve kept a single flight of mine safe. Look at all the cases the TSA <a href=\"http://nomadcapitalist.com/2013/04/23/im-in-the-us-and-why-many-foreigners-dont-want-to-be/\">screws up anyway</a>.</p>\n<p>Similarly, I believe in self-reliant while overseas. If I ever get stuck in a war zone, I wouldn&#8217;t trust the US consulate to keep me safe. They&#8217;re not very good at doing things for other people.</p>\n<p>All throughout history, governments have guarded the capital. The military was focused there and made it their top priority. The hinterlands&#8230; not so much. In the same way, today&#8217;s US government will defend their own overpaid bureaucrats before helping some little old citizen stuck in Libya evacuate alive.</p>\n<p>It&#8217;s the sovereign version of &#8216;put your mask on first, then assist others.&#8217;</p>\n<p>For a government that couldn&#8217;t even protect it&#8217;s own government agents in Libya, I doubt they&#8217;d do much to help little old me if I ever got holed up in a war zone somewhere. (And, since they&#8217;re sociopaths who can&#8217;t be challenged, even less if they read this article.)</p>\n<p>Fortunately for them, their <a title=\"Don&#8217;t let travel warnings stop you from visiting Cambodia\" href=\"http://nomadcapitalist.com/2013/08/26/dont-let-travel-warnings-stop-you-from-visiting-cambodia/\">propaganda warnings</a> against visiting any place remotely unsafe prevents most Americans from going to some &#8220;war zone&#8221; (like <a title=\"How to invest in Philippines agriculture without getting dirty\" href=\"http://nomadcapitalist.com/2013/12/13/invest-philippines-agriculture-without-getting-dirty/\">the Philippines</a> &#8211; ha ha) and them having to be called out on just how phony their overseas protection is.</p>\n</div>","title":"America’s bad excuse for citizenship-based taxation"}},"pageContext":{"id":"5b92397b87be0583cfde680d"}}