{"data":{"mongodbDatabaseArticles":{"id":"5b92396787be0583cfde67f8","content":"<div><h2>What you&#8217;re probably doing wrong</h2>\n<p>Here at Nomad Capitalist, we recently worked with an Australian guy. He was earning $400,000 a year with his online business but paying almost $200,000 a year on it! He had a nice standard of living and wanted for nothing. He had a great apartment, was visiting clubs and bars whenever he wanted to and was saving around $50,000 a year.</p>\n<p>That&#8217;s not bad. But he wanted to <a href=\"http://nomadcapitalist.com/2017/02/06/22-things-nomad-capitalist-taught-me/\">become a multimillionaire</a> and be able to retire early, support his family, and enjoy the rest of his life. So he came to me and asked how he could make this happen.</p>\n<p>The first thing we did was get him to move out of Australia &#8212; i.e., leave his home country. He moved to Asia, where he could have the same lifestyle or better but without the huge tax bill. Now he has a better lifestyle and he&#8217;s putting away over $250,000 a year. He&#8217;s also investing his money with much better rates of return so he will hit his goal of being a multimillionaire much faster.</p>\n<p>The elements of this story are twofold: Firstly, we&#8217;ve talked previously on Nomad Capitalist about how in the U.S. the average person often doesn&#8217;t have $500 when needed to pay for an emergency. In fact, almost two-thirds of Americans often find themselves in this situation. </p>\n<p>Now I&#8217;m reading that the numbers aren&#8217;t that much different even if you&#8217;re earning right up to low six-figure salaries. If you&#8217;re making millions, you probably do have a couple of spare bucks lying around, but the point is this: Even if you&#8217;re making $100,000 a year, you probably don&#8217;t have much spare for emergencies.</p>\n<p>I spoke to my Danish friend about what happens in Copenhagen with people he knows who work in the big accounting firms. Some of those people are partners in those firms and earning upwards of &#8364;300,00 to &#8364;400,000 a year. But by the time they&#8217;ve paid for their fancy car, a house in the right neighbourhood, splashed out on entertaining friends, bought their wife a designer handbag, and paid their tax bill, they too are left with zero.</p>\n<p class=\"et_post_video\"></p>\n<h2>Two big takeaways</h2>\n<p>Water seeks its own level. This is especially true when it comes to living in your home country. For most people, it seems that no matter how much you earn, you&#8217;re left with zero. By the time you&#8217;ve paid for the house, all the different bills, <a href=\"http://nomadcapitalist.com/2017/02/08/lower-taxes-florida-nevada-state-tax/\">and then your tax bill</a>, so many people wind with zero or very little leftover.</p>\n<p>In my situation, I managed to save some money when I lived in the U.S., but as soon as I got out of that system I was able to save so much more, do so much more, and grow my wealth so much faster.</p>\n<p>Being in a place like Lesotho where people are more relaxed really made me think about these two key takeaways I&#8217;ve been alluding to:</p>\n<ul>\n<li>Reduce your tax burden</li>\n<li>Don&#8217;t try and keep up with the Joneses</li>\n</ul>\n<h2>Imagine the life you could have</h2>\n<p>Imagine how much you could accumulate and how much more relaxed you could be if you applied these principles to your life.</p>\n<p>For example, let&#8217;s look back at the guys from Copenhagen. Imagine if <a href=\"http://nomadcapitalist.com/2013/11/20/buy-real-estate-malaysia-foreigner/\">they lived in Malaysia</a>. They might not need the Range Rover anymore and they might not care if they live in the &#8220;right neighbourhood.&#8221; They would just want a nice house that they could enjoy, rather than having to constantly show off. The biggest thing, though, is that they&#8217;d no longer have to pay 50% to 60% of their earnings in tax.</p>\n<p>It&#8217;s the same with the Australian guy that I mentioned earlier. He decided to moved to Thailand. He chose an area of Bangkok that wasn&#8217;t the sexiest, but he liked it. And now he has a bigger and better house than the one he had in Sydney. He&#8217;s enjoying himself and, importantly, he&#8217;s no longer paying $200,000 a year in tax. He&#8217;s reduced his tax burden, he&#8217;s saving a lot of money, he lives where he wants, and he doesn&#8217;t need to show off to anybody. He&#8217;s doing what he wants. </p>\n<p>Our two key elements have improved his life and taken him from saving $50,000, if that, to $250,000 a year!</p>\n<p>Furthermore, now that he&#8217;s opened his mind to living outside of Australia, he&#8217;s also no longer just keeping his money in the bank, earning 1% interest. He&#8217;s growing his money faster and will become a multimillionaire many years faster, too.</p>\n<h2>These principles in action</h2>\n<p>If we look at a place like Lesotho, where people are more relaxed and don&#8217;t take things too seriously, you can see that this kind of thinking can make a big difference to your own life. Maybe we want to be in the Four Seasons or in the business class lounge. But you can do that a lot more with a lot less effort when you cut out your tax burden and stop trying to &#8220;keep up with the Joneses.&#8221; </p>\n<p>When you decide to leave your home country and no longer pay taxes there, you can live somewhere with a lower cost of living, get more for your money, and afford a more luxurious apartment. You can do so much more!</p>\n<p>You can learn more about how to cut your tax bill legally at NomadCapitalist.com. We can show you how so many people who are running location-independent businesses, online businesses, e-commerce, consulting etc. are creating massive wealth much faster than everybody else.</p>\n</div>","title":"Two ways for entrepreneurs to KEEP more of their money"}},"pageContext":{"id":"5b92396787be0583cfde67f8"}}