{"data":{"mongodbDatabaseArticles":{"id":"5b93835687be056953db7e51","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"0d10\" id=\"0d10\" class=\"graf graf--h3 graf--leading graf--title\">How to Determine if Candidates Will Thrive in a Remote Work Environment</h1></p><p name=\"cc42\" id=\"cc42\" class=\"graf graf--p graf-after--figure\">I&#8217;ve made stellar hires who have propelled my company&#8217;s success. I&#8217;ve also made some bad hiring decisions. In the last decade, our bad hires have cost <a href=\"http://articulate.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Articulate</a> several million dollars. And we&#8217;re not alone. CEO Tony Hsieh estimates that bad hires have <a href=\"https://www.youtube.com/watch?v=XHcyKU-wZoA&amp;feature=youtu.be\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">set Zappos back $100 million</a>.</p><p name=\"8ef6\" id=\"8ef6\" class=\"graf graf--p graf-after--p\">But hard costs are just the beginning. Bad hires infect your company like a virus. If they&#8217;re not pulling their weight, bad hires demoralize other people on the team. If they have a poor attitude or are political, they sow negativity and distrust. If they&#8217;re managers or executives, they can derail entire teams, cost you valuable employees, and undermine the company&#8217;s ability to execute on key priorities.</p><p name=\"df06\" id=\"df06\" class=\"graf graf--p graf-after--p\">On the flip side, the benefits of a great hire can be just as powerful. Great hires elevate team morale when they excel at their roles. They help teams bond when they&#8217;re kind, positive, and supportive of their teammates. Excellent managers and executives keep your company on the right course, motivating and focusing teams on the projects that matter the most.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*io71WIgEqVDw68fSgaqkdQ.png\"><p name=\"a516\" id=\"a516\" class=\"graf graf--p graf-after--figure\">So, it&#8217;s really important to hire the right people. That is easier said than done, of course, particularly for tech companies facing the much-touted <a href=\"http://blog.indeed.com/2016/12/05/impact-of-tech-talent-shortage/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">tech talent shortage</a>. If you&#8217;re working at a fully remote tech company like ours, you have the added challenge of finding that rare breed of person who shines when given freedom, has an insanely good work ethic, is highly self-motivated, and doesn&#8217;t need to see people each day in the flesh to feel connected to them. Plus, you need to make sure&#8202;&#8212;&#8202;without meeting them in person&#8202;&#8212;&#8202;that candidates will gel with the rest of your team.</p><p name=\"8185\" id=\"8185\" class=\"graf graf--p graf-after--p\">Through trial and error, we&#8217;ve developed some core strategies for determining whether candidates will thrive in our remote work environment.</p><h4 name=\"c35e\" id=\"c35e\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">We look for work-from-home experience and&#160;affinity</strong></h4><p name=\"7830\" id=\"7830\" class=\"graf graf--p graf-after--h4\">These days, it&#8217;s more common for people to have remote work experience. Obviously, candidates with proven success in a remote environment are the safest bet. People who have worked as freelancers or consultants come in second. However, we make sure these folks were successful in their solo careers! If they weren&#8217;t, it could signal a lack of self-discipline, and self-discipline is an absolute must for remote employees to succeed.</p><p name=\"ed1a\" id=\"ed1a\" class=\"graf graf--p graf-after--p\">Even if the candidate doesn&#8217;t have remote or contracting experience, there are ways to gauge whether that person is built for remote work. Many companies now offer work-from-home days. During the interview process, we ask candidates whether they&#8217;ve exercised that benefit anywhere they&#8217;ve worked and what they did and didn&#8217;t like about it. If they describe how much more they got done without office distractions, thumbs up. If they talk about how great it was to do their laundry during work hours, thumbs down.</p><p name=\"1fef\" id=\"1fef\" class=\"graf graf--p graf-after--p\">We also ask candidates to describe the best company culture they&#8217;ve experienced and probe for specifics about what makes them happiest at work. People who rate happy hours, foosball tournaments, and lunchtime games highly probably need more in-person work socializing than we can offer. People who relate experiences where they were empowered to accomplish important work and had ownership over their projects are more likely to thrive in a remote culture that provides a lot of autonomy.</p><h4 name=\"092f\" id=\"092f\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">We screen for qualities needed to work&#160;remotely</strong></h4><p name=\"8067\" id=\"8067\" class=\"graf graf--p graf-after--h4\">Successful remote workers are disciplined and self-motivated. No boss is eyeing them from across the office to see whether they&#8217;re working. They alone are responsible for structuring their workdays. They must own their work, and proactively communicate with their teams to grease the wheels of collaboration. We highly value productivity in our culture, so we also look for individual contributors who express a hunger to get things done.</p><p name=\"e71e\" id=\"e71e\" class=\"graf graf--p graf-after--p\">To detect whether candidates have these characteristics, we pay close attention during the application process. Do they communicate with us proactively? Do they research our company and check in with us regularly, or do they passively wait for someone to instruct them on next steps? To assess their sense of ownership and responsibility, we ask potential hires to tell us about a time they failed at work. Do they make excuses and blame their failure on others, or do they describe the valuable, actionable lessons they learned from their mistakes?</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*05FZJhGaGeknkZwBag4sEg.png\"><p name=\"56be\" id=\"56be\" class=\"graf graf--p graf-after--figure\">When candidates discuss their work accomplishments, we probe carefully about the role they played. Is it clear they made individual contributions to projects, or is it hard to pin down exactly what they did? We&#8217;ve found that people from big companies with a slower work pace and unclear project owners often find it difficult to adjust to a culture that expects them to personally drive their own deliverables.</p><p name=\"92f8\" id=\"92f8\" class=\"graf graf--p graf-after--p\">Finally, we vet for communication skills, knowing that without them, an employee simply won&#8217;t be effective in our remote environment. Whether you&#8217;re problem-solving in a daily video standup, writing stories in GitHub, or shooting Slack messages to your teammates, you must be able to get your ideas across clearly, or collaboration falls apart.</p><h4 name=\"55c6\" id=\"55c6\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">We do projects together to see how they&#160;work</strong></h4><p name=\"d002\" id=\"d002\" class=\"graf graf--p graf-after--h4\">For many roles, we also do a trial of sorts with our final candidates. We pair engineering candidates with our own engineers for a few hours. It lets us witness firsthand their technical and problem-solving skills as well as their comfort collaborating remotely. We give marketing hires a small project, and evaluate not only their thinking behind the deliverable but also how effectively they communicate it via video conference to a diverse panel of interviewers. Our UX candidates solve a design challenge and walk through their solution live with our designers and engineers.</p><p name=\"c9fc\" id=\"c9fc\" class=\"graf graf--p graf-after--p\">We&#8217;ve had candidates we love completely bomb these small trial projects. We&#8217;ve had other outside-the-box candidates totally nail them. In other words, doing them has saved our bacon over and over.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*mTKUJ3DE8jYjFmvKjmg2IQ.png\"><h4 name=\"6a28\" id=\"6a28\" class=\"graf graf--h4 graf-after--figure\"><strong class=\"markup--strong markup--h4-strong\">We get cross-team input on cultural&#160;fit</strong></h4><p name=\"0ded\" id=\"0ded\" class=\"graf graf--p graf-after--h4\">Getting people from outside the immediate team to interview candidates can be another helpful strategy for assessing whether someone will fit into our remote culture. Sometimes, a team can be so focused on whether a candidate has the right skill set that they might miss some misfit tells. So, we solicit help from other teams to see clearly.</p><p name=\"8016\" id=\"8016\" class=\"graf graf--p graf-after--p\">For example, our marketing team routinely has people from our web development, IT, and product operations teams interview candidates. This process is valuable not only because marketing collaborates with these other teams and wants to get their buy-in, but also because getting perspective from diverse teams makes it more likely that a cultural fit analysis will be accurate.</p><p name=\"534e\" id=\"534e\" class=\"graf graf--p graf-after--p\">While we&#8217;ve had great success with these strategies, we&#8217;re learning <a href=\"http://42hire.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">one hire at a time</a> how to refine them even more. After all, we&#8217;re only as good as our people.</p><h4 name=\"94fe\" id=\"94fe\" class=\"graf graf--h4 graf-after--p\">Check out my other articles on remote&#160;work:</h4></div>","title":"How to Determine if Candidates Will Thrive in a Remote Work Environment"}},"pageContext":{"id":"5b93835687be056953db7e51"}}