{"data":{"mongodbDatabaseArticles":{"id":"5b9248b987be056953db7be0","content":"<blockquote><p>(..) be wary of following the careers advice your college gives you. In journalism school, for example, students are routinely instructed that, though they may wish to write about development issues in Latin America, in order to achieve the necessary qualifications and experience they must first spend at least three years working for a local newspaper, before seeking work for a national newspaper, before attempting to find a niche which brings them somewhere near the field they want to enter. You are told to travel, in other words, in the opposite direction to the one you want to take. You want to go to Latin America? Then first you must go to Nuneaton. You want to write about the Zapatistas? Then first you must learn how to turn corporate press releases into &#8220;news&#8221;. <strong>You want to be free? Then first you must learn to be captive.</strong> (..) This career path, in other words, is counter-educational. <strong>It teaches you to do what you don&#8217;t want to do, to be what you don&#8217;t want to be. It is an exceptional person who emerges from this process with her aims and ideals intact.</strong> Indeed it is an exceptional person who emerges from this process at all.</p> <p>(..)</p> <p><strong>What the corporate or institutional world wants you to do is the opposite of what you want to do. It wants a reliable tool, someone who can think, but not for herself: who can think instead for the institution.</strong> </p> <p>(..)</p> <p>How many times have I heard students about to start work for a corporation claim that they will spend just two or three years earning the money they need, then leave and pursue the career of their choice? <strong>How many times have I caught up with those people several years later, to discover that they have acquired a lifestyle, a car and a mortgage to match their salary, and that their initial ideals have faded to the haziest of memories, which they now dismiss as a post-adolescent fantasy? How many times have I watched free people give up their freedom?</strong></p></blockquote> ","title":"Never dismiss your ideals as post-adolescent fantasy"}},"pageContext":{"id":"5b9248b987be056953db7be0"}}