{"data":{"mongodbDatabaseArticles":{"id":"5b95ee8487be0583274900e0","content":"<div><p><img class=\"aligncenter size-full wp-image-14707\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/What-to-Wear-in-Thailand-4.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"What to Wear in Thailand\" width=\"1000\" height=\"550\"><br>\nIf you&#8217;re coming to Thailand, chances are the number one thing you&#8217;re wondering about is what clothes to pack. Sure, you want to stay comfortable in Thailand&#8217;s hot and humid climate, but it&#8217;s also a country whose people (aside from its infamous bar girls and ladyboys) dress quite modestly. Is it possible to stay cool and comfortable while following the &#8220;rules&#8221;? Absolutely. Ladies and gentlemen, we bring to you the dos and don&#8217;ts of what to wear in Thailand.</p>\n<p>We&#8217;ve briefly addressed what to wear in Thailand in our <a href=\"https://www.tielandtothailand.com/tips-visiting-thailand-first-time/\">Tips for Visiting Thailand for the First Time</a> post, but since it&#8217;s such a hot topic and Thailand&#8217;s high season is in full swing now, we were inspired to dedicate an entire post to it.</p>\n<p>Let&#8217;s be honest: Thailand usually turns a blind eye to foreigners&#8217; clothing choices, so <strong>on the surface there seems to be no clear-cut rules on how to dress</strong>.</p>\n<p>However, there are definitely clothing trends that are acceptable and others that just won&#8217;t do, and that is something we&#8217;ve deduced simply by observing what the locals wear. Plus, we can confidently say that your appearance has an effect on how you&#8217;re treated in Thailand, so choosing to dress tastefully and appropriately goes a long way.</p>\n<h2><p id=\"What_to_Wear_Everyday_Outfits\"><p>What to Wear: Everyday Outfits</p></p></h2>\n<p></p><img class=\"wp-image-14682 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/What-to-Wear-in-Thailand-Appropriate-Outfits-No3.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Everyday outfits for Thailand\" width=\"1000\" height=\"550\"><p>Thailand is hot, sunny, and humid! You&#8217;ll sweat no matter what you wear.&#160;But&#160;before you go tossing in any ol&#8217; sleeveless or see-through shirt and those booty shorts in your suitcase,&#160;here&#160;are some tasteful suggestions.</p>\n<h3><p id=\"Do_bring_hot_weather_clothing\"><p>Do</p> bring hot weather clothing</p></h3>\n<p>Guys, the best thing to wear in Thailand are&#160;<strong>polo shirts, button-down collared shirts, and golf or Bermuda shorts. </strong>Even good quality t-shirts and cargo shorts will do. Packing a pair of semi-casual pants will come in handy for an evening&#160;out.</p>\n<p><strong>Ladies, definitely pack skirts, shorts, summer dresses, and tasteful tops. </strong>These can be either flowing or fitted but should be of good&#160;quality. Shirts should cover your shoulders (to the edges) and have a semi-high collar line. We don&#8217;t mean turtlenecks, but your cleavage shouldn&#8217;t be showing. Sheer or lacy fabric is a good way to stay cool, but be sure to&#160;wear a camisole or slip underneath.</p>\n<p><img class=\"size-full wp-image-16919 alignleft\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/Our-Top-Pick-70px.png?resize=185%2C70&amp;ssl=1\" alt=\"Our Top Pick\" width=\"185\" height=\"70\">We recommend moisture-wicking <a href=\"https://amzn.to/2GFBvlL\" target=\"_blank\" rel=\"noopener\">polos</a> and <a href=\"https://amzn.to/2gsPwcB\" target=\"_blank\" rel=\"noopener\">shorts</a>&#160;for guys. For ladies, this <a href=\"https://amzn.to/2qebgvY\" target=\"_blank\" rel=\"noopener\">Bohemian dress</a> is a favorite. It doubles as an evening outfit with leggings or a bathing suit cover on the beach.</p>\n<p>&#160;</p>\n<h3><p id=\"Don8217t_wear_revealing_clothing\"><p>Don&#8217;t</p><p> wear revealing clothing</p></p></h3>\n<p></p><img class=\"wp-image-13021 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/08/wear-at-thai-temple-27-1000px.jpg?resize=1000%2C666&amp;ssl=1\" alt=\"East meets West choice in attire\" width=\"1000\" height=\"666\"><p>For men, <strong>don&#8217;t&#160;wear sleeveless muscle&#160;shirts or singlets</strong> (especially ones that show your man nipples) or walk around with your&#160;shirts unbuttoned.</p>\n<p>Ladies, <strong>don&#8217;t wear tank tops and&#160;avoid spaghetti strap shirts completely&#160;</strong>unless you are wearing a cardigan or shawl draped over your shoulders. Leave the&#160;dangerously short (high?) Daisy Duke shorts at home, too.</p>\n<p>And pleeeaaase, pleeeease<strong>&#160;don&#8217;t show&#160;your cleavage. </strong>We can&#8217;t stress this enough.</p>\n<h2></h2>\n<p>You may find yourself walking a lot before you get comfortable using the local transportation. The more comfortable and easier to wear shoes you have, the better.</p>\n<h3><p id=\"Do_wear_comfortable_preferably_water-resistantshoes\"><p>Do</p> wear comfortable, preferably water-resistant&#160;shoes</p></h3>\n<p>Comfortable shoes are a must. Since it rains often in Thailand, anything made of rubber or a plastic composite is a great choice.<strong> Flip flops are totally acceptable but flat, slipper-like shoes are much more convenient. </strong>&#160;The latter protects your feet from street grime and there are no laces to wrestle with when taking off your shoes.</p>\n<p><strong>Always take your shoes off&#160;before entering someone&#8217;s house or a temple.</strong>&#160;If you will see piles of shoes outside of an entranceway, that&#8217;s a dead giveaway to remove yours, too.</p>\n<p><img class=\"size-full wp-image-16919 alignleft\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/Our-Top-Pick-70px.png?resize=185%2C70&amp;ssl=1\" alt=\"Our Top Pick\" width=\"185\" height=\"70\">We don&#8217;t like admitting it, but we love crocs. Super comfy, blister free, easy-to-clean, waterproof&#160;crocs. Guys, check out their <a href=\"https://amzn.to/2g3UPyE\" target=\"_blank\" rel=\"noopener\">loafer style boat shoes</a>. Gals, take a look at these <a href=\"https://amzn.to/2g3KOSm\" target=\"_blank\" rel=\"noopener\">ballet flats</a>.</p>\n<p>&#160;</p>\n<h3></h3>\n<p></p><img class=\"wp-image-14680 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/What-not-to-wear-in-Thailand.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Spaghetti strap shirts and walking around barefoot are not acceptable in Thailand.\" width=\"1000\" height=\"563\"><p>Ladies, although you look cute in your high&#160;heels,&#160;you may&#160;simultaneously break an ankle and knock out a few front teeth as you faceplant on Thailand&#8217;s generally sad excuse for sidewalks.&#160;If you absolutely must&#160;wear heels, go with low wedges or espadrilles to give you a bit more surface area to balance on.</p>\n<p>It&#8217;s best not to use hiking or combat boot and socks for everyday shoes. Your feet will cook to death and could possibly develop a mad case of athlete&#8217;s foot.</p>\n<p>Lastly,&#160;<strong>do not walk around barefoot. </strong>Some free-spirited individuals like to connect with Mother Earth and in some countries it&#8217;s ok (maybe? which ones, we don&#8217;t know), but not in Thailand. Bringing city grime that&#8217;s been collecting on the soles of your feet into a Thai home or business&#160;is offensive.</p>\n<h2><p id=\"At_the_Beach\"><p>At the Beach</p></p></h2>\n<p>Thailand is famous for its gorgeous beaches, but make sure to cover up&#160;appropriately as soon as you&#8217;re off the beach!</p>\n<h3><p id=\"Dowear_bathing_suitson_the_beach_and_cover-ups_in_town\"><p>Do&#160;</p>wear bathing suits&#160;on the beach and cover-ups in town</p></h3>\n<p>Although Thais are often fully clothed at the beach, <strong>it&#8217;s&#160;alright for foreign&#160;guys to wear only swim shorts and for ladies to wear two-piece bathing suits</strong>. Just makes sure this is at the beach and not while you&#8217;re walking down Main Street.</p>\n<p><strong>When you step off the sand and start to venture into town, grab a beach cover-up.</strong> Ladies, this means wearing&#160;a sarong or wrap that covers your chest and midriff and guys should grab a t-shirt (nothing sleeveless) to wear over&#160;your swim trunks.</p>\n<p>There are tons of shops in Thailand&#8217;s beach towns selling airy cover-ups and wraps. They&#8217;ll also have lots of sunglasses and big floppy sun hats to protect you from the sun when you need them.</p>\n<p><img class=\"size-full wp-image-16919 alignleft\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/Our-Top-Pick-70px.png?resize=185%2C70&amp;ssl=1\" alt=\"Our Top Pick\" width=\"185\" height=\"70\">Sarongs are perfect for covering up your bathing suit, drying off, protecting your skin from the sun, and stretching out on the sand. These <a href=\"https://amzn.to/2gsCtUZ\" target=\"_blank\" rel=\"noopener\">elephant sarongs</a> are a great fit for Thailand&#8217;s beaches.</p>\n<h3><p id=\"Don8217twalk_around_town_in_bathing_suits_or_go_topless\"><p>Don&#8217;t</p>&#160;walk around town in bathing suits or go topless</p></h3>\n<p>A quick glance around and you will never see a Thai person walking down the street or riding a motorbike in a bathing suit. Nor will they ride around barefoot. <strong>Wearing a bathing suit into town without a cover-up is a big no-no</strong> and makes Thais (and conscientious expats) uncomfortable. This especially holds true in non-beach towns&#160;such as&#160;Bangkok and Chiang Mai!</p>\n<p>The only area in Thailand we would say to be more conscious about&#160;your choice in bathing suit&#160;is in the deep south where Thailand neighbors Malaysia. This region is populated by conservatively dressed Muslim communities and its considered&#160;disrespectful to walk around with your booty jiggling in a thong bikini or your package, eh hem, on display in a Speedo. There you will see Thais, both men and women, wearing what looks like a wetsuit.</p>\n<p>Also, it is completely <strong>unacceptable to&#160;sunbathe topless</strong> in Thailand.</p>\n<h2><p id=\"Temples\"><p>Temples</p></p></h2>\n<p></p><img class=\"wp-image-14684 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2015/12/What-to-Wear-in-Thailand-Appropriate-Outfits-No21.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Long sleeves and pants are great to wear at a Thai temple\" width=\"1000\" height=\"550\"><p>If there is one place where both men and women must dress appropriately, this is it. Otherwise, you risk offending the locals in their place of worship.</p>\n<h3><p id=\"Docover_up_your_shoulders_and_knees\"><p>Do&#160;</p>cover up your shoulders and knees</p></h3>\n<p><strong>Men are expected to wear conservative collared shirts and shorts</strong> that come to the knee, although pants are preferred. T-shirts are ok, but a dressier shirt, whether short-sleeved or long-sleeved, is preferred.</p>\n<p><strong>Women must cover their cleavage and shoulders</strong> and wear pants or skirts that are at least knee-length. One of the best pieces of clothing you can pack is a shawl because&#160;you can wrap it around your waist or drape it across your shoulders and chest if you are visiting a temple.</p>\n<p>Chances are you&#8217;ll see a monk at a temple. Monks are highly respected, so <strong>keep your head below a monk as you pass by them</strong> (duck a little if you&#8217;re tall) and do not touch them (especially&#160;women).</p>\n<h3><p id=\"Don8217tdress_immodestly\"><p>Don&#8217;t&#160;</p>dress immodestly</p></h3>\n<p><strong>Men shouldn&#8217;t go to a temple in a sleeveless shirt or a shirt that&#8217;s been left unbuttoned</strong> and revealing their chest or belly. Don&#8217;t walk in with really short shorts, either.</p>\n<p>Women will not be allowed to go into a temple if their shoulders, thighs, or cleavage is showing.</p>\n<p>Most of the popular temples provided visitors with free wraps just in case you&#8217;ve not covered up enough.</p>\n\t\t\t\t</div>","title":"What to Wear in Thailand: Dos and Don’ts"}},"pageContext":{"id":"5b95ee8487be0583274900e0"}}