{"data":{"mongodbDatabaseArticles":{"id":"5b96298f87be058327491199","content":"<div><p>Welcome to&#160;<a href=\"http://www.hippie-inheels.com/backpackers-boutique\" target=\"_blank\" rel=\"noopener\">Backpacker&#8217;s Boutique</a>. Every Sunday, this spot will feature a new travel blogger. Some weeks it will be a really fun&#160;<strong>interview about packing, fashion, and fitness</strong>&#160;so you can snoop inside their bags &amp; lives a little bit and other weeks it&#8217;ll be a&#160;<strong>detailed</strong>&#160;<strong>luxury guide</strong>&#160;to a city the featured blogger/expat knows very well.&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to Nairobi</h1><p><strong>Tell us a little about &#160;yourself and why you&#8217;re an expert on luxury travel in&#160;Nairobi.</strong></p><p>I first visited Nairobi, Kenya way back in 2002. I was only a few years out of college, and had just been hired as the North American Marketing Manager for the Kenya Tourist Board.</p><p>I&#8217;d never even been to Africa! After a few fast-paced trips to familiarize myself with Kenya, I fell deeply in love with East Africa.&#160;Since then, I&#8217;ve been a travel marketer promoting travel to sub-Saharan Africa.</p><p>Over the years I&#8217;ve spent a ton of time in Nairobi, largely because it&#8217;s the main hub of tourism in East Africa.</p><p><img class=\"aligncenter size-full wp-image-8432\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/PA182932.jpg?resize=560%2C420&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"560\" height=\"420\"></p><p><img class=\"aligncenter size-full wp-image-8429\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/P1013258.jpg?resize=560%2C420&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"560\" height=\"420\"></p><p><strong>What makes Nairobi a perfect destination for travelers seeking a glamorous trip?</strong></p><p>I&#8217;ve always loved the way the air smells in Nairobi. It&#8217;s very organic, with scents of the earth. Sidewalks are well-worn footpaths of red soil. Vendors sell produce and flowers from small wooden stalls.</p><p>There are a few great restaurants in Nairobi, some of which had been around since the colonial days, and a hand full of high-end hotels that cater to safari tourists.</p><p>And none of this has really changed. Travelers seeking an authentic Out of Africa luxury safari experience won&#8217;t be disappointed in Kenya.</p><p>But at the same time, Nairobi isn&#8217;t the same city it was a decade ago. Thanks to technology and plenty of jobs for a newly educated middle class, Nairobi has boomed. In addition to these romantic, historic hotels and restaurants in Nairobi, there are several new chic, urban hotels and restaurants if travelers prefer a more modern African experience.</p><p><img class=\"aligncenter size-full wp-image-8433\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/sarah-and-the-rhino.jpg?resize=560%2C374&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"560\" height=\"374\"></p><p><strong>What 5 star hotel is the best in your town?</strong></p><p>No visit to Kenya is complete without a safari experience. If you don&#8217;t have time to visit one of Kenya&#8217;s renown national parks or private wildlife reserves, <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Nairobi_Tented_Camp.htm\"><strong>Nairobi Tented Camp</strong></a> in Nairobi National Park is a perfect option.</p><p>Enjoy a game drive with a professional safari guide in a Land Cruiser. Spot the big 5, including elephant, lion, rhino, leopard and Cape Buffalo. Then, enjoy a 4-course meal under canvas followed by bed in a luxury safari tent. This is where &#8220;glamping&#8221; was invented!</p><p>If you prefer a more urban African experience, stay in the new<strong> <a href=\"http://www.agoda.com/en-sg/dusit-d2-nairobi-hotel/hotel/nairobi-ke.html?cid=1716750\" target=\"_blank\" rel=\"noopener\">Dusit hotel</a></strong>. The rooms, including a sleeping room, separate dressing area and a massive bathroom, are lovely and modern. The restaurant offers something for every palate, and the lobby bar is perhaps the best in the city. Prior to opening early in 2014, the bartenders all spend 6 weeks in a intensive mixology course, and create drinks with the most care and attention to detail.</p><p><img class=\"aligncenter size-full wp-image-8431\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/PA182920.jpg?resize=560%2C420&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"560\" height=\"420\"></p><p><strong>Are there any fun activities for the adventurous traveler?</strong></p><p>One of the most fun and rewarding experiences in Nairobi is visiting the <a href=\"http://www.sheldrickwildlifetrust.org/\" target=\"_blank\" rel=\"noopener\">Daphne Sheldrick Elephant Orphanage</a>.</p><p>This organization rescues baby elephants in the wild, and brings them back to a facility in Nairobi National Park where professional caretakers nurse them back to health and raise them until they are old enough to be released back into the wild.</p><p>There is an hour-long viewing open to the public every morning, but if you adopt an elephant (for as little as US$50) you can attend a private viewing in the early evening and watch while the caretakers get the baby elephants ready for bed. This is a must-see while in Nairobi!</p><p><img class=\"aligncenter size-full wp-image-8430\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/P1013808.jpg?resize=560%2C350&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"560\" height=\"350\"></p><p><strong>Where are the best hang outs during the day?&#160;</strong></p><p>Nairobi has a really fun coffee shop culture. On any given day, you&#8217;ll find locals, expats and tourists congregating at coffee shops around Nairobi.</p><p>This should come as no surprise, as some of the world&#8217;s best coffee is grown right in Kenya. At one time, the bulk of the best coffee was solely produced for export. However, today, Kenyans have come to appreciate high quality coffee.</p><p>You&#8217;ll find a number of Java House restaurants around the city. Enjoy free wifi, a great menu of pastries, sandwiches and salads, in a fun atmosphere. I love the Java House located at The Junction Mall just off Ngong Road near Karen.</p><p>Don&#8217;t be surprised to see young Kenyans typing away on their Macbook Air computers while plotting their tech startup with friends.</p><p><img class=\"aligncenter wp-image-8428\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/mom-solo-getaway.jpg?resize=560%2C420&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"560\" height=\"420\"></p><p><strong>Tell us all the hot shopping spots; who&#8217;s carrying the trendy local designers? Are there designers we should make sure to meet?</strong></p><p>Shopping in Nairobi can be a bit tricky. Most Nairobi residents do most of their shopping in South Africa or Europe. However, if you&#8217;re looking to pick up something special and unique from Nairobi, don&#8217;t miss the numerous boutiques in the Karen neighborhood of Nairobi.</p><p>I love <a href=\"http://www.annabellethom.com/\" target=\"_blank\" rel=\"noopener\">Annabelle Thom</a> for handbags<strong>, </strong><a href=\"http://annatrzebinski.com/\" target=\"_blank\" rel=\"noopener\">Anna Trzebinksi</a> for amazing leather dresses and tops complete with hand beading by local Maasai women, and <a href=\"http://www.pennywinter.com/\" target=\"_blank\" rel=\"noopener\">Penny Winter</a> for beautiful jewelry with an African twist.</p><p>[Book a room | Book a Flight]</p><p>&#160;</p><p><img class=\"alignleft wp-image-8426 size-thumbnail\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/IMG_4685.jpg?resize=150%2C150&amp;ssl=1\" alt=\"A Luxury Guide to Nairobi\" width=\"150\" height=\"150\">Denver-based travel blogger Sarah Fazendin has spent her entire career in luxury travel, adventuring in style across 30+ countries. These days, Sarah keeps busy juggling a career, a couple of kids, and a head-spinning daily schedule. But she still makes time for travel. On her travel blog, A Week at the Beach (<a href=\"http://www.aweekatthebeach.com/\" target=\"_blank\" rel=\"noopener\">http://www.aweekatthebeach.com</a>), Sarah&#8217;s mission is to inspire busy moms everywhere to make more time for travel.&#160;Be sure to find inspiration for your next trip by connecting with her on Instagram and Twitter @aweekatthebeach.</p><p>&#160;</p><p>&#160;</p><p class=\"fusion-clearfix\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"A Luxury Guide to Nairobi"}},"pageContext":{"id":"5b96298f87be058327491199"}}