{"data":{"mongodbDatabaseArticles":{"id":"5b92396887be0583cfde67fa","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">The World&#8217;s Highest Government Bond Interest Rates</h1>\n \n</p><img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/highest-yields-government-debt.jpg\" alt=\"The world's highest interest rates on government debt\" width=\"700\" height=\"466\" class=\"size-full wp-image-26410\"><p>Dateline: Dubai, United Arab Emirates</p>\n<p>A recent Friday evening of mine was spent sipping cocktails with my fiancee and our friend in one breath, and eagerly chatting with an investor friend about the free fall of the Turkish lira in another.</p>\n<p>For someone who tracks global markets, exchange rates, and bank yields, the idea of a <a href=\"https://www.youtube.com/watch?v=wTFWZKwsjq0\" rel=\"noopener\" target=\"_blank\">currency collapse</a> was interesting on many levels, from opening new avenues cheap and <a href=\"http://nomadcapitalist.com/2018/05/18/get-paid-second-citizenship/\">profitable second passports</a> to presenting opportunities to cash in from blood in the streets.</p>\n<p>As we talked about currency exchanges rates and a strengthening dollar, our conversation turned to ways to cash in on high yields. With a number of countries in the weeds right now, there are opportunities to earn (ultra) high yields not only in foreign bank accounts &#8211; which we&#8217;ve discussed <a href=\"http://nomadcapitalist.com/2018/08/12/highest-interest-rates-banks/\">in this article</a> &#8211; but in government debt.</p>\n<p>With some European countries literally paying negative interest, the thirst for yield is huge. Park your money in Swiss bonds for a year and you&#8217;ll pay them more than half of one percent for the privilege. Park your money in assets like <a href=\"http://nomadcapitalist.com/2018/08/30/gold-backed-currency/\" rel=\"noopener\" target=\"_blank\">gold</a> and you may avoid inflation but won&#8217;t earn yield.</p>\n<p>The challenge is determining which sovereign bond offerings are worth taking part in, and which are an easy ticket to financial ruin. As they say, never catch a falling knife; no doubt some of the world&#8217;s highest yielding government bonds are denominated in local currencies that will depreciate against the dollar or euro even more.</p>\n<p>However, my curiosity got the best of me and I decided to create a list of the world&#8217;s highest government bond interest rates. If you&#8217;re interested in investing in government debt, you can read and see which offerings might be worth taking part in&#8230; and which aren&#8217;t worth touching with a ten-foot pole.</p>\n<h2>Government Bonds With High Interest Rates</h2>\n<p>Before we get started, let me clarify that this article is not intended to provide any kind of investment advice. Any investment is potentially risky, and investing in government debt typically based in random foreign currencies can be especially risky even for experienced investors.</p>\n<p>Basically, any decision you make with this information is yours alone and you&#8217;re responsible for the consequences of your own investments.</p>\n<p>With that said, here are the world&#8217;s highest yielding government bonds as of September 2018.</p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/argentina-peso-highest-government-debt-yields.jpg\" alt=\"Argentina peso debt yields\" width=\"700\" height=\"466\" class=\"size-full wp-image-26421\"><h3>Argentina</h3>\n<p><strong>Government Bond Interest Rate: 26.2% (One year)</strong><br>\nArgentina is no stranger to hyperinflation or economic collapse. In the late 1990s, Argentina experienced <a href=\"https://en.wikipedia.org/wiki/1998%E2%80%932002_Argentine_great_depression\" rel=\"noopener\" target=\"_blank\">a great depression</a> that caused widespread unemployment and riots. Despite being <a href=\"http://nomadcapitalist.com/2015/09/14/living-in-buenos-aires-argentina-what-you-need-to-know-when-moving-to-ba/\">one of the wealthiest countries</a> in the world at the turn of the twentieth century, Argentina managed to screw up its economy in a big way.</p>\n<p>However, it seemed the country was back on track with new pro-business leadership and a staggering 100-year debt offering that was gobbled up by institutional investors in 2017. New President Mauricio Macri pulled off only the second ever <a href=\"https://www.ft.com/content/5ac33abc-551b-11e7-9fed-c19e2700005f\" rel=\"noopener\" target=\"_blank\">&#8220;century bond&#8221;</a> in Latin American history, convincing the markets to park their money in pesos for generations to come.</p>\n<p>One Wall Street type suggested that the long-term debt offering was a result of interest from banks who wanted to take a long-term view on Argentina in light of its new, market-friendly economy. Recently, however, the Argentine peso <a href=\"https://www.cnbc.com/2018/08/30/argentina-crisis-peso-crashes-to-record-low-amid-imf-plea.html\" rel=\"noopener\" target=\"_blank\">fell to record lows</a> against the dollar as emerging market woes spread to Argentina. In fact, the peso is plunging as I write this.</p>\n<p>If you&#8217;re willing to gamble on the Argentine peso, a one-year government bond is yielding 26.1%. Technical indicators suggest a strong sell. Meanwhile, banks are offering a close 22.9% on short-term <a href=\"http://nomadcapitalist.com/2018/08/12/highest-interest-rates-banks/\">term deposits</a>, meaning the government may have a higher default risk. When you consider that the peso has historically had one of the world&#8217;s largest currency <a href=\"http://fortune.com/2015/12/28/argentina-peso-black-market/\" rel=\"noopener\" target=\"_blank\">black markets</a>, you&#8217;re probably best to stay away.</p>\n<h3>Bahrain</h3>\n<p><strong>Government Bond Interest Rate: 6.4% (Two years)</strong><br>\nMore promising is the Gulf nation of Bahrain. Bahrain has the distinction not only of being an oil-producing nation, but of having its national currency &#8211; the Bahrain dinar &#8211; pegged to the US dollar at a rate of 0.376:1. (Yes, the dinar is one of a handful of currencies stronger than the US dollar.)</p>\n<p>However, Bahrain&#8217;s economy has been in a slump lately, and even a large discovery of oil <a href=\"https://www.bloomberg.com/news/articles/2018-04-03/nice-oil-find-bahrain-shame-about-the-ballooning-credit-risk\" rel=\"noopener\" target=\"_blank\">didn&#8217;t impress</a> analysts. Bahrain&#8217;s woes have Wall Street raising issues about its credit risk, even as Bahrain&#8217;s central bank <a href=\"https://www.bloomberg.com/news/articles/2018-06-26/no-sign-of-gulf-aid-sends-bahrain-credit-risk-up-most-on-record\" rel=\"noopener\" target=\"_blank\">assures the market</a> it&#8217;s committed to keeping its dollar peg.</p>\n<p>Basically, Bahrain is strapped for cash and the question on the street is who will bail them if if necessary? Some point to neighboring Gulf nations, while others aren&#8217;t quite sure.</p>\n<p>Nevertheless, credit worries over Bahrain have driven up yields as well as the cost to insure its debt. If you believe that Bahrain will be able to support its US dollar peg, then today&#8217;s yields may be quite attractive for you given their effective convertibility to/from US dollars. Technical indicators label Bahrain debt a &#8220;buy&#8221;, with yields on two-year government debt at 6.4%. Foreigners can&#8217;t open bank accounts in Bahrain without a work permit, so this is the easiest way to earn interest on holding the dinar.</p>\n<h3>Brazil</h3>\n<p><strong>Government Bond Interest Rate: 9.4% (Two years)</strong><br>\nLike its neighbor Argentina, Brazil has seen the value of its currency slide against the US dollar due to worries about its election process. With one presidential contender in jail and concerns about NAFTA brewing, the Brazilian real is declining, driving yields on Brazilian debt up.</p>\n<p>The Brazilian real has long been something of a basket case. Heck, this is a country where opening a business bank account takes nine months in some cases; the same account would take about an hour in the countries where I operate. I&#8217;m no fan of Brazil, and their currency has suffered a not-quite-Turkey-esque slide in recent years, giving back all of its &#8220;dead cat bounce&#8221; recovery against the US dollar in 2017.</p>\n<p>That said, <a href=\"https://www.exchangerates.org.uk/news/22813/brazilian-real-brl-to-rise-as-risk-environment-improves.html\" rel=\"noopener\" target=\"_blank\">one analyst suggests</a> that Brazil&#8217;s currency does not deserve the beating it&#8217;s taken. Despite being among the worst-performing <a href=\"http://nomadcapitalist.com/2018/08/25/best-markets-invest-in-africa/\">emerging market</a> currencies, they posit that the fundamentals of Brazil are stronger than many think and that the environment there is improving. Others, however, say <a href=\"https://www.marketwatch.com/story/more-room-for-brazils-real-to-fall-after-hitting-31-month-low-analysts-say-2018-08-23\" rel=\"noopener\" target=\"_blank\">there&#8217;s more room</a> for the real to fall.</p>\n<p>Either way, Brazil sovereign debt rates are currently yielding an impressive 9.38% on a two-year offering. If you agree that the Brazilian real will recover against your base currency, you may take the risk on the country paying its bills and earn such a high interest rate. That rate is a lot higher than the 4.5% you&#8217;ll earn in a Brazilian bank&#8230; if you don&#8217;t explode before one <a href=\"http://www.nomadcapitalist.com/offshore-banking/\">opens a bank account</a> for you.</p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/egyptian-pound-highest-goverment-debt-yields.jpg\" alt=\"Egyptian pound debt yields\" width=\"700\" height=\"467\" class=\"size-full wp-image-26417\"><h3>Egypt</h3>\n<p><strong>Government Bond Interest Rate: 19.4% (Six months)</strong><br>\nIt&#8217;s always interesting to ascertain the right course of action when citizens of a country tell you said country is a terrible place to invest. Most people tend to be rather nationalistic, so when my Egyptian friends asked why the heck I&#8217;d want anything other than a brief vacation to Sinai and the Pyramids, I took notice.</p>\n<p>In addition to having the <a href=\"https://www.youtube.com/watch?v=qAc_iLfBbKQ\" rel=\"noopener\" target=\"_blank\">world&#8217;s worst</a> <a href=\"http://nomadcapitalist.com/2016/06/20/best-citizenship-by-investment-programs/\">citizenship by investment</a> offer, Egypt also has a lot of government instability. Egyptians tell me they worry about the government literally changing the rules of the game overnight, and they would certainly worry about government bonds being repaid if they were investors.</p>\n<p>After years of very gradual descent against the US dollar, the Egyptian pound fell out of its chair overnight in late 2016, losing more than half of its value. Ever since, it&#8217;s been back to the same slow burn with current values nearing 18 pounds to each US dollar. That said, Bloomberg claims that foreign debt investors feel there is <a href=\"https://www.bloomberg.com/news/articles/2018-02-25/egypt-investors-now-bold-enough-to-look-for-dollars-themselves\" rel=\"noopener\" target=\"_blank\">some stability</a> in the market, although I doubt that from recent figures. One report suggests the pound will <a href=\"https://www.egyptindependent.com/us-dollar-rises-to-egp-20-in-2019-cnn/\" rel=\"noopener\" target=\"_blank\">drop further</a> this year.</p>\n<p>What is true is that Egypt&#8217;s sovereign bonds <a href=\"https://www.bloomberg.com/news/articles/2018-08-15/traders-looking-for-refuge-from-volatility-will-find-it-in-egypt\" rel=\"noopener\" target=\"_blank\">are paying</a> some of the highest interest rates among emerging markets. Considering the currency isn&#8217;t in total freefall like the Turkish lira or Argentina peso, someone with a decent risk appetite might take them up on near-20% yields for rather short-term bond issues.</p>\n<h3>India</h3>\n<p><strong>Government Bond Interest Rate: 7.7% (Two years)</strong><br>\nIndia has long been a bit of a mess, but its status as a BRICS country and a huge economy make it particularly intriguing. This is a country where I&#8217;ve struggled for an entire week to find a single bank with a working ATM. Despite my skepticism, a number of short-term technical indicators actually rank Indian government debt as a &#8220;strong buy&#8221;.</p>\n<p>Unlike economies like the United States, India has actually lowered its debt-to-GDP ratio over recent years. Like the country itself, India&#8217;s economy is a tale of good and bad. The government is actively stepping in <a href=\"https://timesofindia.indiatimes.com/business/india-business/government-to-rbi-identify-public-sector-banks-for-mergers/articleshow/65603407.cms\" rel=\"noopener\" target=\"_blank\">to clean up</a> debt-laden banks, and a number of underperforming companies are being driven into bankruptcy. Falling oil prices are putting pressure on the economy and may cause India to miss its deficit targets as well.</p>\n<p>Meanwhile, India is pitching itself for a credit rating upgrade, and some suggest that a declining rupee will put the country back on track. Overall, India seems like more risk than I&#8217;d like to take on for a relatively low interest rate among emerging market debt offerings, but there are two sides to every story.</p>\n<p>Park your money in rupee-backed debt for two years and you&#8217;ll earn 7.7%. As to banking in India to earn similarly high interest rates, I wouldn&#8217;t be caught dead even trying.</p>\n<h3>Kenya</h3>\n<p><strong>Government Bond Interest Rate: 11.1% (Two years)</strong><br>\nEver since falling out of bed in 2015, the Kenyan shilling has performed without much fanfare against the US dollar. In fact, it has mildly appreciated against the dollar since hitting fresh lows several years ago. Foreign remittances into Kenya, mainly <a href=\"https://af.reuters.com/article/commoditiesNews/idAFL8N1VI1B7\" rel=\"noopener\" target=\"_blank\">from the diaspora</a>, have increased as of late and the currency is expected to remain stable by some analysts.</p>\n<p>Like many African economies, Kenya is a land of contradictions. Kenya has become a regional economic hub in east Africa, with startups and multinational corporations alike setting up shop in Nairobi. The economy continues to grow, by one estimate at rates of 6% this year. Others say there are sad <a href=\"https://www.standardmedia.co.ke/article/2001293652/painful-economic-realities-kenyans-don-t-want-to-face\" rel=\"noopener\" target=\"_blank\">economic realities</a> that Kenya needs to face, and that growth is down overall.</p>\n<p>As far as African sovereign debt goes, Kenya seems to be one of the lower-drama options from my vantage point. However, relatively does not a good investment make. The geniuses at the IMF say that Kenya&#8217;s borrowing costs are well above its benchmark for emerging markets, and debt-to-GDP levels in Kenya have increased in recent years thanks to budget deficits.</p>\n<p>If you would have taken 11.1% for a two-year issue recently, you would have been able to mitigate all currency risk against the US dollar. The question is whether that can continue.</p>\n<img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/08/namibia-dollar-highest-government-debt-yields.jpg\" alt=\"Namibia dollar debt yields\" width=\"700\" height=\"467\" class=\"size-full wp-image-26423\"><h3>Namibia</h3>\n<p><strong>Government Bond Interest Rate: 8.1% (One year)</strong><br>\nThe Namibian dollar may have the worst peg on the planet. After being freed from South African occupation in 1990, Namibia went on to develop its own currency but pegged it to the South African rand. While the dollar <a href=\"https://www.bloomberg.com/news/articles/2018-04-11/namibian-rate-veers-from-south-africa-s-for-first-time-since-15\" rel=\"noopener\" target=\"_blank\">hasn&#8217;t exactly</a> been kept at par with the declining rand, poor reserves and its close association have sent Namibia&#8217;s dollar falling against developed currencies.</p>\n<p>After reaching recent lows in the early 2010s, Namibian government debt hit all-time highs in 2017 at nearly 42% debt-to-GDP. That passed a so-called, <a href=\"https://www.namibian.com.na/63485/read/Public-debt-at-469pct-of-GDP-in-2017\" rel=\"noopener\" target=\"_blank\">self-imposed limit</a> of 35% debt the country set.</p>\n<p>Namibia is cutting government spending, but still expects its debt issues <a href=\"https://allafrica.com/stories/201803080334.html\" rel=\"noopener\" target=\"_blank\">to linger</a>. The country is cutting taxes, which is good for economic freedom but potentially bad for bond holders as government debt remains at high levels on bonds denominated in a toxic currency.</p>\n<p>Namibia&#8217;s sovereign debt is currently paying a coupon rate of 8.1%, and most technical indicators list the debt as a &#8220;strong sell&#8221;.</p>\n<h3>Turkey</h3>\n<p><strong>Government Bond Interest Rate: 23.3% (One year)</strong><br>\nAdmittedly, one of my favorite things to do at one point was check the USD/TRY exchange rate as Turkey&#8217;s lira plunged. The lira has now dropped more than 50% against the dollar in the last year after years of slower declines before that, potentially making everything from real estate in Istanbul to Hermes blankets sold in lira suddenly (and perhaps temporarily) cheap.</p>\n<p>That currency collapse is a big part of the reasons why Turkey&#8217;s government bond yields are now well into the 20% range. These rates haven&#8217;t been seen in Turkey since the last crisis in 2008. The difference is in the Turkish culture and economy; ten years ago the country was poorer but leadership had yet to be consolidated. Turkey now exports far more goods but has also scared many parts of the world with a decrease in secularism.</p>\n<p>In 2018, the United States has used Turkey&#8217;s declining economy as a bargaining chip. Turkey says its economy is strong, but the currency looks like a mess. That said, I see an opportunity to arbitrage investments in Turkey for immigration status as part of, say, a passport portfolio.</p>\n<p>Turkey&#8217;s government debt is currently yielding 23.3% and based in lira. You can earn 16.5% in lira at the local bank, although the process isn&#8217;t as easy as it used to be. The big question is whether Turkey&#8217;s government will use its heft as a large domestic economy to put pressure on bond holders. If the lira can recover this time, that 23.3% will look like a wise investment.</p>\n<h3>Ukraine</h3>\n<p><strong>Government Bond Interest Rate: 18.1% (One year)</strong><br>\nIt&#8217;s hard to think of a bigger currency basket case in recent years than the Ukrainian hryvnia. After years of relative tranquility around 8:1 against the US dollar, political unrest started a long-term plunge of Ukraine&#8217;s currency several years ago. Sovereign debt yields rose right along with it. Today, it would take 28 hryvnia to buy a dollar, matching the all-time worst moment of the currency in early 2015.</p>\n<p>Part of the problem with investing into Ukraine&#8217;s sovereign debt is knowing who to trust. Pro-Russian sources are <a href=\"https://www.stopfake.org/en/fake-turkey-crisis-imf-and-ukraine-s-national-bank-collapse-ukrainian-currency/\" rel=\"noopener\" target=\"_blank\">constantly claiming</a> a forthcoming crash in the hryvnia and the liquidation of the country&#8217;s central bank. The central bank&#8217;s outright claims that it <a href=\"https://economics.unian.info/10240230-nbu-s-refusal-to-control-hryvnia-despair-or-provocation.html\" rel=\"noopener\" target=\"_blank\">will not prop up</a> its currency mean that further tumbles could be coming, and that would effect bond holders.</p>\n<p>Basically, holding Ukrainian government debt is for the most adventurous of investors. Some analysts predict <a href=\"https://112.international/opinion/possible-collapse-of-the-ukrainian-debt-market-might-be-dangerous-31529.html\" rel=\"noopener\" target=\"_blank\">further drops</a> for the battered currency, partially due to the government&#8217;s constant issue of new sovereign debt to pay off past obligations.</p>\n<p>I&#8217;ve spent time in Ukraine and, while not easy, it&#8217;s possible to take a long position on the Ukraine hryvnia by <a href=\"http://nomadcapitalist.com/2017/08/11/bank-account-in-ukraine/\">opening a bank account in Kiev</a>. The question is who do you trust to fail less: the government or the banks? Ukrainian banks aren&#8217;t exactly known for their impeccable track record. Either way, if you choose to buy Ukrainian debt, you can expect to be rewarded with 18.1% yields for a one-year issue, which isn&#8217;t much higher than <a href=\"http://nomadcapitalist.com/2018/08/17/non-crs-countries-banking/\">privacy-friendly bank</a> term deposit rates. Somehow, some technical indicators still claim a &#8220;buy&#8221;, but we can&#8217;t say we agree.</p>\n<p class=\"et_social_bottom_trigger\"></p> </div>","title":"The World’s Highest Government Bond Interest Rates"}},"pageContext":{"id":"5b92396887be0583cfde67fa"}}