{"data":{"mongodbDatabaseArticles":{"id":"5b937b2287be056953db7d26","content":"<div><h1 name=\"de7a\" id=\"de7a\" class=\"graf graf--h3 graf--leading graf--title\">How do e-residents pay&#160;taxes?</h1><h2 name=\"7d5c\" id=\"7d5c\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">E-Residency enables anyone to conduct business globally so international taxation must be easier for everyone&#160;too.</h2><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*zQ56WlZs_dgBmyd8Cyhcrg.png\"><p name=\"d2ab\" id=\"d2ab\" class=\"graf graf--p graf-after--figure\">Estonia currently ranks first in <a href=\"http://estonianworld.com/business/estonia-competitive-tax-system-oecd-2/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener nofollow noopener\" target=\"_blank\">the International Tax Competitiveness Index</a> and enables entrepreneurs to pay Estonian taxes entirely online with minimal hassle.</p><p name=\"d2ac\" id=\"d2ac\" class=\"graf graf--p graf-after--p\">That&#8217;s no reason to be complacent though.</p><p name=\"d7e4\" id=\"d7e4\" class=\"graf graf--p graf-after--p\">Not only does the Estonian Tax and Customs Board have to keep innovating to better serve citizens, residents and other tax payers, but it also now serves entrepreneurs from our growing community of e-residents around the world.</p><p name=\"30ce\" id=\"30ce\" class=\"graf graf--p graf-after--p\">The advantage of e-Residency is that it gives entrepreneurs a greater choice of services online. The success of the programme then depends on being able to offer the highest quality public e-services and online business environment.</p><p name=\"9831\" id=\"9831\" class=\"graf graf--p graf-after--p\">It is likely that more countries will offer e-Residency in future and this will improve the quality of governance globally. We&#8217;re not going to wait, however.</p><p name=\"6d65\" id=\"6d65\" class=\"graf graf--p graf-after--p\">As Head of the Estonian Tax Department, I want to give you an update now on how we are investing in improving our services for you as an e-resident (and everyone who pays taxes in Estonia). I also want to provide more clarity about how taxation works for e-residents as I know this is one of the most frequently discussed issues online among e-residents.</p><h3 name=\"0137\" id=\"0137\" class=\"graf graf--h3 graf-after--p\">E-Residency is not tax residency</h3><p name=\"c801\" id=\"c801\" class=\"graf graf--p graf-after--h3\">We value e-residents for the contribution that they make to Estonia in return for the opportunities that our country can provide.</p><p name=\"5269\" id=\"5269\" class=\"graf graf--p graf-after--p\">Some of that contribution is financial and some of that financial contribution is paid directly through taxes. In fact, it&#8217;s worth noting that e-residents have already paid more back to Estonia through income tax alone than the amount invested in the e-Residency programme by Estonian tax payers.</p><p name=\"47c2\" id=\"47c2\" class=\"graf graf--p graf-after--p\">However, I want to emphasise that e-Residency is not tax residency (as well as not being citizenship or the right to physically reside in Estonia or the EU).</p><p name=\"76a9\" id=\"76a9\" class=\"graf graf--p graf-after--p\">Not all e-residents contribute taxes to Estonia, but when they do it is based on what e-Residency has enabled them to do (by creating a company that is legitimately tax resident here under international rules) and not just because they are an e-resident.</p><p name=\"3cb6\" id=\"3cb6\" class=\"graf graf--p graf-after--p\">E-Residency is also definitely not a way to avoid paying taxes. Fortunately that doesn&#8217;t actually disappoint many entrepreneurs who would rather have the opportunity to build a more successful and trusted company that can more easily conduct business globally. That&#8217;s what e-Residency offers.</p><h3 name=\"e766\" id=\"e766\" class=\"graf graf--h3 graf-after--p\">Here&#8217;s how we are improving Estonian&#160;taxation</h3><p name=\"c722\" id=\"c722\" class=\"graf graf--p graf-after--h3\">Not so long ago, it tended to only be large companies with offices and factories in multiple countries that had to deal with the complexities of international taxation.</p><p name=\"5842\" id=\"5842\" class=\"graf graf--p graf-after--p\">Thanks to e-Residency and other advances in digital technology however, almost anyone can now start a global company that operates across borders&#8202;&#8212;&#8202;even if you are the only employee.</p><p name=\"554a\" id=\"554a\" class=\"graf graf--p graf-after--p\">That&#8217;s obviously a good thing, but it also means the complexities of international taxation can affect anyone too.</p><p name=\"b2c2\" id=\"b2c2\" class=\"graf graf--p graf-after--p\">Most of these new companies now benefiting from e-Residency don&#8217;t have large accounting departments or anywhere near the same resources in order to determine their tax obligations. They shouldn&#8217;t need to either.</p><p name=\"15d8\" id=\"15d8\" class=\"graf graf--p graf-after--p\">We believe taxation must become simpler and fairer for everyone so that entrepreneurs can focus on their passion and not on paperwork.</p><p name=\"58c9\" id=\"58c9\" class=\"graf graf--p graf-after--p\">Fortunately, Estonia has already developed a tax system that is designed to support entrepreneurial growth. For example, companies that are tax resident in Estonia are only taxed at a flat rate when profits are distributed so there is no tax on profits that are reinvested into the company.</p><p name=\"f1fd\" id=\"f1fd\" class=\"graf graf--p graf-after--p\">It&#8217;s not just our tax rules that are attractive to entrepreneurs, however. It&#8217;s also the ease at which taxes can be paid. We are incredibly proud of the e-solutions currently offered by the Estonian Tax and Customs Board because everything can now be done online and is fully integrated with the secure digital identities provided to citizens, residents and e-residents. That&#8217;s convenient for everyone, whether your office is next to ours in &#220;lemiste or your office is a beach cafe on the other side of the planet.</p><p name=\"a484\" id=\"a484\" class=\"graf graf--p graf-after--p\">However, the current system was designed quite a few years ago as an online version of offline services. Like many legacy systems in government, it was designed (quite understandably at the time) with the needs of officials as the primary focus.</p><p name=\"159a\" id=\"159a\" class=\"graf graf--p graf-after--p\">New technology now enables us to create a more innovative system that is designed around users, whether they are accountants or entrepreneurs of small or large companies. For example, we are adding more languages, using responsive and mobile-friendly designs, and ensuring all processes are as logical and user-friendly as possible.</p><p name=\"43bb\" id=\"43bb\" class=\"graf graf--p graf-after--p\">Our aim is to create a comfortable self-service tax environment for everyone that is hassle-free and contact-free. In addition, we are improving the collection and analysis of data so that entrepreneurs have access to valuable economic information in real-time.</p><p name=\"4404\" id=\"4404\" class=\"graf graf--p graf-after--p\">The development of this new e-Tax and Customs Board portal will be fully complete by the end of 2020, but we will already start phasing in new services this year and we are really looking forward to listening to your feedback about them.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*lyQEVa1z_IEQBVxPJvyUkQ.jpeg\">Estonia&#8217;s new e-Tax and Customs Board portal will start coming online this&#160;year<p name=\"4836\" id=\"4836\" class=\"graf graf--p graf-after--figure\">You are welcome to contact our team anytime at <strong class=\"markup--strong markup--p-strong\">nonresident@emta.ee</strong>, whether you have questions about your own taxation or would like to provide your thoughts on how we can further improve.</p><p name=\"a297\" id=\"a297\" class=\"graf graf--p graf-after--p\">We&#8217;re not just improving Estonian taxation either. Our country currently holds <a href=\"https://www.eu2017.ee/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">the Presidency of the Council of the European Union</a> so we&#8217;re also helping modernise taxation across the continent so that it takes into account the development of the digital economy and becomes more neutral, fair and transparent for everyone.</p><p name=\"561b\" id=\"561b\" class=\"graf graf--p graf-after--p\">We are also in the early stages of exploring how international taxation can be automatically divided between different countries in future so that even those not tax resident here can use our tax services. This would further reduce the hassle to global entrepreneurs while ensuring that countries receive their fair share of taxation. We are always keen to speak with tax officials in other countries whose departments are interested in piloting this approach so please get in touch if that is you.</p><p name=\"738f\" id=\"738f\" class=\"graf graf--p graf-after--p\">Finally, the e-Residency programme is also being developed at the same time and this will include more support for e-residents in future to help them understand their tax obligations depending on which countries they are operating in.</p><p name=\"7b47\" id=\"7b47\" class=\"graf graf--p graf-after--p\">We would like to help as many e-residents as possible to use our Estonian tax services, but your tax obligations are based on international tax rules so I want to give you an overview of how that works.</p><h3 name=\"15ae\" id=\"15ae\" class=\"graf graf--h3 graf-after--p\">Understanding your tax obligations</h3><p name=\"b69d\" id=\"b69d\" class=\"graf graf--p graf-after--h3\">For some, determining your tax residency will be easy if you and your company are based in one country and you clearly work and generate your value in that country.</p><p name=\"015b\" id=\"015b\" class=\"graf graf--p graf-after--p\">For others though, there is no doubt that determining international tax obligations can get challenging, especially if you are a location-independent entrepreneur or a &#8216;digital nomad&#8217;.</p><p name=\"8a8a\" id=\"8a8a\" class=\"graf graf--p graf-after--p\">This issue affects everyone conducting business across borders, whether as an e-resident or not. However, e-Residency can be an important part of the solution to this global challenge by providing more transparency in how companies are operating and making it easier for them to pay taxes where they are owed.</p><h4 name=\"77df\" id=\"77df\" class=\"graf graf--h4 graf-after--p\">Personal tax</h4><p name=\"9f07\" id=\"9f07\" class=\"graf graf--p graf-after--h4\">I want to address the subject of personal tax before company tax because there is plenty of discussion online about international taxation, but the distinction between these two is often confused.</p><p name=\"fddb\" id=\"fddb\" class=\"graf graf--p graf-after--p\">Your personal tax residency and your company&#8217;s tax residency are not always the same because the criteria for determining them is different and your company&#8217;s circumstances might be very different to your personal circumstances.</p><p name=\"0f6f\" id=\"0f6f\" class=\"graf graf--p graf-after--p\">Your personal taxes pay for a wide range of services from healthcare to pensions in the country that you are personally tax resident. It is possible that these kind of services could also one day be offered by a digital nation like ours, but this won&#8217;t happen in the near future.</p><p name=\"8ad8\" id=\"8ad8\" class=\"graf graf--p graf-after--p\">Different countries have different ways of determining personal tax residency, but it is usually as simple as where you live for more than six months of the year. In Estonia, you are personally tax resident if you live here for at least 183 days over 12 consecutive months. In that case, however, you probably do not need a digital identity as an e-resident because you will likely have one as a resident.</p><p name=\"caf9\" id=\"caf9\" class=\"graf graf--p graf-after--p\">If you are a location-independent entrepreneur or a digital nomad then it is possible that you won&#8217;t be in any one location long enough to qualify under this criteria. In that case, your personal tax residency is usually considered to be your &#8216;home country&#8217;.</p><p name=\"afe8\" id=\"afe8\" class=\"graf graf--p graf-after--p\">Despite all these considerations, determining your personal tax residency is rarely a challenge for e-residents for the simple fact that most people do have a home country&#8202;&#8212;&#8202;even if they consider themselves to be location-independent&#8202;&#8212;&#8202;and it&#8217;s where they maintain a registered address.</p><p name=\"94c6\" id=\"94c6\" class=\"graf graf--p graf-after--p\">Bare in mind that &#8216;not being in a country&#8217; is generally not considered by tax authorities to be the same as &#8216;not living in a country&#8217;. If you go on holiday then it won&#8217;t affect your personal tax residency. The same can be true if you go travelling for an extended period, especially if you have an address that you can return to.</p><p name=\"3068\" id=\"3068\" class=\"graf graf--p graf-after--p\">It is technically possible for you to not be personally tax resident anywhere if you keep moving, but that is far harder to achieve than people often think and it&#8217;s not worth the hassle. You would give up valuable benefits, like your social security, your credit rating and your ability to apply for many products and services, both now and in the future. You would also need to research the rules in every jurisdiction that you spend time.</p><p name=\"b115\" id=\"b115\" class=\"graf graf--p graf-after--p\">It is rare, but also possible that two countries could consider you to be personally tax resident, especially if you are location-independent. Fortunately, you are protected by the same treaties that protect companies for the avoidance of double taxation.</p><p name=\"4f5c\" id=\"4f5c\" class=\"graf graf--p graf-after--p\">Your personal tax is then paid on your income when your company pays your wage and it is subject to the rules in the country of your personal tax residency. Your accountant should be able to ensure this is a smooth process so take a look at <a href=\"https://e-resident.gov.ee/run-a-company/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">the list of business service providers on the e-Residency website</a> to find accountancy services that specialise in e-residents.</p><h4 name=\"a3d1\" id=\"a3d1\" class=\"graf graf--h4 graf-after--p\">Corporation tax</h4><p name=\"b050\" id=\"b050\" class=\"graf graf--p graf-after--h4\">Corporation tax is paid by your company where your company is tax resident.</p><p name=\"6543\" id=\"6543\" class=\"graf graf--p graf-after--p\">Part of the complexity of providing general advice for companies operating internationally is due to the fact that taxation is based on international rules and can not be decided unilaterally by any one country where you intend to pay taxes, whether that&#8217;s the country that your company is registered in or the country where you presently live.</p><p name=\"d11e\" id=\"d11e\" class=\"graf graf--p graf-after--p\">Taxation is based on your company&#8217;s unique circumstances so it is ultimately your company&#8217;s responsibility to determine its tax obligations (whether it&#8217;s only in the tax resident country or also in another country through a permanent establishment or any passive type of income) and ensure those taxes are paid so that it does not encounter problems with any tax authorities in future.</p><p name=\"1804\" id=\"1804\" class=\"graf graf--p graf-after--p\">That&#8217;s why the most important advice any of us can give is that you should always consult your own qualified tax adviser if you have any doubt about your tax obligations.We are also more than happy to answer your questions ourselves too at <strong class=\"markup--strong markup--p-strong\">nonresident@emta.ee</strong>.</p><p name=\"e5ac\" id=\"e5ac\" class=\"graf graf--p graf-after--p\">At first, companies established in Estonia through e-Residency are automatically tax resident in Estonia. It is then the company&#180;s duty to also pay taxes in other countries according to their law if the source of taxable income is there.</p><p name=\"b94c\" id=\"b94c\" class=\"graf graf--p graf-after--p\">Fortunately, Estonia has already signed 57 treaties for the avoidance of double taxation, which includes all EU member states and most OECD member states, as well as key countries where e-Residency is growing the fastest such as Ukraine and Turkey. A full list is <a href=\"https://www.emta.ee/eng/business-client/income-expenses-supply-profits/external-agreements/conventions-avoidance-double\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">available here</a>.</p><p name=\"cfd6\" id=\"cfd6\" class=\"graf graf--p graf-after--p\">Like personal tax residency, there is also variation in the criteria that different countries use to determine corporate tax residency. As a general rule though, most tax systems are now based around the principle of paying taxes in the country where the value is generated. For example, the term &#8216;Permanent Establishment&#8217; (PE) is used to determine the economical link with the county, in order to establish the taxable threshold in the foreign country.</p><p name=\"4085\" id=\"4085\" class=\"graf graf--p graf-after--p\">If your company has a strong presence in one country then this will be simple to determine, but if your company is operated across multiple countries then you will likely need help from a qualified tax adviser that can look at your unique situation. This can even affect very small companies and one-person companies because founders might be travelling and working at the same time or collaborating across borders.</p><p name=\"6a06\" id=\"6a06\" class=\"graf graf--p graf-after--p\">Remember, your company&#8217;s circumstances (and therefore its tax obligations) can change over time too.</p><p name=\"1be7\" id=\"1be7\" class=\"graf graf--p graf-after--p\">Once again, take a look at <a href=\"https://e-resident.gov.ee/run-a-company/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow nofollow noopener\" target=\"_blank\">the list of business service providers on the e-Residency website</a> because they are recommended by other e-residents and have the most experience advising companies run by e-residents on their tax issues. About 90% of e-resident entrepreneurs use the services of companies like theirs.</p><p name=\"fd6b\" id=\"fd6b\" class=\"graf graf--p graf-after--p\">Your Estonian accountant might recommend that you speak to a qualified tax specialist in the country where there is most likely to be a disputing claim for your tax residency. This doesn&#8217;t mean that you would need two accountants in two countries on a long term basis, but a one-off visit might be a wise investment. Remember though, you can always speak to our team too and there&#8217;s no charge for that.</p><p name=\"6239\" id=\"6239\" class=\"graf graf--p graf-after--p\">Now let&#8217;s look at some examples of how international taxation works in practice.</p><h3 name=\"2cfb\" id=\"2cfb\" class=\"graf graf--h3 graf-after--p\">Examples</h3><ol class=\"postList\"><li name=\"3b79\" id=\"3b79\" class=\"graf graf--li graf-after--h3\">Jaako lives in Helsinki, Finland and Venla lives in Tallinn, Estonia. Together, they are starting an e-commerce store and hope to sell products to customers from anywhere in the world. Both the company and Venla are tax resident in Estonia, while Jaako is tax resident in Finland and pays Finnish taxes on his personal income as a foreign employee of an Estonian company. Jaako visited a tax adviser and consulted the tax department in Finland to find out if the company had any tax obligations there too and then Finland&#8217;s tax treaty with Estonia ensured that there was no risk of double taxation.</li><li name=\"fb6a\" id=\"fb6a\" class=\"graf graf--li graf-after--li\">Kateryna lives in Kyiv, Ukraine where she established a company on her own. She runs her startup through e-Residency because it enables her to<a href=\"https://medium.com/e-residency-blog/how-to-access-a-paypal-business-account-from-any-country-f5360419fed8\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\"> open a PayPal business account</a>, access the EU market, trade in euros and more easily conduct business with customers around the world. The company generates all its value in Ukraine so pays all its taxes there, however. Over time however, Kateryna discovered that her greatest opportunities to grow the business are coming from inside the EU so she successfully applies for<a href=\"http://startupestonia.ee/visa\" class=\"markup--anchor markup--li-anchor\" rel=\"nofollow noopener\" target=\"_blank\"> Estonia&#8217;s startup visa programme</a> and relocates to Tallinn with her company. Kateryna then begins paying all her company and personal taxes to Estonia where she now lives and work. A year later however, Kateryna has been able to grow her company enough so that she can open her first office and hire her first employees. Her obvious choice is Kyiv due to its talent pool, costs and her own local knowledge. As a result, the company now has its permanent establishment in Ukraine and begins paying taxes in Ukraine again. Both Estonia and Ukraine played a key role in Kateryna&#8217;s success and both countries benefited, although the tax treaty between them ensured that no revenue was taxed by both of them at the same time.</li><li name=\"6564\" id=\"6564\" class=\"graf graf--li graf-after--li\">Steve is a marketing consultant from the UK, but he&#8217;s currently travelling internationally and working at the same time as a &#8216;digital nomad&#8217; through his own one-person company. He established his company through e-Residency because it enabled him to establish a truly location-independent company that he can run online anywhere and has lower costs than a company registered in the UK. He also works with other freelancers around the world, including in Estonia where he has connected with the notorious #estonianmafia startup scene. Steve&#8217;s personal tax residency is still in the UK and that allows him to keep contributing to his healthcare and pension there. However, his company was tax resident in Estonia when it was created and no other country has any competing claims for his taxes. Steve pays UK taxes on his salary as a foreign employee and his company pays Estonian taxes on his dividends.</li></ol><h3 name=\"30b9\" id=\"30b9\" class=\"graf graf--h3 graf-after--li\">More information</h3><p name=\"5d24\" id=\"5d24\" class=\"graf graf--p graf-after--h3\">There&#8217;s more information about Estonian taxation for non-residents <a href=\"https://www.emta.ee/eng/business-client/registration-business/non-residents-0\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">here</strong></a> on our website for the Estonian Tax and Customs Board.</p><p name=\"fddd\" id=\"fddd\" class=\"graf graf--p graf-after--p\">For any further questions, we&#8217;d be happy to answer you directly if you send us an email to <strong class=\"markup--strong markup--p-strong\">nonresident@emta.ee</strong>.</p><p name=\"1883\" id=\"1883\" class=\"graf graf--p graf-after--p\">Also, the e-Residency website contains lots of useful information and contacts, as well as the lists of service providers that I mentioned. It&#8217;s the first place to start if you want to become an e-resident so visit <a href=\"http://e-resident.gov.ee\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow nofollow noopener\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">e-resident.gov.ee</strong></a> to join our digital nation.</p><p name=\"447c\" id=\"447c\" class=\"graf graf--p graf-after--p graf--trailing\">Finally, please do leave us comments below if you have any feedback on how we are developing our services at the Estonian Tax and Customs Board.</p></div>","title":"How do e-residents pay taxes? – E-Residency Blog – Medium"}},"pageContext":{"id":"5b937b2287be056953db7d26"}}