{"data":{"mongodbDatabaseArticles":{"id":"5b921d1f87be0571ac1b04fb","content":"<div><p></p><img src=\"http://nomadcapitalist.com/wp-content/uploads/2018/04/crypto-investor-second-passport-bitcoin.jpg\" alt=\"Why crypto investors need a second passport\" width=\"700\" height=\"467\" class=\"size-full wp-image-25228\"><p>Dateline: Tbilisi, Georgia</p>\n<p>Long before I started Nomad Capitalist, I began researching my options to internationalize my life and expand my options. I have now spent an entire decade researching and obtaining things like <a href=\"http://nomadcapitalist.com/second-passport/\">second passports</a> and <a href=\"http://nomadcapitalist.com/2015/09/07/tax-free-countries-second-residency/\">second residencies</a>. With Nomad Capitalist, I turned those experiences into an opportunity to help other people do the same.</p>\n<p>Over the years, I have seen many transformations in the offshore industry, especially with the rapid pace of change in the information era.</p>\n<p>Each new change brings with it opportunities and challenges. What I have seen over and over again is that those who are willing to adapt to those changes, thrive.</p>\n<p>More recently, cryptocurrency investors have begun to face an increasing onslaught of changes as governments step up <a href=\"https://www.cnbc.com/2018/01/17/irs-steps-up-tax-enforcement-for-cryptocurrencies.html\">tax enforcement and regulation</a> of the growing crypto market. Smart investors have begun to examine their offshore options in an effort to adapt to these developments.</p>\n<p class=\"et_post_video\"></p>\n<p>&#160;</p>\n<p>I see cryptocurrency as an especially interesting component of an individual&#8217;s offshore plan. There are a limited number of <a href=\"http://nomadcapitalist.com/2018/08/19/most-crypto-friendly-countries/\">crypto-friendly countries</a> out there, and without a doubt cryptocurrency investors need to protect themselves with offshore strategies, particularly those investors from the western world.</p>\n<p>My recommendation?</p>\n<p>Those who are seriously looking to adapt to the mounting regulations should take a small portion of their crypto wealth and invest in second residencies and passports to ensure the long-term viability of their crypto investing.</p>\n<p>Why?</p>\n<p>Here are the top five reasons every serious crypto investor needs a second residency or passport:</p>\n<h2><strong>1. Opportunity Cost</strong></h2>\n<p></p><img class=\"wp-image-25031 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-2.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>This first reason on the list largely applies to US citizens, but it can still apply to citizens of other countries as government bodies the world over step up enforcement and regulation on things like<a href=\"https://www.investopedia.com/terms/i/initial-coin-offering-ico.asp\"> ICOs</a> (Initial Coin Offerings) that use cryptocurrencies to raise funds for other endeavors.</p>\n<p>I have had a number of US crypto investors come to me explaining that they cannot participate in certain ICOs because those running the fundraising operation do not want people with a US address, residence permit, or citizenship.</p>\n<p>Now, occasionally, I will see someone who just decides to circumvent the rules and use some shortcut, but as regulations get bigger and bigger, I see a considerable challenge for anyone trying to cut corners. Institutions like the <a href=\"https://www.sec.gov/\">Securities and Exchange Commission</a> and others are, no doubt, going to come through and make it very difficult to invest in ICOs.</p>\n<p>I had one guy come seeking my help because, as he told me, he was losing millions of dollars in opportunities by not being able to buy these coins via ICOs because they will not accept US citizens &#8211; they simply pose too much of a risk when it comes to compliance with tax laws and other regulations.</p>\n<h2><strong>2. Tax Exposure </strong></h2>\n<p></p><img class=\"wp-image-25032 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-3.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>If you can bypass the first challenge and manage to get into crypto deals as a US citizen &#8211; or if you have simply already invested in crypto &#8211; you will definitely experience tax exposure.</p>\n<p>Now, this is not an article for the crypto-anarchists who plan on keeping everything offline and living in their basement. But, if you are looking to take your cryptos and have them on the exchange, turn them into other kinds of wealth, buy real estate, and facilitate other investments, governments are really stepping up enforcement on taxes.</p>\n<p>You&#8217;ve seen what happened with <a href=\"https://www.coindesk.com/\">CoinDesk</a> and the IRS where there&#8217;s a lot more information sharing going on &#8211; that has been a global trend for years in the offshore industry as a whole. There is simply more information sharing as governments have become much more aggressive against banks and many other institutions.</p>\n<p>So, it is no surprise that we are seeing more and more regulation with many of these exchanges.</p>\n<p>For the survival of cryptocurrency, I believe that many of them will cooperate and a lot of people are going to get a knock on their door as very little cryptocurrency capital gains or trading profits have actually been reported on taxes up to this point.</p>\n<p>So, again, for US citizens, if you are trading or earning <a href=\"http://nomadcapitalist.com/2014/04/06/top-5-expat-friendly-countries-with-no-capital-gains-taxes/\">capital gains</a>, it doesn&#8217;t matter where in the world you live, you are going to pay tax on those profits as a US citizen.</p>\n<p>Unfortunately, the only real option available to US citizens who want to eliminate this taxation is to <a href=\"http://nomadcapitalist.com/expatriation/\">give up their US citizenship</a>. Having a second passport gives you the option to renounce and &#8220;<a href=\"http://nomadcapitalist.com/2017/05/15/how-to-go-where-youre-treated-best/\">go where you&#8217;re treated best&#8221;</a> to a country where they don&#8217;t tax you.</p>\n<p>You can both live in and be a citizen of a country where they&#8217;re not going to tax your trading activities at the new crazy rates or tax you on capital gains when you sell your cryptocurrencies.</p>\n<p>For people who are from Australia, the UK, Canada, and other countries, you may not necessarily have to give up your citizenship to reduce your tax burden, but having a residence permit may actually help and being able to live outside your home country would allow you to stop the taxes on future gains and future trades.</p>\n<h2><strong>3. Uncertainty</strong></h2>\n<p></p><img class=\"wp-image-25033 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-4.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>As we&#8217;ve discussed, we&#8217;ve seen a lot of new regulation coming out for cryptocurrencies. Even the best adapters understand that the intensity of this change is difficult to adjust to on a constant basis.</p>\n<p>What is the US going to do?</p>\n<p>What is the SEC going to do?</p>\n<p>What are other countries around the world going to do?</p>\n<p>How will all of this impact your ability to hold these assets?</p>\n<p>What&#8217;s going to happen with the banking system and your ability to convert your cryptocurrency to that platform?</p>\n<p>What are the rules going to be if you want to take those cryptos and convert them into other assets?</p>\n<p>There is a lot of uncertainty that is less dependent on the strength of cryptocurrencies in and of themselves and more on the governments dictating how you can use your money. This is just another reason why it could be beneficial to distance yourself from your home country and find a country that is less obsessed with controlling your every financial move.</p>\n<p>At the very least, you should have another option in your back pocket &#8211; be it a place where you have a residence permit or <a href=\"http://nomadcapitalist.com/2017/04/21/how-choose-best-second-passport/\">a second passport</a>. If you have a backup plan, you have the option to break free of one country if they start to make your life too difficult with excessive regulation.</p>\n<p>As uncertain as things may be, the one thing you can count on is that there will be more and more restrictions on people who want to use their cryptocurrencies in the real world. It&#8217;s going to be much more difficult, so plan accordingly.</p>\n<h2><strong>4. Liquidity</strong></h2>\n<p></p><img class=\"wp-image-25034 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-5.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Another factor that is influenced by uncertainty is the simple question of liquidity. With more regulations, what are banks going to do if you want to cash things out? Especially if you have the wrong citizenship?</p>\n<p>There are certainly plenty of non-bank ways to use cryptocurrencies, but again, for the person who wants to eventually own other assets, I see liquidity as potentially being an issue with increased regulation.</p>\n<h2>&#160;5.&#160;<strong>Running As An Active Business</strong></h2>\n<p></p><img class=\"wp-image-25035 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-6.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>I recently spoke with someone who actually did an ICO and raised a lot of money. However, as a US citizen, they now have a big US tax bill.</p>\n<p>Even though the guy is living outside the US, he&#8217;s going to pay millions of dollars in taxes because he&#8217;s running an active business in cryptocurrencies.</p>\n<p>If he had distanced himself from the United States first, he would have been able to save those millions of dollars and obviously put that back into his next business&#8230; or anything that he wanted.</p>\n<p>If you are planning on taking your crypto investments to the next level and turning them into an active business, consider taking a step back and setting up a proper offshore strategy first.</p>\n<p>The time and money you spend on a proper offshore strategy will save you potential millions down the road.</p>\n<p>&#160;</p>\n<h2><strong>Do I Need a Passport or a Residence Permit?</strong></h2>\n<p></p><img class=\"wp-image-25036 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-7.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>It is easy to see that there are a few issues with cryptocurrencies these days.</p>\n<p>You have western countries increasingly stepping up enforcement for tax, expanding regulations that make it harder to operate, and just making life difficult for people who want to invest in cryptocurrencies.</p>\n<p>But how can a passport or a residence permit help you?</p>\n<p>And how can you know which one you need for your specific circumstance?</p>\n<p>If you&#8217;re a US citizen, getting a second passport should be your top priority because the US government will follow you no matter where you go. They have regulations of all sorts for US citizens, even if you&#8217;re living overseas. Having a second passport as a US citizen is a way to have a call option. If things get too difficult, you can go somewhere else.</p>\n<p>For everyone else who&#8217;s not a US citizen &#8211; namely, folks from other western citizens &#8211; having a residence permit and a place to go should be your first goal. The government doesn&#8217;t want you to know about this &#8211; they don&#8217;t even want you to be in cryptos &#8211; but they don&#8217;t want you to know that there are ways to take back control, starting with<a href=\"http://nomadcapitalist.com/2017/07/10/factors-second-residency/\"> a second residence</a>.</p>\n<p>If you can get out of Australia, for instance, and obtain a second residence, you can then tell the Australian government that you officially live somewhere else and, as such, you are no longer subject to Australian tax laws.</p>\n<p>If you have cryptos that you paid half a million for that are now worth a million and that you believe are going to be worth ten million, you will save yourself a lot of money by simply residing somewhere else with better tax laws.</p>\n<p>Having a residence permit and setting up a proper strategy where you actually leave the home country where you are from allows you to get a lot more benefits. If you can show that you are living elsewhere, whether it&#8217;s in Eastern Europe or South America or somewhere in Asia or the Middle East, if you can say, &#8220;I live here now&#8221; then you have an advantage.</p>\n<p>Any crypto investor should look at both. US citizens, especially, need a second passport, but you never know what other countries are going to do that will create the need for a second passport.</p>\n<p>As the laws get more and more draconian, if you&#8217;ve turned $1,000 into $100,000 (as some people I know have done) or if you&#8217;ve turned $5,000 into a million dollars, take a small sliver of that and go out and get a second passport so that you have an option that you can keep in your back pocket.</p>\n<p>Some US citizens may want to exercise that option right away, for others it&#8217;s just good to have in your back pocket.&#160;&#160; The residence permit, on the other hand, gives you the ability to say, &#8220;Hey, this is where I live.&#8221; The two really work hand in hand as a great series of options, not only to be proactive now in increasing your opportunities but to make sure you are covered and have a backup plan for later.</p>\n<h2>&#160;<strong>Where Should I Get My Second Residence or Passport?</strong></h2>\n<p></p><img class=\"wp-image-25037 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/crypto-investor-second-passport-second-residency-8.jpg\" alt=\"crypto investor second passport second residency \" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Depending on where you&#8217;re from and your specific approach, a second passport or residence may play a different role in your offshore strategy. The bigger question is, where do you get a second residence or passport?</p>\n<p>With residences, there are many different options and it is important to consider your lifestyle, where you want to go and how you want to set up your life.</p>\n<p>As to passports, there are a<a href=\"http://nomadcapitalist.com/2017/04/21/how-choose-best-second-passport/\"> lot of different options</a>. We have numerous different videos on the Nomad Capitalist Channel and hundreds of articles here on the blog where we talk about different passport options.</p>\n<p>To help you narrow it down a little, the goal for a lot of crypto investors should be to put out as little money as possible and still get the passport quickly.</p>\n<p>Especially as a US citizen, you may want the option of<a href=\"http://nomadcapitalist.com/2018/03/26/why-and-how-i-renounced-my-us-citizenship/\"> renouncing your US citizenship</a> in a matter of months because, every month that goes by, you may be losing money by not being in ICOs or by paying taxes on your trades.</p>\n<p>For this reason, one of the options that are worth considering is going to one of the <a href=\"http://nomadcapitalist.com/2016/06/20/best-citizenship-by-investment-programs/\">citizenship by investment program</a>s and making a donation to get a second passport.</p>\n<p>From $100,000 and up, you can make a donation and pay some legal fees on top of that and you can get a passport in a matter of months. And, if you&#8217;re operating at a serious level, the ROI on that can be almost instant.</p>\n<p>There are other passport opportunities that are worth considering as well, particularly for folks who have cryptocurrencies as a big part of their assets but also have fiat cash or other assets in a different pile that they can draw from.</p>\n<p>There are other countries where you can go in and buy a property in exchange for a passport or start a business or do other things and get a passport in six months, a year, etc. In fact, there is a new program that recently came out where you can get a passport in one to two months by making an investment in a property.</p>\n<p>Which passport you should get depends on whether you&#8217;re single, married, which country you come from, which countries you want to be able to travel to, if you&#8217;re a US citizen and you want to go back to the United States at some point in the future&#8230; there are a lot of different factors that you have to consider.</p>\n<p>If you want to find out more about how you can set up a customized residence and passport strategy as a crypto investor, be sure to check out our other resources here on <a href=\"http://nomadcapitalist.com/blog/\">the blog</a> and on the<a href=\"https://www.youtube.com/user/nomadcapitalist\"> YouTube channel</a>.</p>\n<p>You can also ask for help and work personally with our team to develop that strategy.</p>\n<p>Either way, if you are a serious crypto investor, you should at least have a defensive strategy in place that you can always keep in your back pocket, if not also a proactive strategy that you are actively working toward.</p>\n<p>As someone who has obtained second citizenships, I can tell you that it can give you a whole different outlook on life once you know that you have the freedom to leave if you don&#8217;t like it where you are.</p>\n</div>","title":"5 Reasons Every Crypto Investor Needs a Second Residency and Second Passport"}},"pageContext":{"id":"5b921d1f87be0571ac1b04fb"}}