{"data":{"mongodbDatabaseArticles":{"id":"5b962b9387be0583274911de","content":"<div><p><strong>&#8220;It&#8217;s time to get your paws dirty&#8230;&#8221;&#160;</strong>a travel blog interview.</p><p>Jo and Chris met in the office and are about to leave it all behind, even their little cat, and take the world by storm, starting in Malaysia and ending in Nepal, the adventure will be extreme! Jo has a degree in Geography and is PADI certified. She can&#8217;t say no to buying a grey tee shirt and multiple lipsticks. Not one for zip off cargo pants, Jo likes to stay stylish while on the road. Jo really caught my attention when she posted how &#8220;the shopaholic&#8221; saved money for travel. I decided I&#8217;d ask her some questions about what she likes to pack and so forth&#8230; read on &amp; there will be some links to her blog as well! Definitely take some time to stop over and say Hi to her :)</p><h1>Interview with Jo:</h1><p><img class=\"aligncenter  wp-image-2620\" alt=\"dirty paws travel blog\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/chris-and-jo.jpg?resize=560%2C560&amp;ssl=1\" width=\"560\" height=\"560\"><strong>1. You met your boyfriend in the office and the two of you are leaving. What was the catalyst for that jump- the ONE thing that made you guys know you could do it?</strong></p><p>The fact that we could live AND work together without killing each other. We spend almost every second of every day together and we still love being with each other. It doesn&#8217;t matter how much you love each other, if you can&#8217;t be in the same space as that person constantly, travelling together is not for you. Travelling also exacerbates the fact you are together because at some point you will be tired, dirty and frustrated at some point and the key is not to use your partner as an emotional punching bag.</p><p><strong>2. As a lipstick lover a) which is your favorite b) which one(s) will you be taking on your trip?</strong></p><p>I think lipsticks are a totally underrated travel accessory! A quick application of red lipstick can take your outfit from day-time casual to super cute night time party. Why wouldn&#8217;t you stuff a couple in your bag? I will be taking three on my trip. A fiery orange-based red, a bright but wearable pink and a nice neutral &#8220;your lips, but better &#8221; colour. My favourite has to be the fiery red. When you have bit of a tan, this colour can look really pretty (Think Amber Heard in The Rum Diaries).</p><p><strong>3. What other makeup do you feel like you have to have in case of a big night out?</strong></p><p>When travelling it&#8217;s<a href=\"http://dirtypawsblog.com/2013/11/03/girl-travelers-the-three-product-makeup-routine-for-on-the-road\" target=\"_blank\"> great to keep it simple and fresh</a>. A smidge of BB cream, a bit of rosy pink blush, waterproof mascara (for the inevitable end of the night swim) and a bit of tinted chapstick or lipstick. If I am feeling extra fancy then I will get out an black liquid eyeliner and do a bit of a cat eye flick.</p><p><strong>4. Do you have a special skin care regime while you&#8217;re on the road or do you let the sunlight exposure alone keep you looking fresh?</strong></p><p>I am a big fan of all natural skin products like the one&#8217;s from Lush. I will always, always take my make-up off at the end of the day (usually with a face-wipe). It gives me the heebie jeebies to even think about going to bed with stuff on my face. I also wash my face twice a day with either Lush&#8217;s Herbalism or Angels on Bare Skin, then I use just a cheap moisturiser to keep my skin looking fresh. I like the idea of using environmentally friendly products because so many of these developing countries struggle with environmental issues and I&#8217;m happy not to contribute.</p><p><img class=\"aligncenter  wp-image-2623\" alt=\"dirty paws blog\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/DSCN2158.jpg?resize=482%2C640&amp;ssl=1\" width=\"482\" height=\"640\"><strong>5. As a fashionista, do you dress cute for flights or do you let that be your &#8220;time off&#8221; and dress comfortable?</strong></p><p>I have a set outfit for flights that I think is cute and comfortable. This outfit has never failed me and is super comfy. Black leggings, a long-sleeve cotton top, a pashmina or cotton scarf and my cream coloured converse. I usually also take my super cozy American Apparel hoodie with me too because sometimes the airplane can be a tad overzealous with the air conditioning. My dad ( who is a commercial airline pilot) told me that budget airline&#8217;s such as Air Asia turn the air-conditioning way high so that the passengers will have to pay the $10 for a blanket. So be prepared and always take something warm!</p><p><strong>6. What shoes do you use for every day walking and sightseeing? flip flops, cute sandals.. maybe somewhat nerdy chacos like me?</strong></p><p>So many travellers have chacos! I must try these&#8230; I can&#8217;t go past a nice pair of cream converse. They match everything and are really comfy after you break them in. They do get dirty easily but you can rinse them down and they retain their shape.</p><p><strong>7. If someone said to you &#8220;I could never live out of a backpack for 3 months&#8221; what would be the first advice you would give them?</strong></p><p>You need so much less than you think you do. Without getting too deep, collecting and surrounding yourself with material goods can be a really bad habit and breaking the need to have all these things is extremely liberating. It an be particularly hard for girls because we are constantly told that we need all these &#8220;things&#8217; to make us beautiful. We are told we need to straighten our hair, put a tonne of make-up on and wear the latest clothes to be pretty and popular. In actual fact, the most beautiful girls are the one&#8217;s that are confident with themselves and how they naturally look. I really think that travel gives you that confidence and freedom and develop&#8217;s the most important part of you, your character!</p><p><img class=\"aligncenter size-full wp-image-2622\" alt=\"dirty paws travel blog\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/diving-photo.jpg?resize=457%2C596&amp;ssl=1\" width=\"457\" height=\"596\"><strong>8. As a certified PADI rescue diver, what advice would you give people who want to use that as a means to make money while abroad? Is it practical?</strong></p><p>It seems that everyone and their uncle has a scuba certification nowadays so its definitely not as easy as it used to be. I would advise taking an alternative route and instead of working as a dive instructor or dive meter, use your qualifications to work or volunteer at a conservation group. I did this in <a href=\"http://dirtypawsblog.com/2013/10/02/46/\" target=\"_blank\">Madagascar and Mauritius</a> and it was great!You might not make as much money but giving back on your travels is really important.</p><p><strong>9. When you don&#8217;t get a chance to shower and wash your hair, what is your go-to hair style to hide the mess? (mine is a side braid!)</strong></p><p>I think I have this in common with a lot of girls when I say that if I haven&#8217;t washed my hair in awhile, the messy bun is where it&#8217;s at! Just put all your hair in messy bun on top of your head and your good to go. It gets your hair out of your face and you don&#8217;t even have to think about it. If your wanting something a little more, then tie a head scarf around your head or add in a braid or two.</p><p><strong>10. What&#8217;s the one material item you&#8217;ll miss from home, comfy beds, pizza?</strong></p><p>My bed is definitely something I will miss because in the process of <a href=\"http://dirtypawsblog.com/2013/11/01/how-a-shopaholic-is-saving-money-to-travel/\" target=\"_blank\">saving money for travel I have become such a homebody</a>. There is nothing quite as comfortable as watching movies in bed all day long. Also, not sure if he counts as a material item but my cat Souffl&#233; will be sorely missed.</p><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on <a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>, <a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>, <a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a> &amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Travel Blog Interview with Jo from Dirty Paws- Hippie in Heels"}},"pageContext":{"id":"5b962b9387be0583274911de"}}