{"data":{"mongodbDatabaseArticles":{"id":"5b937b0587be056953db7d07","content":"<div><p name=\"0d8e\" id=\"0d8e\" class=\"graf graf--p graf--leading\">Thanks for sharing the less glamorous side of the nomadic lifestyle, <a href=\"https://medium.com/@charlierguo\" class=\"markup--user markup--p-user\" target=\"_blank\">Charlie</a>! As a person that has gradually become more and more nomadic over the last five years, I can definitely relate.</p><p name=\"bc17\" id=\"bc17\" class=\"graf graf--p graf-after--p\">But more than anything I think it&#8217;s your style of nomading that&#8217;s the problem. The longest you stayed in one place was three weeks, you say? That does sound exhausting, indeed. I tried that lifestyle for a while, and I even wrote a blog post about why I pivoted away from it (see <a href=\"http://thomas.do/post/89467975320/my-nomadic-travel-pivot\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">My Nomadic Travel Pivot</a>). Luckily, there&#8217;s a difference between being nomadic and a backpacker.</p><p name=\"fd2f\" id=\"fd2f\" class=\"graf graf--p graf-after--p\">Being nomadic, or location independent, is more about the mindset than anything else. You don&#8217;t have to be traveling all the time. In fact, even though I have no permanent home, I don&#8217;t see myself as a constant traveler. In my mind, I move around every few months, usually staying in one place for one to three months at a time. I might travel for a week or two between moves, but moving is not traveling.</p><p name=\"aa2b\" id=\"aa2b\" class=\"graf graf--p graf-after--p\">Sharing an apartment with others for a few months will give you an instant group of people to hang out with. You&#8217;ll be able to build much deeper relationships than you can in just a few days. And you&#8217;ll get to know the city, the people, and the culture a lot better than if you&#8217;re just Instagramming your way through a continent.</p><p name=\"c95f\" id=\"c95f\" class=\"graf graf--p graf-after--p\">Being a nomad doesn&#8217;t mean you never go &#8220;home&#8221;. In my mind, I have many homes around the world. Home is wherever my friends are, or in some cases a city I just feel at home in. Personally, I return &#8220;home&#8221; many times per year. I&#8217;m home in Lisbon. I&#8217;m home in San Francisco. I&#8217;m home in Copenhagen. I&#8217;m home in Berlin. And I&#8217;m home when I visit my friends and family in Norway.</p><p name=\"e4c1\" id=\"e4c1\" class=\"graf graf--p graf-after--p\">Being a nomad doesn&#8217;t mean you have to sacrifice friendships, either. I probably spend about half the year making new friends, and half the year hanging out with old ones. By now, the people I care the most about (other than my close family) are spread all over the world anyway. So the best way to see them regularly, is to keep on moving.</p><p name=\"c7f3\" id=\"c7f3\" class=\"graf graf--p graf-after--p\">I&#8217;m not saying that loneliness isn&#8217;t a real problem for many nomads. It is. And so is the feeling of being desensitized to objectively mind-blowing experiences. But these issues can also be mitigated without settling down permanently. Change your pace. See your friends and family more. Practice mindfulness. Stop and smell the roses.</p><p name=\"b72b\" id=\"b72b\" class=\"graf graf--p graf-after--p graf--trailing\">Being a nomad is about the freedom to be where you want, when you want. Stop traveling all the time. Keep on nomading.</p></div>","title":"Nomad and traveler is not the same thing – Thomas K. Running – Medium"}},"pageContext":{"id":"5b937b0587be056953db7d07"}}