{"data":{"mongodbDatabaseArticles":{"id":"5b93834687be056953db7e46","content":"<div><p>That&#8217;s all false. If you&#8217;re currently working as a developer you have the potential to get remote freelance work. I&#8217;m not talking about UpWork or Freelancer either. I&#8217;m going to show you how with just a little bit of extra work, mostly on things not related to development, you can get your first fully remote front-end freelance project or job in 2018.</p><p>I&#8217;ve met a lot of good developers who think they can&#8217;t do remote work. They think they somehow lack the skills, they&#8217;re not good enough, or they don&#8217;t have remote experience.</p><h3 name=\"b6a2\" id=\"b6a2\" class=\"graf graf--h3 graf-after--figure\"><strong class=\"markup--strong markup--h3-strong\">1) Clients don&#8217;t come to you. Find them and reach out directly.</strong></h3><p name=\"3742\" id=\"3742\" class=\"graf graf--p graf-after--h3\">When I first started freelancing I thought that just by putting my portfolio online clients would come and contact me. They didn&#8217;t. The truth is that 80% of success in freelancing comes from reaching out to clients directly and selling them on the value you can provide.</p><p name=\"1b8b\" id=\"1b8b\" class=\"graf graf--p graf-after--p\">That can be scary because we&#8217;re creators. We&#8217;re good at programming. We don&#8217;t like seeing ourselves as &#8220;sellers&#8221;. Instead, <strong class=\"markup--strong markup--p-strong\">look at selling as a way to communicate the value your skills can provide your potential clients and you&#8217;ll dramatically increase your chances of landing a client. </strong>It&#8217;s a numbers game. The more proposals you send the more likely you are to land a client.</p><h3 name=\"080a\" id=\"080a\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">2) Avoid UpWork, Freelancer, and&#160;Fiverr</strong></h3><p name=\"624b\" id=\"624b\" class=\"graf graf--p graf-after--h3\"><strong class=\"markup--strong markup--p-strong\">The good clients avoid websites like UpWork, Freelancer, and Fiverr like the plague.</strong> They know it always dissolves into a bidding war with inexperienced overseas developers. That&#8217;s never fun for both the client and developer. As a remote freelancer, I&#8217;ve been lucky enough to not have to use these websites and you don&#8217;t have to either.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*sAk7RDzosTuRmr08PF-hmg.jpeg\">There are already countless articles describing how horrible marketplaces like UpWork&#160;are.<h3 name=\"d4ac\" id=\"d4ac\" class=\"graf graf--h3 graf-after--figure\"><strong class=\"markup--strong markup--h3-strong\">3) How to find good&#160;clients</strong></h3><p name=\"6ef7\" id=\"6ef7\" class=\"graf graf--p graf-after--h3\">So where do you find the good clients? <strong class=\"markup--strong markup--p-strong\">They post all over the internet in various communities, job boards, and forums.</strong> Clients post their job on job boards like Codepen Jobs and Angel List, post on Reddit, comment on a thread in Hacker News, and post on a variety of other places. It can be overwhelming and take hours a week if you don&#8217;t know where to look, but the good ones are definitely out there posting and looking for talent.</p><h3 name=\"b155\" id=\"b155\" class=\"graf graf--h3 graf-after--p\">Avoid the hours of searching for clients with RemoteLeads</h3><p name=\"86d9\" id=\"86d9\" class=\"graf graf--p graf-after--h3\">You can avoid all of those hours of searching for leads by subscribing to RemoteLeads. <strong class=\"markup--strong markup--p-strong\">We find the best leads, vet them, and send them to you via email</strong>. It&#8217;s a good way to make sure you have a steady stream of potential leads coming in. You can subscribe <a href=\"https://remoteleads.io/remote-freelance-front-end\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">here</a>.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*9vcqH7vk1kyrsLEqBnieIw.png\"><h3 name=\"626c\" id=\"626c\" class=\"graf graf--h3 graf-after--figure\"><strong class=\"markup--strong markup--h3-strong\">4) Resumes are dead. Send good&#160;emails.</strong></h3><p name=\"e957\" id=\"e957\" class=\"graf graf--p graf-after--h3\">The reality is that when a client posts a job or freelance project online they&#8217;re getting slammed with replies. It&#8217;s frustrating for a client because most of the time those applications are just a PDF resume and nothing else.</p><p name=\"79bf\" id=\"79bf\" class=\"graf graf--p graf-after--p\"><a href=\"https://remoteleads.io/about\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Harbind</a>, my partner and Co-Founder at RemoteLeads, had the responsibility of bringing new developers on board when working as a senior back-end developer for an agency. You wouldn&#8217;t believe the number of terrible resumes that he would get. It would literally just be a PDF attachment. Here&#8217;s his advice: <strong class=\"markup--strong markup--p-strong\">Avoid resumes. Write a good cover letter directly in the email body instead.</strong></p><p name=\"1ff0\" id=\"1ff0\" class=\"graf graf--p graf-after--p\">I took that advice and found that my biggest advantage when landing clients are the proposals that I write. You can get an edge over 90% of applicants just by putting a little extra thought into the proposal you write in the email body and how you can solve the client&#8217;s problem with your skills.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*rkDw0Pnn_X5xowO6lhCEXg.png\">An example of how I layout the copy in my email&#160;body<h4 name=\"e394\" id=\"e394\" class=\"graf graf--h4 graf-after--figure\">How to write proposals that win you remote freelance clients</h4><p name=\"4189\" id=\"4189\" class=\"graf graf--p graf-after--h4\">I wrote an article to share with you how with just a few minutes of extra research and modifying your email copy you can dramatically increase your chances of winning a client. Check out the article <a href=\"https://remoteleads.io/blog/proposals-that-win-remote-freelance-clients/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">here</a>.</p><h3 name=\"53bb\" id=\"53bb\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">5) Your Portfolio. State your value proposition immediately.</strong></h3><p name=\"2218\" id=\"2218\" class=\"graf graf--p graf-after--h3\">Clients are busy. From their perspective, it&#8217;s a full-time job going through applicants for freelance project or job. You have 3 seconds to show a potential client what you do. You can state that clearly by having a single sentence at the top of your portfolio that says what you do.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*YNykITePPrm30Jw5PT3ABA.png\">The sentence I use in my portfolio.<p name=\"4787\" id=\"4787\" class=\"graf graf--p graf-after--figure\">Clients are going through so many portfolios that it&#8217;ll be a breath of fresh air when they see your portfolio laid out simply with the value proposition immediately stated at the top.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*czeoejc5TV_AzdnGDdzwQA.png\">Make client&#8217;s lives easier by making all of your portfolio information easy to&#160;access.<p name=\"f0ca\" id=\"f0ca\" class=\"graf graf--p graf-after--figure\">Also, make sure you have clear links to your previous projects, your GitHub, and Codepen profile. Clients want to see what you&#8217;ve worked on before and they don&#8217;t want to have to scour your website to find them.</p><h3 name=\"9ff9\" id=\"9ff9\" class=\"graf graf--h3 graf-after--p\"><strong class=\"markup--strong markup--h3-strong\">Conclusion: Putting everything together</strong></h3><p name=\"cac3\" id=\"cac3\" class=\"graf graf--p graf-after--h3\">Ultimately, it comes down to finding good clients and then clearly communicating your value proposition to them. You can do that by avoiding marketplaces like Upwork, creating a good proposal in your email body when you email them and making sure that your portfolio clearly states your main value proposition.</p><h4 name=\"ba09\" id=\"ba09\" class=\"graf graf--h4 graf-after--p graf--trailing\">Thank you for&#160;reading!</h4></div>","title":"5 steps to getting your first remote web development freelance client in 2018"}},"pageContext":{"id":"5b93834687be056953db7e46"}}