{"data":{"mongodbDatabaseArticles":{"id":"5b92489887be056953db7bc0","content":"<div><p><a href=\"http://techcrunch.com/2015/10/27/twitter-growth-q315/\">Twitter is struggling</a>. It's a public company, with millions of shareholders, and these shareholders want to see user growth. Why? Because if you're business model is based on ads, lots of users means lots of money.</p> <p>But is this concept still relevant in 2015? I don't think so.</p> <p>Right now, Twitter doesn't have enough users to make enough money from ads to reflects its valuation of ~$20 bln.</p> <p>But can we find a way to show shareholders more revenue and profits without having a billion+ users like Facebook?</p> <p>What about asking users to pay? I know CRAZY RIGHT?</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\">Thanks for more than 500 people who answered this (surely vague) question. Interesting result though. <a href=\"http://t.co/2KdLQ66UAO\">pic.twitter.com/2KdLQ66UAO</a></p> <p>&#8212; Tobias van Schneider (@schneidertobias) <a href=\"//twitter.com/schneidertobias/status/655855253586341889\" class=\"broken_link\">October 18, 2015</a></p></blockquote> <p></p> <p>This is interesting, <a href=\"//twitter.com/schneidertobias\">Tobias van Schneider</a> did a survey on who would pay for Twitter. It turns out 33% of people would pay to use and support Twitter. Let's see how that would work out.</p> <p>With 300M users, if 33% paid $5/m for Twitter, that'd result in</p> <blockquote><p> 300,000,000 users * 33% = 100,000,000 paying users<br> 100,000,000 paying users * $5/m * 12 months = $6,000,000,000/y </p></blockquote> <p>That's $6 billion in revenue. How much is Twitter making now? <a href=\"http://files.shareholder.com/downloads/AMDA-2F526X/0x0x841607/E35857E7-8984-48C1-A33B-15B62F72A0F7/2015_Q2_Earnings_press_release.pdf\">$500M per quarter</a>. So that's $2 billion per year. Mostly from ads that aren't performing well. So this is $4 billion more, by just asking users to pay.</p> <p>Tobias's survey is skewed though as it's not random and only taken from his audience.</p> <p>So what if we go very modest here. What if 3% paid of users paid $5 to get extra features?</p> <blockquote><p> 300,000,000 users * 3% = 10,000,000 paying users<br> 10,000,000 paying users * $5/m * 12 months = $600,000,000/y </p></blockquote> <p>That's still $600 million in revenue. Easily enough to run a service like Twitter, if they'd make their company more lean.</p> <p>And people could choose what to pay for. You can let them have extra features: like being verified, getting badges.</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\"><a href=\"//twitter.com/levelsio\">@levelsio</a> <a href=\"//twitter.com/twitter\">@twitter</a> shit, let ppl pay for verification badges &amp; they double their users AND revenue!</p> <p>&#8212; Thomas O'Leary (@tomskee) <a href=\"//twitter.com/tomskee/status/655859407608131584\">October 18, 2015</a></p></blockquote> <p></p> <p>Doesn't work you think?</p> <p>Ask Tinder, it worked for them <a href=\"http://www.businessinsider.com/tinder-plus-being-tested-in-europe-2015-2\">even if nobody believed it</a>.</p> <p>It's now the #13 highest grossing app in the Apple App Store (!).</p> <a href=\"//www.appannie.com/apps/ios/top/?device=iphone\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2015/10/Screenshot-2015-10-18-16.55.05.png\"></a> <p>A new model is being a patron. Just ask them to support your app like a patron. Just <a href=\"http://www.marco.org/2015/10/13/pragmatic-pricing\">like Marco Arment's Overcast just did</a>:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\">Overcast 2.0 is out. Having already saved 54 hours thanks to Smart Speed, I'm happy to become a patron.\n<a href=\"http://t.co/vvDc9yBlaQ\">http://t.co/vvDc9yBlaQ</a></p> <p>&#8212; Anders Kierulf (@smartgo) <a href=\"//twitter.com/smartgo/status/652506881831759872\">October 9, 2015</a></p></blockquote> <p></p> <p>I always get a backlash when I propose something like this. People say, \"but Twitter is a hypergrowth company\". But, wait, no it's not! It failed at being a hypergrowth company. The hypergrowth part didn't work out. That's Facebook now. So, why can't Twitter just be a regular predictable good business making money? Not from ads, but from paying users. It's seems obvious and fitting with the current zeitgeist against ads.</p> <p>Why not sell ads instead? Except that people hate them, it costs a lot to sell ads. You need a huge sales teams. While it decreases the quality of the user experience. If people love your product, why not ask them to pay for it? That costs nothing.</p> <p>I know why not. It's ego. A business that makes good revenue but isn't hypergrowth isn't cool (yet). But that's changing I think. VC-backed companies are starting to take cues from bootstrapped software in just asking users for money.</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p lang=\"en\" dir=\"ltr\">In the next few years, you'll see lots of VC-backed companies take cues from bootstrappers on actually asking users to pay money</p> <p>&#8212; levels.io (@levelsio) <a href=\"//twitter.com/levelsio/status/655859189017878530\">October 18, 2015</a></p></blockquote> <p></p> <p>With the most modest estimates, we get $600M/y. That's enough to pay the salaries of 2,400 employees at $250,000. Or 1,200 employees if we add server costs, office rent costs etc. Why not?</p> <p>Seriously, why not?</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Why doesn’t Twitter just asks its users to pay?"}},"pageContext":{"id":"5b92489887be056953db7bc0"}}