{"data":{"mongodbDatabaseArticles":{"id":"5b937b0987be056953db7d0c","content":"<div><h1 name=\"9d72\" id=\"9d72\" class=\"graf graf--h3 graf-after--figure graf--title\">Why I Never Use Co-Working Spaces as a Digital Nomad &amp; Why You Might Not Want to&#160;Either</h1><p name=\"856f\" id=\"856f\" class=\"graf graf--p graf-after--h3\">Last week, I wrote <a href=\"https://entrepreneurs.maqtoob.com/10-signs-that-your-digital-nomad-guru-or-advisor-is-a-crackpot-bd63727f9cad#.lh2hxbvz9\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">a piece on digital nomad gurus</a> and how to spot the vampires who will weasel their way into your wallet and suck it dry, if you are foolish enough to let them do so. In that article I mentioned in passing that I consider &#8220;co-working spaces&#8221; to be absolutely equivalent to &#8220;offices&#8221; mainly because that&#8217;s what they are. It was bizarre to find that I was suddenly facing an angry barrage of ridiculousness on social media for this.</p><p name=\"1a0e\" id=\"1a0e\" class=\"graf graf--p graf-after--p\">This boiled down to: &#8220;I like co-working and therefore it&#8217;s not an office,&#8221; followed by peculiar arguments as to why this should be true, such as: &#8220;You don&#8217;t have a boss.&#8221; Does that mean that when a boss visits an office the office stops being an office because he is the boss and doesn&#8217;t have one? It&#8217;s a logical conundrum for sure and one that fails to recognize that many digital nomads, including myself, have often been the boss in an office before.</p><p name=\"9e65\" id=\"9e65\" class=\"graf graf--p graf-after--p\">The next implication was that all bosses are bullying and domineering. This isn&#8217;t true. I&#8217;ve had some excellent bosses. When I was a boss, I spent nearly all my time in the coffee shop because I had so little to do. I wasn&#8217;t bullying and domineering, more &#8220;rarely present.&#8221; By the way, if you can get it&#8202;&#8212;&#8202;that&#8217;s the best kind of &#8220;boss job&#8221; to have, one that requires little or no work but still comes with a healthy pay packet. I read an awful lot of excellent fiction that year, developed a lifetime&#8217;s immunity to the effects of caffeine and was still considered to be the best regional general manager that the company employed. There&#8217;s a lot to be said for paid laziness.</p><p name=\"5769\" id=\"5769\" class=\"graf graf--p graf-after--p\">The other argument was that, in an office, you can&#8217;t work outside. You can in some offices. I&#8217;ve worked in offices with outdoor areas where we held meetings, wrote code, and smoked the occasional joint when nobody was looking. They were happy days.</p><p name=\"03e3\" id=\"03e3\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">The truth is that an &#8220;office&#8221; is simply a place that people gather together to do work. So co-working spaces are offices.</strong> In my original article, I also said that if you&#8217;re happy to work in an office, that&#8217;s cool&#8202;&#8212;&#8202;everyone should be free to be happy. I just want to share with you why I&#8217;m not happy to work in a co-working space:</p><h3 name=\"b2aa\" id=\"b2aa\" class=\"graf graf--h3 graf-after--p\">They are Lousy Value for the&#160;Money</h3><p name=\"1888\" id=\"1888\" class=\"graf graf--p graf-after--h3\">I am currently in Chiang Mai, the mecca of the digital nomad world thanks to the endless fluff articles about how cheap it is to live here. &#8220;I can&#8217;t imagine spending more than $2,500 a month here&#8221;&#8202;&#8212;&#8202;suggests a lack of imagination rather than an inability to achieve this feat.</p><p name=\"a74c\" id=\"a74c\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;I am earning but my expenses every month are less than $750 a month.&#8221; Good for you. That wouldn&#8217;t pay my bar bill most months, but good for you all the same.</p><p name=\"a71d\" id=\"a71d\" class=\"graf graf--p graf-after--p\">These articles will eventually have some poor fool humble bragging about his $150 apartment in which he/she lives like a member of royalty. It is possible that the King of Lilliput would find 28 square meters of room with no kitchen an incredible amount of space but for the rest of us, that&#8217;s a prison cell.</p><p name=\"4ca4\" id=\"4ca4\" class=\"graf graf--p graf-after--p\">They will then go on to talk about the $150 a month they blow on co-working. The bizarre thing is that if they took the $150 they spent on co-working and added it to the $150 for an apartment&#8202;&#8212;&#8202;they could get a decent sized apartment (my own apartment comes in at $350 a month making it the cheapest place I&#8217;ve ever lived in Asia; it&#8217;s huge and it has a kitchen).</p><p name=\"518a\" id=\"518a\" class=\"graf graf--p graf-after--p\">$150 a month in Chiang Mai for a desk and an internet connection (plus maybe some cheap coffee) is a rip off. If you had a registered company you could rent an actual private office for less money than you rent that desk for.</p><h3 name=\"0dee\" id=\"0dee\" class=\"graf graf--h3 graf-after--p\">They are Full of Digital&#160;Nomads</h3><p name=\"87cb\" id=\"87cb\" class=\"graf graf--p graf-after--h3\">Yes, I&#8217;m a digital nomad but please don&#8217;t tell anyone. They&#8217;ll have me confused with the people who hang out in co-working spaces. I&#8217;ve tried co-working a couple of times over the years and the people who hang out in these spaces, in South East Asia at least, are clueless.</p><p name=\"55ee\" id=\"55ee\" class=\"graf graf--p graf-after--p\">Having read their &#8220;how to be a digital nomad&#8221; guru who insists that they work in a co-working space, that&#8217;s what they&#8217;re going to do. Their &#8220;businesses&#8221; are a bad joke, usually selling expertise that they don&#8217;t have, or bargain basement freelancing (a life from which very few ever escape), or worse they&#8217;re just starting out drop-shipping.</p><p name=\"442a\" id=\"442a\" class=\"graf graf--p graf-after--p\">I get the need for a social life but why would you want to hang around with a bunch of clueless white people (and they are, invariably, white) with no real businesses to speak of and who are completely convinced it is the act of travel that makes them interesting. (Hint: It doesn&#8217;t. Travel is only interesting when it is used to broaden the mind rather than tick things off lists. People who speak of having &#8220;done&#8221; places are always in the latter category and are always more boring than watching paint dry on the Titanic).</p><p name=\"81ce\" id=\"81ce\" class=\"graf graf--p graf-after--p\">Take this pair of Chiang Mai&#8217;s finest&#8202;&#8212;&#8202;the Atlas brothers. <a href=\"https://nomads.digitalfreedom.life/digital-nomads-q-a-profile-003-aaron-atlas-from-indiana-united-states-62a84550f9fc#.8qxrd0g4v\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">In an interview (with himself no less) in September 2016</a>, Aaron Atlas told the world that he was unaware that he when he paid for his flights that they would come out of his bank balance. So, he was short on money and decided to spend $3 a day for his first 3 months. This moron, and there is no kinder word for it than that, now sells &#8220;how to get by in Chiang Mai&#8221; lessons to the tune of $1,500 a pop.</p><p name=\"f66c\" id=\"f66c\" class=\"graf graf--p graf-after--p\">His brother, Travis Atlas, has written a book entitled <a href=\"https://www.amazon.com/Digital-Nomad-10-Keys-Becoming-ebook/dp/B01N2XOCAW\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">&#8220;10 Keys to Becoming a Digital Nomad.&#8221;</a> This is more reasonably priced at $2.99 even if he doesn&#8217;t know that keys don&#8217;t help people become anything, they open locks.</p><p name=\"6067\" id=\"6067\" class=\"graf graf--p graf-after--p\">This low price is because Travis&#8217; book is badly written (my favourite part is where he expresses astonishment that his brother&#8217;s girlfriend can read) and because it offers no useful advice at all. In fact, it focuses on selling Tim Ferris&#8217;s 4 Hour Workweek (still available without purchasing Travis&#8217; book) and various podcasts, mentoring programs, etc. The market of people who need to read books to be told to read other books is probably very small.</p><p name=\"bc7a\" id=\"bc7a\" class=\"graf graf--p graf-after--p\">These are the people you find in co-working spaces. That&#8217;s why you won&#8217;t find me in a co-working space and why I&#8217;d prefer you didn&#8217;t tell my clients that I&#8217;m a digital nomad.</p><h3 name=\"537b\" id=\"537b\" class=\"graf graf--h3 graf-after--p\">It&#8217;s Work for Work&#8217;s&#160;Sake</h3><p name=\"828a\" id=\"828a\" class=\"graf graf--p graf-after--h3\">I didn&#8217;t quit my life of working in an office to end up working in an office that I pay rent for. This is because I already pay rent on my home in Chiang Mai which has a huge desk and great internet connection.</p><p name=\"e931\" id=\"e931\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">When I work from home this is how my routine works:</strong></p><p name=\"2923\" id=\"2923\" class=\"graf graf--p graf-after--p\">&#183; Alarm goes off at 6 a.m.</p><p name=\"d9f6\" id=\"d9f6\" class=\"graf graf--p graf-after--p\">&#183; Alarm gets sworn at and slapped around until it goes quiet at 6.01 a.m.</p><p name=\"c25e\" id=\"c25e\" class=\"graf graf--p graf-after--p\">&#183; Kettle gets turned on at 6.02 a.m.</p><p name=\"3820\" id=\"3820\" class=\"graf graf--p graf-after--p\">&#183; Coffee is made by 6.05 a.m.</p><p name=\"3561\" id=\"3561\" class=\"graf graf--p graf-after--p\">&#183; At 6.06 a.m. I start work and I work until I&#8217;m done (usually about 2 p.m. with coffee breaks, cigarette breaks and a lunch break taken into account)</p><p name=\"243b\" id=\"243b\" class=\"graf graf--p graf-after--p\">The amount of time wasted in this process is minimal. Unless, of course, I choose to waste my time&#8202;&#8212;&#8202;the siren call of endless Wiki links beckons in the dark for me too.</p><p name=\"013f\" id=\"013f\" class=\"graf graf--p graf-after--p\">If, on the other hand, I worked from a co-working space. I&#8217;d have to get up, get ready to go out, pack a bag full of the things that are already neatly set up on my desk, walk to the co-working space, go through the inevitable round of greeting people that polite people do when they&#8217;re in a room with other people, listen to some of those people (whether I want to or not) when they decide to turn that greeting into a conversation, unpack my bag and plug everything in, wait for my computer to boot, make longer trips than turning right to grab coffee during the day, etc.</p><p name=\"fe73\" id=\"fe73\" class=\"graf graf--p graf-after--p\">None of these things are a big deal in their own rights but they do start to add up over the course of the day. In fact, at a conservative estimate assuming you try to keep yourself to yourself in these places&#8202;&#8212;&#8202;you&#8217;ll waste an hour a day on things you don&#8217;t need to do. If you get involved in the endless conversations and other crap that goes on in a co-working space&#8202;&#8212;&#8202;write off 2 or more hours each day.</p><p name=\"8590\" id=\"8590\" class=\"graf graf--p graf-after--p\">That&#8217;s all time that a digital nomad can spend doing something fun instead. An hour a day saved is an extra day out every fortnight. Two hours a day is a bonus weekend every fortnight. In exotic locales, that&#8217;s some serious time to ditch your PC and get out and see the world.</p><p name=\"d42e\" id=\"d42e\" class=\"graf graf--p graf-after--p\">And don&#8217;t forget that you spend this time, in co-working spaces, in order to be around people like the Atlas brothers.</p><h3 name=\"e823\" id=\"e823\" class=\"graf graf--h3 graf-after--p\">Self-Motivation is&#160;Critical</h3><p name=\"d256\" id=\"d256\" class=\"graf graf--p graf-after--h3\">If you&#8217;re going to work remotely, freelance, or run your own business and you need other people to motivate you to do the work&#8202;&#8212;&#8202;you&#8217;re doing the wrong job. If you can&#8217;t set yourself a list of goals and then go and achieve those goals without a &#8220;go Jim-lad&#8221; from a bunch of clueless people, you&#8217;re not ready to live an independent lifestyle.</p><p name=\"b161\" id=\"b161\" class=\"graf graf--p graf-after--p\">Those people in co-working spaces are a distraction from getting work done. Just like people in the office you left behind were a distraction from getting work done.</p><p name=\"74e7\" id=\"74e7\" class=\"graf graf--p graf-after--p\">I run three businesses; two of those are with business partners. None of us has ever needed a co-working space in order to get stuff done. Work needs doing and we&#8217;re happy to do it.</p><p name=\"0980\" id=\"0980\" class=\"graf graf--p graf-after--p\">If you lack motivation, question what you&#8217;re doing with your life and don&#8217;t waste money going to a co-working space looking for motivation. Just buy a copy of Travis Atlas&#8217; book and leave it on the shelf and remind yourself, that that&#8217;s the kind of person who uses a co-working space. Look at that book and determine never, ever to be like that and then do whatever you need to do. Repeat as necessary.</p><h3 name=\"4721\" id=\"4721\" class=\"graf graf--h3 graf-after--p\">Coffee Shops are&#160;Better</h3><p name=\"a74a\" id=\"a74a\" class=\"graf graf--p graf-after--h3\">Assuming that, as a digital nomad, you&#8217;re aware that you are not required to move into a tourist area and live next door to other digital nomads and that there is, in fact, a huge world of places where you can live and still access food and coffee&#8202;&#8212;&#8202;then there&#8217;s no reason at all that you can&#8217;t work in a coffee shop.</p><p name=\"ff9f\" id=\"ff9f\" class=\"graf graf--p graf-after--p\">Unsurprisingly, coffee shops on the tourist trail are packed out with badly-dressed weasels paying too much for a skinny latte and uploading their awful holiday snaps to Facebook via their smartphones on the coffee shop&#8217;s Wi-Fi.</p><p name=\"02cc\" id=\"02cc\" class=\"graf graf--p graf-after--p\">My local coffee shop, however, doesn&#8217;t sell skinny lattes because they take pride in serving coffee and not some low rent simulacrum of it. It has blisteringly fast Wi-Fi and I can have it all to myself for much of the day. Rarely is there more than one other customer when I&#8217;m there&#8202;&#8212;&#8202;not because it&#8217;s bad (the owner is the best cook in Thailand for my money), but because it&#8217;s in a location where there is no passing trade. Perfect for me, if not for the owner&#8217;s profits. In addition, it also has a pleasant outdoor terraced area where I can drink coffee and play with the internet to my heart&#8217;s content.</p><p name=\"7c1b\" id=\"7c1b\" class=\"graf graf--p graf-after--p\">There are hundreds of coffee shops like this one all over the world. In Chiang Mai, I&#8217;ve never been more than a 2 minute walk from a coffee shop where I could, if I wanted, work all day long for the price of a couple of espressos. Fortunately, I like working from home so when I go to a coffee shop&#8202;&#8212;&#8202;I take a book and savour the experience of learning from, or being entertained by, somebody who can actually write.</p><p name=\"1b5a\" id=\"1b5a\" class=\"graf graf--p graf-after--p\">The few regulars at my local coffee shop are all retired business people from around the world. They actually know how to run a business and are a gold mine of actionable information if you get to know them. That&#8217;s got to be better than somebody who doesn&#8217;t know you have to pay for a flight, right?</p><h3 name=\"10d9\" id=\"10d9\" class=\"graf graf--h3 graf-after--p\">And a Few Other Objections Handled&#8230;</h3><p name=\"aa8b\" id=\"aa8b\" class=\"graf graf--p graf-after--h3\">As I said at the start, I got quite a bit of incredulous abuse over co-working spaces last week on social media, so I thought I&#8217;d answer all those points now:</p><h4 name=\"3a05\" id=\"3a05\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">Don&#8217;t you miss working in a&#160;team?</strong></h4><p name=\"ca10\" id=\"ca10\" class=\"graf graf--p graf-after--h4\">I still work in a team. I work with clients, business partners, suppliers, etc. I do all of this via Skype when communication is needed. Most of the time it&#8217;s not needed because I deal with professionals who can motivate themselves without my input.</p><h4 name=\"a767\" id=\"a767\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">But what about creativity, how do you brainstorm?</strong></h4><p name=\"751d\" id=\"751d\" class=\"graf graf--p graf-after--h4\">Recent research has proven what common sense should have proven years ago: Brainstorming provides better results when each person does the brainstorming on their own and then results are collated at the end.</p><p name=\"0a89\" id=\"0a89\" class=\"graf graf--p graf-after--p\">When you bring a group of people together, the loudest people dominate and the others lose their voice. Quiet people can be just as creative as mouthy people but you&#8217;ll never know that if you think you have to make them work in a room where they can be shouted down or talked over. I&#8217;m a creative professional; I can generate ideas by myself when I need to too.</p><h4 name=\"62e5\" id=\"62e5\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">But what about extreme co-working?</strong></h4><p name=\"d0e8\" id=\"d0e8\" class=\"graf graf--p graf-after--h4\">I&#8217;m still laughing. Apparently, it&#8217;s best to drag all your office equipment out in to the jungle and risk having it rained on rather than doing the work more efficiently at home and having the time to visit the jungle with a picnic instead.</p><h3 name=\"54c2\" id=\"54c2\" class=\"graf graf--h3 graf-after--p\">Summary</h3><p name=\"4497\" id=\"4497\" class=\"graf graf--p graf-after--h3\">The reasons, that I don&#8217;t do co-working and you might not want to either, are simple:</p><p name=\"743b\" id=\"743b\" class=\"graf graf--p graf-after--p\">&#183; It&#8217;s lousy value for money</p><p name=\"e088\" id=\"e088\" class=\"graf graf--p graf-after--p\">&#183; It means coming into contact with the worst people digital nomad life has to offer</p><p name=\"523a\" id=\"523a\" class=\"graf graf--p graf-after--p\">&#183; It means losing productivity and time, time that can be spent enjoying what digital nomad life has to offer</p><p name=\"cee5\" id=\"cee5\" class=\"graf graf--p graf-after--p\">&#183; Other people are not a substitute for self-motivation</p><p name=\"cbbd\" id=\"cbbd\" class=\"graf graf--p graf-after--p\">&#183; Coffee shops are better</p><p name=\"77bd\" id=\"77bd\" class=\"graf graf--p graf-after--p\">&#183; There&#8217;s nothing you can&#8217;t do without a co-working space</p><p name=\"d5c3\" id=\"d5c3\" class=\"graf graf--p graf-after--p\">One last thing, as Columbo would say, it is absolutely fine to choose to work from a co-working space (office). But please stop pretending that it&#8217;s necessary, or even beneficial, to do so. It is certainly not an essential to any digital nomad&#8217;s life. The vast majority of successful digital nomads (those with real jobs, or high-level freelance contracts, or actual businesses to run), will never be found in a co-working space and it&#8217;s time to acknowledge that fact.</p><p name=\"6ddd\" id=\"6ddd\" class=\"graf graf--p graf-after--p\">***</p><p name=\"2261\" id=\"2261\" class=\"graf graf--p graf-after--p graf--trailing\">On Your Terms is a publication by <a href=\"http://www.tortugabackpacks.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Tortuga</a>, makers of the ultimate travel backpack.</p></div>","title":"Why I Never Use Co-Working Spaces as a Digital Nomad & Why You Might Not Want to Either"}},"pageContext":{"id":"5b937b0987be056953db7d0c"}}