{"data":{"mongodbDatabaseArticles":{"id":"5b9382d587be056953db7dfa","content":"<div><h1 name=\"c7c8\" id=\"c7c8\" class=\"graf graf--h3 graf-after--figure graf--title\">Getting Remote Critique&#160;Right</h1><p name=\"466a\" id=\"466a\" class=\"graf graf--p graf-after--h3\">Remote work brings with it some challenges that need careful pruning to create a successful and happy team. One of the first things that comes to mind is <strong class=\"markup--strong markup--p-strong\">critique</strong>, a daunting task when in the same room as people, let alone hundreds or thousands of miles away from one another.</p><p name=\"00be\" id=\"00be\" class=\"graf graf--p graf-after--p\">When you&#8217;re sitting across from a person in a meeting room, understanding their body language or the tone of what they say is easy. When you&#8217;re remote, that emotional sensitivity disappears, so we have to take steps to build an environment where this doesn&#8217;t cause problems. Here are a few steps you can take to ensure people are happy and you&#8217;re getting the best feedback you can to build a great product.</p><h3 name=\"966b\" id=\"966b\" class=\"graf graf--h3 graf-after--p\">Give feedback at the right&#160;time</h3><p name=\"56d3\" id=\"56d3\" class=\"graf graf--p graf-after--h3\">Critique should come at a time and a place when the creator of the work feels safe and prepared for it. The basic rule of thumb is <strong class=\"markup--strong markup--p-strong\">don&#8217;t give feedback without permission first</strong>.</p><p name=\"c6cc\" id=\"c6cc\" class=\"graf graf--p graf-after--p\">To expand this, most critique should come during a feedback session set up by the designer but&#8202;&#8212;&#8202;if you must give feedback&#8202;&#8212;&#8202;send them a message first to ask if they have time to hop on a call. This isn&#8217;t because the designer doesn&#8217;t want to receive feedback, it&#8217;s that they may not be in the right frame of mind, ready to act on any feedback, or it might be inappropriate to distract them.</p><p name=\"f9ff\" id=\"f9ff\" class=\"graf graf--p graf-after--p\">In the past, I made sure feedback sessions were at the same time and place every week (Friday, 10am, GoToMeeting) so people knew when they were expected to give feedback, and to get me into the right mood for feedback. I gave a talk about this a few years back, the <a href=\"https://www.slideshare.net/cxpartners/how-rapid-feedback-luke-jones-cxpartners\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">slides are available here</a>.</p><h3 name=\"0973\" id=\"0973\" class=\"graf graf--h3 graf-after--p\">Be prepared</h3><p name=\"917d\" id=\"917d\" class=\"graf graf--p graf-after--h3\">Prepare for feedback sessions by ensuring your comps or prototypes are available to share quickly, and make sure you have the equipment you need to gather the feedback.</p><p name=\"1f37\" id=\"1f37\" class=\"graf graf--p graf-after--p\">Upload your comps to InVision or put them in a place where you&#8217;re able to make notes when people give feedback and have some software like Zoom, GoToMeeting, Hangouts, or Slack ready to share and discuss your designs in real-time. Your workmates need to see what you&#8217;re discussing, and you need to hear their feedback, so make sure you&#8217;re investing in <a href=\"https://medium.com/building-creative-market/building-a-distributed-startup-4c71591ce683\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">tools that make this process better</a>.</p><p name=\"3b3e\" id=\"3b3e\" class=\"graf graf--p graf-after--p\">The best way to prepare for this in advance is by scheduling weekly critiques with your teams and getting into a routine of preparing what you want to gather feedback on before the meeting begins.</p><h3 name=\"96a6\" id=\"96a6\" class=\"graf graf--h3 graf-after--p\">Include everyone on your&#160;team</h3><p name=\"8ef6\" id=\"8ef6\" class=\"graf graf--p graf-after--h3\">Loneliness and isolation are amplified when you are remote, with even more abstraction when you&#8217;re talking to a non-designer. An effortless way to solve this and to get buy-in from the rest of your team is to include everyone in feedback sessions and reach out to them individually as often as possible; the engineering intern might have some invaluable thoughts on the product.</p><p name=\"1187\" id=\"1187\" class=\"graf graf--p graf-after--p\">The people I work most closely with are PMs and designers, so I always put extra effort in to shoot the engineers on my team a Slack message saying &#8216;Hey, do you folks have 10-minutes to go through some designs with me?&#8217; I hope the result is an improved relationship, and a team that feels more ownership of what they&#8217;re working on.</p><p name=\"6ee7\" id=\"6ee7\" class=\"graf graf--p graf-after--p\">In addition, make sure everyone on your team knows they can give feedback. In Japan, the most junior person in the room speaks first. This prevents them from undermining their superiors and encourages them to speak up about their good ideas. Understand that giving critique is sometimes as hard as receiving critique, so create an environment that encourages people to provide that critique.</p><h3 name=\"f98a\" id=\"f98a\" class=\"graf graf--h3 graf-after--p\">Over-communicate and re-frame the&#160;feedback</h3><p name=\"6a2d\" id=\"6a2d\" class=\"graf graf--p graf-after--h3\">In an office, you know Sam will be sitting near you 8 hours a day. When you&#8217;re remote, that person might be in a totally different timezone, so you can&#8217;t assume they will be around if you need them to clarify some feedback. With that in mind, <strong class=\"markup--strong markup--p-strong\">don&#8217;t be afraid to ask stupid questions</strong> (e.g. if everyone else in the room seems to understand but you do not, don&#8217;t be afraid to say &#8216;can you elaborate on this please? I&#8217;m not getting it&#8217; or &#8216;what does this do?&#8217;)<strong class=\"markup--strong markup--p-strong\"> </strong>and always <strong class=\"markup--strong markup--p-strong\">re-frame the feedback </strong>to avoid ambiguous critique.</p><p name=\"b936\" id=\"b936\" class=\"graf graf--p graf-after--p\">For example, if you do not understand someone&#8217;s feedback, try and repeat it back to them in your own words, e.g. &#8216;so to clarify, you&#8217;re asking what would happen if the user has bought this item before?&#8217; This clarifies the feedback and puts it in your own words, a win/win when you look at that comment two days later and know exactly what it means without having to wait for Sam to come online.</p><h3 name=\"0bdc\" id=\"0bdc\" class=\"graf graf--h3 graf-after--p\">Foster a culture of mutual&#160;respect</h3><p name=\"0c0a\" id=\"0c0a\" class=\"graf graf--p graf-after--h3\">The best environments to work in are those when everyone has great respect for the expertise of others. That respect requires humility and restraint, it requires people to leave their egos at the door and know that they might not be the best person for the job. This is amplified when you aren&#8217;t in the same room and it&#8217;s more difficult to read social cues or facial expressions.</p><p name=\"d188\" id=\"d188\" class=\"graf graf--p graf-after--p\">To avoid this, know when to provide suggestions or when to merely ask questions about some aspects of a design. Ask the person you&#8217;re giving feedback to what kind of feedback they&#8217;re looking for, because sometimes suggestions are far better suited to sketching sessions, discovery, or ideation workshops so you could wait for those instead. Most of all, <a href=\"https://medium.com/building-creative-market/design-critiques-part-i-a-culture-of-effective-feedback-2713005a58a\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">know where your responsibilities are</a>, and use this to improve collaboration.</p><p name=\"b9a2\" id=\"b9a2\" class=\"graf graf--p graf-after--p\">However, the key word here is mutual, so this should always go both ways. Designers must respect and harness the skills others have, use that to the advantage of the product they are designing, and adapt to the ways in which others work.</p><h3 name=\"81a1\" id=\"81a1\" class=\"graf graf--h3 graf-after--p\">Meet in person if you need&#160;to</h3><p name=\"847a\" id=\"847a\" class=\"graf graf--p graf-after--h3 graf--trailing\">If you&#8217;re working through something complicated or getting towards the end of a large project, then meeting in person is an option. Few things beats being in a room with your team and work through a problem at the same time.</p></div>","title":"Getting Remote Critique Right – Building Creative Market – Medium"}},"pageContext":{"id":"5b9382d587be056953db7dfa"}}