{"data":{"mongodbDatabaseArticles":{"id":"5b96249187be058327490eb0","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">23 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p>This post is a part of <a href=\"https://foxnomad.com/2012/08/13/geek-takeover-week-on-foxnomad-2012/\">Geek Takeover Week 2012</a> and written by my special geek guest author, Mike Sowden. Mike is a British writer and blogger with a special brand of geekiness he brings to his site <a href=\"http://mikesowden.org/feveredmutterings/\">Fevered Mutterings</a>.</p>\n<p><em><img src=\"http://photos.foxnomad.com/NorthAmerica/Nevada/Las-Vegas/i-ZBMsqjw/0/690x690/P1010672-M.jpg\" alt=\"enterprise nx-01\" width=\"690\" height=\"518\"><br>\n</em></p>\n<p>I started traveling because I wanted to find Middle Earth.</p>\n<p>Ridiculous, I know.</p>\n<p>But I&#8217;ve grown up a lot since then &#8211; and now I&#8217;m hunting for Middle-Earth, Westeros, Morrowind, Skyrim, Azeroth, Icewind Dale, Barsoom, Utopia, Oz and the Discworld. (My reasons for traveling haven&#8217;t changed &#8211; I&#8217;ve just read more&#8230;and now I&#8217;m a videogames geek as well as a bookworm).</p>\n<p>Look behind the reasons people travel and you&#8217;ll find a lot of imaginary landscapes. It&#8217;s telling that a perennial favorite travel quote on social media is a quote from Lord Of The Rings (check out no. 35 <a href=\"http://matadornetwork.com/bnt/50-most-inspiring-travel-quotes-of-all-time/\">here</a>). The urge to travel is born in the imagination, and imaginations are stirred by fiction.</p>\n<p>Here are three fictional worlds that make me restless to see more of my own.</p>\n<p><strong><img src=\"http://photos.foxnomad.com/photos/i-R8kDXPd/0/M/i-R8kDXPd-M.jpg\" alt=\"sand dune\" width=\"300\" height=\"399\">Desert Planet</strong></p>\n<p><strong></strong>It&#8217;s astounding that Frank Herbert&#8217;s Dune is almost half a century old. Mauled by the excesses of David Lynch&#8217;s film-making in 1984 and by two interesting but flawed SyFy miniseries in 2000 &amp; 2003, Dune is still waiting for its definitive screen adaption &#8211; and US cable network HBO would be perfect for the job because Dune is science fiction&#8217;s Game Of Thrones. It&#8217;s brutal, sexual, subtle, cerebral, politically messy and played out over a galactic empire of mind-boggling scale &#8211; but the focus is a single planet with a unique ecosystem.</p>\n<p>Arrakis. Dune. Desert planet.</p>\n<p>Dear HBO:</p>\n<p>Dune has been luring people to the world&#8217;s desert regions for the last half-century. For geeks &#8211; you know, those people who run half our planet these days &#8211; it&#8217;s the Western nerd-appeal of the Northern Sahara, Jordan&#8217;s <a href=\"http://www.visitjordan.com/default.aspx?tabid=66\">Wadi Rum</a>, the land outside Dubai and anywhere else in the world that drifting sand covers the horizon. In Frank Herbert&#8217;s original six-part Dune sequence (let&#8217;s skip quickly over the recent prequels written by other people), desert was a backdrop to science fiction&#8217;s first real epic: the political fall of a noble house, the betrayal and brutalizing of an honourable people and the revenge of an orphaned son with a unique, messianic connection with the land&#8230;</p>\n<p>Oh, come on, HBO. You know this already. George RR Martin cites Dune as one of his influences, and you love that guy right now. Consider this: with Dune, not only do you hook the current generation of geeks, you get everyone else as well, right back to Old Grandpa Geek with his Star Trek The Original Series box-sets on VHS. You also get to film in some of the world&#8217;s most evocative landscapes, and get to fictionally populate them with some of literature&#8217;s hardiest, bloodiest people to ever wield a crys-knife.</p>\n<p>Dune is all about desert. Deserts cover one-third of our planet and form some of the world&#8217;s remaining unexplored wildernesses. Want to go down in history as the makers of a TV series that birthed a million globe-trotters? Make Dune.</p>\n<ul>\n<li>Starting point: <a href=\"https://www.amazon.co.uk/Dune-Frank-Herbert/dp/0450011844\">Dune</a> &#8211; Frank Herbert</li>\n</ul>\n<p><strong>Island World</strong></p>\n<p><img src=\"http://photos.foxnomad.com/photos/i-w3xNznk/0/O/i-w3xNznk.jpg\" alt=\"orkney\" width=\"690\" height=\"375\"></p>\n<p>Staying with crappily-adapted works of fiction &#8211; it can&#8217;t be easy being Ursula K LeGuin. She&#8217;s spent a career writing some of the most beautiful and gnarly speculative fiction of the 20th Century, winning five Hugos and six Nebulas and influencing the likes of Salman Rushdie and Neil Gaiman. And when someone finally adapts her most famous work, they make <a href=\"https://www.rottentomatoes.com/m/earthsea/\">this</a> &#8211; leading LeGuin to post an article at Slate.com subtitled &#8220;<a href=\"http://www.slate.com/articles/arts/culturebox/2004/12/a_whitewashed_earthsea.html\">how the Sci Fi Channel wrecked my books</a>&#8221;. Wince.</p>\n<p>Earthsea (the world, not the pea-brained TV series) consists of a colossal archipelago of hundreds of islands surrounded by a boundless sea. Its people are ethnically diverse but tend towards dark, reddish skin, because LeGuin is sick of fantasy adaptations populated only by Caucasians (j&#8217;accuse, Tolkien). The economy is maritime (read: there&#8217;s fish everywhere) and the tech level is&#8230;well, that&#8217;s a good question, because this is a land of magic. Magic is this world&#8217;s nuclear power: it keeps society turning, but most people would prefer to know nothing about how and why that happens. Magic users are revered, but from a distance &#8211; because when they go into melt-down, they&#8217;re everyone&#8217;s problem.</p>\n<p>I&#8217;ve been to Earthsea. I&#8217;ve briefly worked there, as an archaeologist, helping excavate a farmstead and its fishing station on the coast of a remote island. It&#8217;s a haunting place&#8230;and it&#8217;s called <a href=\"http://mikesowden.org/feveredmutterings/orkney-what-do-you-do\">Orkney</a>, Shetland and the Western Isles. It&#8217;s no stretch at all to transpose the events of LeGuin&#8217;s Earthsea books on the islands north and west of Scotland, as much Scandinavian (Norse, or &#8220;Viking) as anything else. Go there with the books in your hands, and go in search of magic. You may just find it.</p>\n<ul>\n<li>Starting point: <a href=\"https://www.amazon.co.uk/A-Wizard-Earthsea-Puffin-Books/dp/0140304770\">A Wizard Of Earthsea</a> &#8211; Ursula LeGuin</li>\n<li>A guide to <a href=\"http://www.visitorkney.com/gettinghere.asp\">Getting to Orkney</a> (VisitOrkney.com)</li>\n</ul>\n<p><strong>The Future Of Travel</strong></p>\n<p><img src=\"http://photos.foxnomad.com/photos/i-HrhCVhz/0/690x690/i-HrhCVhz.jpg\" alt=\"mars curiosity\" width=\"690\" height=\"481\"></p>\n<p>Imagine a rocky, dusty plane under a rust-coloured sky. It&#8217;s cold (cold enough to kill you in seconds) and it&#8217;s drier than Death Valley. Right now, the very second you&#8217;re reading this, a wheeled robot the size of a car is sitting in the middle of it. In the distance looms a mountain, 5 kilometres high. The rock-strewn ground is bare of footprints or tracks of any kind &#8211; because no human beings have ever set foot in this place. They still haven&#8217;t &#8211; yet here we all are, millions of us, peering out through the cameras of this robot sat 500 million kilometres away, on Mars.</p>\n<p><a href=\"http://www.nasa.gov/mission_pages/msl/index.html\">You may have heard the news</a>.</p>\n<p>The Red Planet has held Western literature&#8217;s imagination since HG Wells turned it into the Solar System&#8217;s fortress of evil. It&#8217;s not our closest neighbour, but it&#8217;s certain the most hospitable (Venus is so hot that <a href=\"http://www.bbc.co.uk/science/space/solarsystem/sun_and_planets/venus\">lead would melt at ground level</a> &#8211; if it wasn&#8217;t dissolved by the airborne sulphuric acid before it got there). It&#8217;s still unwelcoming enough to kill anyone without a space-suit &#8211; something <a href=\"https://www.youtube.com/watch?v=wEMWtyAKRhQ\">Ray Bradbury got very wrong</a> &#8211; but it holds the potential to be humanity&#8217;s new home, some day.</p>\n<p>Author Kim Stanley Robinson spent a decade imagining how we might do that, and then he turned his best guess into a trilogy of novels. Not only did they win awards and sell in barrowloads, they also used some of NASA&#8217;s best guesses on how we might get onto another planet in order to stay there. The technology is convincing and undoubtedly not too far from what future manned Mars missions will be relying on&#8230;but the real star of the books is, unsurprisingly, Mars itself.</p>\n<p>Imagine a volcano so tall (22 km from sea level) it touches the edge of space. Imagine a canyon 7 km deep &#8211; in comparison, the Grand Canyon is just 1.8 km deep &#8211; and 4,000 km long, the distance between New York &amp; San Francisco. Imagine a planet half Earth&#8217;s size but with the same amount of dry land &#8211; because there are no seas, anywhere.</p>\n<p>OK, stop imagining. Because all these things are real. They&#8217;re awaiting future generations of globetrotters, people who go off-world to go RTW, to places on a scale so vast <a href=\"https://io9.gizmodo.com/5650306/the-rough-guide-to-solar-system-mountaineering\">our planet can&#8217;t accommodate them</a>. Mars is the future of travel, and our imaginations are exploring it already.</p>\n<p>Hey, HBO, if you have any money left over after making Dune, well, there&#8217;s this series of books about Mars that&#8230;.oh, ok, yes, I&#8217;ll shut up.</p>\n<ul>\n<li>Starting point: <a href=\"https://www.amazon.co.uk/Red-Mars-Kim-Stanley-Robinson/dp/0007310161/ref=sr_1_1?ie=UTF8&amp;qid=1344430749&amp;sr=8-1\">Red Mars</a> &#8211; Kim Stanley Robinson</li>\n</ul>\n<p>[photos by: Mike Sowden (Orkney), <a href=\"https://twitpic.com/agc3nk\">NASA/Twitpic</a> (Mars Curiosity), <a href=\"https://www.flickr.com/photos/hamed/330039839/\">Hamed Saber</a> (Sand dune)]</p>\n<p>Thank you again Mike for being a part of and contributing to my first Geek Takeover Week. You can all catch up with Mike on his blog, <a href=\"http://mikesowden.org/feveredmutterings/\">Fevered Mutterings</a> and find him on <a href=\"https://twitter.com/Mikeachim\">Twitter</a>, <a href=\"https://www.facebook.com/feveredmutterings\">Facebook</a>, and <a href=\"https://plus.google.com/107638668945149178416\">Google+</a>.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"“And I Must Follow If I Can”: Three Fictional Worlds That Make Me Travel"}},"pageContext":{"id":"5b96249187be058327490eb0"}}