{"data":{"mongodbDatabaseArticles":{"id":"5b95ea8787be05832748ffb3","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/topphotopompeii.jpg\" alt=\"Overlooking Pompeii\"><br> When I was growing up, I wanted to be an archeologist. I loved history, and the thought of uncovering temples and tombs in jungles excited me. I used to read books on Greek and Roman history and have discussions with my history teacher, even as young as 13. In short, I was a huge geek from the get-go. Being such a huge history geek, visiting Pompeii, the city destroyed by Mount Vesuvius in 79 AD, has always been high on my list of things to do. The falling ash came so quickly it preserved the city just as it was. It&#8217;s a place frozen in time.</p><p>This year, I finally got to see it. I&#8217;ve traveled the world and seen plenty of marvelous ruins, but this is one of the best. The buildings, the frescoes, the streets, the pots, the bodies&#8212;everything is so well preserved. And even though a lack of upkeep has taken its toll on the site, I still found it a fascinating place to spend the day. My only hope is that the Italian government will get its act together to keep this site from falling into further disrepair.</p><p>Located near <a href=\"https://www.nomadicmatt.com/travel-guides/italy-travel-tips/naples/\">Naples</a>, <a href=\"https://www.nomadicmatt.com/travel-guides/italy-travel-tips/\">Italy</a>, Pompeii takes a full day to see. If you truly want to indulge your inner Indiana Jones and visit every building here, schedule an extra half day. I saw a lot on my full day, here but there was even more that I missed. With that in mind, what should you see, especially if you can&#8217;t come back a second day? Here are some highlights of Pompeii:</p><p><strong>The Brothel</strong><br> <img src=\"https://media.nomadicmatt.com/brothelpompeii.jpg\" alt=\"frescoes from a brothel\"><br> The brothel is a tiny house with stone beds and scenes of the acts customers could pay for. It&#8217;s ancient porn and is one of the most-visited houses in all of Pompeii. (Probably back then too!)</p><p><strong>The Forum Baths</strong><br> <img src=\"https://media.nomadicmatt.com/forumbathspompeii.jpg\" alt=\"forum baths in pompeii\"><br> Located near the forum, these baths are incredibly well preserved, and you can even peek inside the wall to see how they heated the baths.</p><p><strong>The Villa of the Mysteries</strong><br> <img src=\"https://media.nomadicmatt.com/villaofmysteries.jpg\" alt=\"the villa of mysteries\"><br> Located outside the main area, I liked this place because the frescoes were amazingly well preserved and had such great color. Since it&#8217;s a bit of walk, there weren&#8217;t that many people here either.</p><p><strong>The Forum</strong><br> <img src=\"https://media.nomadicmatt.com/pompeiimain.jpg\" alt=\"Pompeii forum\"><br> The most crowded place in Pompeii, the forum is right near the main gate. It was the main center of life in Pompeii and is also were you can go see the relics they found.</p><p><strong>The Stabian Baths</strong><br> <img src=\"https://media.nomadicmatt.com/suburbanbaths.jpg\" alt=\"Stabian baths\"><br> Another well-preserved bath, this one is the oldest in Pompeii, has a slightly bigger chamber, and sees a whole lot less crowds. You can also see some preserved bodies here.</p><p><strong>House of the Small Fountain</strong><br> <img src=\"https://media.nomadicmatt.com/fountainpompeii.jpg\" alt=\"the small statue in Pompeii\"><br> A beautiful house with a large back room, wonderful frescoes, and a beautiful mosaic fountain. You can even still see the sloped roof used to gather rainwater.</p><p><strong>House of the Faun</strong><br> <img src=\"https://media.nomadicmatt.com/pompeiistatue.jpg\" alt=\"House of the Faun\"><br> This is the biggest house in Pompeii and gets its name from the statue in the front courtyard. There&#8217;s a large courtyard in the back where you can also find a very detailed mosaic of a battle scene.</p><p><strong>Garden of the Fugitives</strong><br> <img src=\"https://media.nomadicmatt.com/plastercastspompeii.jpg\" alt=\"the Garden of the Fugitives\"><br> Located in the back of Pompeii, this old vineyard has preserved casts of people who didn&#8217;t make it out of the city alive. There&#8217;s also a fantastic garden here.</p><p><strong>House of Venus in the Shell</strong><br> <img src=\"https://media.nomadicmatt.com/venuspompeii.jpg\" alt=\"Venus in the shell\"><br> Another place located far away from the crowds, this house has a colorful fresco to the goddess Venus. There are also a few gardens here and a detailed statue of Mars.</p><p><strong>The Amphitheater</strong><br> <img src=\"https://media.nomadicmatt.com/amphipompeii.jpg\" alt=\"The amphitheater as seen from above in the Spring\"><br> This huge amphitheater is where they held the ancient games that entertained them. It&#8217;s a quiet place to walk around and given its position at the far end of Pompeii, you&#8217;ll see very few people there, especially during the early morning or late afternoon hours.</p><p><strong>Great Palestra</strong><br> <img src=\"https://media.nomadicmatt.com/pompeiisquare.jpg\" alt=\"Pompeii Palestra\"><br> Right next to the amphitheater, the &#8220;great palace&#8221; was an exercise park and place for youth groups. It&#8217;s also a great place to escape the crowds.</p><p><strong>House of Sallustio</strong><br> <img src=\"https://media.nomadicmatt.com/salusstiopompeii.jpg\" alt=\"Overlooking Pompeii\"><br> One of the oldest houses in Pompeii, this was most likely an inn. There&#8217;s a small garden in the back, a fresco of the goddess Diana, and even a little food shop in the front.</p><p>There are hundreds of buildings to see and wander through in Pompeii. Just the highlighted ones will consume a lot of your time. These are just my favorite sites&#8212;both popular and less popular, but all beautiful.</p><p><strong>Pompeii Visiting Tips</strong></p><ul><li><strong>Watch out for closings.</strong> Not all the attractions are open as they say they are. I found a number of places you were supposed to be able to get into closed. They even started closing one while I was looking around.</li><li><strong>Start in the back</strong>. To avoid the crowds, move from the farthest temples toward the front. The majority of people stick to the center of Pompeii, and you can visit the main area when the crowds have gone by late afternoon.</li><li><strong>Don&#8217;t do the audio guide</strong>. I bought the audio tour for 10 euros and found it to be a waste of time. The free book they give you includes enough information. The audio guide doesn&#8217;t explain much more.</li><li><strong>Limited time? Do a guided tour</strong>. I listened to a number of guided tours while I was walking around and I was impressed with their knowledge. Plus, I like being able to ask questions that can further explain things. The guided tours simply take you to the highlights, unless you do a personal tour.</li><li><strong>Bring lots of water</strong>. During the summer, it gets scorchingly hot. Bring lots of water and some sunscreen to avoid being burnt.</li></ul><p>In the time I was there, I barely scratched the surface of Pompeii, and I filled a whole day! One day, I&#8217;d love to go back and visit all the buildings I missed. But then again, I&#8217;m a history geek and could spend days upon days among ruins. If you don&#8217;t live and breathe history like I do, one day would be enough to see the highlights. Make sure you move away from the city center to see some of the lesser known and less crowded sites. Walking among the ruins is an eerie but beautiful feeling.</p></div>","title":"Things to Do and See in Pompeii"}},"pageContext":{"id":"5b95ea8787be05832748ffb3"}}