{"data":{"data":{"edges":[{"node":{"id":"5b9624f987be058327490f51","title":"Which Star Trek Crew Member Do You Travel Like?","source":"foxnomad","summary":"“To boldly go where no man has gone before.”-Star Trek title sequenceThe voyagers of the original Star Trek Enterprise inspired an entire generation to explore beyond what their imaginations had to capture.\nWhile the worlds of Star Trek may be fantasy, the personalities behind the original characters embody several ‘traveler types’ that we all are and see in others.\nBelow is a quick recap of some other Star Trek characters from the original 1960s series.\nWhich Star Trek Crew Member Do You Travel Like?\nI hope that you enjoyed this little traveling personality chart based on the Star Trek characters.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/05/tos_crew1.jpg"}}},{"node":{"id":"5b9624f887be058327490f4f","title":"Post Highlights: [5/1/2009]","source":"foxnomad","summary":"Post Highlights are a selection of the best and most popular posts from the past two weeks updated every other Saturday.\nAnother great way to get the best of foXnoMad is to subscribe to my RSS feed (what is RSS?).\n48 Hours In IstanbulIstanbul is many things to many people and if I had 48 hours in the city, here’s what I’d recommend to get your feet wet, jump in the pool, or become a fish in this city which spans two continents.\nThree Location Based Social Networks Travelers May Find UsefulThere are some differences between three of the popular options, Loopt, brightkite, and foursquare so here are the basics to introduce you to them.\nTurkish Remedies For Preventing An Upset StomachOnly some of these are backed by science, and the others may just be old wives tales but won’t hurt to try especially if you’ve got a sensitive stomach.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b9624f687be058327490f4d","title":"Changes Coming To Email, Design, and Some Contest News","source":"foxnomad","summary":"Over the coming weekend I’ll be expanding and reworking the email updates so they are more useful and readable with some new options.\nA number of you have sent me suggestions about them, and some features you’d like built into the website.\nIf you’ve got anything to add, feel free to let me know in the comments or send me an email.\nAlso, I’m planning another summer contest, although I’m thinking of pushing it back to June or July.\nIt’s typically slower on the Internets during the busy summer traveling months and might be a nice change of pace.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/05/ideas1.jpg"}}},{"node":{"id":"5b9624f687be058327490f4b","title":"From Lisbon To Saigon In One Shot: The Ultimate Train Challenge","source":"foxnomad","summary":"40 Shares PinThis September, I will begin a race against 5 other travel bloggers to break the record for the world’s longest continuous train journey.\nTo be more precise, The Ultimate Train Challenge will have me hopping from train to train, beginning in Lisbon, Portugal all the way to Vietnam’s Saigon.\nWhat Is The Ultimate Train Challenge?\nWhen I was first approached with the idea by Michael Hodson, I found both the travel and personal challenge difficult to resist.\nThe Devil Is In The PlanningEach of us train challenge participants can choose our own paths -north or south across Europe – then south from China into Vietnam.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/06/madrid-atocha-train-station.jpg"}}},{"node":{"id":"5b9624f587be058327490f4a","title":"The Rode VideoMicro Compact Microphone Will Significantly Improve Your Travel Video Audio","source":"foxnomad","summary":"﻿More and more of you are adding travel videos to your trip collections as phones of the past 2 years have made major jumps in video quality.\nAs cameras and mobiles get better at taking video, they still suck at audio.\nFor video with any kind of intelligible speaking in it, a microphone can go a long way.\nThe Rode VideoMicro is a compact, durable microphone under $60 that dramatically improves audio in any video.\nYou can watch my full review of the Rode VideoMicro in the video above.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2018/05/rode-vidmicro.jpg"}}},{"node":{"id":"5b9624f487be058327490f49","title":"The Best Falafel In The World Is In The Middle Of A Decade-Old Sibling Feud","source":"foxnomad","summary":"This is the story of two brothers in Beirut, Lebanon, who haven’t spoken in since 2006, when they’re split up their father’s famous falafel shop.\n(Falafel is a simple dish of fried chickpeas, often wrapped in pita bread.)\nThe two sons of Mustapha Sahyoun, Fuad and Zuheir, inherited the shop in 1992 but due to a dispute they won’t discuss, in 2006, Fuad opened his falafel shop right next door.\nBoth of these shops are considered some of the best falafel in the world; though which is better is something of a local rivalry in itself.\nI visited the Sahyoun falafel shops during a visit to Beirut and you learn more about the story in the video here.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/Thumbnails/n-G3vWG/i-G3MvQsC/0/b68c3745/1682x1152/i-G3MvQsC-1682x1152.jpg"}}},{"node":{"id":"5b9624f287be058327490f45","title":"What To See And Do In Asuncion, Paraguay","source":"foxnomad","summary":"Asuncion is the capital city of a country I’ve described as affectionately weird – one of the reasons you should travel to Paraguay.\nHere’s how to explore Asuncion and embrace its culture, history, and yes, weirdness.\nGoogle will send you somewhere nearby but a part of town don’t you definitely don’t want to be in.\nMercado 4 is a fun stroll though Paraguay’s booming counterfeiting economy; highlighting just how off the international grid Asuncion is.\nNow all of a sudden you’re feeling small town again in Asuncion, an a la carte travel experience.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2018/06/P1070059_60_61c-X3.jpg"}}},{"node":{"id":"5b9624f187be058327490f43","title":"Journalist Richard McColl Talks About Colombia’s Forgotten City, Mompos","source":"foxnomad","summary":"152 Shares PinRichard McColl is a freelance journalist and author based in Bogota, Colombia.\nHe is currently pursuing a PhD and also runs a small hotel, La Casa Amarilla, in colonial Mompos.\nIn my experience, I actually just bought a wreck of a colonial house before having the idea of opening a hostel.\nYou could go from Bogota to Villa de Leyva, to San Gil and Barichara, on to Mompos and then to Cartagena.\nThank you very much Richard for taking the time to share your knowledge about Mompos and traveling in Colombia.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-RDqKL72/0/690x690/i-RDqKL72.jpg"}}},{"node":{"id":"5b9624f087be058327490f41","title":"Colombia Travel Information","source":"foxnomad","summary":"You can find more Colombia travel information within the posts below.\nJournalist Richard McColl Talks About Colombia’s Forgotten City, Mompos – Writer, and hotelier talks about his adopted home.\nPhotography From Around ColombiaComing soon!\nWhere I’ve Stayed & Recommend [What this means]BogotaA Few Places To Eat, Drink, And ExploreThese are just a few selected places of the many I visited in these cities for a sample of what to see and taste.\nBogotaPhoto GalleriesYou can learn more travel information about other nations by checking out the full country list here.","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b9624ef87be058327490f3f","title":"foXnoMad’s Got A New Look","source":"foxnomad","summary":"I have a lot planned for you in the coming weeks so it seemed only appropriate to freshen up my digital wardrobe.\nPlease let me know what you think of the new style and any bugs you might come across that need ironing out.\nIt’s hard to specify what the changes are because the look is completely different, although in function, foXnoMad more or less works the same.\nYou’ll notice the most popular posts are listed to your left, where you’ll also find a powerful search engine for foXnoMad.\nI hope you like the fox’s shiny new coat.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-gscW27P/0/690x690/i-gscW27P.jpg"}}},{"node":{"id":"5b9624ee87be058327490f3d","title":"All Connections To foXnoMad Are Now Encrypted","source":"foxnomad","summary":"19 Shares PinfoXnoMad got a new look last week and over the weekend some enhancements.\nTo help further protect your privacy and security online, all connections to foXnoMad are now using TLS encryption.\nThis means, among other things, your comments (along with the information you send with them, like email addresses) won’t be visible to anyone potentially watching the wireless network you’re on.\nSwitching to full encryption is a move sites like Google and Facebook have made and it was about time I did here too.\nSites using SSL/TLS do give you some privacy on wireless networks but to be completely secure, you should be using one of these VPNs for travelers.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Asia/Yemen/Sanaa/i-kDhQ9Dv/0/690x690/P1260662_3_4c-X3.jpg"}}},{"node":{"id":"5b9624ed87be058327490f3b","title":"Lebanon Travel Information","source":"foxnomad","summary":"You can find more Lebanon travel information within the posts below.\n123Photography From Around LebanonComing soon!\nWhere I’ve Stayed & Recommend [What this means]Coming soon!\nPhoto GalleriesComing Soon!\nYou can learn more travel information about other nations by checking out the full country list here.","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b9624ec87be058327490f39","title":"Common Sense Advice On Handling Most Joint Injuries On Your Own – [Part 2 of 2]","source":"foxnomad","summary":"In Part 1 of handling most joint injuries on your own I emphasized the importance of self-administering first aid within the first 48 hours.\nTaking care of an injury immediately after it occurs the right way, in large part determines how long you’ll be able to travel with ease again.\nAt the first sign of pain stop your stretch and carefully move your joint back to rest.\nStop taking care of them (stretching, massage, and listening to your body) and you increase your chances of re-injury or chronic pain down the line.\nTake care of yourself and your body will take care of you for many more travels to come!","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/05/stretch1.jpg"}}},{"node":{"id":"5b9624ea87be058327490f36","title":"I Started This Blog 10 Years Ago Today","source":"foxnomad","summary":"I recalculated it a number of times to make sure I wasn’t adding an extra couple of years but that’s right, 10 years ago on this date I wrote the first foXnoMad post.\nA Short History TaleBack then in 2006, this was a blog I created for a few friends and myself, so we could keep in touch.\nSome time later foXnoMad took off with me following, on a journey that is now a quest to visit every country in the world.\nA Big Thank YouAll of this – my dream to travel the world and write about the places I visit is because you read and support this blog.\nI look forward to continuing the trip with you as foXnoMad expands later this year beyond anything I could have imagined in 2006.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-stpj2jc/0/690x690/i-stpj2jc-3572x1472.jpg"}}},{"node":{"id":"5b9624ea87be058327490f35","title":"The Best Comments Of The Month: June 2011","source":"foxnomad","summary":"The comments too have been equally scorching, here are some that will give you a sunburn if you stand too close.\nImperator gives a good account of how tourism is often a first-aid kit for economies recovering from various social and political ills.\nThe Travel Chica and I are both celebrating our birthdays – by fox years I guess we’re about the same age?\nThanks everyone for your helpful comments this past month.\nIt’s summer travel season in the northern hemisphere – so, where are you off to over the next few months?","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/06/pug-on-beach.jpg"}}},{"node":{"id":"5b9624e887be058327490f32","title":"Blow Out The Candles: foXnoMad Turns 5 Years Old Today","source":"foxnomad","summary":"There are some gray whiskers popping up on foXnoMad (figuratively and literally) as this travel site turns 5 years old today.\nSometime within the past year I decided to formalize a general travel goal, setting my sights on seeing every country in the world.\nThe Ultimate Tech Guide For Travelers 50% Off Today OnlyFor foXnoMad’s birthday, today only The Ultimate Tech Guide For Travelers is 50% off – but still includes 6 months of free personal travel tech support for yours truly.\nThank you for that – I only hope I can do the same for you and help you travel smarter.\nEnjoy some digital birthday cake on me, wherever you are in the world 🙂My sincere thanks,-Anil[photo by: JohanBerglund (red fox)]","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/06/red-fox.jpg"}}},{"node":{"id":"5b9624e387be058327490f2b","title":"March 2012 LIVE CHAT! Announcing The Best City To Visit 2012 Tournament Brackets And Favorite (Plus Not-So-Favorite) Cities","source":"foxnomad","summary":"16 Shares PinWelcome everyone to this month’s live chat.\nI’ll be breaking down the competing cities plus giving my predictions along with Wandering Earl and Barry and Julia who write Turkey’s For Life.\nClick here to jump right into the chat happening for the next 3 hours!\nThe Live Chat is only open from 2pm-5pm US EST; 7pm-midnight London GMT).\nFinally, I’ll be announcing a few changes to the chat format and more.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2012/03/brackets.gif"}}},{"node":{"id":"5b9624e087be058327490f29","title":"The Best City To Visit Travel Tournament 2011: Elite 8","source":"foxnomad","summary":"127 Shares PinThere were a few close races last week as the poll numbers jumped around quite a bit.\nLubeck gave one heck of a fight before bowing out to tournament favorite Istanbul; while again Florence and Rio quietly advanced to the the round of 8.\nFor the rest of the tournament you’ll have to register to vote.\nYou can view the entire tournament bracket in full size or click the image to view in wide-screen.\nYou can be the first to find out about the next one by signing up for my email updates, RSS feed, or bi-monthly newsletter.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/03/best-city-to-visit-2011-elite-8.jpg"}}},{"node":{"id":"5b9624dc87be058327490f25","title":"Interview With Stephane Pingaud About New Service Cost4Travel","source":"foxnomad","summary":"Stephane Pingaud recently got in touch with me about a new project called cost4travel.\nStephane shares some information about this new service which I think many travelers will find useful.\ncost4travel provides a way for travelers to record and reference their travel costs, so that other travelers can budget realistically for their future trips.\nTravel meta-search engines, while very useful in the travel booking process, do not offer a complete picture of the travel costs to be expected from upcoming trips.\nleisure – and possibly un-managed business – travelers do want to better organize their travel costs and control their travel budget.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/10/cost4travel-logo1.jpg"}}},{"node":{"id":"5b9624db87be058327490f23","title":"You Can’t Have All The Fun: I’m Giving Myself Some Vacation Time","source":"foxnomad","summary":"So much so that somehow over the last 3 years I turned my vacation into a job.\nSo, nothing big, no drama, I’m just going to be a good boss to my best – and only – employee.\nI’m going to give myself 6 weeks of annual vacation and force myself to use it.\nMore specifically I’ll make a note here letting you know I’m going to be gone for one, two, whatever weeks.\nPlus you’ll get a little reading break too from time to time, so no need to feel left out.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-VFd2s9r/0/O/i-VFd2s9r.jpg"}}},{"node":{"id":"5b9624d787be058327490f1d","title":"I’m Taking My First Vacation, See You In Two Weeks","source":"foxnomad","summary":"13 Shares PinAs I mentioned last week, I’ve decided to be a good boss to my blogging self and take about 6 weeks of annual vacation each year.\nSo this confessed work-and-travelholic is going to take the next 2 weeks off somewhere in the world.\nI’ll be slow to respond to comments, most emails, and there won’t be any new posts until February 21rst when I’ll launch this year’s Best City To Visit 2012 Contest.\nIn the meantime you can check out my least and most popular posts of 2011, my travel gadget gift guide if you’ve got a birthday coming up (happy birthday by the way!\nI look forward to getting back to you soon and hope these withdrawal symptoms subside or increase significantly – I want to see where these hallucinations go from here.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Europe/Turkey/Istanbul/i-bS2RVMs/0/690x690/P105040234c-M.jpg"}}},{"node":{"id":"5b9624d587be058327490f1c","title":"The Best City To Visit Travel Tournament 2012: Preliminary Voting","source":"foxnomad","summary":"266 Shares PinYou can vote for your favorite 10 cities below; voting ends this Wednesday, February 29th at 12pm US EST.\nThose of you reading through email and RSS will have to click-through to this page to vote.\nThis round of voting will not eliminate cities but it is what I use to order (seed) them in the tournament.\nThe cities with the most votes will be matched up in the next round with the cities with the least votes in this round.\nIn the past years of the tournament, those who did better here tended to advance further in the tournament.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-2bZQw3c/0/O/i-2bZQw3c.jpg"}}},{"node":{"id":"5b9624d287be058327490f19","title":"Airline Feeding Frenzy","source":"foxnomad","summary":"The onslaught of à la carte fees by the airlines is another in a growing number of reasons of why the airline industry needs to be run like a public utility.\nAs a result we have a $439USD advertised flight that, with added fees, ends up being almost $700.\nYou not only get the thrill of long line-ups and flight delays you have the opportunity of paying for the privilege.\nFor example, on American Airlines, passengers flying within the U.S. pay $20 USD for their first checked bag and $30 for the next one.\nNow the passengers pay for services the airlines already have to buy.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/10/grabbing-money1.jpg"}}},{"node":{"id":"5b9624ce87be058327490f13","title":"Overcoming The 7 Major Obstacles To Traveling The World eBook","source":"foxnomad","summary":"It started with a simple list of 7 reasons you won’t travel the world, a post which I had planned on following up with one quick summary.\nMy series on overcoming obstacles to traveling the world turned out to span 2 months, generated over 100 comments, and had my inbox filled with messages from people who wanted to, had, or were currently overcoming the 7 obstacles themselves.\nThat’s why I decided to convert the series into my first eBook Overcoming the 7 Majors Obstacles to Traveling the World which you can purchase here now.\nGet A Copy of Overcoming the 7 Major Obstacles to Traveling the WorldYou can get you copy of my eBook, Overcoming the 7 Major Obstacles for $8.00 on Amazon.com or Barnes & Noble.com.\nI really believe that many of you will find this eBook valuable and useful.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/09/overcoming-the-7-major-obstacles-to-traveling-the-world-ebook-cover11.jpg"}}},{"node":{"id":"5b9624cc87be058327490f0f","title":"What I’ve Been Up To Recently","source":"foxnomad","summary":"I’ve been working on a few new projects and wanted to let you know some of the things I’ve been working on and have planned for the upcoming weeks.\nTo start, I’ll be launching 3 new regular travel-related blogs, the first of which is call How To Travel With Pets.\n(Travel bloggers interested in being added to the How To Travel With Pets links page, just send me an email.)\nI’ve also got a lot of traveling coming up around the US before heading to Europe.\nIn the meantime feel free to drop some comments letting me know what you’re up to, where you’re traveling, and what you’re working on.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/10/chatting-teeth1.jpg"}}},{"node":{"id":"5b9624cb87be058327490f0d","title":"Wanderlists, Travel Secrets, and More Tech Tips For The Road","source":"foxnomad","summary":"The first goal, and probably most ambitious one, came about in 2003 when my uncle handed me a magazine.\nHopping Around The WebI also, along with several other digital nomads, recently got to talk tech again with Nora Dunn about essential services for the road.\nOn top of that Heather On Her Travels was kind enough to mention several travel bloggers including myself in an article about a great project from Tripbase.\nThey are donating $1 for every download of their free ebook series and there are some good ones to choose from.\nDownloading the ebook is free, with no sign up to anything, and Tripbase makes the donation on your behalf.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2010/06/reading-under-the-covers.jpg"}}},{"node":{"id":"5b9624ca87be058327490f0b","title":"Have You Ever Felt Bouncy After A Flight, Cruise, Or Car Ride? [POLL RESULTS]","source":"foxnomad","summary":"Based on your comments and the results of a poll I took last week, many of you have occasionally felt “landsick” – that persistent bouncy feeling several hours or days after a long flight or boat ride.\nI explained why you feel bouncy and came across Mal de Debarquement syndrome, a condition where the feeling lasts for years after.\nIn the coming weeks I’ll have an interview with someone who suffers from Mal de Debarquement syndrome to learn more about what it’s like living with that feeling constantly, 3 years after a boat ride.\nFor most of us however, you can reduce the symptoms of landsickness by reducing your flight delay stress, honing that energy positively, or putting (acu)pressure on the inside of the your wrist.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/Thumbnails/n-G3vWG/i-jP4HLPb/0/831b3a3c/O/i-jP4HLPb.jpg"}}},{"node":{"id":"5b9624ca87be058327490f0a","title":"Adventures On The Road, Imagine: A Vagabond Story","source":"foxnomad","summary":"Traveler and author Grant Lingel was kind enough to send me a copy of his new book Imagine: A Vagabond Story.\nThe book is an honest chronicle of New Yorker Lingel’s first trip as a vagabond down to Mexico and beyond.\nImagine: A Vagabond Story is a slice of time in Lingel’s life and a familiar story for many perpetual travelers.\nImagine: A Vagabond Story is Lingel’s backpacking adventure, without a set plan or permanent characters, save two.\nImagine: A Vagabond Story is a fun story with familiar elements for most travelers and some new adventures for others.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/10/imagine-vagabond-story1.jpg"}}},{"node":{"id":"5b9624c887be058327490f07","title":"5 Places to Entertain Kids in Leeds, England","source":"foxnomad","summary":"Free Child Friendly MuseumThe Leeds City Museum in Millennium Square is open from 11:00 a.m. every day except Monday, and admission is free.\nBird Garden, Animals, And Open SpaceLotherton Hall is an Edwardian country house set in gorgeous parkland, about 13 miles northeast of Leeds City Centre.\nHopefully this guide has given you a taste of what there’s to do and see in Leeds for kids.\nRead more guides on attractions in Leeds, on My Life in Leeds, a locally written guide.\n[photos by: Leeds City Museum and Kirkstall Abbey by dcronian, timojazz (Thackray Museum), tricky (Roundhay Park), Drown (Lotheron Hall bird park)]","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2010/06/leeds-city-museum.jpg"}}},{"node":{"id":"5b9624c387be058327490efe","title":"Sights And Sounds From The Gulf’s Best Corniche: Muscat, Oman","source":"foxnomad","summary":"Perhaps it’s the absence of skyscrapers looming on the horizon or nature’s inclusion of the rocky cliffs along the skyline, but Muscat, Oman’s corniche is visually unique in the region.\nMuscat, and Oman in general, makes you feel like it’s a nation undercover.\nHiding its wealthy status and oil money, along with throngs of visible tourists, it’s tough to be the wiser.\nThese guys were much more lively the few hands before I shyly asked to take a video of their card game.\nImmediately to the left, at the end of the main corniche path, is Muscat’s famous fish market.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Asia/Oman/Muscat/i-DzrDPcD/0/O/CIMG1346.jpg"}}},{"node":{"id":"5b9624c287be058327490efc","title":"The Best City To Visit Travel Tournament 2011: Final Four","source":"foxnomad","summary":"152 Shares PinThe Elite 8 of The Best City To Visit Travel Tournament was a series of upsets for the most part, with strong favorites Istanbul and Jerusalem being bumped out by the smaller Porto and Chaing Mai.\nRio also moved on to the Final Four, quietly yet again, although now all eyes will be set on the Brazilian city against the Prague powerhouse.\nPorto or Chiang Mai – Prague or Rio de Janiero; you’ve got two days to determine who moves on.\nThere can be only one best city – polls are open until this Thursday, March 31rst at 6pm US EST.\nYou can view the entire tournament bracket in full size or click the image to view in wide-screen.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/03/CIMG1208-21.jpg"}}},{"node":{"id":"5b9624b687be058327490ee3","title":"The Cheesiest Travel Photo Contest – Entry #6","source":"foxnomad","summary":"This is the first of 9 entries in The Cheesiest Travel Photo Contest that I’ll be posting through Wednesday.\nCheck out entry #1, entry #2, entry#3, entry #4, and entry #5 and vote for your favorites beginning next Monday, August 24th.\n“While walking by a local Chinese tourist dressed up in a costume, I was coerced into being a prop in his photo shoot”Submitted by: Tighe FlanaganOne random subscriber will be picked and given a prize also.\nThe easiest way to enter is to sign up for daily email updates below or follow me on Twitter.\nReceive email updates:","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/08/Tighe-Flanagan-Fenghuang-China1.jpg"}}},{"node":{"id":"5b9624b087be058327490ed6","title":"The Cheesiest Travel Photo Contest – Entry #8","source":"foxnomad","summary":"This is the first of 9 entries in The Cheesiest Travel Photo Contest that I’ll be posting through Wednesday.\nCheck out entry #1, entry #2, entry#3, entry #4, entry #5, entry #6, and entry #7 and vote for your favorites beginning next Monday, August 24th.\n“The Dwarf and the Giant”Submitted by: Priyank (Final Transit)One random subscriber will be picked and given a prize also.\nThe easiest way to enter is to sign up for daily email updates below or follow me on Twitter.\nReceive email updates:","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/08/Priyank-Giant-and-the-Dwarf1.jpg"}}},{"node":{"id":"5b9624ae87be058327490ed1","title":"Talking Near-Future Space Tourism On bloon With zero2infinity CEO Jose Mariano","source":"foxnomad","summary":"In the year 2002 he authored a paper named “The role of balloons in the future development of space tourism”.\nI had the pleasure of meeting Jose in Sofia, Bulgaria during the Space Tourism & Travel Trends Summit.\nHow does bloon work exactly?\nLooking into a crystal ball, where does the technology behind bloon go – what could be next?\nYou can learn more about bloon and zero2infinity on their respective websites.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/04/Jose-Mariano-Lopez-Urdiales.jpg"}}},{"node":{"id":"5b9624ad87be058327490ecf","title":"Ask Aerospace Engineer Jose Mariano Anything You Want About Space Tourism","source":"foxnomad","summary":"30 Shares PinSpace may be the final frontier, but you don’t have to wait for warp drive to explore it.\nLike myself, I’m sure many of you are waiting for the chance to extend your travels beyond our planet and my live chat guest today is working to make that happen.\nIn 2009 Jose Mariano Lopez-Urdiales founded Zero2Infinity in Barcelona, Spain; its maiden vehicle is bloon, a stratospheric balloon that will allow people to fly to Near-Space.\nThanks to his astronomer father, he has been in close contact with space missions ever since he was a child.\nI first met Jose in 2011 when he gave a talk about bloon at a conference on space tourism and interviewed him about near-future space tourism later that year.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2013/07/jose-mariano.jpg"}}},{"node":{"id":"5b9624ab87be058327490ece","title":"Use Your Next Trip To Solve That Big Problem You Have Back Home","source":"foxnomad","summary":"Traveling doesn’t make your problems go away, it just brings them along for the ride.\nAlthough your next trip likely won’t solve dilemmas directly, vagabonding can redirect your focus in unique ways, preparing you to tackle life crises of all sizes.\nThat’s part of the reason everyone seems so “new” to us upon returning home after a long trip.\nChemicals like cortisol and adrenaline sharpen your senses, giving you faster reaction times to tiger attacks and the occasional life-challenge.\nSo, even if your problems are waiting for your after your next trip, your journey may have just given you enough neural ammunition to tackle them effectively.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/NorthAmerica/Mexico/Playa-del-Carmen/i-FQCVqtP/0/690x690/P1220993_4_5c-M.jpg"}}},{"node":{"id":"5b9624a887be058327490ecb","title":"The Best City To Visit Travel Tournament 2012: Elite 8","source":"foxnomad","summary":"2.7K Shares PinThe path to this year’s remaining 8 cities in The Best City to Visit 2012 Travel Tournament has been a wild one.\nI don’t think many of us would have predicted this Elite 8 when the tournament began a little over 2 weeks ago.\nGuimaraes again slips by another round to survive and Marrakesh knocks off New York City.\nAnd Porto, last year’s champion was eliminated so now we’re set for a new city to win 2012.\nThe Final Four – and second to last round of the tournament – will begin again this Tuesday, March 20th.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-mPFFnVL/0/O/i-mPFFnVL.jpg"}}},{"node":{"id":"5b9624a787be058327490ec8","title":"Post Highlights: [1/10/2009]","source":"foxnomad","summary":"Post Highlights are a selection of the best and most popular posts from the past two weeks updated every other Saturday.\nAnother great way to get the best of foXnoMad is to subscribe to my RSS feed (what is RSS?).\nA Look Back On My Travel Predictions For 2008With the year drawing to a close I’d like to look back with you at my predictions and see how each of them turned out.\nWorld Map of Air Travel Over 24 HoursA representation of air traffic patterns across the world during a typical 24 hours span using data from delay predictor FlightStats.\nThey were all so good that I thought I’d share them with you for your pleasure as well.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b9624a487be058327490ec6","title":"The Book That Continues To Inspire My Travels","source":"foxnomad","summary":"Reading and travel are two of my passions and it was fun to be able to put them together in a recent guest post I wrote about the book Long Way Round.\nIt was a pleasure to write How A Long Way Round Shaped Travel for A Traveler’s Library about how this particular book influenced my travels.\nI originally heard about the trip (which book is based on) in a magazine my uncle handed me in 2003.\nThe trip was still in the planning stages but it had me hooked and lusting for the road.\nI hope that you’ll read my guest post How A Long Way Round Shaped Travel and check out some of Vera’s other wonderful posts.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2010/02/boy-on-horse.jpg"}}},{"node":{"id":"5b96249f87be058327490ec4","title":"Do You Have A Travel Blog? [POLL]","source":"foxnomad","summary":"Many of you are travel enthusiasts and over the last few months there have been a number of new readers to this site.\nI’d like to find out a bit more about you to help focus my writing in the upcoming months.\nI’d appreciate it if you could answer the following question:Those of you who do have a travel blog (updated or not) please let me the link in the comments, especially those of you I haven’t met.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-pHLNpbh/0/690x690/i-pHLNpbh.jpg"}}},{"node":{"id":"5b96249f87be058327490ec3","title":"Are Wow Air Deals Worth It?","source":"foxnomad","summary":"32 Shares PinYou may have seen recently a lot of seemingly spectacular deals from Wow Air, a low-cost airline based in Reykjavik, Iceland, that offers transatlantic flight deals for less than $99.\nThose deals seem worth it (answering the question above) of course, if they are what they seem upfront.\nI spent some time booking flights using Wow Air and found while it might be an inexpensive way to cross the Atlantic, it may not always be the best way.\nWow DealsA lot of low cost carriers advertise big deals on flights, pricing them so low it feels more like you could be booking a bus ticket.\nThe advertised deals get you to the booking process, and in the case of Wow Air, the fees for most people bring the airfare up to less attractive numbers.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/01/i-PhZGHH4.jpeg"}}},{"node":{"id":"5b96249b87be058327490ec0","title":"Travel Hack: Pentensils","source":"foxnomad","summary":"Another great travel essential, Pentensils transform most pen tops into knives, forks, and spoons.\nAlthough the Ultimate Spork seems better suited for the job – except it can’t write.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96249987be058327490ebd","title":"What It’s Like To Live In Turkey As Foreigners, 13 Years After A Dream Come True","source":"foxnomad","summary":"1.5K Shares PinThis is a guest post Barry and Julia, who sold up in the UK to travel around Turkey for 6 months.\nTheir blog, Turkey’s For Life is a slow travel and food blog about Fethiye and other parts of Turkey.\nWe actually took the plunge to travel Turkey for a few months, not to live here…but we never left.\nAfter 13 years of life in Turkey, we’ve done a lot, seen a lot and learned a lot…and there’s much further to go.\nWe can assure you that wherever you may live or travel to in Turkey, it is very real.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/Other/My-Smug-Mug/n-JLVBs/i-Ff6Ksmb/0/690x690/i-Ff6Ksmb.jpg"}}},{"node":{"id":"5b96249687be058327490ebb","title":"Bedbug Clues","source":"foxnomad","summary":"Infestations of the little blood sucking bugs are increasing at hotels around the world.\nBusinessWeek reports there are some clues to look for to tell if the hotel you’re staying at has a bedbug problem on their hands.\nHotel dogs walking around with sniffing dogs in the lobby are also a good indicator.\nKeep in mind that the little critters are found in hotels of varying classes, including 4 and 5-star ones.\nBedbugs can live without a meal for more than a year and hitch rides around the world in your luggage.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2007/12/250px-Cimex_lectularius1.jpg"}}},{"node":{"id":"5b96249587be058327490eba","title":"How To Keep To A Single Carry On","source":"foxnomad","summary":"Wear a single multi-purpose pair that will be easy on your feet – preferably in black to help you blend in.\nIf you must bring an extra pair (or heavens two), tie them by the laces to your carry on.\nWear a single multi-purpose pair that will be easy on your feet – preferably in black to help you blend in.\nFollow The 10 Of Essentials Rule – This rule applies even to thoughtfully packed carry on bags.\n– It’s so 90s, but any sweaters, light jackets, or hoodies shouldn’t take up space in your carry on.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/NorthAmerica/California/San-Francisco/i-3wvW5LJ/0/M/CIMG3602-M.jpg"}}},{"node":{"id":"5b96249587be058327490eb9","title":"Overcoming 7 Major Obstacles To Traveling The World – #7 You Will Travel The World…Later","source":"foxnomad","summary":"Overcoming the obstacles to traveling the world half-assed can make your current situation more difficult while not getting you any closer to actually traveling the world.\nOvercoming the obstacles to traveling the world half-assed can make your current situation more difficult while not getting you any closer to actually traveling the world.\nRun your excuses by a friend or one of the travel many people traveling the world for a reality check.\nCan you say you won’t have regrets if you don’t travel the world?\nNext Thursday I’ll have a follow up on the entire series of overcoming obstacles to traveling the world.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/08/procrastination-poster1.jpg"}}},{"node":{"id":"5b96249387be058327490eb7","title":"Post Highlights: [2/9]","source":"foxnomad","summary":"?s reluctance to embrace the global travel boom , there are many advantages to going there for foreigners.\nTravel Blog Carnival Week 5Until now, I?\nBlog Carnival as a contestant.\nThis week I reviewed the entries submitted by other travel bloggers and selected the best three.\nThere are better ways to try to get refunds, even for weather delays.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96249287be058327490eb5","title":"The Quick Guide To Visiting North Korea","source":"foxnomad","summary":"All Flights Will Originate From China – There are no direct flights to North Korea, except from China on North Korea’s only airline, Air Koryo (which does not have a website).\n– There are no direct flights to North Korea, except from China on North Korea’s only airline, Air Koryo (which does not have a website).\nContact Your Embassy – Either in North Korea or before you leave, in case you need their assistance.\nBeware Of Customs/Immigration When You Return – Many countries (especially the US) don’t have diplomatic relations with North Korea.\nNorth Korea seems a fascinating destination that has (very, very) slowly been opening up to the global tourism industry.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Asia/Bahrain/Manama/i-fJ69gsK/0/M/CIMG0879-M.jpg"}}},{"node":{"id":"5b96249187be058327490eb2","title":"Using 5 Essential Moving Tools For Packing","source":"foxnomad","summary":"I’ve taken Lifehacker’s 5 essential tools for moving and adapted them for lazy travelers.\nZiploc BagsSave time going through airport security by prepackaging all of your “liquids” in ready ziploc bags.\nAmple protective plastic wrap servers the same purpose and can be used to plug up any holes your bags have earned along the way.\nProtective plastic wrap can also be used to save your fragile gifts from damage during handling.\nAside from these essential moving tools you’ll want to keep your small travel essentials with you (in a ziploc bag).","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/NorthAmerica/California/San-Francisco/i-ngK6tD9/0/M/CIMG3591-M.jpg"}}},{"node":{"id":"5b96249187be058327490eb0","title":"“And I Must Follow If I Can”: Three Fictional Worlds That Make Me Travel","source":"foxnomad","summary":"Look behind the reasons people travel and you’ll find a lot of imaginary landscapes.\nIt’s telling that a perennial favorite travel quote on social media is a quote from Lord Of The Rings (check out no.\nThe urge to travel is born in the imagination, and imaginations are stirred by fiction.\nHere are three fictional worlds that make me restless to see more of my own.\nMagic is this world’s nuclear power: it keeps society turning, but most people would prefer to know nothing about how and why that happens.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/NorthAmerica/Nevada/Las-Vegas/i-ZBMsqjw/0/690x690/P1010672-M.jpg"}}},{"node":{"id":"5b96249087be058327490eaf","title":"June, 2011","source":"foxnomad","summary":"The comments too have been equally scorching, here are some that will give you a sunburn if you stand too close.\nImperator gives a good account of how tourism is often a first-aid kit for economies recovering from various social and political ills.\nThe Travel Chica and I are both celebrating our birthdays – by fox years I guess we’re about the same age?\nI appreciate Stephen‘s advice on booking trains in China, I’ll need it late in September as I race toward Saigon on The Ultimate Train Challenge.\nIt’s summer travel season in the northern hemisphere – so, where are you off to over the next few months?","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248f87be058327490ead","title":"Overcoming 7 Major Obstacles To Traveling The World – #4 You’ll Miss Your Family and Friends","source":"foxnomad","summary":"A number of you are planning to travel the world one day, which won’t happen unless you can overcome these 7 obstacles.\nDon’t try to fight it, you will miss people but accepting that makes it easier to overcome this obstacle to traveling the world.\nDon’t get confrontational or blow off your friends and family when they tell you that you’re going to be missed.\nTraveling solo forces you out of your shell and exploring the world with a partner or some friends makes you much more approachable (and people will approach you!)\nLet The Obstacle Overcome ItselfMissing your family and friends and worrying about it are part of the process – and overcomes itself – if you let it.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/08/sad-face-on-plate1.jpg"}}},{"node":{"id":"5b96248e87be058327490eaa","title":"How To Stick To Your 2017 Travel Resolutions","source":"foxnomad","summary":"‘2017 Travel Resolutions’), prioritize them, and set schedules to make sure you stay on track.\nUse The Winner Effect To Knock Out ResolutionsDon’t make the first resolutions you want to tackle be the most difficult.\nThat makes it all the harder to ditch your travel resolutions.\nImagine yourself accomplishing each of your travel resolutions and you’re much more likely to believe it’s possible, less risky, and rewarding.\nA 15 minute dose of confidence and conviction for your travel resolutions and other passions in life.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/01/P106038234c-M.jpeg"}}},{"node":{"id":"5b96248e87be058327490ea9","title":"The Weather Is Getting Colder: Prepare For Ski/Snowboarding Season Online","source":"foxnomad","summary":"Since snow is (finally) beginning to fall in many parts of the world, it’s time to check out my online ski and snowboard preparation guide.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248b87be058327490ea6","title":"Final Inspire Me Africa Photo Contest Prize Awarded","source":"foxnomad","summary":"Dawoud W. was the subscriber who was randomly selected to win a copy of Long Way Down.\nDawoud, thanks for being a member of the foXnoMad blog network and hope you enjoy the book.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248a87be058327490ea4","title":"The Dog Days of Cubbon Park in Bangalore","source":"foxnomad","summary":"About the most interesting thing at this large but quiet park.\nCubbon Park has nice greenery for local residents to stroll though, but the fuss being made about it didn’t warrant a stop on my latest trip.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2008/12/cubbon-park-bangalore-india-9-large1.jpg"}}},{"node":{"id":"5b96248a87be058327490ea3","title":"Post Highlights: [12/20/2008]","source":"foxnomad","summary":"Post Highlights are a selection of the best and most popular posts from the past two weeks updated every other Saturday.\nCabin Cuddler ReviewAs shown in the photo to the right, the Cabin Cuddler is a 100% polyester travel blanket that wraps around your body and feet.\nInterview With Cabin Cuddler Creator Jim LevingsJim is a fascinating fellow who was kind enough to let me ask him a few questions about his product the Cabin Cuddler, how he found out that airplane blankets aren’t washed, and his career as a pilot.\nShiva Temple – Bangalore, IndiaYou can see the rest of my pictures from this Shiva Temple, with impressive statues of the deity here.\nInspire Me Africa Photo Contest ResultsThe voting for the top prize in the Inspire Me Africa Photo Contest went down to the very end last night.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248a87be058327490ea2","title":"Inspire Me Africa Photo Contest Results","source":"foxnomad","summary":"The voting for the top prize in the Inspire Me Africa Photo Contest went down to the very end last night.\nYou can see the final contest results below:[poll id=”18”]Congratulations Deniz you belly danced your way to the third prize!\nI personally enjoyed all of the pictures but would have liked to see Mara’s picture gain some more traction in the voting.\nI’ll be posting a recap and my post-contest thoughts next week, but I’d like to hear your opinions and comments on the results.\nThe next ‘big’ contest will be announced in mid-April.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248987be058327490e9f","title":"This Is A Picture Of The Very First Starbucks","source":"foxnomad","summary":"For some reason taking a picture of every Starbucks I came across (and/or Bill Gates) became a personal photographic scavenger hunt.\nAcross from the Pike Place Market, I noticed an odd Starbucks, with the wrong logo and colors.\nIt wasn’t until seeing another picture of it years later did I realize this was the first Starbucks.\nThe first Starbucks opened on March 31, 1971, but didn’t sell coffee to drink, but the beans themselves.\nObviously things worked out from there since old or new, there always seems to be a line out the door.","info":{"author":"Anil Polat","top_img":"https://photos.smugmug.com/NorthAmerica/Washington/Seattle/i-JfzCt9T/0/690x690/CIMG1951.jpg"}}},{"node":{"id":"5b96248787be058327490e9c","title":"Will Flying Separately Save Your Family In A Plane Crash?","source":"foxnomad","summary":"They do this so that in case of a plane crash, their family and one of the children will survive.\nAs odd as it sounds, the idea intrigues me, does flying separately really reduce the chances of losing your entire family in a plane crash?\nThe NumbersAccording to Plane Crash Info, the odds of you dying in a commuter plane crash are 1 per every 140,000 flight hours.\nIt just gives each passenger (if you’re family is taking two planes) a 1 in 20,000 chance of dying in a crash.\nIn The EndIf your family takes an of 10 flights per year, you’d have to fly an average of 2,000 years before your first plane crash.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2008/12/numbers-300x2011.jpg"}}},{"node":{"id":"5b96248787be058327490e9a","title":"I’m Bleeping Matt Damon","source":"foxnomad","summary":"Matt Damon haters came out of the closet when it was thought he’d be the next Captain Kirk.\nWell now we know that heee’s not gooooing tobe the neeext Kirk.\nBut Sarah Silverman is fucking him.\nYes, she’s fucking Matt Damon (the video is slightly NSFW).\nAn homage to foXnoMad’s earlier days…still hate him?","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248787be058327490e99","title":"12 Hours Left To Vote In Inspire Me Africa Photo Contest","source":"foxnomad","summary":"It’s certainly been quite a contest with Casey and Yasser trading places for first and Stina nipping at Deniz’s heels for the past 2 weeks.\nYou’ve got 12 more hours to help support and vote for your favorite Inspire Me Africa photos and decide the final winners!\nYou can also join the action.\nSubscribe to foXnoMad daily email updates below and you’ll be entered to win the 4th prize.\nReceive email updates:","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96248587be058327490e96","title":"Two Places Outside Of The United States Where George W. Bush Is Surprisingly Popular","source":"foxnomad","summary":"14 Shares PinAmerica’s 43rd president, George W. Bush, left office with a domestic approval rating of 22% and is the only living U.S. ex-president with a current rating under 50%.\nThe first region is actually in a country where you’d expect George Dubya Bush to hardly be the most popular politician around.\nThe Kurdish Region Of Northern IraqI’ve written before about the unrecognized Kurdish autonomous region in northern Iraq and the optimism brewing there.\nBut for Georgians and those living in northern Iraq, Bush’s two terms worked out well for them.\nHave you been anywhere else where George Walker Bush was surprisingly popular – or not?","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Asia/Georgia/Tbilisi/i-t5f9GNW/0/M/P10705686970c-M.jpg"}}},{"node":{"id":"5b96248287be058327490e92","title":"Soldiers Standing Guard Outside The Carthage National Museum In Tunisia","source":"foxnomad","summary":"In many ways this photograph sums up the state of Tunisia as I found it weeks after the Bardo Museum attacks: on edge and deserted of tourists.\nThere were more soldiers than visitors are almost every famous tourist spot; which may have you wondering is traveling to Tunisia safe?","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Africa/Tunisia/Carthage/i-W3JPP4B/0/1024x1024/P1400173-2850x2138.jpg"}}},{"node":{"id":"5b96248087be058327490e8e","title":"Girlfriend In French","source":"foxnomad","summary":"Seems that “Hey Hey You You” is the universal language.\nIs she singing all of these?\nThere’s more…In German:In Chinese:In Italian:In Japanese:Spanish Version with Strange Soap Opera As Music VideoFinally, in Portuguese:","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96247f87be058327490e8c","title":"Monks Do Get Into Fights","source":"foxnomad","summary":"What To Expect At Your First Creation Las Vegas Star Trek ConventionRoad Tested!\nIs The DJI Mavic Pro Still Worth Buying In 2018?","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2007/04/_42825937_monksap4161.jpg"}}},{"node":{"id":"5b96247f87be058327490e8b","title":"Penguin Ecotourism","source":"foxnomad","summary":"For about $2,700 you can fly to South Africa and join the Earthwatch Institute protect the world’s third largest penguin colony.\nKeep in mind that this is not you typical do-nothing-but-eat-and-chill vacation.?\nOn free days visit Cape Town and sightsee.\nWhen you return you’ll only be a 15 minute walk away from those cuties in the picture.\nEcotourism is not limited to birds if reptiles are more your thing.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96247e87be058327490e89","title":"Howard Stern TV Free Online Preview Today Until April 29","source":"foxnomad","summary":"Those of you overseas and in the US wanting a look at the Howard Stern show uncensored (which means naked lesbians, naked midgets, and naked lesbians) you can do so until the 29th of April.\nThe show will stream for free in hopes that you will sign up for the normally pay-per-view service.\nDon’t forget how easy it is to get free TV on the Internet.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2007/04/65498867_6cc75f77791.jpg"}}},{"node":{"id":"5b96247c87be058327490e87","title":"How To Get Travel Insurance Coverage For Adventure Sports","source":"foxnomad","summary":"While it’s not surprising that run-of-the-mill travel insurance won’t cover a holiday in Syria (here’s how to get travel insurance coverage when traveling to risky locations) you might not be aware that common activities like skiing, generally aren’t covered either.\nFor those of you who like to stay in shape when traveling, it’s important to get the proper travel insurance coverage; since it is you who is most likely to need it in the first place.\nSome Big IfsIt’s important to note where you’ll be, say, hiking, can determine if your travel insurance covers you – even if you’ve purchased adventure sports coverage.\nStart by calling your current medical insurance provider, then your regular travel insurance company.\nAlthough a little pricier than electronics coverage – adventure sports travel insurance is a lot less expensive than paying for an twisted ankle mountain biking or fractured wrist during an afternoon of canoeing.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-HQZtHSR/0/690x690/i-HQZtHSR.jpg"}}},{"node":{"id":"5b96247687be058327490e7e","title":"Reminder: Live Chat Later Today Right Here And All About Spain","source":"foxnomad","summary":"I would like to let you know about my second live chat on foXnoMad coming up later today (Thursday December 1rst) from 10am-1pm US EST.\nI’m very excited to have Daniel Galan and Arantxa Ros to chat with us about all things Spain.\nThat’s your chance to drop in and ask about your Spanish travel fantasies with these two experts I both met in Spain over the last year.\nCome to any page on this site during the chat hours and there will be a gigantic banner atop where you can find the chat.\nAs for Arantxa in Tenerife and Daniel in Granada, I’m not sure what they’ll be drinking but can guarantee we’ll find out.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2011/11/istanbul-lol-cat.jpg"}}},{"node":{"id":"5b96247587be058327490e7c","title":"Granada Cathedral In Granada, Spain Review","source":"foxnomad","summary":"It’s easy to get church overload in Granada but if you had to limit yourself to a handful, the Granada Cathedral should be one of them.\nThe interior is intricate but the area it covers is what makes it such an impressive sight.\nThe Cathedral is only a few Euro to enter and will take about 30 minutes to see.\nView Spain in a larger mapFor more of what I’ve written about Spain, including my photo galleries, check out my Spain travel information page.\nAny Questions?","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96247587be058327490e7a","title":"The Cheesiest Travel Photo Contest – Entry #7","source":"foxnomad","summary":"This is the first of 9 entries in The Cheesiest Travel Photo Contest that I’ll be posting through Wednesday.\nCheck out entry #1, entry #2, entry#3, entry #4, entry #5, and entry #6 and vote for your favorites beginning next Monday, August 24th.\n“Woo, says Stevo, in a self-portrait at the Forbidden City in Beijing, China”Submitted by: Steve (Asian Ramblings)One random subscriber will be picked and given a prize also.\nThe easiest way to enter is to sign up for daily email updates below or follow me on Twitter.\nReceive email updates:","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/08/Stevo-in-the-forbidden-city-sml1.jpg"}}},{"node":{"id":"5b96247487be058327490e78","title":"Rojo Bar In Granada, Spain Review","source":"foxnomad","summary":"Modern tapas that are a fusion of both Spanish traditional dishes with a worldly flare.\nThese are some of the best tapas to be found in Granada and to make it even more enticing you’ll get one free with each beer.\nView Spain in a larger mapFor more of what I’ve written about Spain, including my photo galleries, check out my Spain travel information page.\nAny Questions?\nFeel free to contact me.","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96247387be058327490e76","title":"Bar La Blanca Paloma In Granada, Spain Review","source":"foxnomad","summary":"The fried fish – school shark, octopus, and others (yes, octopus is not a fish I know) – is excellent here and what Bar La Blanca Paloma is best known for.\nThis classy place is a favorite among locals and has excellent prices.\nView Spain in a larger mapFor more of what I’ve written about Spain, including my photo galleries, check out my Spain travel information page.\nAny Questions?\nFeel free to contact me.","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96247387be058327490e73","title":"Enter To Win A Nook Tablet With Every $10 Donation To Passports With A Purpose","source":"foxnomad","summary":"Every $10 donation is US-tax deductible and if you enter before December 16th, you can pick the prize of your choosing.\nThis year I’m offering up a Nook Tablet, one of my favorite new gadgets on the market.\nWhy The Nook Tablet?\nThe Nook Tablet is a personal favorite of mine; and an eReader can lighten your backpack by letting you carry around a 400 gram library on your shoulder.\nTo be a part of this year’s effort and enter to win a Nook Tablet, or one of the other prizes, donate here.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2011/11/nook-tablet.jpg"}}},{"node":{"id":"5b96247387be058327490e72","title":"Sensual Love Top","source":"foxnomad","summary":"The “sensual love” picture (at the top of this page) came from Peaceluvbug‘s recent trip to Spain.\n“Sensual Love” was an upscale sex shop on Las Ramblas in Barcelona.\nIt was pretty close to our hostel and had many kinky funny things in the window… but very classy.\nI wonder if the inside was kinkier…but I guess we’ll never know since she didn’t go in.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96247187be058327490e6f","title":"Can You Count Faster Than A Chimp?","source":"foxnomad","summary":"We can “see” a handful of things and without knowing how many there are instantly – this is called subitizing.\nThe other way of counting is enumerating – counting up individual numbers.\nChimpanzees usually start at six.\nTest your subtizing skills against a chimp to fail like I did.\nWe have a lot to learn from the other non-human great apes, let’s hope we don’t kill them all.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96246f87be058327490e6a","title":"D’olier Chambers Dublin, Ireland","source":"foxnomad","summary":"Dublin is a very photogenic city although I couldn’t do it justice.\nI was in town attending the Hoscars but arrived a few days early to explore.\nThe streets tend to curve and names change from one block to the next…plus I’m hopelessly terrible with directions.\nD’olier Chambers was built in 1891 by a tobacco company but now houses the Mona Lisa Restaurant on the first floor.\nI’ll be writing more about Dublin next week, which is a fun city to wander around; until then you can see some more of my photos from Dublin here.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Europe/Ireland/Dublin/i-TRLpxmF/0/O/CIMG2649.jpg"}}},{"node":{"id":"5b96246e87be058327490e69","title":"Travel Blog Success Launched This Week","source":"foxnomad","summary":"On Monday he launched Travel Blog Success, a community for those looking to improve their travel blogs and potentially use them to earn money for traveling.\nTravel Blog Success is a membership site that consists of 12 core lessons ranging from creating a travel blog, the technical details of maintaining a website, and managing a travel blog while you actually travel.\nWho Is Travel Blog Success For?\nDave doesn’t promise that you’ll triple your readership or make thousands of dollars but Travel Blog Success can help your travel blog beyond more than just the 12 core lessons.\nYou can read more on my full review of Travel Blog Success over on my other blog, Travel Blog Advice.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2010/02/travel-blog-success.jpg"}}},{"node":{"id":"5b96246e87be058327490e67","title":"Photo Essay: Ecuador’s Crazy New Year’s Celebration","source":"foxnomad","summary":"Burning the viejos at mid-nightThis year I spent New Year’s in Ecuador and found a new celebration and tradition for bringing it in.\nOne can’t walk down the street in any major city on New Year’s night without having a pocket full of change.\nThey guys (I mean ladies) even go as far as setting up roadblocks to stop traffic and they stop everyone.\nA City AblazeFireworks start blazing at 11:00 pm and don’t stop until about 1:30 am.\nIf you’re ever near Ecuador during the Christmas holidays, make sure you stop off and try to stay for the New Year’s celebration.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2010/02/18665_267717975784_147277205784_3801613_4513095_n.jpg"}}},{"node":{"id":"5b96246d87be058327490e65","title":"Rating Dublin’s Popular Tourist Attractions","source":"foxnomad","summary":"The Guinness StorehouseThis isn’t the building where they brew the Guinness but it is Ireland’s most popular tourist destination.\nIt costs about 6 Euro to get in and you’ll get to wander around on your own through the museum.\nThe Temple BarThere is no cover charge to get into this famous Dublin pub, located at the corner of Temple Lane.\nTrinity CollegeCollege campuses can make for good, free, travel opportunities in many cities and Trinity College is in the middle of Dublin a good location to stop by.\nI don’t think any of these places will disappoint particularly if you’ve got a slight inclination toward any of them.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/Europe/Ireland/Dublin/i-kTSWs5K/0/M/CIMG2597-M.jpg"}}},{"node":{"id":"5b96246c87be058327490e64","title":"The Best Comments Of The Month: January 2010","source":"foxnomad","summary":"I’d like to thank all of you for commenting and bringing each of my posts to life.\nThese are just some of the best comments of the past month.\nBarbara left a ton of useful information about planning an RTW that you should read if you are going to travel around the world.\nAlthough I personally loved it, I agree with Akila and can see how the Guinness Storehouse wouldn’t make this list.\nGo for the smaller hostels says Mark H.I appreciate your comments, thoughts, and insights on each post, thank you!","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2010/02/cat-on-keyboard.jpg"}}},{"node":{"id":"5b96246b87be058327490e61","title":"Will Obama Improve The Travel Industry? [POLL]","source":"foxnomad","summary":"Next Tuesday, Barack Obama will be sworn in as the next president.\nI’d like to find out from you travelers, do you think that an Obama administration can help fix problems within the US travel industry?\nImproved public transportation, an outdated air traffic control system, and a passenger bill of rights are some of the issues you identified in a poll back in November.\nOn Inauguration Day I’ll tackle the most pressing issues within the travel industry, how to fix them, and whether an Obama administration is likely to do so.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-5cdb7xc/0/O/i-5cdb7xc.jpg"}}},{"node":{"id":"5b96246a87be058327490e60","title":"Monasterio Chill Out In Granada, Spain Review","source":"foxnomad","summary":"An amazing view of the monastery to go along with a few beers (which come with tapas after 8pm) at this cafe which sits above a hotel on the lower floors.\nView Spain in a larger mapFor more of what I’ve written about Spain, including my photo galleries, check out my Spain travel information page.\nAny Questions?\nFeel free to contact me.","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96246787be058327490e5d","title":"How To Get To The Top Of Tirana, Albania’s Mount Dajti By Cable Car","source":"foxnomad","summary":"You can get to the top of Mount Dajti, just outside of Tirana, by taking the Dajti Ekspress, the longest cable car in the Balkans.\nHere are the best ways to get to Mount Dajti.\nDajti Cable Car Hours – From 10am to 7pm (winter); extended hours to 10pm during the summer months.\nThe trip from the bus station to nearby the cable car station is about 25 minutes.\nUnless you’re arriving with a bicycle, get a round-trip ticket up to the top by taking the 3.6 kilometer (2.2 mile) Dajti Ekspres cable car.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/02/P1420922-X2.jpeg"}}},{"node":{"id":"5b96246687be058327490e5a","title":"Has The Global Economic Crisis Effected Your Travel Plans? [POLL]","source":"foxnomad","summary":"In planning for an upcoming post on unconventional ways to fund your travels, it recently struck me – there is a global economic crisis going on.\nMoney, and how to squeeze more out of it for your travels, has been on my mind lately.\nI want to know, has the global economy effected your travel plans?\nFeel free to add to the poll by sharing your thoughts in the comments.","info":{"author":"Anil Polat","top_img":"https://photos.foxnomad.com/photos/i-vfGW23X/0/O/i-vfGW23X.jpg"}}},{"node":{"id":"5b96246687be058327490e59","title":"Le Jardin – Oberoi Hotel, Bangalore","source":"foxnomad","summary":"I was lucky enough to enjoy some food at the Le Jardin Restaurant inside of the Oberoi hotel in Bangalore recently.\nThe courses were decent but not particularly tasty, especially considering the high cost of the food there.\nSome General Guidelines To Eating Indian Street FoodStick to well-cooked foods that are either barbecued or fried.\nWatch where others are eating, it’s usually a good indicator of the quality of food.\nHere’s an example of a vendor selling samosas at one of New Delhi’s oldest markets, Chandni Chowk.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2009/01/Le+Jardin_+Oberoi+Bangalore+_4_.jpg"}}},{"node":{"id":"5b96246587be058327490e58","title":"Is It Safe To Travel To Turkey? [Updated: Jan. 2017]","source":"foxnomad","summary":"23 Shares PinAround a year ago I originally wrote whether it was still safe to travel to Turkey, a question I get regularly in my inbox.\nRecently, it has moved to Turkey’s travel capital, Istanbul.\nBut you have to be prepared when you travel to Turkey, that something bad might happen during your stay there.\nMillions of tourists a month are still visiting Turkey, having wonderful trips, and seeing a truly remarkable travel destination.\nThe question isn’t whether Turkey is safe, but whether or not traveling there makes you comfortable.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/01/P1260305-X2.jpeg"}}},{"node":{"id":"5b96246487be058327490e55","title":"Reader Stina Wins $25 Email Subscription Contest","source":"foxnomad","summary":"Congratulations to Stina who won $25 today.\nStina was the 10th person to sign up for foXnoMad email updates since I announced the Inspire Me Africa photo contest last week.\nAs part of the Inspire Me Africa photo contest, all RSS and email subscribers are eligible to win one of the 4 prizes in December.\nThe contest begins on November 3, 2008 – I haven’t released the full details yet, but here is more information if you’re curious.\nYou can sign up for email updates below.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2008/10/winner1.jpg"}}},{"node":{"id":"5b96246387be058327490e54","title":"Abaco In Granada, Spain Review","source":"foxnomad","summary":"This tea house is quite relaxing and comfortably designed but it’s really the views of Granada that make it special.\nThe balcony only holds about 3 tables so you’re best bet is to come around slower times in the mid-to-late afternoon.\nView Spain in a larger mapFor more of what I’ve written about Spain, including my photo galleries, check out my Spain travel information page.\nAny Questions?\nFeel free to contact me.","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96246387be058327490e53","title":"Buy Select Cell Phones Without Contract Obligations At Grakomindo","source":"foxnomad","summary":"One of Indonesia’s largest mobile phone retailers offers a large selection of cell phones for international customers, without contract obligations.\nCustomers in the US can order hard to find phones from Grakomindo and still choose from most carriers.\nGrakomindo is a sharp and well organized website that features a huge selection of Nokia, Motorola, and Samsung (among other) phones.\nGrakomindo’s prices are typically much higher than buying cell phones tied to a plan (for you US customers) and you’ll have to decide if the trade-off for a select phone is worth it.\nGrakomindo offers a 90 day return policy, minus a 5% restocking fee on all orders.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2008/10/grakomindo1.gif"}}},{"node":{"id":"5b96246287be058327490e51","title":"foXnoMad Reviewed By Travel Blissful Editor Erica Johansson","source":"foxnomad","summary":"Founder and editor of Travel Blissful, Erica Johansson was kind enough to write a review of foXnoMad yesterday.\nI’d like to welcome all of you Travel Blissful readers who may be new to this site.\nAbout foXnoMad the BlogThe aim of foXnoMad is to help you travel smarter.\nI try to write about the travel topics that people who are passionate about travel want to read about.\nReceive email updates:–I’d like to thank Erica, who writes one of my favorite travel blogs, Travel Blissful, for reviewing foXnoMad.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2008/10/aboutme_big.jpg"}}},{"node":{"id":"5b96246187be058327490e4f","title":"Gilbert Arenas Launches Official Store","source":"foxnomad","summary":"What To Expect At Your First Creation Las Vegas Star Trek ConventionRoad Tested!\nIs The DJI Mavic Pro Still Worth Buying In 2018?","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96245e87be058327490e4b","title":"Check Airline Sites For The Best Deals","source":"foxnomad","summary":"Next time you’re looking for a deal on a flight, make sure to check out the ‘deals’ page of airlines flying to your destination.\nAirlines are increasingly keeping their deals off of popular online travel agents such as Kayak and FareCompare.\nIf the airlines can skip the middleman, not only do they save the commission expenses, but they build consumer loyalty and drive traffic to their sites.\nWhen you are set on getting a deal, install Yapta to get automatic alerts when tickets fall below your desired price and check Airfarewatchdog.\nAgents from the site check all of the airlines’ sites manually and post the prices and details of each deal.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96245d87be058327490e49","title":"French Tampax Ad","source":"foxnomad","summary":"What To Expect At Your First Creation Las Vegas Star Trek ConventionRoad Tested!\nIs The DJI Mavic Pro Still Worth Buying In 2018?","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2007/12/tampaxcompak1.jpg"}}},{"node":{"id":"5b96245b87be058327490e43","title":"Unconventional Ways To Raise Funds For Your Travels","source":"foxnomad","summary":"Before you cut your own plans however, consider the following unconventional ways to fund your travels.\nI prefer Half.com, which makes it easy to sell books, CDs, and DVDs and reimburses you for most shipping costs.\nI prefer Half.com, which makes it easy to sell books, CDs, and DVDs and reimburses you for most shipping costs.\nGrab Extra Change From Toll Booths – Chances are you are missing the ‘rejects’ coin return below most toll booths.\n– Chances are you are missing the ‘rejects’ coin return below most toll booths.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2008/10/couch-change2.jpg"}}},{"node":{"id":"5b96245687be058327490e39","title":"The Cheesiest Travel Photo Contest – Entry #9","source":"foxnomad","summary":"This is the last of 9 entries in The Cheesiest Travel Photo Contest that I’ll be posting through Wednesday.\nCheck out entry #1, entry #2, entry#3, entry #4, entry #5, entry #6, entry #7, and entry #8 and vote for your favorites beginning next Monday, August 24th.\n“Rare documentation of the elusive albino sea unicorn, found basking on the beach in Mazatlan, Mexico”Submitted by: RyanOne random subscriber will be picked and given a prize also.\nThe easiest way to enter is to sign up for daily email updates below or follow me on Twitter.\nReceive email updates:","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2009/08/IMG_04091.jpg"}}},{"node":{"id":"5b96245487be058327490e35","title":"Weeks Before The Crowds In Oludeniz On Turkey’s Mediterranean Coast","source":"foxnomad","summary":"You can actually see the edge of the Blue Lagoon at the far end of the beach in the photo above but the best views are from the air.\nThere’s a bit of confusion online about the exact location of Oludeniz – and what sea it’s on.\nBoth Wikipedia and Google Maps incorrectly place Oludeniz on the Aegean Sea; close but not quite.\nMake no mistake about it, Oludeniz, which means “dead sea” in Turkish, is on the Mediterranean.\nThat trip helped what had been a dismal set of pictures previously, most of which you can see in my Oludeniz album here.","info":{"author":"Anil Polat","top_img":"https://www.foxnomad.com/wp-content/uploads/2011/07/CIMG0464.jpg"}}},{"node":{"id":"5b96245387be058327490e33","title":"Newly Discovered Travel Blogs","source":"foxnomad","summary":"In the past 2 months I’ve met a flurry of new travel bloggers and discovered a number of great travel blogs.\nAdmirable India – Written by Maneesh, a jack of all trades who travels out of his home base in Bangalore, India.\nBig Travel Web – Chris, 28, a travel enthusiast London, UK who writes sharing advice and tips on travel to Latin America.\nClearly Enlight – Shawn left Santa Cruz, California in 2007 to travel the world for the next 5 to 7 years.\nWritten by Priyank, a fresh but thorough traveler who writes about his travels through India, Israel, and Peru, among others.","info":{"author":"Anil Polat","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}},{"node":{"id":"5b96245287be058327490e32","title":"La Cueva In Granada, Spain Review","source":"foxnomad","summary":"One of my favorite places to eat in Granada as the food is fairly authentic, of high quality, and not expensive.\nA good time to visit is during lunch (3pm or so in Spain) and order plato Aapujarreno, a dish of sausage, eggs, and blood pudding.\nThe portions are quite large so go east your first time around.\nView Spain in a larger mapFor more of what I’ve written about Spain, including my photo galleries, check out my Spain travel information page.\nAny Questions?","info":{"author":"","top_img":"https://foxnomad.com/wp-content/uploads/2017/10/foxnomad_logo-2.png"}}}]}},"pageContext":{"source":"foxnomad","alias":"hobby","label":"爱好体验"}}