{"data":{"mongodbDatabaseArticles":{"id":"5b95eabc87be05832748ffcc","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/madagascarpoverty1.jpg\" alt=\"Poverty and outdated buildings in Madagascar\"><br> Two years ago, I wrote about how <a href=\"https://www.nomadicmatt.com/travel-blogs/travel-privilege/\" target=\"_blank\" rel=\"noopener\">privileged and lucky</a> we are to be able to travel the world. No matter our circumstances, we are doing something most of the world will never get a chance to do. Most people never leave their own country, let alone their continent.</p><p>Even if we&#8217;re barely scraping two pennies together as we couchsurf the world, we&#8217;re pretty fortunate. I wrote back then (and sorry for quoting myself):</p><blockquote><p>In the &#8220;quit your job to travel the world&#8221; cheerleading that happens so often on travel websites (including this one), we often forget that it&#8217;s not easy for everyone.</p><p>There are those for whom no mindset change, spending cuts, or budget tips will help them travel &#8212; those who are too sick, have parents or children to care for, face great debt, or work three jobs just to make rent.</p><p>After all, 2.8 billion people &#8212; nearly 40% of the world&#8217;s population &#8212; survive on less than $2 USD a day! In my home country of the United States, 14% of the population is below the poverty line, 46 million people are on food stamps, many have to work two jobs to get by, and we have a trillion dollars in student debt dragging people down.</p><p>Nothing any website can say will magically make travel a reality for those people.</p><p>Those of us who do travel are a privileged few.</p></blockquote><p>That&#8217;s not to say that hard work doesn&#8217;t count, but hard work doesn&#8217;t exist in a bubble &#8212; the circumstances that create the opportunities for hard work to bear fruit are often just as important as the work itself: support from family and friends, jobs that allow for overtime, a strong currency, cheap flights, or golden passports allow you to find work overseas. All these things matter. Most of us who travel aren&#8217;t barely getting by or on social assistance nor do we wonder if we can afford the next meal.</p><p>Whether you are <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" rel=\"noopener\" target=\"_blank\">traveling the world on $10, $50, or $200 a day</a>, the simple fact you are traveling for pleasure puts you in a global minority.</p><p>We&#8217;re a privileged bunch.</p><p>Traveling constantly teaches me to appreciate just how lucky I am to do what I do. It reminds me never to forget the fact that I have access education, support systems, and resources most of the world doesn&#8217;t.<br> <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-travel-around-madagascar/\" rel=\"noopener\" target=\"_blank\">My visit to Madagascar</a> in September was my most recent reminder of this. Madagascar is a country of 20 million people that sees only 300,000 tourists a year. In Madagascar, 90% of the population lives in poverty, and 25% live in areas prone to natural disaster. Almost half of all children under five are malnourished, and the GNP is just $420 per capita (with 92% of the population living on $2 a day). Madagascar is also one of the ten countries most at risk from the effects of climate change. The country is 152 of 188 on the UN Human Development Index. Things are so bad there was actually a recent outbreak of plague. Yes, THE PLAGUE.</p><p>While I&#8217;ve seen poverty before on my travels, it&#8217;s never been as open, vivid, and widespread as what I saw in Madagascar.</p><p><img src=\"https://media.nomadicmatt.com/madagascarpoverty2.jpg\" alt=\"A father and son in Madagascar\"></p><p>My guide Patrick told me about Madagascar&#8217;s plight: corruption, environmental degradation, poverty, poor infrastructure, and a lack of education (including sex education) that has led to overpopulation, too many kids, not enough jobs, and a vicious cycle.</p><p>In Madagascar the roads have more holes than a slice of Swiss cheese, and there are too many cars and frequent accidents. Going 250km can take up to eight hours. While I was there, a bridge on the only north-south road collapsed because a truck was too heavy for it (weight station bribes are frequent). We had to wade through a river for another bus to pick us up on the other side.</p><p>And trains? The three train lines, built by the French in the 1960s, run only a few times a month, are mostly used for freight, and frequently break down. They are worse than the roads.</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/madagascar-in-pictures/\" target=\"_blank\" rel=\"noopener\">Madagascar</a> is a place where houses reminded me of early colonial US settlers: dirt and mud homes with straw roofs and one tiny window for air. I visited a few villages, and inside these homes, I immediately noticed the musty air and lack of ventilation. I thought to myself, This is how people get respiratory diseases.</p><p>It is a country where kids wear an amalgamation of whatever they can find &#8212; and more often than not, it is filled with holes.</p><p>It is a place where people live in shantytowns and on riverbanks where they also dry their clothes (and where it floods constantly during the rainy season). They fish and farm in urban areas next to factories dumping pollution.</p><p><img src=\"https://media.nomadicmatt.com/madagascarpoverty4.jpg\" alt=\"Dated buildings in Madagascar\"></p><p>It is a country where I saw people mining for sapphires in conditions so harsh it could only be described as a scene out of <a href=\"http://amzn.to/2jl4eWa\" target=\"_blank\" rel=\"noopener\">Blood Diamond</a>. This is place where the mining industry keeps people in company towns under terrible conditions simply because they know the people have no other option.</p><p>It is a place where the kind of poverty you read about became very, very real.</p><p>This is not to say I never knew this stuff existed. I&#8217;m not na&#239;ve or stupid. I read the news. I&#8217;ve been around the world. I&#8217;ve seen corruption, political turmoil, and poverty before. But it&#8217;s one thing to read about stark poverty in the news and it&#8217;s another to see it in front of you. It&#8217;s another to be confronted with it and have it confront your views.</p><p>This isn&#8217;t a situation where it&#8217;s like &#8220;Ohh, wow, it&#8217;s poverty! Let&#8217;s go take a look!&#8221;</p><p>This is one of those situations where you feel like you&#8217;re seeing for the first time.</p><p>This is one of those situations where your bubble bursts and what you see on TV and the news goes from abstract to real.</p><p>It&#8217;s become so easy nowadays to travel in your comfort zone and never come face to face with aspects of the world that may utterly change who you are and what you think. It&#8217;s easy to visit developing or developed countries, stay on the backpacker trail, and never see anything that makes us confront our privilege. It&#8217;s easy to only see what you want to see, to stare at Facebook in hostels, visit backpacker bars, take big-bus tours, fly from resort to resort, and attend cultural events designed for tourists.</p><p>If travel is meant to push you out of your <a href=\"https://www.nomadicmatt.com/travel-blogs/the-2am-principle/\" target=\"_blank\" rel=\"noopener\">comfort zone</a> and expand your mind, you need to visit places that do so. To me this is part of the beauty of travel. It forces you outside your bubble, which adds great perspective to life.</p><p><img src=\"https://media.nomadicmatt.com/madagascarpoverty8.jpg\" alt=\"A boy looking through a window\"></p><p>You realize how lucky you are to be able to travel &#8212; while getting to know how most of the world really lives. To see it, to experience it. While we argue on Facebook and debate Twitter memes, kids go to bed hungry across the world (and sadly too often in developed countries too).</p><p>This is not to say I am arguing for &#8220;poverty tourism,&#8221; but going to places so different from your own can open your mind to different cultures, lifestyles, behaviors, and income levels.</p><p>The locals in Madagascar were friendly, welcoming, and hospitable. They were genuinely curious in our conversations and appreciative of the fact we were there. They never made me feel like I didn&#8217;t belong. I loved all my interactions with people in the country and the happy smiles they had on their faces. I&#8217;m sure they would all love a little bit more fresh water, health care, food, and basic infrastructure. But it was nice to see kids playing in the streets not glued to their iphone. It was nice to remember that there&#8217;s so much beyond consumerism.</p><p>My trip to Madagascar was a deeply profound one because it pulled me out of my bubble and made me remember that&#8217;s there is stark inequality in the world and made want to do more about it.</p><p><img src=\"https://media.nomadicmatt.com/madagascarpoverty10.jpg\" alt=\"Poverty in Madagascar\"></p><p>It was a reminder to resubscribe to the Ralph Waldo Emerson school of thought:</p><blockquote><p>To laugh often and much; To win the respect of intelligent people and the affection of children; To earn the appreciation of honest critics and endure the betrayal of false friends; To appreciate beauty, to find the best in others; To leave the world a bit better, whether by a healthy child, a garden patch, or a redeemed social condition; To know even one life has breathed easier because you have lived. This is to have succeeded.</p></blockquote><p>Words without action are nothing.&#160;I must not become too selfish and I must endeavor more to give back to the places that give me so much.</p><p>So, as I end this article, I want to highlight some good local development organizations that are working to improve the living conditions in Madagascar. I donated $250 to each already.</p><ul><li><a href=\"http://www.feedbackmadagascar.org/eng/index.php\" target=\"_blank\" rel=\"noopener\">Feedback Madagascar</a> is an organization that helps to alleviate poverty by working directly with communities to recognize the relationship between poverty, environmental degradation, and poor health. It gives priority to project sites in remote areas.</li><li><a href=\"https://madagascar.co.uk/\" target=\"_blank\" rel=\"noopener\">SEED Madagascar</a> specializes in sustainable development and conservation projects in the southeastern part of Madagascar. Its projects include school building, natural resource management, environmental conservation, and more.</li><li><a href=\"http://www.madalief.nl/\" target=\"_blank\" rel=\"noopener\">Madalief</a> is a nonprofit organization run by a small group in the Netherlands, and it aims to give poor children in Madagascar a better future. Madalief also helps offer employment to locals on the project site, like at its eco-social hotel in Ambositra (which I stayed in).</li><li><a href=\"https://www.hopeformadagascar.org/\" target=\"_blank\" rel=\"noopener\">Hope For Madagascar</a> &#8211; With a focus on disadvantaged children and women, Hope For Madagascar builds and repairs schools and offers scholarships to children in need. It also works to improve village self-sufficiency through clean water and permaculture projects.</li><li><a href=\"https://www.reefdoctor.org/\" target=\"_blank\" rel=\"noopener\">Reef Doctor</a> &#8211; This non-profit has been implementing conservation projects in southwest Madagascar for 15 years. Reef Doctor works to restore and preserve vulnerable habitats and overexploited resources, while also creating projects to alleviate poverty in Madagascar.</li></ul><p>In a country where a meal is less than a dollar, corruption is rife, and higher education is uncommon, a little can go a very, very long way.</p><p>I encourage you to seek out destinations that make you rethink your life; to find organizations that help others and the environment when you travel; to get off the tourist trail, expand your mind, open your heart, and, as Gandhi said, be the change we wish to see the in the world.</p><p>(And visit Madagascar. It&#8217;s a wonderful place. See my previous articles fawning over it.)</p></div>","title":"A Journey Through Madagascar: Notes on the Privilege of Travel"}},"pageContext":{"id":"5b95eabc87be05832748ffcc"}}