{"data":{"mongodbDatabaseArticles":{"id":"5b921d1387be0571ac1b04ef","content":"<div><p>Now that he&#8217;s a big deal, Warren Buffett owns sprawling insurance companies that lobby government to keep the estate tax in effect, all so they can sell insurance against it.</p>\n<p>In case the irony is lost on you, Warren Buffett profits from his insurance companies selling a service to business owners who don&#8217;t want to end up like the Omaha family he ripped off years ago.</p>\n<p>Then there&#8217;s the notion of borders as a way to keep foreign workers out. If an Indian computer geek is the best guy or girl for a tech job, why should companies like Microsoft face a shortage of H1B visas to get the talent they need&#8230; all while smaller companies get left out in the cold altogether?</p>\n<p>On a more simple level, why shouldn&#8217;t local fast food workers compete with Central American immigrants? If the much ballyhooed American workforce is as strong as its proponents say it is, the Mexican workers won&#8217;t stand a chance.</p>\n<p>Every day, individuals and businesses around the world make decisions based on self-interest. That self-interest makes sure we have the most amount of money in our pockets and the best chance for profit in the future.</p>\n<p>For me, that has included hiring higher-priced Westerners to fill several positions at our companies recently. Sure, I could have <a title=\"How to hire a virtual assistant: 3 tips to increase productivity\" href=\"http://nomadcapitalist.com/2013/11/25/how-to-hire-a-virtual-assistant-3-tips-increase-productivity/\">trained a Filipino virtual assistant</a> to do the job, but I preferred paying someone in North America five times the salary to not have to bother.</p>\n<p>Such is capitalism at work.</p>\n<p>And the reality is that capitalism no longer exists in its true form in any Western country. Heck, it doesn&#8217;t exist in any mutated form.</p>\n<p>For as much as the West and its politicians claim to stand behind capitalism, Western countries are some of the least capitalistic on earth.</p>\n<p>Perhaps politicians in The Land of the Free are worried about being the victims of some kind of modern McCarthyism, although even that trend is changing.</p>\n<p>Today, politicians like Elizabeth Warren denounce capitalism, while Barack Obama tells business owners &#8220;you didn&#8217;t build that&#8221;.</p>\n<p>While anti-immigrant parties across Europe are gaining steam, anti-capitalist Green and even Communist parties hold decent positions in numerous national legislatures. Countries like Portugal and even Austria have <a href=\"https://en.wikipedia.org/wiki/Category:Communist_parties_in_Portugal\" target=\"_blank\" rel=\"noopener\">numerous communist parties</a>.</p>\n<p>Hating capitalism has become more and more popular in the West, and it is having an impact on the culture.</p>\n<p>In Spain, for instance, not only is it difficult for most youth to find a job, but many young people are angry at even having to find one. The anti-capitalist culture in much of Europe has indoctrinated the next generation to think that working for &#8220;the man&#8221; is unethical.</p>\n<p>While I&#8217;m all for starting a business and going my own way, there is a better way to do it, as I&#8217;ll share in a moment.</p>\n<p>Meanwhile, everything from Occupy Wall Street rallies to socialist politicians demanding that the &#8220;evil rich pay their fair share&#8221; has set people off against the free market.</p>\n<h2>Capitalist countries where the free market is still alive and respected</h2>\n<p>Yet, capitalism is still thriving in other parts of the world. In fact, you&#8217;ll never believe which countries are the most capitalist. It turns out that the most capitalist countries are also some of the largest homes of what I call &#8220;forced entrepreneurs&#8221;; people who don&#8217;t work for the man because they can&#8217;t.</p>\n<p>A recent survey of 44 countries around the world revealed that <strong>Vietnam</strong> has the highest levels of support for capitalism and the free market, with 95% of respondents speaking highly of the system.</p>\n<p>Population-rich <strong>Bangladesh</strong>, one of the poorest countries in South Asia and the world, came in <a href=\"https://www.forbes.com/sites/alyssaayres/2014/10/28/bangladesh-capitalist-haven/\" target=\"_blank\" rel=\"noopener\">second place</a> with huge support of the free market economy, followed by <strong>South Korea</strong>, <strong>China</strong>, and <strong>Ghana</strong>.</p>\n<p>Respondents to the survey suggested overwhelmingly that open trade creates jobs and leads to better wages. Those surveyed in these emerging markets indicated that foreign investment is a good thing, not something to be wary of.</p>\n<p>Some of the world&#8217;s poorest people believe that capitalism and free markets is what will drive them to prosperity. They realize that it will not happen overnight, but that favoring new jobs and new investment will ultimately raise them out of poverty and create better conditions in their countries.</p>\n<p>These countries understand what Canada, Hungary, and the United States do not: shutting down pathways for the wealthy to invest in your country leads to falling markets and being left behind.</p>\n<p>Of course, some will argue that the United States and other wealthy countries do not have to kowtow to foreign capital the way a poor country has to. I disagree.</p>\n<p>After a country spits on capitalism, it doesn&#8217;t take long for the negative effects to kick in. Eventually, <a title=\"The Paris Hilton Effect: what happens when countries go bankrupt\" href=\"http://nomadcapitalist.com/2014/05/23/paris-hilton-effect-happens-countries-go-bankrupt/\">your country looks like Paris Hilton</a>, wondering why it&#8217;s so rich and too stupid to care.</p>\n<p>For the time being, there will always be a certain amount of investment into countries like the United States. The rich of the emerging world still dream of living in a &#8220;rich country&#8221; and haven&#8217;t figured out that doing so will subject them to <a title=\"FATCA and new IRS penalties on offshore accounts\" href=\"http://nomadcapitalist.com/2014/06/10/fatca-new-irs-penalties-offshore-accounts/\">a draconian tax regime</a> best avoided.</p>\n<p>However, some of the world&#8217;s most substantial investments are going to countries you would never think are capitalist.</p>\n<p>I for one would rather invest in Vietnam, where the culture is very pro-capitalist, even while the government maintains a faux &#8220;Socialist&#8221; banner.</p>\n<p>In fact, places like China may claim to be communist but are practically runaway capitalism. An EU diplomat I sat next to on a plane several years ago lambasted Mainland China as &#8220;Republican politicians run amok&#8221;.</p>\n<p>As I reported from Nicaragua almost a year ago, the old school communists may not want to shed their titles, but most of them have seen the light. <a title=\"Why the communists are capitalists now\" href=\"http://nomadcapitalist.com/2014/02/13/communists-capitalists-now/\">The communists are capitalists now.</a></p>\n<p>Even the emerging world politicians who still wish to run a corrupt government realize that money coming in and investment being made is better than stealing all of the country&#8217;s farmland and putting people in work camps.</p>\n<p>Politicians in the Western world pay lip service to capitalism in a way that politicians here in Asia and the emerging Americas don&#8217;t. For these Western politicians, it&#8217;s just that: lip service.</p>\n<p>If you run a business, much of Western society is opposed to you.</p>\n<p>They are offended by your ability to profit while their wages stagnate.</p>\n<p>They view you as the oppressor.</p>\n<p>They wish heavy regulatory burdens and other punitive actions on you.</p>\n<p>They want you to bear the brunt of a bankrupt nations&#8217; increasingly desperate tax code.</p>\n<p>Western nations have gotten away with saying one thing and doing another. Like saying they are for private property rights, then using <a title=\"Back door expropriation: how to lose your home (and go to jail)\" href=\"http://nomadcapitalist.com/2014/08/20/expropriation-easy-way-to-lose-your-home/\">de facto expropriation</a> by raising <a title=\"Countries with no property taxes where you REALLY own your home\" href=\"http://nomadcapitalist.com/2014/05/27/countries-with-no-property-taxes-really-home/\">property taxes</a> eight-fold.</p>\n<p>Or by <a title=\"Top 5: States and countries with the highest capital gains taxes\" href=\"http://nomadcapitalist.com/2014/03/30/top-5-states-countries-highest-capital-gains-taxes/\">raising capital gains taxes</a> while claiming to welcome investment.</p>\n<p>The world&#8217;s most capitalist countries are the ones you&#8217;d least expect. They are the ones where people understand through life&#8217;s lessons that they are owed nothing and that hard work can create opportunity.</p>\n<p>These capitalist countries are the ones you ought to seek out. Bangladesh, <strong>India</strong> and Vietnam are vying to become <a title=\"Where is the next Singapore? How to find the next boom market\" href=\"http://nomadcapitalist.com/2014/01/08/next-singapore-find-next-boom-market/\">the next <strong>Singapore</strong></a> or Hong Kong.</p>\n<p>South Korea has <a title=\"How to get South Korea residency and citizenship\" href=\"http://nomadcapitalist.com/2014/01/06/get-south-korea-residency-passport/\">seen this transformation</a> in this lifetime. So have countries <a href=\"http://nomadcapitalist.com/2014/12/03/georgia-one-capitalist-countries-world/\" target=\"_blank\" rel=\"noopener\">like <strong>Georgia</strong></a>.</p>\n<p>The next place to see such a remarkable Singapore or Korea-like transformation will be one of these truly capitalist countries that knows, as I say, where their bread is buttered.</p>\n<p>Meanwhile, the clueless West will continue to disintegrate and become poorer and poorer as they abandon the very principles that made them rich so long ago.</p>\n</div>","title":"The world’s most capitalist countries"}},"pageContext":{"id":"5b921d1387be0571ac1b04ef"}}