{"data":{"mongodbDatabaseArticles":{"id":"5b93830587be056953db7e1a","content":"<div><h1 name=\"e3c5\" id=\"e3c5\" class=\"graf graf--h3 graf--leading graf--title\">Why You Shouldn&#8217;t Accept My Invitation to Join Me on Remote.com (Because I Didn&#8217;t Send&#160;It)</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*VoOcdjzPNojAaHrGOJpGJg.png\"><p name=\"5954\" id=\"5954\" class=\"graf graf--p graf-after--figure\">This morning I found an email in my inbox from a journalist I respect, but don&#8217;t know well. Join me on Remote.com, was the subject line. In it, her picture (from Facebook), a short bio and then: Marie invites you to connect on Remote.com.</p><p name=\"451d\" id=\"451d\" class=\"graf graf--p graf-after--p\">I hadn&#8217;t heard of it, and because it came from someone I admire, I clicked. The easiest way to explore was to simply accept the invitation, which felt harmless enough&#8212;I&#8217;ve joined many a thing through my Facebook profile, and always simply deactivated them later if necessary.</p><p name=\"239a\" id=\"239a\" class=\"graf graf--p graf-after--p\">The next question, too, seemed innocuous. Did I want to &#8220;connect&#8221; my Google account? Well, a service like Remote.com, which claims to be a community for remote and freelance work, is only useful if people you would want to work for or with are using it. If I connected my Google account, I thought, I&#8217;d be able to see which of the people I already knew were using the service&#8212;as when Linked In suggests connections. I was familiar with the way Linked In works, which is very cautious&#8212;it&#8217;s a network that&#8217;s very aware that users might not want their employers to suddenly notice them, say, beefing up their resume.</p><p name=\"5fb6\" id=\"5fb6\" class=\"graf graf--p graf-after--p\">When connecting my Google account didn&#8217;t lead to a list of people I might want to connect with on Remote.com, I explored a little more, filled in the profile, lost interest and signed off.</p><p name=\"121f\" id=\"121f\" class=\"graf graf--p graf-after--p\">You can probably guess what happened next. Texts, from my two closest friends. Accepting this Remote.com thing, said one. What&#8217;s this Remote thing, asked another. My email started to explode as well. What was this? DId I recommend it? Savvier, or at least more awake people than I was were trying to check in with me before they clicked, but I was also getting many, many notifications that my contacts had &#8220;accepted my invitation&#8221;&#8212;an invitation I wasn&#8217;t aware I&#8217;d sent.</p><p name=\"6fef\" id=\"6fef\" class=\"graf graf--p graf-after--p\">Remote.com had accessed my contacts and emailed every single one of them.</p><p name=\"2960\" id=\"2960\" class=\"graf graf--p graf-after--p\">I didn&#8217;t approve that&#8212;would never have approved that. I&#8217;ve had other networks or applications request permission to do that, in some cases every time you sign in, but never granted it, for obvious reasons.</p><p name=\"71ee\" id=\"71ee\" class=\"graf graf--p graf-after--p\">By not revealing what &#8220;connecting&#8221; your Google account will do, Remote.com violates any trust it could hope to have with users. It&#8217;s certainly lost mine, and at this point I&#8217;m struggling to figure out how to delete my account. (I&#8217;ve also tried to complain about their use of my email account through Twitter and through their customer service, but I&#8217;ve had no response.) Far from inviting people to join me there, I want to invite my connections to join me in boycotting it&#8212;but interestingly, I can&#8217;t. Google may allow Remote.com to send an indentical spam message to all of my contacts, but if I attempted to do the same, it would cut me off quickly. I&#8217;d find myself without any ability to use the account at all.</p><p name=\"b898\" id=\"b898\" class=\"graf graf--p graf-after--p\">I made a mistake here, and I don&#8217;t deny it. I assumed Remote.com would follow the same conventions I&#8217;ve come to count on from other networks, and would request permission before making use of the info it could access through Google. I also assumed that Google actively required it to request that permission. And, yes, I know what happens when you &#8220;assume&#8221;. (For those of you who didn&#8217;t grow up with my mother, you make an &#8220;ass&#8221; out of &#8220;u&#8221; and &#8220;me&#8221;.) The fault is mine, and so is the embarassment.</p><p name=\"8cf6\" id=\"8cf6\" class=\"graf graf--p graf-after--p graf--trailing\">But the fault is also with Remote.com and its founders, employees and investors. We all, in a connected world, owe each other a duty of not taking advantage of those connections. Remote.com is wrong to access the email accounts of users in this way, and Google is wrong to permit it. I&#8217;m ashamed of my mistake, but in their case, it&#8217;s their intentions that are shameful.</p></div>","title":"Why You Shouldn’t Accept My Invitation to Join Me on Remote.com (Because I Didn’t Send It)"}},"pageContext":{"id":"5b93830587be056953db7e1a"}}