{"data":{"mongodbDatabaseArticles":{"id":"5b95ea3287be05832748ff8b","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/thaibeach1.jpg\" alt=\"Ruins and a statue in Sukkothai, Thailand\"><br> Thailand can be as expensive or inexpensive a country to visit as you want it to be. This is a country where you can stay in $3 USD rooms or $1,000 USD resorts. Street food for pennies or gourmet dinners for hundreds. Thailand really runs the gamut.</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/travel-guide-anxiety-when-your-friends-let-you-plan-their-trip/\">When my friends came to visit</a> last December, they budgeted $1,700 USD for their three-week trip. &#8220;No problem,&#8221; I said, &#8220;that&#8217;s more than enough for Thailand. This country is cheap.&#8221; But what I realized as I traveled with people on a limited time frame is that there&#8217;s big difference in budgeting for a backpacking trip versus budgeting for a holiday.</p><p>It requires a whole different mentality. It&#8217;s a lot easier to stick to a low budget when you can average out your expenses over a few months instead of a few weeks. On a vacation, you tend to race around trying to see as much as you can, which can drive up your costs a lot.</p><p><a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\">Thailand is a cheap country to live in and travel around</a>. I spend very little money here. But that changed when my friends came, and why that changed is important for anyone planning to come to Thailand. While my friends were here, I spent a lot of money. For the 24 days we traveled, I spent $1,596.27 USD or $66.51 per day. Here&#8217;s the breakdown (all prices are in in Thai baht):</p><ul><li><strong>Accommodation (cheap guesthouses, nice beach bungalows, luxury jungle huts)</strong>&#160;&#8211; 13,565</li><li><strong>Flights around Thailand</strong>&#160;&#8211; 4,200</li><li><strong>Transportation (public buses, trains, taxis)</strong>&#160;&#8211; 1,470</li><li><strong>Ferry to, around, and from the islands</strong>&#160;&#8211; 1,875</li><li><strong><a href=\"https://www.nomadicmatt.com/travel-blogs/the-complete-guide-to-diving-in-koh-tao/\">Diving in Ko Tao</a></strong> &#8211; 800</li><li><strong><a href=\"https://www.nomadicmatt.com/travel-blogs/jungle-trekking-and-leeches-in-khao-sok/\">Hiking in Khao Sok</a></strong> &#8211; 1,200</li><li><strong>Movie and popcorn (Sherlock Holmes 2&#8212;don&#8217;t see it!)</strong> &#8211; 320</li><li><strong>Misc. (bug spray, toothbrush, etc.) </strong>&#8211; 363</li><li><strong>Drinks (it was the holidays!)</strong> &#8211; 10,115</li><li><strong>Jim Thompson House (museum in <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\">Bangkok</a>)</strong> &#8211; 100</li><li><strong>Medicine (I popped my eardrum scuba diving!) </strong>&#8211; 1,890</li><li><strong>Food (street food, seafood dinners,&#160;<a href=\"https://www.nomadicmatt.com/travel-blogs/eat-like-a-king-in-bangkok/\">amazing international meals in Bangkok</a>)</strong>&#160;&#8211; 11,000</li><li><strong>Web stuff for work</strong> &#8211; 890</li><li><strong>Water </strong>&#8211; 100</li></ul><p><strong>Total spent: </strong>47,888 baht or $1,596.27 USD</p><p><strong>Note:</strong> $1 USD = 30 baht</p><p>For Thailand, that&#8217;s a lot of money. I tell people that backpacking around Thailand costs $30&#8211;35 USD per day, depending on how much alcohol you consume and how many days you spend on the islands, where costs are higher. Most of the time, I spend less than that. I just stayed a week in the northern city of <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/chiang-mai/\">Chiang Mai</a> and only spent about $25 USD per day. That included accommodation (private room with bathroom), local food, Starbucks, the occasional Western meal, and a few drinks.</p><p><a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\" target=\"_blank\"><img src=\"https://media.nomadicmatt.com/2018/banner-guidecover-thai10.jpg\"></a></p><h3>So Why Did I Spend Double?</h3><p><img src=\"https://media.nomadicmatt.com/thailandcosts2.jpg\" alt=\"Sunset in Ko Lanta, Thailand\"><br> Though my intention was to do &#8220;Thailand on a budget,&#8221; as I traveled with my friends, I realized something I&#8217;d forgotten. When time&#8217;s limited and this is one of two big trips all year, you don&#8217;t want to scrape every penny. Vacations don&#8217;t need to cost a fortune, but if you aren&#8217;t traveling all the time, staying in the cheapest place to <a href=\"https://www.nomadicmatt.com/travel-blogs/make-your-money-last/\">make your money last</a> becomes less of an issue. You want nice things.</p><p>You travel faster. You take planes, not 12-hour trains. You cram more activities into your day. You pamper yourself more. You eat nicer meals.</p><p>And my friends definitely wanted all of the above.</p><h3>How Much Do You Need?</h3><p><img src=\"https://media.nomadicmatt.com/thailandcosts3.jpg\" alt=\"Beaches near Ko Lipe, Thailand\"><br> That&#8217;s not to say I don&#8217;t think a vacation in Thailand can&#8217;t be done cheaper. It can. I think a <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\">budget of around $50 USD per day</a> would be perfect for a short vacation to Thailand. You don&#8217;t need to spend as much as I did. I spent a lot of money going out, using the Internet for work, and seeing a doctor. If I cut out those expenses, my average drops to 1,421.16 baht or $47.31 USD per day. That&#8217;s more expensive than a backpacker budget but really <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\">good for a trip to Thailand</a>.</p><p>Throw in some extra money for shopping, and a maximum of $55 USD per day would give you a very, very nice budget vacation in Thailand. For that price, you would get:</p><ul><li>flights so you don&#8217;t have to spend time on long bus rides</li><li>meals that include local restaurants and cheap street food, as well as delicious seafood dinners and some delicious international food in Bangkok</li><li>budget guesthouses with a few &#8220;splurge&#8221; nights thrown in</li><li>some tours and activities</li><li>a&#160;few drinks</li><li>a little extra wiggle room just in case</li></ul><p>Pretty much the essentials of any fun, relaxing holiday.</p><p>While <a href=\"https://www.nomadicmatt.com/getting-started-new/\">all the money-saving tips mentioned on my website can be applied to any style of trip</a> (saving money is universal), how fast you travel on a vacation changes how you spend money. We could have saved a lot if we&#8217;d skipped the flights and taken the train, but my friends didn&#8217;t have the time to spend 12 hours on a train. We flew, which is expensive during peak season.</p><p><img src=\"https://media.nomadicmatt.com/thailandcosts4.jpg\" alt=\"A river in Khao Sok\"></p><p>This experience reminded me that accelerated travel requires us to be more vigilant in our efforts to save money. In the rush to see everything, you can spend a lot of money before you even realize it. I&#8217;ll admit that the budget traveler I normally am went out the door on this trip. I would normally never fly around Thailand, skip the expensive resorts, and not&#160;eat as much international food as I did with my friends.</p><p>A three-week vacation in Thailand might not be as cheap as a three-month backpacking trip, but it can still be inexpensive as long as you watch where your money goes and don&#8217;t forget about keeping to a budget in your quest to see everything.</p><p>&#160;</p><h3>Get the In-Depth Budget Guide to Thailand!</h3><p><a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Thailand_Flat.jpg\" alt=\"Thailand travel guide\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p></div>","title":"How Much a Holiday in Thailand Costs"}},"pageContext":{"id":"5b95ea3287be05832748ff8b"}}