{"data":{"mongodbDatabaseArticles":{"id":"5b9624ce87be058327490f13","content":"<div><p><img alt=\"overcoming the 7 major obstacles to traveling the world ebook cover\" src=\"https://foxnomad.com/wp-content/uploads/2009/09/overcoming-the-7-major-obstacles-to-traveling-the-world-ebook-cover11.jpg\" width=\"276\" height=\"356\">It started with a simple list of <a href=\"http://www.foxnomad.com/2009/07/12/7-reasons-you-wont-travel-the-world/\">7 reasons you won&#8217;t travel the world</a>, a post which I had planned on following up with one quick summary. My series on overcoming obstacles to traveling the world turned out to span 2 months, generated over 100 comments, and had my inbox filled with messages from people who wanted to, had, or were currently overcoming the 7 obstacles themselves.</p>\n<p>That&#8217;s why I decided to convert the series into my first eBook <strong>Overcoming the 7 Majors Obstacles to Traveling the World</strong> which you can <a href=\"https://www.amazon.com/dp/B004APA4ES\">purchase here now</a>.</p>\n<p><strong>What&#8217;s In The eBook?</strong></p>\n \n<p>You may have already read some or all of the series over the last few months and having it all in one place and reading it through can have a powerful effect if you want to travel the world but don&#8217;t know where to start. It&#8217;s also a resource you can have with you to check on your progress or give you a boost when you need it from time to time.</p>\n<p><strong>Get A Copy of Overcoming the 7 Major Obstacles to Traveling the World</strong></p>\n<p>You can get you copy of my eBook, <a href=\"https://www.amazon.com/dp/B004APA4ES\">Overcoming the 7 Major Obstacles for $8.00 on Amazon.com</a> or <a href=\"http://search.barnesandnoble.com/books/product.aspx?ean=2940011863646\">Barnes &amp; Noble.com</a>.</p>\n<p>I really believe that many of you will find this eBook valuable and useful.</p>\n<p>I&#8217;ll also send you free updates to the book which will include new additions to the series. I hope you&#8217;re ready to pick apart each obstacle and overcome them one by one.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Overcoming The 7 Major Obstacles To Traveling The World eBook"}},"pageContext":{"id":"5b9624ce87be058327490f13"}}