{"data":{"mongodbDatabaseArticles":{"id":"5b95ee9287be0583274900e5","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Introducing Thailand Coaching Sessions</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a title=\"Introducing Thailand Coaching Session\" href=\"https://www.tielandtothailand.com/introducing-thailand-coaching-sessions/\"><img class=\"aligncenter wp-image-10822 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/10/IntroducingThailandCoachingSessions2.png?resize=562%2C499&amp;ssl=1\" alt=\"Introducing Thailand Coaching Sessions\" width=\"562\" height=\"499\"></a>For those who are thinking about coming to Thailand, you&#8217;re in luck! We&#8217;re happy to announce that we now offer Thailand Coaching Sessions. Our personalized coaching sessions are designed to guide long term travelers and prospective expats towards amazing lives abroad. Whether you plan to move to Thailand indefinitely, take a sabbatical, or simply enjoy a long vacation here, we offer answers to all of your questions.</p>\n<p><strong></strong></p>\n<h2><p>Now Introducing Thailand Coaching Sessions</p></h2>\n<p>Thanks to readers like you, our blog has blossomed since it began a year and a half ago. Since working our way up to be among Thailand&#8217;s blog authorities, we&#8217;ve been met with an outpour of emails, comments, and questions from people looking for more insight on coming to Thailand. We&#8217;ve learned so much about Thailand from before and since our own move back in March 2013 and have shared our findings and experiences in well over a thousand emails and comments.</p>\n<p>Now we&#8217;re taking everything we&#8217;ve learned and offering a service that dedicates our undivided attention to sharing that information with you. With our combined experience of moving to and successfully living the life in Thailand, we now offer customized and tailored <a title=\"Thailand Coaching Sessions\" href=\"https://www.tielandtothailand.com/thailand-coaching-sessions/\">Thailand Coaching Sessions</a> to answer all your questions about moving here.</p>\n<h2><p>Is It Right For You?<br>\n</p></h2>\n<p>Our Thailand Coaching Sessions are perfect for people who don&#8217;t have the precious time to spend stumbling through the internet for answers. This is also for people who have consumed every detail in our 100+ blog posts but are looking for more.</p>\n<p>In fact, we&#8217;ve already made custom itineraries for people who&#8217;ve taken extended vacations in Chiang Mai. We&#8217;ve helped people settle here who wanted to become location-independent entrepreneurs and others who simply wanted to make a major life change.</p>\n<p>We will continue to give quality and informative posts, but if you are looking for more breadth or depth from what we haven&#8217;t yet covered, this service is for you.</p>\n<h2><p>What We Provide<br>\n</p></h2>\n<p>Each Thailand Coaching Session starts off with a 90 minute consultation via phone call, video chat, or live chat. You&#8217;ll have plenty of topics to choose from, but you can pretty much ask us anything! Within 24 hours of your consultation, we will send you a follow-up email with all the answers to your questions as well as any pertinent links to help make your visit or move to Thailand easier.</p>\n<p>Think about it: in only one day, you&#8217;ll have all the answers to those questions that have been bugging you for months, perhaps even years.</p>\n<p>Let us take care of you. <a title=\"Thailand Coaching Sessions\" href=\"https://www.tielandtothailand.com/thailand-coaching-sessions/\">Learn more about our Thailand Coaching Sessions here</a>.&#160; We look forward to working with you!</p>\n<p>Your Coaches,<br>\nChris and Angela</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Introducing Thailand Coaching Sessions"}},"pageContext":{"id":"5b95ee9287be0583274900e5"}}