{"data":{"mongodbDatabaseArticles":{"id":"5b95eec887be0583274900f5","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">North Carolina Road Trip</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>This weekend we visited my grandparents for what might be the last time before we make the move to Thailand. With all of the wedding planning this was actually the first time we were able to take a weekend road trip this summer. We both decided to leave work at 11:30AM on Friday. Being that we are now suffering from a bit of senioritis, we inadvertently took the more inconsiderate route and let our bosses know about our plans to leave work early about an hour prior to our departure. Yes, this wasn&#8217;t the wisest decision we could have made, but it was a choice that made our short lived freedom seem that much sweeter as we took off down I-95.<br>\n<strong></strong></p>\n<p><a href=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2012/09/20120923-125122.jpg?ssl=1\"><img class=\"alignnone size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2012/09/20120923-125122.jpg?w=1080&amp;ssl=1\" alt=\"20120923-125122.jpg\"></a></p>\n<p>The drive went by fine, and considering it was Labor Day weekend we avoided traffic for the most part. We pulled into the driveway at my grandparents house at around 7:15pm. We were met at the door with hugs, and then told we have 2 minutes to change into something a little nicer because the neighborhood restaurant stopped serving dinner at 7:40pm. We stretched our muscles and rushed on over with thoughts of our first adult beverage occupying our minds. The server greeted our grandparents like old friends would, and ushered us over to our table. We all ordered some kind of mixed drink and jumped at the opportunity to try to special shot of the night when it was offered to us. It was called the &#8220;Woohoo&#8221;&#8230;and my grandfather was quick to exclaim &#8220;I hope I get some woohoo later on tonight&#8221;. I always look forward to these little inappropriate quotes from my grandfather, but this one came to fruition much faster than I had expected and definitely set the tone for the night.</p>\n<p>After we stuffed our faces we putted on down the road back to their house. We all sat down on the porch for a while, and I continued to enjoy a few glasses of Jim Beam splashed with a little diet coke. My grandfather enjoyed his gin and tonic and we all started to discuss our impending wedding and move to Chiang Mai, Thailand. To my surprise my grandparents we very open to the idea and that night I learned that my grandfather had actually spent 13 months in Northern Thailand during the Vietnam War. He still remembered a good amount of Thai words and phrases and could even quote the currency conversion rate from the year he was there. He described Chiang Mai as having mostly dirt roads and dirt cheap village style accommodations&#8230;oh and the tons and tons of snakes. Some of which he described as the size of logs that stretched out across the dirt roads. My grandfather has a unique way of telling his war stories. He gives you the no nonsense unfiltered version that combines the humor with the unpredictable horror of the Vietnam War. Having served in the Army as well I can really appreciate that. His recollection of the way Thailand was back in the sixties has definitely changed the way I look forward to experiencing our trip. I now plan to explore some of the villages and bases in Korat and NKP that he recounted from his memories. I hope that he can one day come visit us and experience everything the way it is today and compare the two eras. I think it would be awesome to see Thailand through his eyes in that way.</p>\n<p>The next day Angela and I set up two chairs and an umbrella on Holden Beach and let some of the stress from the past few months melt away. We spent the rest of the weekend eating all the food we would never touch back at home, and had a little too much to drink. We enjoyed the company of my grandparents and laughed a lot before heading back up north, relaxed and a just little sun burnt. The weekend went by fast, and we know the next month will be over and the wedding here before we know it. We are looking forward to seeing all of our friends and family one last time before we prepare to make our dream of moving to Thailand and traveling the rest of the world a reality.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"North Carolina Road Trip"}},"pageContext":{"id":"5b95eec887be0583274900f5"}}