{"data":{"mongodbDatabaseArticles":{"id":"5b95eaa987be05832748ffc2","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/bangkoksatcity1a.jpg\" alt=\"Bangkok skyline near sunset\"><br> Updated: 8/3/2018 | August 3rd, 2018</p><p>Chaos. Crowds. Delicious food. Cheap clothes. Wild nightlife.</p><p><a href=\"https://nomadicmatt.com/travel-blogs/visit-bangkok-itinerary/\" target=\"_blank\" rel=\"noopener\">Bangkok has it all</a>.</p><p>The city was founded after the fall of Ayutthaya in 1767. The new king, Taksin, established a capital in an area that was then called Thonburi. When Taksin&#8217;s reign ended in 1782, King Buddha Yodfa Chulaloke reconstructed the capital on the east bank of the river and gave the city a very long ceremonial name which became shortened to its current official name, Krung Thep Maha Nakhon, the City of Angels. Over the centuries, the city has grown into the metropolis it is today.</p><p>When I first visit Bangkok, I didn&#8217;t like the city. I couldn&#8217;t wait to get out. When I first came to <a href=\"https://nomadicmatt.com/travel-blogs/visit-bangkok-itinerary/\" target=\"_blank\" rel=\"noopener\">Bangkok</a>, I couldn&#8217;t wait to leave. Despite it being a large city, there just didn&#8217;t seem to be much &#8220;to do&#8221; or see. There were a plethora of temples, the Grand Palace, and some malls, but after two days, I was ready to leave and never return. In 2007, I spent one night in the backpacker area of Khao San Road and then left for the beaches.</p><p>I&#8217;m not alone in that opinion. Over the years, I&#8217;ve met many people who feel the same way.</p><p>Bangkok is one of those love or hate cities.</p><p>Few, if any, have mixed opinions about it. Bangkok is a shock to the senses.</p><p>But, after finding myself there with a job and spending time there, I&#8217;ve come to realize Bangkok is a great place. There&#8217;s a lot to do there.</p><p>Bangkok is like an onion. There are many, many layers to it.</p><p>And the best ones aren&#8217;t found on the surface.</p><p>I was looking for touristy stuff in a city that lacked touristy stuff. It wasn&#8217;t until <a href=\"https://www.nomadicmatt.com/travel-blogs/four-step-language-learning/\" target=\"_blank\" rel=\"noopener\">I decided to learn Thai</a> that I found myself on an extended stay in the city. And the longer I stayed in Bangkok, the more the city opened up and I realized that there&#8217;s always something to do here. What Bangkok has to offer is excitement, food, and nightlife.</p><p><img src=\"https://media.nomadicmatt.com/bangkok3.jpg\" alt=\"buddha statue's feet in bangkok\"></p><p>If you&#8217;re heading to Bangkok and want to ensure you get your trip started on the right foot, here are some suggested activities that will help you peel back those layers:</p><ul><li><strong>See the Grand Palace &#8211;</strong> The palace is the official residence of the current monarch (though it is just used for official ceremonies). Check out Wat Pra Kaeo, which houses the 15th century Emerald Buddha, tons of temples, statues, and beautiful reliefs. It costs 500 THB to enter the Grand Palace.</li><li><strong>Visit Jim Thompson House &#8211;</strong> Jim Thompson was a former American spy and silk merchant in Thailand during the 1950s and 1960s. He built his traditionally Thai home in Bangkok and decorated it with beautiful teak wood. He vanished mysteriously in 1967 but now his house is now a monument to traditional Thai architecture. Proceeds from the entrance fee go to help orphaned children.</li><li><strong>Explore Wat Arun and Wat Pho &#8212;</strong> Head to Wat Po to see the famous golden reclining Buddha statue. It costs 100 THB to enter Wat Po. Wat Arun is a gorgeous Buddhist temple on the Chao Phraya River opposite the Grand Palace. It has one main spire and four small ones and is so iconic you&#8217;ll find it on Thai money. From the top of the main spire, you get to see stunning sweeping views of</li><li><strong>Go shopping at the Chatuchak Weekend Market or Rot Fai Night Market &#8211;</strong> The weekend market is an ideal place to buy anything and everything. This football-stadium-sized marketplace offers the best place to get gifts, find knock-offs, barter, or have some good food. Definitely come here on a Saturday or Sunday to shop around! Rot Fai Market (or Train Market) is an authentic open-air bazaar selling an array of vintage collectibles and memorabilia, from antique furniture to hippy fashion and Mao kitsch. The Train Night Market is absolutely one of the coolest markets in Bangkok. Open at night on Thursday through Sunday.</li><li><strong>Watch a Muay Thai fight at Lumpinee Stadium &#8212;</strong> This  stadium  just  moved  to  its  new  home  on  Ramintra  Road  and  can  hold  up  to  8,000  spectators.  If  you  want  to  see  a  Muay  Thai  fight  in  the  city,  this  is  the  place  to  go.  Fight  nights  are  Tue,  Fri,  and  Sat  at  6pm.  Ticket  prices  are  from  1,600  baht.</li><li><strong>Go on a day trip to Kanchanaburi or Ayutthaya &#8212;</strong> Kanchanaburi is famous for the &#8220;Bridge over the River Kwai&#8221; from WWII. This town has a monument honoring those who lost their lives, tons of historical sites, the beautiful river, Erawan National Park and its cascading aqua-colored waterfalls, the Kanchanaburi Elephant Nature Park where you can feed and bathe elephants, and the town itself. Ayutthaya is the old capital from Thailand&#8217;s peak kingdom days, which is home to the summer palace and tons of breathtakingly unique temple ruins. It&#8217;s a dusty old town. Since it is so close to Bangkok, it&#8217;s a very popular day trip destination for tours. Lots of companies offer trips but it&#8217;s so easy to get to, I would simply go on your own by train.</li></ul><p>(For more in-depth details on these you can check out <a href=\"https://nomadicmatt.com/travel-blogs/visit-bangkok-itinerary/\" target=\"_blank\" rel=\"noopener\">my free destination guide to Bangkok.</a>)</p><p><img src=\"https://media.nomadicmatt.com/2018/saturdaybkk3.jpg\" alt=\"the grand palace in bangkok\"></p><p>At first glance, Bangkok doesn&#8217;t look like much. It&#8217;s crowded. There&#8217;s pollution. The traffic is an eternal snarl.</p><p>This is something travelers do often. We make sweeping judgments about places by the limited interactions we have with locals, the weather, or some little mishap that happened. We see a sliver of life and create a gospel about it. On the road, you often here people say things like &#8220;The French are rude&#8221; or &#8220;I was in that city. It&#8217;s boring there&#8217;s nothing to do.&#8221;</p><p>But could an entire people be rude? And maybe it was the person&#8217;s actions that got a rude response? Or maybe they are boring and don&#8217;t really know the city? Maybe they just missed something?</p><p><img src=\"https://media.nomadicmatt.com/2018/saturdaybkk2.jpg\" alt=\"the skyline of bangkok\"></p><p>There are a million factors that can make or break a place. I hated LA until I really got to know it. To me, as a tourist, it was difficult to get around and I felt like there was little to do. But the more I visited, the more I realized there was a lot to do. There just isn&#8217;t a lot of tourist things to do.</p><p>Living in Bangkok taught me I had made sweeping judgments based on limited experience. That I had hated a city for the mere glimpse at it and that I really knew nothing at all.</p><p><img src=\"https://media.nomadicmatt.com/2018/saturdaybkk4.jpg\" alt=\"the busy streets of bangkok\"></p><p>Look beyond your first impressions of <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\" target=\"_blank\" rel=\"noopener\">Bangkok</a>, and you&#8217;ll find one of the most exciting and vibrant cities in the world.</p><h3>Get the In-Depth Budget Guide to Bangkok!</h3><p><a href=\"https://nomadicmatt.com/books/bangkok-guide/\" target=\"_blank\" rel=\"noopener\"><img src=\"https://media.nomadicmatt.com/GuideBookCovers/NM_Guide_to_Bangkok_Flat.jpg\" alt=\"Nomadic Matt's Guide to Bangkok\" width=\"180\" height=\"240\"></a>My detailed, 80-page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Bangkok, a city I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, bars, and much more!! <a href=\"https://nomadicmatt.com/books/bangkok-guide/\" target=\"_blank\" rel=\"noopener\">Click here to learn more and get started!</a></p></div>","title":"The Saturday City: A Visitor's Guide to Bangkok, Thailand"}},"pageContext":{"id":"5b95eaa987be05832748ffc2"}}