{"data":{"mongodbDatabaseArticles":{"id":"5b92396987be0583cfde67fb","content":"<div><p></p><img class=\"size-large wp-image-21426\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/06/hell-yes-or-no-offshore-700x467.jpg\" alt='Andrew Henderson: value your time and say \"hell yes or no\"' width=\"700\" height=\"467\"><p>Dateline: Warsaw, Poland</p>\n<p>I recently got a Facebook message request from David, a guy I met at a conference I spoke at.</p>\n<p>David had just started an import-export business, buying stuff from manufacturers in China&#8217;s Guangdong region, and having it shipped to Amazon&#8217;s warehouses in the United States for sale under the <a href=\"http://nomadcapitalist.com/2017/05/12/incorporate-amazon-fba-taxes/\">Amazon FBA program</a>.</p>\n<p>I&#8217;ve worked with a number of FBA sellers who are earning high six-figures and even well into the seven figures. In one case, I was able to help one entrepreneur save nearly $500,000 in taxes in one year merely by restructuring his business overseas.</p>\n<p>David wanted to know how he could similarly <a href=\"http://nomadcapitalist.com/2017/02/08/lower-taxes-florida-nevada-state-tax/\">save on taxes</a>.</p>\n<p>However, David was a new <a href=\"http://nomadcapitalist.com/2017/05/12/incorporate-amazon-fba-taxes/\">Amazon seller </a>and had yet to achieve that level of success. He told me that he expects to net about $60,000 this year. While those numbers are not bad for a new business run by a guy with no previous experience, my response to David might surprise you.</p>\n<p>I told David to keep building his business and come back to me when he was comfortably doing six figures in profit every year.</p>\n<p>My reasoning is simple: over 14 years of being in business, and nearly a decade of exploring and now living an offshore lifestyle, I&#8217;ve learned a few lessons about the importance of nuance in business.</p>\n<p>One of those lessons is that sometimes it&#8217;s better to pay a little tax than to go through a lot of effort to move offshore.</p>\n<p>&#8220;But Andrew&#8221;, you might ask. &#8220;I thought it was best to set your business up offshore before you even started.&#8221;</p>\n<p>To that, my answer is yes. Had David come to me a year ago and said that he expected his soon-to-launch business to eventually generate millions of dollars in profits, I would have told him to incorporate offshore in anticipation of that if he could afford it. Then, he could have started off on the right foot.</p>\n<p>However, most people who come seeking help do so after their company is started, usually in their home country, and after they&#8217;ve paid a serious amount in taxes.</p>\n<p>It&#8217;s easy to decide that your new business will be based in Singapore from Day One.</p>\n<p>It&#8217;s similarly easy to have someone help you legally migrate your existing business offshore once you&#8217;re paying a boatload in taxes every year, and those taxes are getting in the way of your business.</p>\n<p>In David&#8217;s case, we determined that after some exemptions and deductions, he would likely pay about $8,500 in US taxes this year.</p>\n<p>While $8,500 is nothing to sneeze at, it&#8217;s also not an amount that any serious business owner focused on growth is going to miss. When you&#8217;re working to build a multi-million dollar company, a few thousand dollars here and there may be annoying, but not worth the effort to resolve a complex problem.</p>\n<p>That&#8217;s exactly why I told David that I didn&#8217;t want to help him.</p>\n<p>These days, <a href=\"https://www.forbes.com/sites/shephyken/2017/01/07/10-customer-service-and-customer-experience-cx-trends-for-2017/\" target=\"_blank\" rel=\"noopener\">business demand is shifting</a> to people who do things and benefit from personal experience, and away from stodgy professionals who charge high fees and don&#8217;t understand their customers.</p>\n<p>For the same reason mega-grocery stores are losing share to local farmer&#8217;s markets, I believe that <a href=\"http://nomadcapitalist.com/2014/12/01/dont-fall-one-size-fits-offshore-service-providers/\">the old guard</a> of the offshore industry will lose share to people who are actually living an offshore lifestyle.</p>\n<p>That&#8217;s where some real life business lessons come into play. Two of the lessons I have learned &#8211; often the hard way &#8211; are:</p>\n<h2>Lesson #1: Put a value on your time</h2>\n<p>Early in my business career, I would spend nights working on the company website or collating data because it seemed like &#8220;the right thing&#8221; to do as a young business owner. Growing up in Ohio, my father talked about business as &#8220;blocking and tackling&#8221;; basically, doing the boring stuff everyday and eventually becoming successful.</p>\n<p>Years later, when my first business had growing into an eight-figure operation, the idea of slaving away on stuff that could have been outsourced for $15 an hour seemed ridiculous.</p>\n<p>Eventually, I figured out an easy to way to determine whether work should be delegated or done by me. It involves dividing your personal annual earnings, or reasonably projected annual earnings, and dividing by 2,000.</p>\n<p>There are 2,000 work hours in a year assuming two weeks of vacation time. While most entrepreneurs work more than forty hours per week and may not take vacation, some digital nomads actually work less. For statistical purposes, I feel that 2,000 hours is a good benchmark.</p>\n<p>For example, if you earn $1 million a year, your time is worth $500 per hour. You could surely outsource every pesky task for less than that. You could also outsource stuff you think you &#8220;enjoy&#8221;, but that just eats up time; I recently outsourced booking hotels to an assistant whom I armed with a long list of my requirements. Following my model, I&#8217;ll save tens of thousands of dollars per year that I used to waste researching the best hotels.</p>\n<p>I try to use this model consistently: if I can cut two hours off of my flying time by paying $200 more for a faster flight, I&#8217;ll do it. However, if I can reduce one hour at an extra cost of $800, I don&#8217;t do it. I follow the rule to the letter so I can properly value my time.</p>\n<p>The issue for new entrepreneurs like David is that they don&#8217;t often value their time. For David to legally avoid the $8,500 he will pay in taxes over the next year, it will not only cost him thousands of dollars to form offshore company structures as well as maintain those structures, but he will need to make changes to his lifestyle, and devote his personal time to figuring out what to do and then executing on that philosophy.</p>\n<p>Sure, David could pay me to do most of the heavy lifting for him, but his total cost would no doubt exceed $8,500, even before you add in all of the time that he will THINK about his offshore structure.</p>\n<p>As a detail-oriented, somewhat neurotic guy myself, I&#8217;ve learned that time spent THINKING about stuff is just as valuable as time spent DOING. Even at David&#8217;s lower &#8220;hourly rate&#8221;, I don&#8217;t think it would make sense for him to move offshore now. His efforts will return better yields focusing on the business, even if that means losing a few extra dollars in the meantime.</p>\n<p>If you want to save taxes in your business from the beginning <a href=\"http://nomadcapitalist.com/2015/04/24/important-tax-strategies-digital-nomads/\">there are several strategies</a>, but most importantly set up the proper offshore structure before you start doing business. Otherwise, your efforts to go offshore will always distract from business growth.</p>\n<h2>Lesson #2: Say &#8220;hell yes!&#8221; or &#8220;no&#8221;</h2>\n<p>This is one that has cost me a lot of money, and one that I&#8217;ve been rather vocal about in recent years. I first heard the actual phrase <a href=\"https://sivers.org/hellyeah\" target=\"_blank\" rel=\"noopener\">&#8220;hell yes or no&#8221;</a> from friend-of-a-friend Derek Sivers, and I&#8217;ve adapted it to my own experiences.</p>\n<p>Years ago, I would approach almost everything in my business and in my life as &#8220;research&#8221;. I would contact everyone from lawyers to ad agencies to &#8220;get information&#8221; on opportunities, then wring my wrists over every dollar and every detail.</p>\n<p>Looking back, I wonder how I was able to build four profitable companies in the United States, all in different industries. The truth is, had I followed this lesson back then, I probably could have doubled or tripled my success by focusing on what really mattered.</p>\n<p>Ironically, many of the people who <a href=\"http://www.nomadcapitalist.com/shop/nomad-strategy-call/\" target=\"_blank\" rel=\"noopener\">seek my help</a> creating an offshore plan now have spent months if not years reading conflicting information from armchair expats and island lawyers, only to come up empty-handed.</p>\n<p>While David&#8217;s intentions were good, he is in a situation where it&#8217;s hard to say &#8220;hell yes!&#8221; to going offshore. If he chose to do everything himself, it would cost a few thousand dollars to set up the most basic of structures that might not continue to serve him once his business grows.</p>\n<p>That means he would spend a good chunk of his tax bill and create more work for himself, all in an effort to save money and time. It&#8217;s hard to get enthusiastic about that, especially since he doesn&#8217;t need the extra $8,500 that badly.</p>\n<p>On the other hand, another Amazon FBA seller &#8211; we&#8217;ll call him Rich &#8211; who recently sought my help had recently paid $312,000 in taxes to the IRS, and he knew exactly what he would do with that money. In fact, paying that much in taxes was not only a six-figure waste of money for him, but it was holding back his business.</p>\n<p>By re-investing that $312,000 from just one year of taxes, Rich figured he could generate over $1 million in extra revenue in the next two years. The lower tax bills every year after that would just be gravy.</p>\n<p>For Rich, investing the time and money in going offshore was dwarfed by literally millions of dollars he will save and earn over the next decade. Rich is the perfect example of seeking help when it hurts more to do nothing than to take action.</p>\n<p>And for Rich, saying &#8220;hell yes!&#8221; was immediate. There was nothing to think about. It was almost like &#8220;Ummm, why are you asking me for a decision? Of course I want to get started on this!&#8221;</p>\n<p>Awhile back, I realized that I had to lead by example if I wanted to inspire others, so I created a policy for myself: anytime I sought a product or service, I would say &#8220;hell yes!&#8221; or &#8220;no&#8221; on the spot.</p>\n<p>When I say &#8220;on the spot&#8221;, I mean that literally.</p>\n<p>For example, I was recently sitting with one of my colleagues in Hong Kong when he told me there is a new bank in Hong Kong that is now accepting foreigners again. Opening a Hong Kong bank account has become incredibly difficult, so I was very interested in moving forward.</p>\n<p>My colleague told me that the bank required a formal business plan in order to approve me, which he could create for a little less than $1,000. I told him: &#8220;do it&#8221;, at which point he leaned over to his secretary and said &#8220;send Andrew an invoice&#8221;, as if I was joking. When I said nothing to rebut him, he seemed incredulous that I actually wanted an invoice.</p>\n<p>I explained to him that the service was something I wanted and, for market research for Nomad Capitalist, probably needed. For me, there was nothing to think about. I was a &#8220;hell yes!&#8221;, and there was nothing more to do other than quickly pay the invoice and get back to running my business until the bank requested me to come to sign the papers.</p>\n<p>Years ago, I would have hemmed and hawed, prevaricated, debated it in my mind, asked a friend, and sought a small discount as a loyal customer.</p>\n<p>Instead, I have found that my greatest success in terms of both profitability and happiness have come when I take the &#8220;hell yes or no&#8221; approach and stop wasting time and mental energy.</p>\n<p>You can apply this philosophy to anything. Six or seven years ago, I upgraded my wardrobe to reflect my growing success. I went from Old Navy to Lacoste to Burberry polo shirts, and quickly realized that buying a $15 shirt you weren&#8217;t in love with didn&#8217;t hurt so much, buying a $175 polo shirt you weren&#8217;t likely to wear was more frustrating.</p>\n<p>When I met my personal shopper in the United States last week, we assembled a lot of clothing to try on, and I quickly dispensed with anything that didn&#8217;t make me say &#8220;hell yes!&#8221;</p>\n<p>As a result, I feel more satisfied with my wardrobe and have an easier time making choices about what to wear as I&#8217;m not bogged down by 73 polo shirts and the feeling that &#8220;Gee, I really ought to wear that burnt orange one so I can get my $15 worth&#8221;.</p>\n<p>The same principle applies when going offshore. If you spend your days casually browsing the &#8220;malls&#8221; of the offshore world, pontificating as to whether a BVI company would make your butt look big, you&#8217;re likely to accomplish far less and only waste a lot of time.</p>\n<p>Instead, try saying &#8220;hell yes!&#8221; or &#8220;no&#8221;. If you find a solution that is confusing, or may not work long-term, or that seems sketchy, say &#8220;no&#8221; and run away. If you &#8220;think about it&#8221;, you may talk yourself into something that doesn&#8217;t serve you just because it&#8217;s a little cheaper than the better option, or because you feel guilty for wasting the person&#8217;s time.</p>\n<p>However, when you find a person or solution <a href=\"http://nomadcapitalist.com/2016/07/13/choose-best-offshore-service-providers/\">that serves all of your needs</a>, jump in head first. After all, if something serves your needs, what is there to &#8220;think about&#8221;?</p>\n<p>I understand the temptation to be polite and merely say &#8220;let me think about it&#8221; when you have no intention of doing so. From experience, I&#8217;ve found that even when I used this as a blow-off, I WOULD actually go and think about it. Over time, I accumulated so many meaningless options that my mind turned to mush and I couldn&#8217;t make any decision.</p>\n<p>The bottom line is that if you need to make a decision on something important, whether it&#8217;s <a href=\"http://nomadcapitalist.com/2017/05/17/ready-move-business-offshore-heres-tell/\">moving your business offshore </a>or buying a polo shirt, focus on solving problems you need to solve, then focus on finding a solution you can say &#8220;hell yes!&#8221; to on the spot&#8230; not after taking a lunch break, or tonight, or after talking to your wife.</p>\n<p>Following both of these principles has helped me dramatically increase my revenues, my free time, and my happiness. Ten years ago, I would have called you an idiot for telling me these things, because my ego was stronger than my willingness to be more successful. That said, I think if you follow my lead on these, you&#8217;ll have a lot more success living <a href=\"http://www.nomadcapitalist.com/flag-theory/\">the Nomad Capitalist lifestyle</a>.</p>\n</div>","title":"“Hell Yes!”: 2 hard lessons I learned while going offshore"}},"pageContext":{"id":"5b92396987be0583cfde67fb"}}