{"data":{"mongodbDatabaseArticles":{"id":"5b95ea5f87be05832748ff9f","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/2018/bangkok_home.jpg\" alt=\"Bangkok skyline\">It&#8217;s been 18 months since I was last here. As I rode the new train into the city, I wondered what else would be different. The last time I was here the political parties were fighting. There were protests, bombings, and citywide violence that turned one of my favorite cities into a war zone. Since my last visit, many of my friends have moved on to new destinations or returned home.</p><p>But as I listened to the people around me and looked at the faces on the train, I felt at ease. I was comfortable. I knew I was home. Though I&#8217;ve been away a long time, <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\">Bangkok</a> and I are as close as ever.</p><p>I checked into my guesthouse, dropped my bags, and practically leapt out the door. I needed to explore. I needed to be outside &#8212; in my city. I wanted to wrap it around me like a blanket.</p><p>I had errands to run. I had food to eat. I had friends to see.</p><p>As I made my way down the main street of Sukhumvit, I marveled at the new buildings. I felt surprise at seeing that derelict buildings, after being there for more years than I can remember, had finally been torn down. Bangkok was changing.</p><p>But it still felt like home.</p><p>The sights. The sounds. The smells. The pace.</p><p>Everything was familiar.</p><p>I was practically skipping down the streets.</p><p>I moved to familiar haunts. I ate near my old house. Fried rice never tasted so good. The guy I buy movies from gave me a big hug and asked why I&#8217;d been gone so long.</p><p>&#8220;I went home,&#8221; I said.</p><p>We make small talk, and he smiles, shakes my hand, and tells me not to stay away for so long again.&#160;&#8220;I&#8217;ll come back more often,&#8221; I promised.</p><p>I move on with my day &#8212; there&#8217;s a lot to do. Walking into my old hair stylist&#8217;s, I ask how much for a cut. &#8220;150 baht,&#8221; she says. Same as last year.</p><p>&#8220;Where have you been?&#8221; she asks me. &#8220;It&#8217;s been a long time.&#8221;</p><p>She remembered my face better than I remembered hers. I feel a bit embarrassed.</p><p>It would be hard to explain my last year. I simply tell her I went home. It&#8217;s partially true.</p><p>&#8220;Oh really? You go home to work?&#8221;</p><p>&#8220;Yeah, I work on the Internet, though, so I can work anywhere.&#8221;</p><p>&#8220;Why don&#8217;t you work here?&#8221; she presses.</p><p>We make small talk in a mixture of Thai and English. I&#8217;m impressed she remembers so much about me. She compliments me on how good my Thai still is, though I think she&#8217;s just being polite.</p><p>It feels good to speak Thai again, but as I stumble over my words, I know I&#8217;m rusty.</p><p>In typical fashion, she asks me if I have a girlfriend.</p><p>&#8220;No,&#8221; I say. &#8220;I&#8217;m not looking for one.&#8221;</p><p>She tells me Thailand is a perfect place to find one.</p><p>She laughs. I laugh.</p><p>As my haircut finishes, she admonishes me. &#8220;If you don&#8217;t come back more, I&#8217;ll raise the price of your haircuts. Thailand is your home.&#8221;</p><p>Later in the evening, I head to my favorite bar, Cheap Charlie&#8217;s. It&#8217;s the home of many good memories. &#8220;Sawadee Krap Satit,&#8221; I say. &#8220;I&#8217;ll have a gin and tonic.&#8221; Looking up from his CDs, the bartender smiles a big grin. He too remembers me. &#8220;Of course,&#8221; he says.</p><p>That night as I have drinks with friends, I can&#8217;t help but think that my hairdresser was right. I am home. Part of me belongs here. Like a piece in a puzzle, I fit perfectly. There&#8217;s nothing unfamiliar about Bangkok and every part of it feels normal to me. It always pulls me back.</p><p>We may not remain in a place forever, but sometimes places forever remain in us.</p></div>","title":"Coming Back to Bangkok: The City I Can Never Escape From"}},"pageContext":{"id":"5b95ea5f87be05832748ff9f"}}