{"data":{"mongodbDatabaseArticles":{"id":"5b95ea0c87be05832748ff7a","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/tipsfordangeroustravel14.jpg\" alt=\"hiking along cliffs\"><br> As I get ready for a trip to Colombia, lots of people have been quick to greet the news of my latest travels with a well-meaning, &#8220;Be careful; it&#8217;s dangerous there!&#8221;</p><p>But is it really any more dangerous than anywhere else I&#8217;ve traveled or lived?</p><p>Our perceptions of what make a place seem dangerous are shaped by many factors&#8212;the hyper-dramatic media more interested in getting a quick and juicy story than sticking around to figure out the complicated dynamics of a place; government agencies driving their own political and economic agendas; and rumors that have taken on a life of their own. All of these are dubious sources of useful information for the traveler getting ready to depart for a place that&#8217;s perceived as having a high danger factor.</p><p>While common sense should be the traveler&#8217;s golden rule no matter where he or she roams, there are a few other tips that you can take along when planning to travel to &#8220;dangerous&#8221; places.</p><h3>Before your trip</h3><h3><img src=\"https://media.nomadicmatt.com/tipsfordangeroustravel17.jpg\" alt=\"follow facts not opinions\"></h3><p><strong>10.</strong> <strong>Check your facts&#8230;and your fears. </strong>Sit down and make a quick inventory. What have you heard about the country you&#8217;ll be visiting? What do you actually know about the country? Where did you get this information? How accurate and reliable is the source? How is danger defined? Is danger calculated in terms of actual, measurable risk?</p><p>For instance, though Puerto Rico is not perceived as a dangerous tourist destination, I lived there for 2.5 years and during that time learned that it was the fifth most violent country in the world (per capita) due to the rate of gun deaths. While most of the deaths occur between people who know each other, innocent bystanders have been injured&#8230;so often, in fact, that the Puerto Rico Police Department has an annual campaign to combat the errant bullets of people who fire guns into the air to welcome the new year. This is a kind of danger that can be substantiated and avoided.</p><p><strong>9. Read advisories and travel warnings and put them into perspective. </strong>By all means, visit the State Department&#8217;s website and review the travel warnings if you must. But then read more about the country and learn about aspects of its history and present that don&#8217;t come across in warnings or the news. Check out blogs, travel forums, local newspapers and magazines, and books written IN the country you&#8217;ll be visiting. Often, locals have a much different&#8212;and more valuable&#8212;perspective of themselves than outsiders. For my upcoming trip to Colombia, for instance, I found a great <a href=\"http://www.blogscolombia.com/\">web portal</a> that has introduced me to dozens of blogs about everything from the popular music of the moment to youth political movements.</p><h3>During your trip</h3><p><img src=\"https://media.nomadicmatt.com/tipsfordangeroustravel16.jpg\" alt=\"hiking over scenery\"></p><p><strong>8. Look at the locals.</strong> That old saying about doing as the Romans do has lasted as long as it has because it works. Do you see people on the street wearing flashy jewelry? No? Then don&#8217;t wear flashy jewelry!</p><p><strong>7. Let people know your plans. </strong>This may sound a bit fatalistic or too Type A for some folks, but telling trusted people what your plans are will help you get tracked down if something horrible does happen to you. For instance, when traveling alone, I send my husband or my mom an email to say what my plans for the day are. It&#8217;s always a simple message. Here&#8217;s one I sent yesterday: &#8220;Hi! Taking the Metro to the Lagunilla Market today and then to see the bulls at Plaza Mexico at 4pm. Be home around 8pm; talk to you then!&#8221;</p><p><strong>6. Keep an emergency contact card in your pocket, wallet, or bag. </strong>Your passport and driver&#8217;s license are of little use for helping people know who to contact if you have an emergency. Here&#8217;s what I keep on my person: &#8220;My name is Julie Schwietert Collazo. My blood type is O+. I have no known allergies, do not take medication, and have no illnesses. In case of an emergency, please contact my husband, Francisco Collazo, at 001-123-456-7890.&#8221; Two important tips: (1) Be sure to put the country code of your emergency contact in the phone number. The United States is not the center of the universe. (2) Write the card in English and in the language of the country where you&#8217;ll be traveling. Update the card as needed. I can&#8217;t emphasize this tip enough; a friend recently fainted on the metro in Mexico City, and this type of card helped her get medical attention right away.</p><p><strong>5. Use authorized taxi services. </strong>If there&#8217;s a tip I&#8217;m prone to ignore, it&#8217;s this one, because following it requires that I call a taxi service in advance. But it&#8217;s worth doing. If you&#8217;re going to be traveling in a city or country for a longer period of time, keep some transportation contact information in your wallet and call for authorized service rather than sticking your hand out for ad hoc service. This applies as much in New York as it does outside the U.S.</p><p><strong>4. Drink in moderation.</strong> Really. This is a tip I NEVER violate. Even if you have a high tolerance for alcohol, people under the influence are targets for criminals anywhere in the world. Also, when you drink excessively, your judgment and ability to make decisions are severely compromised. Be judicious in your use of alcohol.</p><h3>After your trip</h3><p><img src=\"https://media.nomadicmatt.com/tipsfordangeroustravel15.jpg\" alt=\"balloons floating above a sunset\"></p><p><strong>3. Spread the word.</strong> You came back alive!! Let people know about your trip. When you&#8217;re asked, &#8220;Was it dangerous?&#8221; answer honestly based on your own experiences. A great way to begin contesting the image of certain countries as dangerous is to share our travels there through blogs or slideshows. Start speaking out against stereotypes of people and places that deserve a closer look.</p><p><strong>2. Keep learning more. </strong>You&#8217;ve just had an amazing experience in a country or culture that most of the world considers dangerous, but it&#8217;s likely that you&#8217;ve just scratched the surface of all that there is to learn about that place. Keep connected to the country via blogs and newspapers, just as you did before the trip. Sign up for an RSS feed for sites that you find particularly interesting.</p><p><strong>1. Keep traveling.</strong> The world is a big, beautiful place. Get out there and experience it. And come back and tell us about it. The world doesn&#8217;t have as many dangerous places as you may think.</p><p>Julie Schwietert Collazo is the editor of Matador Pulse as well as a regular contributor to the Matador Community. She runs her own website, <a href=\"http://www.collazoprojects.com\">Collazo Projects,</a> which she updates daily. She calls Mexico City and New York home but will be soon be running a hostel in Colombia.</p><p>Photo: <a href=\"https://www.flickr.com/photos/yellowbookltd/8530136053/in/photolist-dZMbgg-6VzrGm-7Bj8nN-9MpYcg-9Mk75x-4p2pAS-7bNtGk-m8Leyt-8Q8YLY-6KEhjd-6Kzm2R-6e4GLR-8wvum5-ceKFZS-gzD9dA-9dXKU2-68bTZR-5Sqz9E-5ZfL7q-dLGsw-6TTQJY-cMiPR-9xVtxH-6jqiEE-pw1ZJ-bDYdcG-BfDcdi-pw2i8-pw2fS-pw2d3-pw29J-pw26K-pw23K-pw1Vz-pw1Rs-pw1nU-pw1jQ-6fcocp-6Bgbo5-7JPLD1-pw1h8-pw1aN-pw17p-pw13Q-pw1dR-52QS9s-b8p3P-iRs4zX-6bKGCA-acAfDw\" target=\"_blank\">2</a></p></div>","title":"Tips for Traveling in “Dangerous” Countries"}},"pageContext":{"id":"5b95ea0c87be05832748ff7a"}}