{"data":{"mongodbDatabaseArticles":{"id":"5b95f4e287be058327490139","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Requirements to Teach in Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p> \n<p>Looking to fund your overseas adventure in Thailand? Teaching English is one of the most popular and readily available means to finance life abroad in the Land of Smiles. Assuming you are ready for this challenge, you may be wondering, &#8220;What are the requirements to teach in Thailand?&#8220;</p>\n<p>If you haven&#8217;t done any research yet, it may (or, it may not) come as a surprise to learn that requirements to teach in Thailand vary greatly depending on where you look. Some sources list a dozen or so conditions, such as proof of taking a Thai culture course, having a teaching license, adequate score in an English proficiency test, and criminal history (yikes! hopefully a lack thereof), while others say you&#8217;ll do just fine with a r&#233;sum&#233; and a good looking picture. Well, which one is it!?</p>\n<p>Based on my personal experience (individual school hiring criteria may vary) becoming a teacher in Chiang Mai in May 2013, there were four major requirements expected of me. Of course, Thailand being Thailand, these requirements seemed to be more like guidelines, and you&#8217;ll see why each of them is often bent a little. The bottom line is that these requirements are what I needed to land a teaching job.</p>\n<h2><p id=\"Requirement_1_Bachelors_Degree_Diploma_or_Higher\"><p>Requirement #1: Bachelor&#8217;s Degree Diploma or Higher</p></p></h2>\n<p>A bachelor&#8217;s degree or higher is one of the most important requirements to teach in Thailand (or to work at all). Simply put, you must be able to provide evidence of a diploma. In my case, I provided a photograph of my diploma and also offered the official copy of my transcript I had brought with me from the States. My particular school was also ok if I had provided them with an unofficial transcript, but your experience may vary.</p>\n<h3><p id=\"Bending_the_Rule\">Bending the Rule</p></h3>\n<p>Although we don&#8217;t encourage this behavior, in the opinion of some schools the bachelor&#8217;s degree does not have to be the conventional four-year (or more) degree. It can be earned from an online university or it can be purchased through a company that sells diplomas for a few hundred dollars. The bottom line is that some schools only seem to want proof of a diploma, not proof of how you earned a diploma. Although it is up to the specific school or hiring agency to decide whether or not they will accept the online purchased diploma over a traditionally earned bachelor&#8217;s degree, we hear that it is unlawful to use a purchased diploma as proof of a bachelor&#8217;s degree in Thailand. I personally graduated from an accredited four-year university and would not feel comfortable cutting corners by utilizing a degree mill if that wasn&#8217;t the case.</p>\n<h2><p id=\"Requirement_2_Teaching_English_as_a_Foreign_Language_TEFL_Certification\"><p>Requirement #2: Teaching English as a Foreign Language (TEFL) Certification</p></p></h2>\n<p>A TEFL certification is not an actual legal requirement to teach in Thailand, but many schools treat it as a qualifier. <a title=\"Earn a TEFL\" href=\"https://www.tielandtothailand.com/recommends/see-tefl/\">Earning a TEFL</a> prepares you for the major differences you may face teaching a Western language to Asian students as well as suggests ways to go about teaching around these differences. It also provides teaching fundamentals for those who have no prior experience, such as how to create lesson plans and how to get students more engaged in a lesson. I personally found it helpful because I had no prior teaching experience.</p>\n<h3><p id=\"Bending_the_Rule-2\">Bending the Rule</p></h3>\n<p>Since having a TEFL is not one of the requirements to teach in Thailand, employers will look for applicants with&#160;prior teaching experience, training, or an English degree. For example, if you have several years&#160;of&#160;experience teaching English in an Asian country or if you have a degree specifically in English (or even better, teaching English as a foreign language), your agency or school may overlook that fact that you&#160;don&#8217;t have a TEFL&#160;certification.</p>\n<p>Keep in mind that although a TEFL is not legally one of the requirements to teach in Thailand, it may land you a more desirable teaching position or tip the scales in your favor should your application or r&#233;sum&#233; be competing with a few others.</p>\n<h2><p id=\"Requirement_3_Non-Immigrant_Business_8220B8221_Visa\"><p>Requirement #3: Non-Immigrant Business &#8220;B&#8221; Visa</p></p></h2>\n<p>Among the requirements to teach in Thailand is possessing a Non Immigrant Business &#8220;B&#8221; Visa (or B Visa for short). It&#8217;s possible to obtain a B Visa before arriving in Thailand if you are sponsored by a hiring agency or school prior to going to Thailand, but most likely you will be going to Thailand on a tourist visa and later switching to a B Visa. Unfortunately, a tourist visa specifically says, &#8220;Employment prohibited.&#8221;</p>\n<h3><p id=\"Bending_the_Rule-3\">Bending the Rule</p></h3>\n<p>Who knows &#8211; maybe your employer will scoop you right up while you are still on a tourist visa, ask you to start teaching the following Monday, and shrug their shoulders and tell you to do a <a title=\"Visa Run Transit Guide: Chiang Mai to Vientiane\" href=\"https://www.tielandtothailand.com/visa-run-chiang-mai-to-vientiane/\" target=\"_blank\" rel=\"noopener\">visa run </a>in the near future. Or maybe you&#8217;re taking classes at the university on a Non Immigrant Education &#8220;ED&#8221; Visa, but you are teaching through a work co-op. The point is, you may be working even if you are not on a B Visa. It happens, but <a title=\"How to Score Thai Non-Immigrant B and O Visas\" href=\"https://www.tielandtothailand.com/thai-non-immigrant-visas/\" target=\"_blank\" rel=\"noopener\">lawfully you need a B visa and a Work Permit to teach</a>, sorted by your prospective employer prior to starting your teaching position.</p>\n<h2><p id=\"Requirement_4_A_Good_Picture_and_a_Good_Attitude\"><p>Requirement #4: A Good Picture and a Good Attitude</p></p></h2>\n<p>An attractive picture goes a long way in Thailand. Unfortunately, this also means that some people are denied a teaching position simply because of the way they look. Workforce discrimination is commonplace in Thailand, and it is not uncommon for a school to discriminate against you based on age, race, or sex. Or the fact you weren&#8217;t wearing a collared shirt in the picture you submitted with your r&#233;sum&#233;.</p>\n<p>The best thing to do is to look sharp in your picture. Have well-groomed hair, a pressed shirt (a tie if you are male), and of course, a smile. Thailand is also well-known for its mai bpen rai outlook, so if you&#8217;re non-confrontational and have a good-humored, go-with-the-flow type of demeanor, you will go far.</p>\n<h3><p id=\"Bending_the_Rule-4\">Bending the Rule</p></h3>\n<p>On a good note, sometimes the people responsible for hiring teachers look past the surface and understand that experience and enthusiasm are more important than a young, white face. On the downside, people with alcohol or drug problems, lackadaisical attitude towards teaching, or flat out aggression still manage to secure teaching positions because they look good in the r&#233;sum&#233; photo.</p>\n<h2><p id=\"Can_You_Meet_these_Requirements_to_Teach_in_Thailand\"><p>Can You Meet these Requirements to Teach in Thailand?</p></p></h2>\n<p>Based on my experience becoming a teacher, the requirements to teach in Thailand may not be as far-fetched or as extensive as some websites may make it to be. In my experience, I was hired by an agency by legitimately meeting the above four requirements to teach in Thailand. However, the best thing to do is contact a school or agency directly and ask for their policy.</p>\n<p>It&#8217;s well worth your time, seeing as &#8220;rules&#8221; vary between schools and districts, and in particular, because some of the requirements to teach in Thailand are rather pricey and time-consuming. It&#8217;s the best way that you can prepare yourself before making the long flight to Thailand.</p>\n<p>Fellow teachers, what has your experience been with the requirements to teach in Thailand?&#160; Are there any suggestions you&#8217;ve found to be useful? Here are some great <a title=\"The Ajarn Guide for Newbies\" href=\"http://www.ajarn.com/help-and-guides/newbie-guide/\" target=\"_blank\" rel=\"noopener\">questions and answers</a> we&#8217;ve found on the topic.</p>\n<p>Disclaimer: This information is based on what we&#8217;ve witnessed and/or heard from other teachers since living in Thailand. Individuals should conduct their own thorough research into the Ministry of Education&#8217;s official requirements to teach in Thailand prior to applying for a position!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Requirements to Teach in Thailand"}},"pageContext":{"id":"5b95f4e287be058327490139"}}