{"data":{"mongodbDatabaseArticles":{"id":"5b95ef6287be058327490111","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Saving a Woman From Being Run Over By a Minivan</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p> \n<p>We are still pretty shaken up and in disbelief from the position that we were thrown into this afternoon. A typical ride home after picking up Angela from school turned into an ordeal that we won&#8217;t soon be able to forget. It has been less than five hours since the incident happened, so we think writing about it might help us deal with it better.</p>\n<p><strong></strong></p>\n<p>At about 4:00pm while we were on our way to our usual afternoon coffee stand, we were stopped at the very busy Pantip Plaza intersection at Chang Klan Rd and Sridonchai Rd heading west. We did what we usually do and slowly crept up towards the front of the pack of cars, which is the standard practice in Thailand. The line of traffic was long, and when we reached the front we took notice that we were the only motorbike there.</p>\n<p>By now I am well aware of the traffic light pattern, and I was patiently waiting for our turn to proceed through the intersection when I heard a crash sound coming from my right side. Angela and I quickly snapped our heads to the right and witnessed a big silver minivan rear ending a Thai woman on a small motorbike. My first thought was that the minivan was going to stop because the collision took place on the front driver side quarter panel. There was no way the minivan driver couldn&#8217;t have realized what he just did&#8230;but he didn&#8217;t stop.</p>\n<p>Shockingly, the driver continued to push the bike off to the side of the vehicle, but not before the woman on the motorbike was forcefully knocked down&#160;to the pavement, directly into the path of the minivan. That is when Angela and I started to yell as loud as we could while simultaneously jumping off of our motorbike toward the unfolding accident. Our shouts did nothing. The driver continued to push forward, lodging the small petrified woman under his front bumper.</p>\n<p>We could not believe what we were witnessing as we saw the helpless woman rolling under the front of the minivan like a rag doll. We proceeded to leap in front of the vehicle and throw our hands up frantically. The driver and the passenger in the front seat had very confused looks on their faces. It was clear that they knew they hit a motorbike, but it was obvious that they had no idea that there was a poor woman trapped underneath the front of their minivan. Wide eyed and not able to fluently speak Thai, Angela and I motioned with our hands that there was something under their vehicle.</p>\n<p>Going back and forth from the eyes of the screaming woman to the dumbfounded faces of the minivan drivers, I made the quick decision to instruct them to back up. Luckily the woman was flat on her back and in no&#160;position to be pulled backwards. &#160;As the van gave way she let out a loud sigh of relief. Angela and I signaled to the woman to stay on her back while the driver of the minivan guiltily began to look her over for visible injuries. It was at this point that we saw a policeman running across the street from the traffic booth he was occupying.</p>\n<p>Quickly glancing around, I was taken aback by the amount of people simply looking on from the safety of their cars.&#160; Not a single person had gotten out of their vehicle to help. I could even see the driver of the car behind my abandoned motorbike start to become frustrated by the obstacle I left in front of him. Maybe he didn&#8217;t see what happened, and maybe all the onlookers were proof of the harsh reality of the <a title=\"The Bystander Effect\" href=\"https://en.wikipedia.org/wiki/Bystander_effect\" target=\"_blank\">bystander effect</a>.</p>\n<p>With shaky hands I ran back across the double line in the road and pushed my motorbike onto the bordering sidewalk while Angela stayed with the woman. By this time, there were two policemen marking the accident scene by spray painting white lines around the minivan&#8217;s tires and blue lines around the woman&#8217;s banged up motorbike.</p>\n<p>Being rush hour, there were countless cars and motorbikes zipping around the scene, so one of the policemen had the driver of the minivan pull his vehicle to the side of the road while the other picked up the motorbike and placed it on the curb.&#160;Thankfully the victim was the exception to the rule and was smartly wearing a helmet, long pants, a jacket, and shoes. We watched as she lifted up her ripped pant legs and sleeves to reveal&#160;that she was not bleeding. Crying and angry we could hear her disdain for the minivan driver in the sharp tone of her voice. We also heard her mention the word farang (foreigner) once or twice. We didn&#8217;t know if she knew that we had saved her from being crushed or if she thought we were complicit, but we were just glad that she was ok.</p>\n<p>Next, one of the policemen quickly walked towards me. I was pretty nervous that we might be placed with some of the blame because I&#8217;ve read in many online forums that if you are a foreigner and see an accident in Thailand, you shouldn&#8217;t involve yourself. To my relief, the policeman smiled, patted me on the back, and said in English, &#8220;Thank you.&#8221;&#160; Feeling relieved, I returned the pat on the back and tensely said, &#8220;That was scary.&#8221; Briefly forgetting what country I was in, I could see that he didn&#8217;t understand a word I just said. He repeated his thank you and I replied with a&#160; &#8220;Khap khun khrup&#8221; (Thank you in Thai).</p>\n<p>Angela and I sympathetically made eye contact with the woman one last time and stared with disapproval at the driver of the minivan before walking back to our motorbike.&#160; As we drove home, all I could do was shake my head back and forth and be thankful that we were able to get off our motorbike in time to jump in front of the van before the driver had a chance to crush the woman with the full weight of his vehicle.</p>\n<p>Today is a day that we won&#8217;t soon forget, and it is going to be even harder for us to see&#160;adults and unsuspecting small children on motorbikes without helmets riding fearlessly through the busy streets of Chiang Mai.</p>\n<p>Have you ever been involved in a life-or-death situation while on the road? What happened and how did you deal with it?</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Saving a Woman From Being Run Over By a Minivan"}},"pageContext":{"id":"5b95ef6287be058327490111"}}