{"data":{"mongodbDatabaseArticles":{"id":"5b921d1c87be0571ac1b04f8","content":"<div><p>However, how long you can stay in a country is just one factor to consider. I&#8217;ve been working on several other strategies that fit in with Flag Theory.</p>\n<p>To be fair, these are just working theories I wanted to share with you. Unlike a lot of people in this business, I&#8217;m open to your honest criticism in the comments section below. Here are three strategies I believe you can use to maximize your freedoms while living overseas&#8230;</p>\n<h2>The No Capital Cities Strategy</h2>\n<p>Personally, I love big cities. In fact, I often find myself passing up beautiful natural scenery in a new country in order to spend time in its big city. (Being a workaholic with a need for fast wifi doesn&#8217;t hurt, either).</p>\n<p>However, several friends of mine have suggested that they avoid capital cities for one reason: a lack of freedom.</p>\n<p>In many ways, the logic behind their avoidance of the capital city is sound. A capital is the seat of a government, and governments attract people who wish to restrict freedoms. Even in relatively free countries, governments will exert their will close to home, while letting the rest of the country and &#8220;the hinterlands&#8221; remain unpoliced.</p>\n<p>This could mean everything from not being able to walk down the street with a drink in hand to more aggressive enforcement of traffic laws.</p>\n<p>One visit to Washington, DC will show you to pros and cons of capital cities. On one hand, residents of capitals enjoy all of the freebies that governments provide for themselves, like free jazz concerts in perfectly manicured city parks every summer.</p>\n<p>The price you pay for this free stuff is living amongst a bunch of power-hungry people who make a living out of dreaming up stupid new laws. If you want the best chance of being left alone, stay away from the government. (Of course, in aspiring police states, there is often nowhere to hide).</p>\n<p>Capital cities are often less bastions of capitalism. Washington may have some venture capital activity, but it is small compared to New York and Silicon Valley. In a more stark contrast, wealth and capitalism in Hanoi pale in comparison to Ho Chi Minh City, Vietnam.</p>\n<h2>The Tax Haven Adjacent Strategy</h2>\n<p>Tax havens are the proof in the pudding that &#8220;go where you&#8217;re treated best&#8221; is only natural. People and their capital naturally gravitate to the best conditions, be that <a title=\"Do anonymous and numbered offshore bank accounts exist?\" href=\"http://nomadcapitalist.com/2014/04/04/numbered-offshore-bank-accounts-exist/\">bank secrecy</a> or zero tax policies.</p>\n<p>However, many of the world&#8217;s tax havens have become quite expensive as a result of all of that wealth flooding in. Think about it: countries that are likely to become tax havens in the first place tend to be small and lacking in resources.</p>\n<p>Luxembourg, Lichtenstein, Andorra, the Cayman Islands, Vanuatu, the Cook Islands, and more. Even places like Switzerland, while quite wealthy from other industries, are small compared to the countries whose citizens they have historically stored wealth for.</p>\n<p>Now, take a huge influx of capital, small land area, and an often tropical climate and imagine what happens when people jam in there. Things get expensive.</p>\n<p>You&#8217;d think living on an island in the middle of nowhere in the Atlantic Ocean would be an affordable proposition. But thanks to a highly sophisticated banking center, Bermuda is one of the most expensive places on earth.</p>\n<p>Monaco, where I&#8217;m hosting a small conference for Members of The Nomad Society this April, is in a similar boat. With less than 1 square mile of land area and a booming port for mega yachts, it&#8217;s no wonder you can&#8217;t buy a broom closet for under $1 million.</p>\n<p>Heck, even Panama &#8211; the potential <a title=\"Five reasons Panama is one of the most free countries in the world\" href=\"http://nomadcapitalist.com/2015/01/19/reasons-panama-is-one-of-the-most-free-countries-in-the-world/\">&#8220;Singapore of the Americas&#8221;</a> &#8211; feels a bit pricey. <strong>So my idea is that you shouldn&#8217;t live in a tax haven&#8230; but you should live next to one.</strong></p>\n<p>Instead of living in Singapore, live in Malaysia. You&#8217;ll be within arms&#8217; reach of all of the benefits of Singapore&#8217;s highly sophisticated financial system without having to pay $10,000 a month for a nice apartment.</p>\n<p>Instead of living in Panama, live in Colombia. You won&#8217;t get bored of the monotony of Panama City and you&#8217;ll enjoy easy access to your money when you need it.</p>\n<p>This strategy is already practiced by many young bankers and managers all around the world. Few people who <a title=\"How to get second residency in Gibraltar\" href=\"http://nomadcapitalist.com/2013/05/03/your-second-residence-how-to-live-in-gibraltar/\">work in Gibraltar</a> live there; they live across the border in Spain where rents are far more reasonable. Ditto for Monaco, Luxembourg, and now even Singapore, where Johor Bahru, Malaysia is becoming what I call &#8220;Singapore&#8217;s New Jersey&#8221;.</p>\n<p>In addition to much lower prices, you&#8217;ll typically enjoy a better quality of life and more entertainment options in the larger countries neighboring tax havens. And provided the country you choose has territorial taxation, you can base your business activities in the nearby tax haven and not be taxed on a residential basis.</p>\n<h2>The Regional Influence Strategy</h2>\n<p>Every time I travel through Central America, I notice one thing: it feels a bit like the United States.</p>\n<p>At the airport in Panama, I was instructed to take off my shoes, belt, watch, and make sure not a scrap of paper remained in my pockets. Sound familiar?</p>\n<p>Last year in Managua, I went through a special metal detector that the security supervisor told me was a gift from the US government. While I can&#8217;t vouch for the truth of that statement, I can say that the countries south of the border have a tendency to follow the lead of the United States.</p>\n<p>It&#8217;s part of the regional influence that they have, in effect, succumbed to. Heck, Panama has a deal to share information with the US government on wire transfers in and out of their country.</p>\n<p>The United States is the biggest perpetrator of this type of regional influence, where the dominant country in the region attempts to get its smaller neighbors on board with its totalitarian ideals.</p>\n<p>Just as the Soviet Union relied on satellite states to share in the misery, countries like the United States use all kinds of shady diplomatic tactics to influence their neighbors. Of course, it&#8217;s not just the United States; China and Russia have eyes on doing the same, although their reach is not nearly as wide at the moment.</p>\n<p>Just as <a href=\"http://www.foxnews.com/opinion/2014/12/05/putin-pushes-back-beware-wounded-russian-bear/\" target=\"_blank\">Fox News</a> and company spent much of last year insisting that the Baltic states would be reclaimed by Russia any day now, countries like the United States are exerting their will on countries that need them as an ally.</p>\n<p>In summary, if you&#8217;re looking to avoid the far reach of the United States, move far away from the United States. Countries here in Central America love their fingerprint scanners and invasive forms the same way the US does.</p>\n<p>Likewise, if you&#8217;re sick of Russian influence, Minsk probably isn&#8217;t the place for you.</p>\n<p>Mexico may be one of the best places within the Americas to find freedom because it is large enough (and has enough resources) to stand up for itself.</p>\n<p>However, size isn&#8217;t the only issue; Ukraine has historically been the breadbasket of Europe and is one of the largest countries in Europe. The fact that it is a failed state neutralized its size when Russia wanted to rattle the saber.</p>\n<p>These are the ideas I frequently discuss in my private masterminds with the entrepreneurs I help, so I&#8217;d love for you to share your thoughts on these ideas below.</p>\n</div>","title":"3 new Flag Theory strategies for expats living overseas"}},"pageContext":{"id":"5b921d1c87be0571ac1b04f8"}}