{"data":{"mongodbDatabaseArticles":{"id":"5b93834e87be056953db7e4c","content":"<div><h1 name=\"c496\" id=\"c496\" class=\"graf graf--h3 graf--leading graf--title\">My Thoughts on Working Remotely, One Year&#160;in</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*hA7bZYzOYKuGSZtBCNkyjg.jpeg\">Barefoot to the Moon album cover by&#160;Echoes<p name=\"f6fc\" id=\"f6fc\" class=\"graf graf--p graf-after--figure\">The social, the efficiency and the health factors</p><h3 name=\"543c\" id=\"543c\" class=\"graf graf--h3 graf-after--p\">A little&#160;intro</h3><p name=\"880d\" id=\"880d\" class=\"graf graf--p graf-after--h3\">It&#8217;s been a little more than a year since I joined <a href=\"https://www.starcounter.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Starcounter</a>. Working full-time as a Javascript developer mostly on <a href=\"https://palindrom.github.io\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Palindrom</a>, <a href=\"https://github.com/Palindrom/JSONPatcherProxy\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">JSONPatcherProxy</a>, and <a href=\"https://github.com/Starcounter-Jack/JSON-Patch/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">fast-json-patch</a>. All the team I work with is in the same timezone. We use Github, Slack and Google Hangouts for meetings.</p><p name=\"9025\" id=\"9025\" class=\"graf graf--p graf-after--p\">I have never been happier and more satisfied with my life than I am now. It&#8217;s been a great year and I learned much more than I ever thought I will before I started.</p><p name=\"2a28\" id=\"2a28\" class=\"graf graf--p graf-after--p\">Before I dive in, it is important to note that a lot of this experience has to do with my nature and my personality; everything I say in this post only applies to me, and may or may not apply to other people.</p><h3 name=\"0042\" id=\"0042\" class=\"graf graf--h3 graf-after--p\">Socially</h3><p name=\"43bd\" id=\"43bd\" class=\"graf graf--p graf-after--h3\">One the personal level, I truly enjoy socializing. But the way I define socializing is meeting once a week for a couple hours. I tend to think that meeting people every morning is a burden. And working remotely is a godsend for me.</p><p name=\"60a6\" id=\"60a6\" class=\"graf graf--p graf-after--p\">However, in this year I learned several lessons when it comes to socializing:</p><ol class=\"postList\"><li name=\"586b\" id=\"586b\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Your social attitude is as important as your skill set</strong>. We are social animals after all. Internally, I have never decided whether I liked a workmate based on how clean their code was. Or how their jsperf results scored. As much as I try to be professional and objective, I find myself liking and respecting nicer workmates more. And obviously, this applies to me too. And proving yourself nice remotely is harder than in real life.</li><li name=\"d326\" id=\"d326\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Networking is a different challenge when working remotely. </strong>There is no coffee break or lunch chitchat<strong class=\"markup--strong markup--li-strong\">. </strong>You&#8217;ll have to step up your social media game, conference attendance and other networking activities.</li><li name=\"a56a\" id=\"a56a\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">We project on people</strong>. In real life, we project all the time. We don&#8217;t know enough about people to understand them, so we assume a lot about them to sympathize (or the opposite) and understand what they&#8217;re saying without much effort. This can be a good thing, but can easily go wrong. When working remotely, you know less, so you assume more. When I first met my team after two months of text communication I was astonished how nice and cheerful they are. I painted wildly different images of every one of them based on the way they communicated on Slack. Not to say that my imagination was grim, but it was largely off. This was eye-opening for me.</li><li name=\"39c0\" id=\"39c0\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Seeing the informal side of my workmates was key. </strong>It was key to seeing them as nice human beings who joke, have fun and have some weaknesses just like I do. Partying with my teammates helped me a great deal to feel secure about myself, to express who I am as a person (not an engineer). And this is a two-way street, it helped me to know who they are, as people, not robotic professionals.</li></ol><p name=\"80bc\" id=\"80bc\" class=\"graf graf--p graf-after--li\">What I learned from the above is that <strong class=\"markup--strong markup--p-strong\">meeting the team was absolutely essential for my morale, satisfaction, and mutual trust.</strong></p><h3 name=\"06c8\" id=\"06c8\" class=\"graf graf--h3 graf-after--p\">The efficiency factor</h3><p name=\"3d6f\" id=\"3d6f\" class=\"graf graf--p graf-after--h3\">One of the upsides of text communication is the ability to think, research and even later-edit what you have to say. When a workmate asks me a question on Slack, I give them a solid well-researched answer with links to specific lines of code. This saves us a lot of time and energy. Every question is a chance to learn and feel more confident.</p><p name=\"ce13\" id=\"ce13\" class=\"graf graf--p graf-after--p\">Also, I rely much less on memory now. I can go back to any conversation I want, and I use Slack search all the time to do that. Even though Slack uses a ton of memory, at least it&#8217;s not mine &#128516;. To me this is a priceless upside; I always struggled to remember the conclusions made in a meeting three days later. This gives me a clear head and the ability to only process one thing at a time. Because I don&#8217;t even try to memorize conversations anymore.</p><p name=\"ac32\" id=\"ac32\" class=\"graf graf--p graf-after--p\">There is no lack of wishing sometimes that I could walk up to a workmate and ask them a quick question and instantly get my answer and move on. But the experience is close enough on Slack.</p><p name=\"5048\" id=\"5048\" class=\"graf graf--p graf-after--p\">Another huge upside to remote work is readiness to work open-source. If you think about it, most of the time open-source work is remote work. You almost never meet your contributors nor the project owners of where you contribute. Having a job that trains you to work open-source is a blessing. I&#8217;m now trained to be unambiguous, direct and to more communicative. Add to that, most the libraries I work on are in fact open-source. This gives me endless satisfaction and pleasure.</p><p name=\"0c15\" id=\"0c15\" class=\"graf graf--p graf-after--p\">One thing I don&#8217;t know about is how much extra effort my workmates are putting to support me working remotely. I try my very best to eliminate that burden but I&#8217;m pretty sure there is an extra mile they walk sometimes to support the remote part of the team. I don&#8217;t have a decent insight on this.</p><h3 name=\"6c32\" id=\"6c32\" class=\"graf graf--h3 graf-after--p\">Commuting</h3><p name=\"ff1c\" id=\"ff1c\" class=\"graf graf--p graf-after--h3\">Now, I&#8217;m much more efficient than the times I used to commute. Personally, I find it hard to read or do anything constructive whlist commuting. Those are at least 60 minutes saved <strong class=\"markup--strong markup--p-strong\">every</strong> day, which I spend in the gym. In a nutshell, I work + exercise in the same amount of time a commuter only works, and with less focus and energy.</p><h3 name=\"3401\" id=\"3401\" class=\"graf graf--h3 graf-after--p\">Health</h3><p name=\"eb96\" id=\"eb96\" class=\"graf graf--p graf-after--h3\">Working from home is reputated to be unhealthy. Well, not in Warsaw. The only thing I can confess to missing is morning sunlight. But there isn&#8217;t a lot of it either ways here. And I try to make up for that:</p><ol class=\"postList\"><li name=\"8d21\" id=\"8d21\" class=\"graf graf--li graf-after--p\">I go out in the morning during weekends.</li><li name=\"0687\" id=\"0687\" class=\"graf graf--li graf-after--li\">I work with a huge window next to me that is always uncurtained.</li></ol><p name=\"15a3\" id=\"15a3\" class=\"graf graf--p graf-after--li\">And smog is a big issue in Warsaw nowadays, so staying in can be even healthier than commuting to downtown everyday at peak pollution hours.</p><p name=\"862f\" id=\"862f\" class=\"graf graf--p graf-after--p\">Regarding sitting for a long time. Working in an office isn&#8217;t a whole lot better. So remote or not, without going to the gym, my job would be extremely unhealthy. I can&#8217;t stress this enough; <strong class=\"markup--strong markup--p-strong\">going to gym is crucial to my health now.</strong></p><h3 name=\"6d6e\" id=\"6d6e\" class=\"graf graf--h3 graf-after--p\">Food</h3><p name=\"a012\" id=\"a012\" class=\"graf graf--p graf-after--h3\">Another cool thing about working from home is the food. Everyday I have a decent breakfast. And recently I started cooking my lunch the night before. When it&#8217;s lunch time, I heat my food and make some salad in quick ten minutes, and enjoy every bite of it. Much healthier than eating at work; has the exact amount of protein and other nutrients that I plan to eat.</p><h3 name=\"305f\" id=\"305f\" class=\"graf graf--h3 graf-after--p\">Conclusion</h3><p name=\"9bb0\" id=\"9bb0\" class=\"graf graf--p graf-after--h3\">I would definitely recommend working remotely for a friend, but they need to make sure to meet their team occassionally, exercise and always give the benefit of the doubt when things are unclear. It&#8217;s also very important to find alternative ways for networking and self marketing.</p><p name=\"5b14\" id=\"5b14\" class=\"graf graf--p graf-after--p graf--trailing\">This is my first post on Medium, please excuse any mistakes or errors.</p></div>","title":"My Thoughts on Working Remotely, One Year in – codeburst"}},"pageContext":{"id":"5b93834e87be056953db7e4c"}}