{"data":{"mongodbDatabaseArticles":{"id":"5b95ea7187be05832748ffa8","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/kolipe-beach.jpg\" alt=\"a serene beach scene in Ko Lipe, Thailand\"><br> In November 2006, I was 5 months into my (supposed) year long trip around the world. While emailing my parents to let them know I was still OK, I saw a message in my inbox:</p><p>&#8220;Matt, I&#8217;m stuck in this placed called Ko Lipe. I&#8217;m not going to meet you as planned, but you should come down here. It&#8217;s paradise! I&#8217;ve been here a week already. Find me on Sunset Beach. &#8212; Olivia&#8221;</p><p>Olivia, a friend from MySpace, was supposed to meet me in Krabi, a tourist destination famed for its limestone karsts, rock climbing, and kayaking.</p><p>I looked up <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/ko-lipe/\" rel=\"noopener\" target=\"_blank\">Ko Lipe</a> on a map. There was only a small mention of it in my guidebook. It was really out of the way and would require a solid day of travel to get to.</p><p>As I looked around the crowded Internet caf&#233; and onto the busy street, it was clear that <a href=\"https://www.nomadicmatt.com/travel-blogs/terrible-ko-phi-phi-thailand/\" rel=\"noopener\" target=\"_blank\">Phi Phi was not the tropical island paradise</a> I had envisioned. The crowds were coming back, the beach was filled with dead coral, boats seemed to ring the island, and the water was polluted with a thin film of&#8230;well, I don&#8217;t want to know. A quieter, calmer paradise held great appeal.</p><p>&#8220;I&#8217;ll be there in two days,&#8221; I replied. &#8220;Just let me know where you are staying.&#8221;</p><p>Two days later, I took the ferry to mainland, a long bus to the port city of Pak Bara, and then the ferry to Ko Lipe. As we passed deserted, jungle-covered islands, I wandered to the top deck where a guy was playing guitar for the few people going to Lipe.</p><p>After he finished, we struck up a conversation.</p><p>Paul was tall, muscular, and thin, with a shaved head and slight stubble. His girlfriend Jane was equally tall and athletic, with curly brownish-red hair and ocean-blue eyes. Both British, they were meandering around Asia until they were ready to move to New Zealand, where they planned to work, buy a house, and eventually get married.</p><p>&#8220;Where are you guys staying?&#8221; I asked as we lounged in the sun.</p><p>&#8220;We found a resort on the far end of the island. It&#8217;s supposed to be cheap. You?&#8221;</p><p>&#8220;Not sure. I&#8217;m supposed to stay with my friend, but I haven&#8217;t heard back yet. I don&#8217;t have a place.&#8221;</p><p><img src=\"https://media.nomadicmatt.com/kolipe-boat.jpg\" alt=\"view from the bow of the boat arriving in Ko Lipe\"></p><p>The ferry neared the island and came to a stop. There was no dock on Ko Lipe. Years before, a developer tried to build one, but the project was canceled after protests from the local fishermen who take passengers to the island for a small fee, and the developer mysteriously disappeared.</p><p>As I got in one of the longtail boats, I dropped my flip-flops into the ocean.</p><p>Watching them sink, I yelled, &#8220;Shit! That was my only pair! I hope I can get some on the island.&#8221;</p><p>Paul, Jane, and I went to their hotel, joined by Pat, an older Irish guy, who also lacked a place to stay. The hotel overlooked a little reef and the small Sunrise Beach, which would become our main hangout spots during our time on the island.</p><p>I decided to bunk with Pat since I hadn&#8217;t heard from my friend Olivia and splitting a room was a more budget friendly. Back then saving a few hundred baht was the difference of one more or less day on the road. Paul and Jane took a bungalow overlooking the ocean. (Their terrace would be another of our little group&#8217;s most popular hangouts.)</p><p>We headed out to find my friend, who had said she could be found on Sunset Beach at the Monkey Bar.</p><p><img src=\"https://media.nomadicmatt.com/kolipe-localboats.jpg\" alt=\"local fishing boats in Ko Lipe\"></p><p>As we walked to the other side of the island, I could see Olivia was right: Ko Lipe was paradise. It was all gorgeous jungles, deserted beaches, warm, crystal-clear blue water, and friendly locals. Electricity was only available for a few hours at night, there were few hotels or tourists, and the streets were simple dirt paths. Ko Lipe was the place I had dreamed of.</p><p>We found Olivia pretty quickly. Sunset Beach was not big, and Monkey Bar, a small thatch-covered shack with a cooler for cold drinks and a few chairs, was the only bar on the beach. After quick introductions, we ordered beers, asked the typical traveler questions, and sat around chatting about nothing.</p><p>Pat turned out to be a snorer so, after two nights, I moved into a bungalow in the middle of the island for 100 baht ($3 USD) a night. Nestled behind a restaurant that served the best squid around, this hardwood structure painted red, with a white roof, small porch, and near-barren interior &#8212; a bed, a fan, and mosquito net &#8212; seemed to be built by the family for a wave of tourism that had never come.</p><p>I gave up trying to find new flip-flops. There was nothing I liked or fit. I&#8217;d wait until the mainland and just go barefoot in the meantime.</p><p>The five of us formed a core group that grew and shrank with the arrival and departure of other travelers. Other than Dave, a young Frenchman, and Sam, a weathered British expat who had been on the island every season for a decade (having once been trapped there after the last boat left), we were the only permanent Western fixtures on the island.</p><p><img src=\"https://media.nomadicmatt.com/kolipe-soccer.jpg\" alt=\"the group playing soccer on the beach in Ko Lipe\"></p><p>Our days were spent playing backgammon, reading, and swimming. We rotated beaches, though we mostly hung out at the beach by Paul and Jane&#8217;s. Within swimming distance was a mini-rock with a sheer drop that provided excellent snorkeling. We&#8217;d occasionally leave the Ko Lipe to explore the deserted islands in the nearby national park, fish, and dive. There&#8217;s nothing quite as lovely as having a whole tropical island to yourself.</p><p><img src=\"https://media.nomadicmatt.com/kolipe-island.jpg\" alt=\"one of the uninhabited islands around Ko Lipe\"></p><p>At night, we would rotate restaurants: my guesthouse owner&#8217;s restaurant, Mama&#8217;s for fresh squid and spicy curry, Castaway on Sunset Beach for massaman curry, and Coco for everything else. Afterwards, we&#8217;d move to Monkey Bar for beach games, beer, the occasional joint, and more backgammon. When the power generators were switched off, we would drink by flashlight before going to bed.</p><p>The days seemed to pass by endlessly. My original three-day visit came and went. I lost any concept of time.</p><p>&#8220;I&#8217;ll leave tomorrow&#8221; became my mantra. I had no reason to leave. I was in paradise.</p><p><img src=\"https://media.nomadicmatt.com/kolipe-couple.jpg\" alt=\"new friends in Ko Lipe\"></p><p>Paul, Jane, and I became close friends as time went by. We formed a mini-group within the group.</p><p>&#8220;What are you guys going to do when you get to New Zealand?&#8221; I asked.</p><p>&#8220;We&#8217;re going to work for a few years and build a life there. We have nothing that&#8217;s pulling us back the UK,&#8221; said Paul.</p><p>&#8220;I&#8217;m going there on this trip so I&#8217;ll visit. It&#8217;s my last stop on the way home,&#8221; I replied.</p><p>&#8220;You can stay with us. Wherever we are,&#8221; said Jane as she passed the joint to me.</p><p>Sitting on the beach one day, I had an idea.</p><p>&#8220;You know what would be cool? An eco-friendly hostel. New Zealand would be the perfect place. Wouldn&#8217;t it be cool to own a hostel?&#8221;</p><p>&#8220;Yeah, that would be fun,&#8221; said Paul.</p><p>&#8220;We could call it The Greenhouse,&#8221; replied Jane.</p><p>&#8220;That&#8217;s a great name.&#8221;</p><p>&#8220;Yeah, seriously.&#8221;</p><p>Paul said, &#8220;I bet we could do it pretty easily. Eco-friendly places are all the rage, and there&#8217;s a lot of space there. We&#8217;ll have a garden, solar panels, and all the other bells and whistles.&#8221;</p><p>We were half-serious about our hostel, discussing the details every day: what it would look like, how we would get funding, the number of beds. It was a pipe dream &#8212; but dreams like this helped us pass the days on the beach.</p><p>We became aware of time again when, one day, our bill at Mama&#8217;s was suddenly double.</p><p>&#8220;What&#8217;s going on? This fish was half the price yesterday!&#8221;</p><p>&#8220;It&#8217;s Christmas! More Europeans this time of the year, so we raised our prices.&#8221;</p><p>Ahhh, capitalism at its best.</p><p><img src=\"https://media.nomadicmatt.com/kolipe-sunset2.jpg\" alt=\"sunset in Ko Lipe\"></p><p>Christmas also meant something else: I would have to leave soon.</p><p>My visa ran only until just before New Year&#8217;s, so I would have to leave to renew it before heading to Ko Phangan for the holiday.</p><p>I didn&#8217;t want to leave.</p><p>We were in paradise. Paul, Jane, Pat, and Olivia were staying and I felt like I was being ripped apart from my family, never knowing when I would see them again.</p><p>But the visa forced my hand.</p><p>Paul, Jane, and I decided to have own our Christmas together. It was only fitting. We wore our best clean shirts and wandered over to Coco&#8217;s for its luxury Western dinner.</p><p>&#8220;I got you guys a gift.&#8221;</p><p>I handed Jane a necklace I saw her eyeing a few days before and Paul a ring he had admired.</p><p>&#8220;Wow. That&#8217;s amazing, mate! Thanks!&#8221; said Paul.</p><p>&#8220;But this is funny,&#8221; he continued. &#8220;We got you something too.&#8221;</p><p>It was a hand-carved necklace with a Maori fishhook on it. It was their symbol for traveler. I wore it for years afterward, a symbol of our friendship, my time on the island, and of who I was.</p><p><img src=\"https://media.nomadicmatt.com/kolipe-dinner.jpg\" alt=\"Christmas dinner in Ko Lipe\"></p><p>Traveling quickens the bonds of friendship. When you are on the road, there&#8217;s no past. None of the baggage of home is with you or anyone you met. There&#8217;s only who you are right now. There&#8217;s nothing to get in the way of the now. No meetings to attend, errands to run, bills to pay, or responsibilities.</p><p>I once heard that the average couple spends four waking hours a day together. If that is true, then we had just spent the equivalent of four months together, but it felt like triple that since there was nothing to keep our minds off the &#8220;now.&#8221;</p><p>I&#8217;ve never been back to Ko Lipe. The development that&#8217;s sprouted would burst my image of perfect.  I&#8217;ve seen the photos of the concrete streets, the huge resorts, and the mass of people. I can&#8217;t bear to see that. Ko Lipe was my beach. The perfect traveler community. I want it to remain that way.</p><p>I would run into Paul and Jane again years later in New Zealand, but I would never see the rest of the group again. They are out there in the world doing their thing. <a href=\"https://www.nomadicmatt.com/travel-blogs/travel-memories/\" rel=\"noopener\" target=\"_blank\">Yet for that month, we were the best of friends.</a></p><p><img src=\"https://media.nomadicmatt.com/kolipe-teddy.jpg\" alt=\"the abandoned teddy bear in Ko Lipe\"></p><p>As I packed my bags and put on my shoes for the first time in a month, I said good bye to Plick Bear, the raggedy teddy bear I found on my porch that became our mascot, and I hoped that the journey ahead would be as good as the one I was leaving behind.</p></div>","title":"Ko Lipe: The Greatest Month in All my Travels"}},"pageContext":{"id":"5b95ea7187be05832748ffa8"}}