{"data":{"mongodbDatabaseArticles":{"id":"5b96298087be058327491195","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What else I&#8217;ve been up to:</h2><p>This week I&#8217;ve been up to nothing outside this site in terms of writing! I&#8217;ve had loads of massage appointments come through all week, so as I type this I&#8217;m laying on the couch waiting for MY masseuse to get here and fix me. I also played with an abandoned baby monkey who needs a babysitter until September.. Ben is with the monkey now, Nassi, and obviously wants to keep her. I&#8217;m also started a NEW business but that&#8217;s still a secret for now ;)</p><h1>Now for your story!</h1><p>We had just ordered our food at a nice restaurant. The waiter was just the nicest guy ever. It was raining and we were having a cup of hot tea.</p><p>The waiter came up to us with a huge smile and a cage&#8230; with a rat in it.</p><p>&#8220;Look madam, nice mouse, we just caught him!&#8221;</p><p>He was standing behind Ben and Ben was facing me. He silently mouthed, &#8220;what the fuck?&#8221; while I gave a huge smile back and said, &#8220;he&#8217;s really nice, are you keeping him?&#8221;</p><p>The waiter explained he was just going to go let him out somewhere else.</p><p>Now, I know some people would get upset about a rat (or the cutest mouse in India; it&#8217;s debatable) in the restaurant or even one being brought up to the table while you&#8217;re about to eat, but this guy was just so nice and I hate to make people feel embarrassed. For example, even when someone says something&#160;incorrect,&#160;I am not the type to call them out I just go along with it. I went along with this too.</p><p>The waiter walked off with his 8 inch &#8220;mouse&#8221; and we later enjoyed a <strong>delicious</strong> dinner.</p><h1>This is India!</h1><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on <a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>, <a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>, <a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a> &amp; <a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p>feature image <a href=\"https://www.flickr.com/photos/vinothchandar/8143981269\" target=\"_blank\">source</a>.</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! (nine)"}},"pageContext":{"id":"5b96298087be058327491195"}}