{"data":{"mongodbDatabaseArticles":{"id":"5b937b0a87be056953db7d0e","content":"<div><h3 name=\"b02f\" id=\"b02f\" class=\"graf graf--h3 graf--leading\">How Do Digital Nomads&#160;Live?</h3><p name=\"2630\" id=\"2630\" class=\"graf graf--p graf-after--h3\">It&#8217;s not as easy as digital gurus make it look. Building a location-independent business is incredibly difficult, and often, digital nomads have professional jobs that pay above-average incomes. These are the kinds of jobs most people dream of having&#8202;&#8212;&#8202;the kinds of jobs they can leverage to make the move to location independence.</p><h4 name=\"1e69\" id=\"1e69\" class=\"graf graf--h4 graf-after--p\">1. Transforming an existing&#160;career</h4><p name=\"12c0\" id=\"12c0\" class=\"graf graf--p graf-after--h4\">The increasingly digital nature of everyday employment makes it easy for some to dislodge their careers from the office. Creative careers, including writing and various design fields, rarely require the creative to be close to their clients&#8202;&#8212;&#8202;if there&#8217;s a client at all.</p><p name=\"ac8c\" id=\"ac8c\" class=\"graf graf--p graf-after--p\">Technical jobs, such as programming and software development, have a similar advantage. Employees can submit their work digitally and connect with coworkers via Skype, Slack, and email. There are a growing number of tech startups that promote remote work, presumably because it reduces costs by not requiring them to rent a large office space (though they&#8217;ll always spin it as providing more freedom to workers).</p><h4 name=\"f09a\" id=\"f09a\" class=\"graf graf--h4 graf-after--p\">2. Using funds from a previous job to build a new&#160;business</h4><p name=\"96b3\" id=\"96b3\" class=\"graf graf--p graf-after--h4\">Other digital nomads come from professional backgrounds where they were earning good salaries. Many of them didn&#8217;t love their jobs and wanted a change. Instead of starting to work remotely, either because it wasn&#8217;t possible or they didn&#8217;t want to remain in their position, they ditched their previous career and used their savings to strike out on their own. This is how many of them became lifestyle entrepreneurs.</p><p name=\"7f47\" id=\"7f47\" class=\"graf graf--p graf-after--p\">Of course, one of the favorite entrepreneurial endeavors of this class of digital nomad is instructing people how to follow their footsteps and become successfully location independent themselves. They sell a whole range of overpriced books and courses which are, more often than not, heavy on inspirational bullshit and light on worthwhile advice where the important detail of the financial security they got from their previous career is significantly downplayed, if not omitted.</p><h3 name=\"812f\" id=\"812f\" class=\"graf graf--h3 graf-after--p\">The Privilege of Digital&#160;Nomadism</h3><p name=\"11cd\" id=\"11cd\" class=\"graf graf--p graf-after--h3\">The <a href=\"https://worlddominationsummit.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">World Domination Summit</a> (WDS) takes place annually in Portland, Oregon. It&#8217;s as a gathering place for the lifestyle-entrepreneurship, do-what-you-love (DWYL) community that&#8217;s grown around the writings of Chris Guillebeau, Tim Ferriss, and other gurus that dominate the niche.</p><p name=\"6f81\" id=\"6f81\" class=\"graf graf--p graf-after--p\">In its early years, Amanda Palleschi covered the event for the <a href=\"https://newrepublic.com/article/119175/rise-do-what-you-love-inspires-thousands\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">New Republic</a>, calling out WDS for being attended primarily by white people who &#8220;have advantages or significant successes that enable them to see the world through DWYL-colored lenses (and to pay for the $500 entry fee to WDS).&#8221; Guillebeau himself even acknowledged that he was &#8220;mostly attracting other Westerners&#8221; and told Palleschi, &#8220;[j]ust because we have privilege doesn&#8217;t mean we can&#8217;t enjoy our lives.&#8221; The summit has advertised a more diverse set of speakers in recent years, but that doesn&#8217;t mean its audience is significantly more diverse. As the community has grown, there were bound to be minorities who did well within it (just as in society at large) but that doesn&#8217;t mean they make up a meaningful portion of its followers.</p><p name=\"7598\" id=\"7598\" class=\"graf graf--p graf-after--p\">Just as the fields that lend themselves to remote work&#8202;&#8212;&#8202;tech, in particular&#8202;&#8212;&#8202;are dominated by straight, white men, so too is the world of digital nomads. The promise of digital nomadism is built on a quasi-libertarian worldview that&#8217;s closely related to the <a href=\"https://medium.com/s/story/we-all-lose-when-elected-officials-drink-silicon-valleys-kool-aid-25ed045d278e\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">ideologies of Silicon Valley titans</a>. Though some believe in measures to promote social progress, many maintain that the government needs to take a hands-off approach on economic matters. The market is working just fine for these itinerant beach-dweller-workers. Why would it need to change?</p><blockquote name=\"c42c\" id=\"c42c\" class=\"graf graf--pullquote graf-after--p\">People who feel &#8220;liberated&#8221; from space have no stake in improving the space around&#160;them.</blockquote><p name=\"2d94\" id=\"2d94\" class=\"graf graf--p graf-after--pullquote\">The &#8220;Do What You Love&#8221; movement begins with privilege and ends with individual success. It ignores programs designed to promote collective wealth and well-being in developed societies. Miya Tokumitsu, a <a href=\"https://www.jacobinmag.com/2014/01/in-the-name-of-love/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Jacobin</a> contributing editor, called it &#8220;the secret handshake of the privileged and a worldview that disguises elitism as noble self-betterment.&#8221; The movement&#8217;s gurus try to appear selfless by gesturing toward charitable causes, but their initiatives often forward their worldview: helping others escape the tyranny of traditional work-life structures by building their own lifestyle businesses, many of which are predicated on their personal brands.</p><p name=\"4f30\" id=\"4f30\" class=\"graf graf--p graf-after--p\">The fierce individualism embedded in the culture of digital nomadism ignores (and can damage) communities, both at home and abroad. People who feel &#8220;liberated&#8221; from space have no stake in improving the space around them. To them, local communities are as valuable as co-working space. Digital nomads are far less likely to work toward positive local change, fight for the rights of disadvantaged peoples, or halt the gentrification that displaces long-term residents&#8202;&#8212;&#8202;to which they usually contribute&#8202;&#8212;&#8202;because those issues don&#8217;t affect them.</p><h3 name=\"2e9f\" id=\"2e9f\" class=\"graf graf--h3 graf-after--p\">Digital Nomads&#8217; Impact on Local Communities</h3><p name=\"c12c\" id=\"c12c\" class=\"graf graf--p graf-after--h3\">As people continue to move to cities and governments <a href=\"https://medium.com/@parismarx/the-private-housing-market-has-failed-us-e3d887d85ffe\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">fail to invest in affordable public housing</a>, urban cost of living has increased faster than wages, placing people in increasingly precarious positions. In developing countries, where governments do not have the resources to provide social supports that are common in developed countries, locals are even more exposed to the market.</p><blockquote name=\"4f39\" id=\"4f39\" class=\"graf graf--pullquote graf-after--p\">Lifestyle gurus advise their followers to find destinations where money will go further, ignoring the consequences for local&#160;people.</blockquote><p name=\"2cc2\" id=\"2cc2\" class=\"graf graf--p graf-after--pullquote\">Digital nomads look for locales that are inexpensive (by Western standards), where they can easily outspend residents to maintain a quality of life that would be difficult to achieve on local salaries. Chiang Mai, Thailand, and Bali are some of the leading destinations for those seeking a location-independent lifestyle. Predictably, developers in these areas begin to chase Western money.</p><h4 name=\"fb84\" id=\"fb84\" class=\"graf graf--h4 graf-after--p\">Taking advantage without giving&#160;back</h4><p name=\"ca3b\" id=\"ca3b\" class=\"graf graf--p graf-after--h4\">Coworking spaces flowered in these cities to serve the influx of Westerners. Property prices <a href=\"https://www.techinasia.com/digital-nomad-documentary-white-male\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">increased</a> because digital nomads can pay more than locals, leading to the displacement of longtime residents in favor of well-off, white newcomers. Lifestyle gurus advise their followers to find destinations where money will go further, ignoring the consequences for local people.</p><p name=\"e924\" id=\"e924\" class=\"graf graf--p graf-after--p\">This is a similar critique to the one leveled against Airbnb, which takes units off the market in major cities, limiting supply and increasing housing costs for locals in order to serve tourists and short-term visitors. Unsurprisingly, Airbnb is very popular among digital nomads moving to new destinations&#8202;&#8212;&#8202;and among those who don&#8217;t establish a permanent residence, opting instead to move every few days or weeks.</p><p name=\"3a2a\" id=\"3a2a\" class=\"graf graf--p graf-after--p\">Though digital nomads often come from developed countries and benefit from taxpayer-funded education, health, and social programs throughout their lives (and expect to in the future when they return to their home countries), they rarely feel an obligation to give back. Similar to tech libertarians, they minimize their tax burden by finding jurisdictions or countries with the lowest tax rate and, depending on the laws of their country of citizenship, move often enough that they aren&#8217;t obliged to pay income tax. (That&#8217;s without mentioning how many location-independent people are working in foreign countries outside the conditions of their visa, and not reporting their incomes.)</p><p name=\"da7a\" id=\"da7a\" class=\"graf graf--p graf-after--p\">Rhetorically, digital-nomad gurus say that everyone should follow their hearts and pursue their passion. It&#8217;s clear that this message is only meant for a particular group of privileged Westerners whose lifestyles are made possible by those rooted in place.</p><p name=\"25de\" id=\"25de\" class=\"graf graf--p graf-after--p\">If they do well enough in their adopted, third-world homes, digital nomads hire cleaners and gig economy workers, not to mention those who serve them at caf&#233;s, restaurants, bars, and co-working spaces. They also hire contract and freelance workers from low-wage countries to do the work they either don&#8217;t have the skills to do or find too monotonous to bother with. Digital nomads love a cheap virtual assistant.</p><h4 name=\"6ca6\" id=\"6ca6\" class=\"graf graf--h4 graf-after--p\">Privilege breeds ignorance</h4><p name=\"97c1\" id=\"97c1\" class=\"graf graf--p graf-after--h4\">Everything, cheap labor included, is simply a line item on the budgetary spreadsheet of digital nomads. They may achieve an additional degree of freedom and enjoyment from structuring their lives in an unconventional way, but that&#8217;s only possible because they surround themselves with people who have similar levels of privilege and an unquestioning adherence to an individualistic worldview strongly influenced by Silicon Valley&#8217;s brand of libertarianism.</p><p name=\"9837\" id=\"9837\" class=\"graf graf--p graf-after--p\">Location independence is only possible because of communication infrastructures built with public funds. Low-cost destinations exist because rich countries looted and plundered the rest of the world for centuries through colonialism and unequal trade relationships. The privilege of even considering digital nomadism is a result of legal structures and high-quality public services funded through the wealth generated by centuries of global dominance.</p><p name=\"a05f\" id=\"a05f\" class=\"graf graf--p graf-after--p graf--trailing\">Privilege allows digital nomads to ignore all these things. It allows them to live in a fantasy world where they need only worry about themselves. They take full advantage of their positions, increasing their satisfaction while avoiding their responsibility to contribute to the society that granted them their privilege in the first place. Their lifestyle actively augments the forces displacing locals. Digital nomads evidently do not care about the places where they happen to live and, for that reason, they have no place in the future.</p></div>","title":"Digital Nomads Are Not the Future – Member Feature Stories – Medium"}},"pageContext":{"id":"5b937b0a87be056953db7d0e"}}