{"data":{"mongodbDatabaseArticles":{"id":"5b96295987be058327491186","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature the luxury side of an awesome city.&#160;Guest bloggers will&#160;share about either their hometown or a town they are expat in and know very deeply so that you get a guide straight from a local.&#160;&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to&#160;Troms&#248;</h1><p class=\"p1\"><b><i>Tell us a little about yourself and tell us why you&#8217;re an expert on luxury travel in Tromso.</i></b></p><p class=\"p1\">My name is Vanessa and I blog about my life and travels in Scandinavia and the Arctic at <a href=\"http://snowintromso.com/about\">Snow in Tromso</a>. I&#8217;ve been living in Tromso for two years now after having moved there from Germany. I was a grad student for most of this time so money was tight. However I kept a list of restaurants I wanted to eat at and activities I wanted to do, that I&#8217;ve finally begun to cross off now that I&#8217;ve graduated and got a full-time job. Tromso, as the rest of Norway, is an expensive place but it offers a lot and is the perfect destination if you&#8217;re looking to experience the Arctic in style!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18240\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/At-Malangen-Brygger.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>What makes Tromso a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p1\">Tromso has the nickname &#8220;Paris of the North&#8221; which it got by a German travelling to the city in the 18th century, expecting a poor and backward place in the middle of nowhere. Instead he found fashion and architecture in line with what was trendy in central Europe at that time, hence his exclamation &#8220;This must be the Paris of the North&#8221;.</p><p class=\"p1\">Still today, Tromso is a hip and trendy place, trying to make the most out of its location in the Arctic. Thus you can spend your day going shopping or dog-sledding and your nights watching the Northern Lights from a whirlpool on a yacht. If that isn&#8217;t glamorous, I don&#8217;t know what is!</p><p class=\"p1\"><b><i>What 5 star hotel is the best in Tromso?</i></b></p><p class=\"p1\">Even though it&#8217;s only got 4 stars, <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Clarion_Hotel_The_Edge.htm\"><strong>Clarion Hotel The Edge</strong></a> is the most luxurious hotel you can find in Tromso. It has been opened in 2014 and has quickly become the most popular hotel in town. It&#8217;s where the Norwegian Royals stay whenever they visit the city. The Edge also hosts one of the finest restaurants in town: Kitchen &amp; Table by Marcus Samuelsson where you are served Manhattan cuisine with an Arctic twist.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18245\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Midnight-Sun-seen-from-Fjellheisen.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>What about boutique hotels in Tromso, of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p1\">Again, The Edge would be my first choice but <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Scandic_Ishavshotel.htm\"><strong>Scandic Ishavshotel</strong></a> and <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Clarion_Collection_Bakeriet.htm\"><strong>Clarion Collection Hotel </strong></a>w<a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Clarion_Collection_Bakeriet.htm\"><strong></strong></a>ith<a href=\"http://tidd.ly/8e9579e4\"></a> would be my alternatives. Even though they are both chain hotels, they offer a glamorous view on the fjord and the Arctic Cathedral. Scandic Ishavshotel furthermore is the best breakfast and brunch spot in town while Hotel With is situated in one of those historic wooden buildings at the waterfront that are so typical for Norway. It&#8217;s also close to the best sea food restaurant in town: Fiskekompaniet. </p><p class=\"p1\">If you&#8217;re okay with staying outside of the city though, I&#8217;d recommend <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Malangen_Resort.htm\"><strong>Malangen Brygger</strong></a> and <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Sommaroy_Arctic_Hotel_Tromso.htm\"><strong>Sommaroy Arctic Hotel</strong></a>. Both hotels offer luxury cabins with fantastic views on the fjords. Malangen Brygger is at a fjord south of Tromso and an ideal place for watching the Northern Lights or experiencing the Midnight Sun. Sommaroy Arctic Hotel then again is situated north of Tromso on the so called &#8220;Summer Island&#8221; where you&#8217;ll find sandy beaches and turquoise waters. It&#8217;s one of my favourite places in the area and definitely the best one if you&#8217;re visiting during summertime.</p><p class=\"p1\"><b><i>Are there any fun luxury activities for the adventurous traveler in</i></b><b><i> </i></b><b><i>Tromso?</i></b></p><p class=\"p1\">Tons! During winter, you can choose between experiencing the Northern Lights in the wilderness, and going dog-sledding, whale-watching, snow-shoe hiking or ice-fishing. </p><p class=\"p1\">In the summer, you can go on a fjord cruise or RiB ride, try kayaking, go glacier hiking or simply go fishing.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18248\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Sommaroy-Arctic-Hotel.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Where are the best hang outs during the day in Tromso?</i></b></p><p class=\"p1\">On a sunny day, you&#8217;ve got to visit the beach Telegrafbukta. As soon as the sun comes out, no matter how cold and windy it is, the locals head to the beach to sun-bathe or take a dip in the ice-cold ocean. Even if you don&#8217;t feel the urge to take off your clothes in 12 degree Celsius weather, a visit to the beach is time worth spent anyway. The scenery is just gorgeous as the beach is situated at a fjord from which you can admire the stunning mountains of the neighbouring island Kvaloya. </p><p class=\"p1\">On a rainy day, you should head to Ris&#248; &#8211; the no. 1 caf&#233; in town. Locals and tourists agree that Ris&#248; serves the best coffee in all of Tromso and the place is packed every day at midday as they serve delicious lunches as well!</p><p class=\"p1\"><b><i>If you have a big date night, what are the most delicious restaurants in Tromso and what are their best dishes?</i></b></p><p class=\"p1\">In case you&#8217;re staying at The Edge, you don&#8217;t even need to leave the hotel as their restaurant Kitchen &amp; Table will serve you dishes inspired by New York, but with a local Arctic twist. Their menu features for example &#8220;Rudolf loves beets&#8221; (reindeer meat), &#8220;Icelandic dream of Bj&#246;rn&#8221; (pulled pork) and &#8220;The King Crab &amp; CO&#8221;. </p><p class=\"p1\">If you&#8217;d like to try traditional Norwegian cuisine though, I can only recommend Fiskekompaniet and Hildr. Fiskekompaniet is a sea food restaurant and they serve the best halibut that I have ever eaten in my entire life!</p><p class=\"p1\">If you&#8217;d like to eat meat instead of sea food, Hildr serves some really nice reindeer meat which is traditional for the Sami, the indigenous people in Northern Scandinavia. </p><p class=\"p1\">Another great place for when all you really want is pizza &#8211; but in style, is Casa Inferno. Not only do they serve the best pizza in town, they also serve beer from local craft breweries and all of that in a steampunk atmosphere with the waiters being dressed up and the walls being decorated with gas masks &#8211; highly recommended!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18244\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Menu-by-Kitchen-and-Table.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Let&#8217;s talk desserts &#8211; what place makes the best?</i></b></p><p class=\"p1\">Kitchen &amp; Table has a pretty interesting dessert menu and I&#8217;ve once ate nitrogen ice-cream and bacon-banana &#8220;Elvis&#8221; cookies there which were absolutely fabulous. </p><p class=\"p1\">If you&#8217;re looking for more &#8220;traditional&#8221; desserts though, the restaurant Egon offers an Oreo cake and milkshakes that are to die for!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18241\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Dessert-at-Egon.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Tell us all the hot shopping spots in Tromso. Who&#8217;s carrying the trendy local designers?&#160;</i></b></p><p class=\"p1\">Scandinavians are trendsetters in both fashion and interior design so if you&#8217;re coming to Tromso to get a hold of the latest trends, you&#8217;re definitely visiting the right place. </p><p class=\"p1\">If you&#8217;re into fashion, <a href=\"http://www.moodsofnorway.com/en/start\">Moods of Norway</a> is the place to go to. Situated on the main street of the city, this boutique sells gorgeous Norwegian woolen sweaters and the latest party dresses.</p><p class=\"p1\">If you&#8217;re however looking for inspiration on how to decorate your flat, Kiil is where you should go! Situated downtown, this interior design store has everything from lamps to sofas &#8211; Scandinavian style.</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18249\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Telegrafbukta.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>What are a couple of the best salons and spas in Tromso?</i></b></p><p class=\"p1\">The best and most unique spa in town would be <a href=\"http://www.vulkana.no/index_en.html\">Vulkana</a> &#8211; or better MS Vulkana! This spa is actually situated on a boat and offers you the opportunity to admire the Arctic fjords from a hot tub on deck. And if that&#8217;s not exciting enough, the boat also has a sauna and a Turkish hamam! </p><p class=\"p1\">Places are limited and the spa is only open on Saturdays for a spa cruise and on Sundays while staying at the harbor, so you should make a reservation before coming to town. </p><p class=\"p1\">PS: The Norwegian crown prince booked the spa for a cruise with the Dutch royals not too long ago so remember to feel like a royal when bathing in the hot tub!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18246\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Northern-Lights.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>Time for a great sunset view&#8230; where would you go?</i></b></p><p class=\"p1\">If you&#8217;re visiting Tromso during summer and you&#8217;d like to experience the Midnight Sun, the best place for this would be <a href=\"http://fjellheisen.no/en/\">Fjellheisen</a>. Take the cable car up the mountain and watch how the sun doesn&#8217;t set but rather moves around Tromso Island from above!</p><p class=\"p1\">Fjellheisen is also a great place to visit during polar night. The sun doesn&#8217;t rise during that time but the sky turns orange and pink around midday when the sun almost makes it over the horizon. It&#8217;s a really special experience on a clear day and can best be watched from the top of the mountain!</p><p class=\"p1\"><b><i>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks. </i></b></p><p class=\"p1\">No visit to Tromso is complete without a beer at &#216;lhallen &#8211; the oldest pub in town. &#216;lhallen is part of the local Mack Brewery so you can choose from 50 different beers here. And don&#8217;t forget to take a selfie with the polar bear &#8211; the pub&#8217;s interior is classically Norwegian and reminds you of the old polar explorations!</p><p class=\"p1\"><img class=\"aligncenter size-full wp-image-18250\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Tromso.jpg?resize=560%2C420&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"560\" height=\"420\"></p><p class=\"p1\"><b><i>If you end the night at a fancy club in Tromso, which one do you head towards? </i></b></p><p class=\"p1\">Gr&#252;nder is the place to be on a Saturday night. It&#8217;s motto is &#8220;Hard Work &#8211; Hard Fun&#8221; and it&#8217;s packed all the time so be early! There&#8217;s live music Wednesdays to Saturdays and you can grab some tapas if you&#8217;re a bit peckish.&#160;</p><p class=\"p1\"><img class=\"size-full wp-image-18247 alignleft\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/08/Profile-Picture.jpg?resize=150%2C150&amp;ssl=1\" alt=\"Luxury Guide to Troms&#248;\" width=\"150\" height=\"150\">Vanessa is a German expat living in Tromso in the Norwegian Arctic. Currently working as a digital marketing consultant, she discovered her love for Scandinavia at an early age and decided to move to Northern Norway to do her Masters after a gap year spent traveling around the North. She blogs about her life in Norway and her travels around the Arctic over at <a href=\"http://snowintromso.com/\">Snow in Tromso</a> and can also be found on Facebook, Instagram, <a href=\"https://twitter.com/snowintromso\">Twitter</a> and <a href=\"https://www.bloglovin.com/blogs/snow-in-tromso-13179721\">Bloglovin</a>.</p><p>&#160;</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Tromsø"}},"pageContext":{"id":"5b96295987be058327491186"}}