{"data":{"mongodbDatabaseArticles":{"id":"5b95ea8187be05832748ffb0","content":"<div><p><img src=\"https://media.nomadicmatt.com/milanguide.jpg\" alt=\"Milan's city skyline\"><br> Milan is the fifth-largest city in the European Union and is recognized worldwide for being a design and fashion capital. It&#8217;s set apart by the city&#8217;s glamor and passions &#8211; football, opera, and fashion. But it has glitz and a few historic sites, for me, Milan is a meh kind of city that didn&#8217;t really amaze me. A lot of Milanese people have even told me it&#8217;s a city in which to work and not play. In my opinion, the city is worth a visit if you&#8217;re passing through but not an extended one.</p><p>In the Piazella Dello Sporto, this bronze sculpture pays homage to one of Leonardo&#8217;s original designs. If you are planning to check out the San Siro track or stadium, it is worth stopping by this courtyard as well.</p><p>This Leonardo da Vinci masterpiece resides in the church of Santa Maria della Grazie. Surviving the trials and tribulations that history, this fresco has been remarkably preserved. Book in advance if you going during peak season.</p><p>Built in the 15 th century by Francesco Sforza, the castle now houses 12 mini-musuems and a vast archive of artifacts. Collections include everything from the Renaissance period, Michelangelo&#8217;s unfinished last work and Civiche Raccolte d&#8217;Arte Antica, to the Museums of Musical Instruments and Antique Art. Admission costs 5 EUR.</p><p>This park is host to Sforzesco castle, Civico Acquario, Triennaler di Milano, Torre Branca, tons of esoteric bars, and a lot more. This is a great area in which to wander for hours and it is nice to relax on the grass when you get tired.</p><p>With over 3,500 statues, 135 spires, and 5 bronze doors, it is not surprising to find that it took 500 years to complete this. Take the elevator up to the roof for amazing views of the city (and maybe the Alps if it&#8217;s a really clear day). The city&#8217;s symbol Madoninna is also perched atop the roof. Taking the stairs costs 11 EUR and the elevator costs 15.</p><p>(Click the title to expand the text)</p><h5>1. Go shopping</h5><p>If you are looking to spend some serious money or even just to do some serious gawking, then you have found a kindred spirit in the Galleria Vittorio Emanuele 11. This is an intense shopping establishment of formidable grandeur that took 12 years to construct. It&#8217;s home to fashion giants such as Prada and Gucci. If you are feeling up to the pinch, buy yourself a 12 EUR coffee and watch as the Milanese high society passes you by.</p><h5>2. Watch some football</h5><p>If you are an avid football (soccer) fan, then book yourself tickets to a match at San Siro stadium. Milan is home to two of the world&#8217;s best football teams &#8211; AC Milan and Inter. Head there during the football season and it is likely that you might see either of these two playing in these famous grounds.</p><h5>3. Roam the flea markets</h5><p>While Milan is renowned for being home to fashion giants, it is also home to its fair share of flea markets too! Fiera di Senigallia, the city&#8217;s most popular and retro flea market, sells disco gear and comic books, among other things. Papiniano, a stone&#8217;s throw away, sells shoes and homewares. If you time your vacation for the end of the month, then a trip to the Antiquariato sul Naviglio could well be in order as it specializes in antiques.</p><h5>4. Visit Pinacoteca di Brera</h5><p>Fine-tune that sweet tooth for art even more by making a visit to the Pinacoteca di Brera. Although it doesn&#8217;t compare in size to the Sforzesco Castle, it certainly makes up for this by displaying some of the finest artwork by the likes of Raphael, Mantegna and Rembrandt. Admission is 10 EUR and it&#8217;s open daily (except Mondays) from 8:30am-7:15pm.</p><h5>5. Visit Idroscalo Park</h5><p>Patches of greenery do exist in the midst of this urban jungle. One favored among the locals is the man-made lake, Idroscalo. Here you will find lovely parkland with areas to cycle, hike and have a barbecue. It&#8217;s almost like being on the Italian coast.</p><h5>6. Walk along Corso Magenta</h5><p>Found in the northwest part of Milan, this street is home to several cafes, shops, and Baroque palaces. Notably, the Santa Maria delle Grazie church and convent are here, which houses The Last Supper. There are several metro stations nearby.</p><h5>7. Attend an Exhibition Fair</h5><p>There is an array of exhibitions held within the city year-round. You can check out anything from computers and industrial equipment to chocolate and wine. With some quick, simple research, you can add an exhibition into your trip.</p><h5>8. Tour the canals</h5><p>Surprised to hear that there are canals in Milan? Well, there are, two to be exact. Based in the Navigli district, they are very enchanting and to be enjoyed during the summer months when you can take a lazy boat trip whilst gazing upon the charming artist havens. This is a great neighborhood and makes for a restful break from the hustle and bustle of the city.</p><h5>9. Wander the Giardini della Guastalla</h5><p>Also known as the gardens of the Guastalla, these are some of the smaller but oldest gardens in the area. Dating back to the 16th century, the gardens have been open to the public since the early 1900s. They are near the Duomo and the University district.</p></div>","title":"Milan Travel Guide: : What to See, Do, Costs, & Ways to Save"}},"pageContext":{"id":"5b95ea8187be05832748ffb0"}}