{"data":{"mongodbDatabaseArticles":{"id":"5b95ea6387be05832748ffa1","content":"<div><p>A hammam is a steam bath popular in North Africa. They are usually found near mosques or toiletry shops and can be upscale or public (traditional). Visit a no-frills traditional one for an authentic and enlightening experience. Public hammams cost about 10 MAD, while hotel hammams can cost 300-500 MAD.</p><p>Chefchaouen is located in the middle of the Rif Mountains. It is very relaxed, offers reasonable accommodations, and is visually stunning. The streets and buildings are painted a vibrant sky blue, and the mountains in the backdrop are rugged and dramatic. It&#8217;s a great place to wander, shop, and sip mint tea.</p><p>The Sahara is exactly how it is portrayed in the movies &#8211; vast, empty, and absolutely spectacular. You can spend the night in a simple tent in the dunes. This was my favorite activity while in the country and I highly recommend it. The stars go on forever and there&#8217;s no light pollution to block them out. (The camel ride isn&#8217;t that comfortable, though!)</p><p>Spend some time in the Djemaa el-Fna, where you can find exotic street performers, tattoo artists, musicians, and chefs. After that, wander around the medina, explore the souks, eat in the market, see the old city, and enjoy Morocco&#8217;s most international city. Marrakesh has it all.</p><p>(Click the title to expand the text)</p><h5>1. Get lost in the medinas</h5><p>The medinas are the historic hearts of each city in Morocco: part residential area, part shopping center, part food market. Here you&#8217;ll find twisting and turning streets where shops, restaurants, markets, and homes all line the streets in buildings seemingly too close together and too old to stay up much longer. As someone who loves to get lost, the medinas were heaven. Word of caution: The Fez Medina is a bit sketchy and unsafe, so do not go too far off the beaten path. Stick to streets with lots of people.</p><h5>2. Trek the High Atlas</h5><p>The rugged and beautiful Atlas Mountains stretch over 1,500 miles, from the West Coast of Morocco all the way to Tunisia. This mountain range is home to Jebel Toubkal, North Africa&#8217;s tallest peak at 13,671 feet. You can hike all year round, but the best time is from April to May.</p><h5>3. Trek through the Torda Gorge</h5><p>This gorge is one of the most recognized in the world and has become very popular with travelers looking to hike the canyon. It&#8217;s a challenging hike but if you&#8217;re looking for something truly different and outdoorsy in Morocco, don&#8217;t miss out on this.</p><h5>4. Visit the Hassan II Mosque</h5><p>The Hassan II Mosque, located in Casablanca, is a population attraction among tourists. It took thousands of Moroccan artists a total of five years to build this detailed architectural masterpiece. Its mosaics, plaster moldings, marble and stone columns and floors, and wood ceilings are utterly impressive. It is big enough for 105,000 worshipers, making it one of the largest mosques in the world! I was awed.</p><h5>5. Learn to cook traditional food</h5><p>Traditional Moroccan food is a blend of Berber, Arabic, Turkish, Middle Eastern, and French cuisine. Many riads (Moroccan house or palace) offer cooking classes in the big cities like Marrakesh and Fez. You&#8217;ll be able to buy fresh produce from the local market and then make a traditional dish. Cafe Clock offers some of the best classes. It was recommended to me by many people and with locations in Marrakesh and Fez, this Western-influenced caf&#233; is famous for its gigantic and delicious camel burger (which tastes a lot like spicy shawarma).</p><h5>6. Wander thru Kasbah les Oudaias</h5><p>Located in Rabat, this Kasbah is found in the oldest part of the city. It&#8217;s tranquil, picturesque with its narrow streets of white houses, and a great place to wander around. Its elevation offers beautiful views of the river and ocean.</p><h5>7. Catch some waves</h5><p>Morocco is extremely popular among surfers. The best time to go is during the winter months when the waves are bigger and more consistent, and the air and water temperature is mild. Head to Taghazoute, the most popular surf town, to catch some waves and browse the surf shops.</p><h5>8. Visit Tangiers</h5><p>This major city in northern Morocco is located on the North African coast at the western entrance to the Strait of Gibraltar. The history of Tangiers is very rich, due to the historical presence of many civilizations and cultures. Almost 100 years ago, Tangiers was considered as having international status by foreign colonial powers and became a destination for many European and American diplomats, businessmen, writers, and spies. Today it&#8217;s a hip must-see city.</p><h5>9. See Atlas Studios</h5><p>Named for its proximity to the Atlas Mountains, Atlas Film Studios in the city of Ouarzazate, is the largest film studio in the world covering more than 322,000 sq ft of the desert. Many big films have been shot here including: Lawrence of Arabia (1962), The Last Temptation of Christ (1988), The Mummy (1999), Gladiator (2000), Kingdom of Heaven (2005), Hanna (2011), and part of the TV series Game of Thrones.  Be sure to visit the nearby Ksar of A&#239;t Benhaddou kasbah too! It plays into what people think a ksar should look like. I enjoyed roaming the streets and climbing to the top for the view. It&#8217;s used in all the movies listed above.</p><h5>10. See the Ancient City of Volubilis</h5><p>A major trading center and the southernmost settlement during Roman times, Volubilis is one of the best preserved (and least frequented) such ruins in the world. I found it empty of tourists, not built up, and open in a way that really lets you get up close and see the structures without being behind ten feet of barriers and jostled by crowds. Most of the city is still unexcavated so the site has a very raw feel to it. I&#8217;ve been to a lot of Roman ruins in my travels, but I love this one the best. It&#8217;s a lovely day trip away from the crowds and noise of Fez. Entrance is 20 MAD.</p><h5>11. Enjoy the Meknes Medina</h5><p>Pleasantly stroll the Medina in Meknes without being pestered. This authentic market sells handicrafts made in Meknes such as the hand embroidery and Meknes &#8220;Damascene&#8221; ironwork. If the Medinas of Fez and Marrakesh overwhelm you, this is the place to go.</p><h5>12. Explore Essaouira</h5><p>Essaouira is located a few hours from Marrakesh on the Atlantic coast and is a popular beach destination for tourists, especially Brits. I loved the relaxed atmosphere of the city, the lack of pushy touts, the sea air, and all the fresh fish. Be sure to visit the wonderful fish market in town, where all the small fishermen sell their day&#8217;s catch. Afterward, check out the small fish stalls nearby in the main square where you can enjoy fresh seafood grilled really cheap. Try stalls #5 and #11 for the best fish!</p></div>","title":"Morocco Travel Guide: What to See, Do, Costs, & Ways to Save"}},"pageContext":{"id":"5b95ea6387be05832748ffa1"}}