{"data":{"mongodbDatabaseArticles":{"id":"5b95f4f987be05832749013d","content":"<div><p>SEE TEFL offers a 4-5 month placement for PAID full-time English Teaching in Central and Northern Thailand &#8212; 2 weeks of TEFL training at our training school in Chiang Mai + accommodation (while training) included. At the end of the placement period participants receive TEFL certification. These teacher training + paid internships are offered twice per year, at the beginning of the Thai school semester.</p>\n<p>It&#8217;s not necessary to possess previous teaching experience or to know any Thai language.</p>\n \n<p><strong>This is a separate program from SEE&#8217;s standard <a href=\"/4-week-tefl/\">4-week 120-hour TEFL Course</a>.</strong></p>\n<h3>TEFL Teacher Internship Training Components</h3>\n<p>There are two training components:</p>\n<ul>\n<li><strong>Pre-arrival</strong>: Videos and assignments that introduce classroom management skills and review common grammar terminology.</li>\n<li><strong>Post-arrival</strong>: 2 weeks of face-to-face group training that focuses on developing essential EFL classroom teaching skills, language awareness and observed teaching practices. In addition, there is basic Thai language instruction and cultural awareness training.</li>\n</ul>\n<h3>TEFL Salary &#8211; Paid Internship</h3>\n<p>Interns are paid at least <strong>28,500 Thai Baht (THB) per month</strong> during the placement period. Thailand has low living costs, so this salary can provide a comfortable lifestyle while teaching in Thailand in local Thai communities.</p>\n<p>This internship is actual paid employment by a school in Thailand. Interns must be employed by a school in order to obtain non-imm B visas and work permits.</p>\n<h2>2018 Dates</h2>\n<ul>\n<li>Onsite training from <strong>September 24th &#8211; October 5th</strong> followed by a paid teaching internship for 4-5 months</li>\n</ul>\n<h2>2019 Dates</h2>\n<ul>\n<li>Onsite training from <strong>April 16th &#8211; 26th</strong> followed by a paid teaching internship for 4-5 months</li>\n<li>Onsite training from <strong>September 23rd &#8211; October 4th</strong> followed by a paid teaching internship for 4-5 months</li>\n</ul>\n<p>Onsite training always starts on a Monday; however, <strong>Please note that for only our April 16th training date, training starts on a Tuesday</strong> as the Monday is the last day of the Songkran National Holiday. Week 1 for our courses starting 16 April will run from Tuesday to Saturday. The following week will run Monday &#8211; Friday.</p>\n<p><img class=\"aligncenter colorbox-916\" src=\"/wp-content/uploads/2014/04/Thai-Temples-and-Buddha-Statues.jpg\" alt=\"Thai Temples and Buddha Statues\"></p>\n<h2>Paid TEFL Internship Eligibility Requirements</h2>\n<ul>\n<li>Be an English native speaker</li>\n<li>Hold a passport from Australia, Canada, Ireland, New Zealand, United Kingdom, South Africa or the United States.</li>\n<li>Be a university graduate and hold a recognized bachelor&#8217;s degree.</li>\n<li>Be no older than 50 and no younger than 21.</li>\n<li>Be adaptable to new and unpredictable situations</li>\n<li>Be of good character and possess a friendly, patient and flexible personality</li>\n<li>Be familiar with Microsoft Word or OpenOffice Writer</li>\n</ul>\n<p>If you meet these requirements, you are eligible to join our Internship program. <a href=\"/register-now/\">Please register here</a></p>\n<p>A police clearance needs to be provided as part of the paperwork requirements of a non-immigrant B (Business) visa application. This can be obtained from the Intern&#8217;s home country before departure for Thailand or in Chiang Mai from the Thai Police. Please contact us to discuss specific details.</p>\n<p><strong>We can also accept applications from non-native speakers.</strong> Please forward by email a copy of your CV with photo and evidence of a language proficiency equivalent to at least IELTS Band 7. These documents will be forwarded to our placement schools who will decide whether they accept the applicant.</p>\n<p><img class=\"alignleft colorbox-916\" src=\"/wp-content/uploads/2014/04/Teaching-in-the-Thai-Classroom.jpg\" alt=\"Teaching in the Thai Classroom\"></p>\n<h2>Location of Internships &#8211; Central and Northern Thailand Provinces</h2>\n<p>Over the past four years we have placed interns in the Northern Thai towns of <strong>Khampaeng Phet, Utthai Thani, Phayao, Phitsanulok, Chiang Mai, Mae Hong Son</strong> (when available), and <strong>Nan</strong> (when available).</p>\n<p>Placements are in formal Thai schools. Depending on availability at the time of placement, opportunities usually exist to teach in kindergarten (anubahn), primary school (pratom), secondary school (matayom) and colleges working Monday to Friday from around 7:30am to 4:00pm each day. A working week normally involves 18 &#8211; 22 teaching periods of between 50 and 60 minutes.</p>\n<p>The academic year in Thailand runs from early May to late March, with a break in early October. Our teacher placement and the two induction training sessions coincide with the start of the two academic semesters in early May (First Semester) and late October (Second Semester). The two week teaching essentials align with the start of a school semester, and the teaching Internship placements are for that length of time.</p>\n<p>After completing their 1 semester teaching placement period, interns receive <strong>full SEE TEFL Certification</strong> upon submission of a 2,000 word essay reflecting on their teaching experience. So far almost all interns have completed this step and received full TEFL certification.</p>\n<p><strong>Intern certification</strong> (equivalent to 120 face-to-face training hours and 6 OTPs): pre-course training, on-site training, 1 semester placement and 2,000 word essay at the end of the placement period reflecting on their teaching/training experience. SEE TEFL provides detailed instruction/guidance.</p>\n<h2>Inclusive Resort-style Accommodation</h2>\n<h3>Chiang Mai Accommodation</h3>\n<p>Resort accommodation at the <a href=\"http://www.ecoresortchiangmai.com/default-en.html\">Eco Resort Chiang Mai, Bumrungrad Road </a> with breakfast and swimming pool is included in the Internship fee for 15 nights during post-arrival training in Chiang Mai. <a href=\"http://www.ecoresortchiangmai.com/gallery-en.html\">Eco rooms</a> are shared with other same-sex Interns. Single-occupancy can be arranged for an additional fee of <strong>$ 150 USD</strong>. The resort is a 5-minute walk from the SEE TEFL training center.</p>\n<p>After training and during placement periods, Interns are responsible for the cost of their own accommodation. Placement schools will introduce their Interns to a range of accommodation options after arrival. Comfortable 1-bedroom apartments only cost between <strong>3,000 and 5,000 Thai Baht (THB)</strong> per month. This will usually include air-conditioning, a double bed and a separate bathroom. Thai apartments rarely have kitchen areas as most Thais eat out as eating food at restaurants or takeaway from markets is very inexpensive.</p>\n<h3>Eco Resort Chiang Mai &#8211; Bumrungrad Road</h3>\n<p></p>\n<p>&#160;</p>\n<h2>TEFL Internship Fees and Dates</h2>\n<p>The standard fee for the complete program is <strong>$ 1,295 USD</strong>. This includes the two weeks of Teaching Essentials training and comfortable resort accommodation during the 2-week course in Chiang Mai.</p>\n<p>Payment is made in two parts:</p>\n<ul>\n<li><strong>$ 495 USD</strong> deposit payment which reserves the place on the program</li>\n<li><strong>$ 800 USD</strong> balance payment, which is due at the end of the first day of the program</li>\n</ul>\n<p>(<a title=\"Current Exchange Rates\" href=\"http://www.xe.com/ucc\">See current exchange rates</a>)</p>\n<p>Note that payment includes 15 nights resort accommodation at the <a href=\"http://www.ecoresortchiangmai.com/default-en.html\">EcoResort Chiang Mai</a> during training.</p>\n<p>Some participants may want to consider various ideas for <a href=\"/fundraising-for-tefl-training/\">raising funds to cover the cost of the SEE TEFL Internship</a></p>\n<p><strong><a href=\"/teacher-training-and-teaching-internship-details/\">Further Teacher Training and Teaching Internship Details</a></strong></p>\n</div>","title":"2 Weeks Onsite Training with accommodation plus 4-5 Month Teaching Placement"}},"pageContext":{"id":"5b95f4f987be05832749013d"}}