{"data":{"mongodbDatabaseArticles":{"id":"5b9248ce87be056953db7bf7","content":"<div><p><a href=\"//news.ycombinator.com/item?id=7891017\">This post</a> on HN today hugely resonated with me.</p> <blockquote><p> Achievement-oriented people are given to depression both when they fail and when they succeed. If your identity is tied up in your work, then you feel bad about yourself when work isn't going well. That's obvious, and that's the message of this blog post. The implicit message is that you're depressed because you're not succeeding, so get your shit together and succeed and be happy like everyone else. </p></blockquote> <p>Even if we succeed and have businesses that do well, the question is what do we do it for? For many of us, it's because we love to work with technology and we don't want a normal job. But is that enough?</p> <blockquote><p>But then if you do succeed, you start to wonder, why did I just spend my youth in this masochistic, narcissistic path, and why the fuck am I not as happy as I was expecting, and is this really all there is in life. This is a classic \"achiever in crisis.\" The problem is that you realize all along you've been doing things that OTHER people wanted -- that is, you've been doing things that make you valuable in society -- perfect summed up in the raison d'etre du jour, \"making the world a better place.\" And nobody stopped you, because who can argue with making the world a better place? (Or being a doctor, or whatever.) But upon reflection, you quickly realize that this was in many ways easier than asking yourself what YOU wanted out of life. I.e. you've pushed aside your innate feelings and desires, whatever they may have been, and replaced them with the external motivation of achievement, under the rationale that you'd be able to \"figure it out\" after you had \"made it\".</p></blockquote> <blockquote><p>Unfortunately achievers aren't really sure what they want \"deep down\" because achievement is inherently defined by society, and then after they've \"made it\" they freak out because they start to wonder if there even is a \"deep down\" or if they're just a highly educated donkey chasing a carrot.</p></blockquote> <blockquote><p>If you talk to e.g. people who've gone through rigorous Ph.D. programs, you'll find a number of them were severely depressed after their defense. It was just kind of a let-down after such a long buildup, and then they started to wonder why they invested the entirety of their twenties into it and question whether that's really what they wanted their life to be. At least before the defense they could have something look forward to, and the various requirements provided a source of manic energy to propel the achiever forward.</p></blockquote> <p>&#8212; EvanMiller on <a href=\"//news.ycombinator.com/item?id=7891017\">Hacker News</a></p> <p>Another more recent post fits the same narrative:</p> <blockquote><p>IMHO, to continually put \"success\" above everything else in your life and slave away towards that goal as the ultimate redemption in everything is a waste of your time and therefore your life.</p></blockquote> <blockquote><p>It can be such as easy sell, especially to people with low self-esteem... if only you were rich, had a great body, had success with the opposite sex, etc., etc. And always underlying it, but never spoken of, is the vain and self centered attempt to compare yourself to others and come out on top.</p></blockquote> <blockquote><p>When these goals are achieved, rarely does anyone publicly say that it wasn't worth it. It's like a bad marriage rotting from the inside. No one wants to admit to being a fool. So stuff like this propagate, it's a beautiful lie. Rather than think of how awesome your life will be if you just work a little harder and achieve success, you might as well be talking about how great heaven will be as long as you follow some arbitrary religious text.</p></blockquote> <blockquote><p>It's like you think someone out there is keeping score, and it's all some type of game which you can win. We came from nature, and in nature, nobody keeps score. Animals live and die on the basis of stupid luck all the time. On your death bed you probably won't be looking over your life and decide whether it was worthwhile or not, and give yourself some report card on it. Instead you more likely won't even remember more than bits and pieces, and then eventually die and forget it all.</p></blockquote> <blockquote><p>I'm not saying don't try. Just make sure you are enjoying what you are doing, first and foremost. If you're not happy, either motivate yourself in a positive way, or let it go. It really isn't worth it.</p></blockquote> <p>&#8212; conroe64 on <a href=\"//news.ycombinator.com/item?id=7990904\">Hacker News</a></p> <p>I guess the only answer would be to keep learning, keep setting higher goals and keep following your drive and ambition to get there. And making sure that you enjoy whatever it is that you're actually doing, while you're doing it. Yes, it's meaningless, but so is everything else right?</p> <p>Having people around you that you love to care for and have fun with also helps give meaning.</p> <p>But to be honest, I'm still completely clueless. Most of my twenties have been exactly this. Trying to reach success and reaching some of it. It feels weird to keep setting new goals when I know this is all a farce anyway. What's the right way to deal with life then? I'd love it if you told me.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"The achiever in crisis"}},"pageContext":{"id":"5b9248ce87be056953db7bf7"}}