{"data":{"mongodbDatabaseArticles":{"id":"5b921d1487be0571ac1b04f1","content":"<div><p></p><img class=\"size-full wp-image-21445\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/06/how-to-get-the-best-of-everything.jpg\" alt=\"How to get the best of everything\" width=\"700\" height=\"467\"><p>Dateline: Dubai, United Arab Emirates</p>\n<p>There is nothing quite like flying on Emirates. For someone such as myself who pays attention to detail and wants to <a href=\"http://nomadcapitalist.com/five-magic-words/\">&#8220;go where I&#8217;m TREATED best&#8221;</a>, these guys have the service game won hands down.</p>\n<p>However, merely getting here en route from Warsaw to Port Vila, Vanuatu was a challenge. My first flight out of Warsaw was, sadly, on the far less hospitable Air Berlin, which canceled my flight without notice just as our bus arrived at the actual plane.</p>\n<p>As a frequent flyer, I was fortunate enough to be re-booked directly on Emirates flights almost all the way to Vanuatu, but with one substantial challenge: Central and Eastern Europe isn&#8217;t exactly the most hospitable place when you need service urgently.</p>\n<p>In all of my years frequenting countries like Poland, I&#8217;ve learned an oft-repeated phrase: &#8220;It is not my problem.&#8221;</p>\n<p>Go anywhere in eastern Europe seeking help and you just might hear &#8220;it is not my problem&#8221;. I&#8217;ve experienced it anywhere from the restaurant that advertises wi-fi but the wi-fi doesn&#8217;t work, to gate agents at Warsaw airport who could care less if you get the seat upgrade you paid for.</p>\n<p>I&#8217;m told that, when translated literally, most people saying that really mean &#8220;It is not my fault&#8221;, but it certainly doesn&#8217;t come out that way.</p>\n<p>For years, I&#8217;ve been a big advocate of <a href=\"https://en.wikipedia.org/wiki/Eastern_Europe\" target=\"_blank\" rel=\"noopener\">Eastern Europe</a> as one of the underrated <a href=\"http://nomadcapitalist.com/2016/06/01/best-countries-in-eastern-europe-business/\">&#8220;hidden gems&#8221; for business</a>. While Asia in particular has gotten a lot of attention from Nomad Capitalists, eastern Europe seems to often be viewed as one in the same with their high-tax western European neighbors.</p>\n<p>Eastern Europe &#8211; defined as non-EU Europe in particular &#8211; is easier to immigrate to, has more open and better banks, offers <a href=\"http://nomadcapitalist.com/2015/05/08/average-salary-to-hire-affordable-european-workers/\">better value employment opportunities</a>, and is a better value to live than the rest of Europe.</p>\n<p>I continue to believe that countries like Serbia, Montenegro, Romania, and Georgia offer a lot of potential in many different areas.</p>\n<p>Sadly, the countries &#8220;in the middle&#8221; &#8211; Poland, the Czech Republic, and Hungary, for example &#8211; don&#8217;t offer the conveniences of western Europe, nor the opportunities of eastern Europe.</p>\n<p>However, no place is a panacea. Just because Serbia or Romania offer many opportunities does not mean your hotel&#8217;s concierge will be as well-trained as you&#8217;d expect in Dubai, for example.</p>\n<p>One thing that I feel is constantly worth reminding people about is just what &#8220;go where you&#8217;re treated best&#8221; means: seeking out the best opportunities wherever they are, whether that is in one place or ten places.</p>\n<p>This is the original <a href=\"http://nomadcapitalist.com/flag-theory/\">Five Flags Theory</a> on steroids, and it means planning each aspect of your life to get the best of everything.</p>\n<p>With airlines like Emirates and Turkish Airlines each flying to a gazillion places these days, it&#8217;s easier than ever to not have to settle.</p>\n<p>For example, while I am looking forward to spending much of my summer downtime <a href=\"https://www.youtube.com/watch?v=UThJKGsLNcU\" target=\"_blank\" rel=\"noopener\">relaxing in Montenegro</a>, I wouldn&#8217;t rate medical care in Budva as best in class. Nor does Montenegro offer world class shopping for stocking up on essentials.</p>\n<p>Instead of tolerating those services in Europe, I&#8217;ve arranged my life to include two annual medical and dental visits each year. That includes one winter visit to the dentist, dermatologist, and general practitioner in Kuala Lumpur, and one summer visit to the dentist and cardiologist in Dubai.</p>\n<p>Not only is getting to Dubai is easy and comfortable from Europe, but the St. Regis in Dubai can cost as little as $140 per night in the hot summer months, making it a great getaway for medical tourism and some air-conditioned shopping in your downtime.</p>\n<p>If you had the traditional two weeks of vacation time each year, you might not choose to spend it in Dubai&#8217;s summer heat, but as a Nomad Capitalist setting your own schedule, your entire calendar is open to experience the best.</p>\n<p>As more and more successful six- and seven-figure entrepreneurs discover the benefits of the Nomad Capitalist lifestyle, they are transitioning into this new way of living. However, one thing I am increasingly noticing is that many entrepreneurs want to largely stay in one or two places most of the time.</p>\n<p>While there is nothing wrong with living a one- or two-base lifestyle and centering your life there, you may be missing out on the full benefits we talk about here by doing so.</p>\n<p>If you set up your banking correctly, you won&#8217;t need to spend much time visiting your banks.</p>\n<p>Ditto for your <a href=\"http://nomadcapitalist.com/2015/07/01/offshore-company-jurisdictions-avoid/\">offshore company jurisdiction</a>, where you host your website, and where you maintain tax residency.</p>\n<p>However, being mobile is important. While it is possible to simply live in a tax haven full-time, my suggestion is to make a list of the products, services, and experiences you value and make sure you schedule time to travel where those things are best available.</p>\n<p>The old way to go where you&#8217;re treated best was to move to one country that offered most of what you needed. For the ultra-rich, it was and still is possible to move to Monaco, but even Monaco doesn&#8217;t offer the best of everything.</p>\n<p>Rather than following the old model of overpaying to accept &#8220;the best&#8221;, I recommend making a list of all of the important experiences in life and asking yourself where you can achieve the best result.</p>\n</div>","title":"How to get the best of everything in life by planting flags"}},"pageContext":{"id":"5b921d1487be0571ac1b04f1"}}