{"data":{"data":{"edges":[{"node":{"id":"5b93838887be056953db7e5c","title":"Why I Only Work Remotely – NewCo Shift – Medium","source":"medium_search_remote","summary":"Open officesMost startups nowadays are obsessed with the open office environment, and it’s nearly impossible to find companies that do not implement this type of layout.\nIt’s hard to estimate how many startups are being held back by the obsession and group think around the open office environment.\nButts in seats thinking vs ROWEROWE (results only work environment) is a fantastic framework that needs to be adopted in places employing knowledge workers.\nIn the case of working from home/remote work, some employees do not do their best work from home, or simply don’t like it.\nIt’s the same reason that communism does not work nearly as well as capitalism — things work best when you give people freedom as individual actors.","info":{"author":"Yan Lhert","top_img":"https://cdn-images-1.medium.com/max/1200/1*n-RV1WLO6v0NdyvZ0LBvnA.jpeg"}}},{"node":{"id":"5b93836d87be056953db7e5a","title":"iOS remote push notifications in a nutshell – Flawless App Stories – Medium","source":"medium_search_remote","summary":"Follow these steps again Certificates, IDs & Profiles -> Identifiers -> App IDs and you should see that Push Notifications are now enabled for Development:Developer Push Notifications enabledStep 4, some code finally: Lengthy configuration, I know, but as mentioned earlier, security is security.\nIn that way, we make sure the user is asked to register for push notifications at the start of the application.\nHowever, there is a pitfall to bear in mind in general — a user can always disallow push notifications authorization in the phone’s settings.\nIn Xcode, go to File->New->Target… like this:File->New->Target… selectionThen in the next menu, under iOS, Filter “service” and choose Notification Service Extension like so:Filtering Notification Service ExtensionClick the Next Button and give it a name of your choosing.\nAnd that is how the Notification Service would know what notification actions to show!","info":{"author":"Deyan Aleksandrov","top_img":"https://cdn-images-1.medium.com/max/1200/1*N5S-XOXZwTQlVdO1ozeLkw.png"}}},{"node":{"id":"5b93836487be056953db7e58","title":"Top 20 Remote Working Apps – The Mission – Medium","source":"medium_search_remote","summary":"Top 20 Remote Working AppsEssential Apps for Home, Co-working spaces and Coffee shopsIn a video last month I wanted to document some of the applications I’m currently using as resources for daily remote work.\nWorking remotely is becoming increasingly popular as technology continues to improve.\nWith research from Stanford suggesting that telecommuting from home has improved performance by 13%, per employee.\nAll of these applications have been handpicked for their flexibility and features to enable you as a remote worker.\n► Top 20 Remote Working Apps • Full Video Here ◄All of the photos from this piece are taking from my remote working adventures.","info":{"author":"Francesco D'Alessio","top_img":"https://cdn-images-1.medium.com/max/1200/1*BHtafTPrsTPNudCsKV8-FA.png"}}},{"node":{"id":"5b93835f87be056953db7e57","title":"How to Make Money Online: 38 Remote Jobs in 2018 – The Mission – Medium","source":"medium_search_remote","summary":"How to Make Money Online: 38 Remote Jobs in 2018 Every year it’s becoming easier to work from your laptopIf you haven’t thought about how to make money online you’re either…A) 90 years old and your grandchild just got you your first computer,orB) uhhh honestly, I don’t know what the hell you’re doing.\nOf course the blogger has been on the list for how to make money online since the beginning of RSS feeds.\nOnline TutorTeaching online classes is always a sure shot way to make money online.\nSell Online CoursesOne way I’ve personally made money online is through selling my online course — The Complete Travel Developer Course.\nNow this can be harder than you may think, but with services like Teachable and ConvertKit it’s never been easier to make money online with online courses.","info":{"author":"Phil Manning","top_img":"https://cdn-images-1.medium.com/max/1200/1*MajAzYSF1wd0J_3RYUq2kQ.jpeg"}}},{"node":{"id":"5b93835d87be056953db7e56","title":"How to Run a Remote Design Sprint Without Going Crazy","source":"medium_search_remote","summary":"How to Run a Remote Design Sprint Without Going CrazyA few tricks for distributed teamsOne of the most common questions about the GV sprint process is “How do you run a remote sprint?\nWhat if the team can’t be together in one place?”I’ve heard stories of people running successful remote sprints, but to be honest, I never totally believed it.\nI still don’t have a perfect answer for how to make remote sprints work.\nRunning a remote sprint is pretty exhaustingRemote sprints are harder than in-person sprints.\nIf there was ever a time to break a sprint over a couple of weeks (maybe “Monday” happens on week 1, and the rest of the sprint happens on week 2) it’s with a remote sprint.","info":{"author":"Jake Knapp","top_img":"https://cdn-images-1.medium.com/max/1200/1*QMqfG7etf8MSL-sAWdMr_g.png"}}},{"node":{"id":"5b93835b87be056953db7e55","title":"6 things to ask when interview for a remote job – freeCodeCamp.org","source":"medium_search_remote","summary":"Let’s take a look at some guidelines and questions that you can ask a potential remote employer.\nFully Remote PositionsMost companies that I have worked for supported remote work in some fashion or another, some better than others, however there’s clearly a learning curve for employers as well as remote employees.\nTypically jobs listed as remote are fully remote.\nCommunication is done through things like Slack/Hipchat, video chat like Skype or Google Hangouts, project management tools and let’s not forget email and phone calls.\nYou should try to get interviews with multiple companies that support remote workers and see how they answer your questions differently.","info":{"author":"Thomas Schultz","top_img":"https://cdn-images-1.medium.com/max/1200/1*S8xlaxth2uIZecHTVMNpHw.jpeg"}}},{"node":{"id":"5b93835a87be056953db7e54","title":"Why I Chose to Build a Fully Remote Company Before it Was Cool","source":"medium_search_remote","summary":"Why I Chose to Build a Fully Remote Company Before it Was CoolOk, I admit that I didn’t choose to build a fully remote company.\nI founded Articulate in 2002 as a remote company because I had to.\nI’d scraped together just enough money to bootstrap the company, but not enough to secure office space in high-rent New York.\nWhile IBM calling remote workers back to the office might seem like a setback for the remote model, many predict the move will backfire, noting that remote work is the new normal.\nCheck out my other articles on remote work:","info":{"author":"Adam Schwartz","top_img":"https://cdn-images-1.medium.com/max/1200/1*ik5UosP-XxxpWNnEjfwdtw.jpeg"}}},{"node":{"id":"5b93835a87be056953db7e53","title":"How I worked remotely from 11 cities in 3 months – Buffer Posts – Medium","source":"medium_search_remote","summary":"I lived in Japan as a kid for 3.5 years, and I lived in Hong Kong for 6 months in 2012.\nHaving worked on Buffer for almost 5 years, I’ve realized that is quite a long time, and I’ve been getting older during those years.\nI was already great friends with Brian, but I think traveling around Asia with him for a month really gave us a chance to get to know each other even better.\nBy ‘slow travel’, I mean staying somewhere for at least 3 months, and generally 5–6 months or more.\nI’ve found my flow and had some of my most productive weeks both on Buffer and with my exercise routine.","info":{"author":"Joel Gascoigne","top_img":"https://cdn-images-1.medium.com/max/1200/1*4xalafbiiN6atrD2sOf3Zg.jpeg"}}},{"node":{"id":"5b93835787be056953db7e52","title":"Remote work is the future! – The Startup – Medium","source":"medium_search_remote","summary":"If you’re able to work remotely, you will actually be left with more money because your expenses are way lower.\nKeep in mind that remote work is not like working in the office.\nRemote working is not for everyone.\nThe entire company is remote, including the engineering team, design team, sales team, growth team, and more.\nRemote Working I’ve been working remotely for almost 5 years, and now leading the design team at Toptal.","info":{"author":"Luboš Volkov","top_img":"https://cdn-images-1.medium.com/max/1200/1*GOEDY-YCZgsqL9rxUmwv9A.jpeg"}}},{"node":{"id":"5b93835687be056953db7e51","title":"How to Determine if Candidates Will Thrive in a Remote Work Environment","source":"medium_search_remote","summary":"How to Determine if Candidates Will Thrive in a Remote Work EnvironmentI’ve made stellar hires who have propelled my company’s success.\nThrough trial and error, we’ve developed some core strategies for determining whether candidates will thrive in our remote work environment.\nWe look for work-from-home experience and affinityThese days, it’s more common for people to have remote work experience.\nEven if the candidate doesn’t have remote or contracting experience, there are ways to gauge whether that person is built for remote work.\nCheck out my other articles on remote work:","info":{"author":"Adam Schwartz","top_img":"https://cdn-images-1.medium.com/max/1200/1*h_XKAdgWQy3hRJ28cB9KLg.jpeg"}}},{"node":{"id":"5b93835587be056953db7e50","title":"The Startup’s Guide to Working Remotely – Startup Grind – Medium","source":"medium_search_remote","summary":"The Startup’s Guide to Working RemotelyEver felt sick of working in the same office, with the same people, day after day after day?\nBut what hurts even more is the lack (and loss) of a deep connection, caused by the shifting mindset from working at a startup.\nBut as exciting as working remotely on foreign land sounds, it takes serious preparation to go on a real nomad trip.\nCheck if your phone works overseasYour phone is your savior if you get lost, get sick, or feel lonely.\nBut if you want to know exactly how much data you use, go to your phone’s settings and check data usage/cellular data.","info":{"author":"Tiffany Sun","top_img":"https://cdn-images-1.medium.com/max/1200/1*DjBQgEFEUhqi7YJTH2Ivtg.jpeg"}}},{"node":{"id":"5b93835387be056953db7e4f","title":"Why our company’s remote work system failed – Startup Grind – Medium","source":"medium_search_remote","summary":"Why our company’s remote work system failedMy company’s cornerstone principles is manage yourself.\nWhat we underestimated was the effort that the entire company would have to make remote work work.\nRemote Work 0.2Image by Francois Hoang via UnsplashA more recent case came when we brought a Taipei developer, Johnny, on board.\nPeople who really want to make it work can check out Buffer’s tools for remote work.\nHowever, we don’t need to over-engineer a system for remote work, or say “yes” to every new hire who wants to work remotely before proving themselves.","info":{"author":"Ben Cheng","top_img":"https://cdn-images-1.medium.com/max/1200/1*0xI1TFDSNb1etCQSRdGSHg.jpeg"}}},{"node":{"id":"5b93835287be056953db7e4e","title":"Building remote-first teams – Karolina Szczur – Medium","source":"medium_search_remote","summary":"The opinion that allowing your peers the freedom of remote work will directly lead to slacking and no work being done is toxic.\nAs a pillar for remote work watch out for red flags such as exclusionary language, lack of clarity and cohesiveness in writing.\nEmployees working full time, but not legally hired as such often lack in perks, annual or sick leave among others.\nAbility to fully govern and enjoy lifeChoosing a place to live is only one aspect of flexibility that remote work brings in.\nHave a routineIt might sound contradictory to introduce routine into newly earned flexibility, but structure is crucial to remote work.","info":{"author":"Karolina Szczur","top_img":"https://cdn-images-1.medium.com/max/1200/1*7fHvXzJk1aNSkiV7n2Seuw.jpeg"}}},{"node":{"id":"5b93835087be056953db7e4d","title":"Remote working? 5 Apps for your Toolkit – The Mission – Medium","source":"medium_search_remote","summary":"Remote working?\n5 Apps for your Toolkit Essential tools for remote workersFor the last 8 months, I’ve been working remotely for several fast-paced startups.\nI’ve managed to improve this hugely over the last few months and on my last remote working stint in 2014, but sometimes we are human.\nFor remote work, that’s important, making sure you get quality work done is the goal and Bear helps me craft my best pieces of writing, where I feel most rewarded.\nIt’s everything I’ve ever wanted in an email experience and one of my most used resources to helping me get my remote work done.","info":{"author":"Francesco D'Alessio","top_img":"https://cdn-images-1.medium.com/max/1200/1*oPTNQWSvaHxALvaAU5MdVw.jpeg"}}},{"node":{"id":"5b93834e87be056953db7e4c","title":"My Thoughts on Working Remotely, One Year in – codeburst","source":"medium_search_remote","summary":"My Thoughts on Working Remotely, One Year inBarefoot to the Moon album cover by EchoesThe social, the efficiency and the health factorsA little introIt’s been a little more than a year since I joined Starcounter.\nAnd working remotely is a godsend for me.\nNetworking is a different challenge when working remotely.\nWhen working remotely, you know less, so you assume more.\nOne thing I don’t know about is how much extra effort my workmates are putting to support me working remotely.","info":{"author":"Omar Alshaker","top_img":"https://cdn-images-1.medium.com/max/1200/1*hA7bZYzOYKuGSZtBCNkyjg.jpeg"}}},{"node":{"id":"5b93834d87be056953db7e4b","title":"The 10 Biggest Misconceptions About Remote Work – Trello – Medium","source":"medium_search_remote","summary":"Yet, misconceptions and stigmas persist about remote work — things like work attire (Do remote workers even get dressed?)\nMyth 2: Remote Workers Are Out Of ContactJust because remote workers are not in an office doesn’t mean they’re off having a picnic somewhere.\nThe social aspect of work is more deliberate, but certainly not diminished in a remote work setting.\nMyth 7: Remote Work Increases CostsSome people assume that the IT concerns actually increase the cost of employing a remote worker.\nJoin the Trello Slack community and tell us what you think about remote work.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/0*UcE5L-F6yMGxxja1.png"}}},{"node":{"id":"5b93834b87be056953db7e4a","title":"How I stay productive working remotely – Help Scout Engineering & Product","source":"medium_search_remote","summary":"According to the latest Developer Survey from StackOverflow, only 11.1% of the participants work remotely full time.\nWorking remotely and having the freedom to choose working hours, gave me the opportunity of writing code when I’m at my best.\nWorking remote and choosing my own hours has enabled me to eliminate these situations and create a much more productive environment.\nMy time spent in Android Studio has grown significantly since I started working remotely.\nHowever, if you think remote work sounds like a dream come true check out our career page, maybe we’ll work (remotely) together!","info":{"author":"David González","top_img":"https://cdn-images-1.medium.com/max/1200/1*UiI71Uam51I4bN3W4UyhJw.png"}}},{"node":{"id":"5b93834a87be056953db7e49","title":"The Complete Guide to Working On A Remote Team – Megan Berry – Medium","source":"medium_search_remote","summary":"The Complete Guide to Working On A Remote TeamThe secret to increasing productivity, work–life balance, and team happinessThis is a guide for people on remote teams or those considering it.\n— Harvard Business ReviewAs an introvert myself, I know that I focus best at home and that’s where I do my best work.\nWe think the ability to travel while working is one of the huge advantages of remote work.\nIf you want to do it, working in a remote team is the best way.\nIt is my belief that working to develop a great remote working culture will pay dividends for decades to come — Joel Gascoigne, CEO at BufferCelebrate people’s victories with them.","info":{"author":"Megan Berry","top_img":"https://cdn-images-1.medium.com/max/1200/1*qwBWXzcCLi40zxXMSAIhQg.jpeg"}}},{"node":{"id":"5b93834887be056953db7e48","title":"The 3/2/2/1 Method: Using Self-Awareness to Work Well Remotely","source":"medium_search_remote","summary":"The 3/2/2/1 Method: Using Self-Awareness to Work Well RemotelyOn any given weekday, I work for approximately eight hours.\nThere’s just one caveat—I work remotely, from different places almost every day, all over the world, with a program called Remote Year.\nI move to a different international city once a month, where I work remotely for a Boston-based company called Wistia.\nIn a regular office setting, we sit down for work (not including an hour lunch break) for approximately 7 hours a day.\nSpreading work out to fit your energy levels will allow you to be more productive, and dare I say it, happier.","info":{"author":"Margot Mazur","top_img":"https://cdn-images-1.medium.com/max/1200/1*frmmAApIaDQXLrsWpfBe8A.jpeg"}}},{"node":{"id":"5b93834787be056953db7e47","title":"Remote is Dead. Long Live Distributed. – WalmartLabs – Medium","source":"medium_search_remote","summary":"Photo: 4398 / 110 images from PixabayI am not a remote worker, I am a part of a distributed team.\nThe term “remote” focuses on where the team member is.\nThe term “distributed,” however, naturally lends itself to thinking about what needs to be done and how we go about doing it together.\nAn organization shifting from having remote workers to the distributed model helps teams transcend the “remote vs in-office” mentality.\nSo this is a call to join us in our journey to eliminate the idea of remote workers and embrace the idea of distributed teams.","info":{"author":"Chase Adams","top_img":"https://cdn-images-1.medium.com/max/1200/1*PYGBgmTDkmf_RY_DUt6X5Q.jpeg"}}},{"node":{"id":"5b93834687be056953db7e46","title":"5 steps to getting your first remote web development freelance client in 2018","source":"medium_search_remote","summary":"1) Clients don’t come to you.\n2) Avoid UpWork, Freelancer, and FiverrThe good clients avoid websites like UpWork, Freelancer, and Fiverr like the plague.\n3) How to find good clientsSo where do you find the good clients?\nThe reality is that when a client posts a job or freelance project online they’re getting slammed with replies.\nConclusion: Putting everything togetherUltimately, it comes down to finding good clients and then clearly communicating your value proposition to them.","info":{"author":"Derick Sozo","top_img":"https://cdn-images-1.medium.com/max/1200/1*lmyf0GM2R_J1J2Qzb4oG1g.jpeg"}}},{"node":{"id":"5b93834587be056953db7e45","title":"Working remotely & Getting things done – Rodolphe Dutel – Medium","source":"medium_search_remote","summary":"My colleagues love to read, they always have great recommendations,When I find something interesting, I go ahead and YouTube proof it:Do I enjoy this topic enough to spend 5–10 hours reading about it?\nSpeed-watching a video (2x speed) on the topic helps me find out,Watching videos at 2x speed — YouTube.comOk, that’s my kind of book!\nOne of my favourite things is to Highlight parts I like so that I can reference back to it later on.\nTimeboxing on Moosti.com“Timeboxing allocates a fixed time period to each planned activity”Also, I love to listen to music when I’m working.\nAn option I found to listen to music and stay focus is to use focusatwill.com to keep a musical background that helps do more:Listening to focusatwill.com“focus@will is a new neuroscience based music service”","info":{"author":"Rodolphe Dutel","top_img":"https://cdn-images-1.medium.com/max/1200/1*8mbsP2iGnFztMup7W--iEQ.jpeg"}}},{"node":{"id":"5b93834387be056953db7e44","title":"Editing files in your Linux Virtual Machine made a lot easier with Remote VSCode","source":"medium_search_remote","summary":"But one of the problems I had with editing files in my virtual machine is that the experience is TERRIBLE.\nHow Vim works on a terminal that is connected to a virtual machine via SSHBut there’s three problems here:a.\nRemote VSCode SetupSo this is where the Remote VSCode comes in.\nThis extension allows you to edit your files from your virtual machine a lot easier.\nYou can find and change that setting by simply going to your ‘User Preferences’ and search for ‘Remote VSCode configuration’.","info":{"author":"Philip Roimon Domingo","top_img":"https://cdn-images-1.medium.com/max/1200/1*T7KOE5Yv3n4xbUP4P-1vMA.png"}}},{"node":{"id":"5b93834287be056953db7e43","title":"The Glory & Gory of A Remote Worker – Devcenter Square Blog","source":"medium_search_remote","summary":"A remote worker is simply someone that does work outside the confines of a traditional office in a company.\nAhhh, thou reader, grab some Burritos, Ofada Rice, Nyamachoma and Coffee for thou shall need food in the time of lonely scrolling.\nRealizing I have never actually met 70% of the people I work with in real life.\nRealizing that I haven’t bought new clothes in 5 months because I only need clothes for Sunday service.\nHaving a difficult time speaking to people in real life without the ability to respond with emojis and GIFs.","info":{"author":"Prosper Otemuyiwa","top_img":"https://cdn-images-1.medium.com/max/1200/1*MFuZssNh9oL1ZmEeXdx3Qg.jpeg"}}},{"node":{"id":"5b93834087be056953db7e42","title":"How I found my ideal lifestyle through working remotely","source":"medium_search_remote","summary":"I found my ideal lifestyle by working remotelyAt the start of 2014, I decided I need to make some changes in my life.\nFrom these books I learned that for a fully remote company to succeed, remote working has to be baked in the fabric of the organisation.\nThat was a good day ☺AdjustingGoing from working in an office to working remotely full time is not easy.\nWhen you’re working with a distributed team of people in timezones across the world, communication becomes the most important thing.\nInterested in remote working?","info":{"author":"Michael Erasmus","top_img":"https://cdn-images-1.medium.com/max/1200/1*LjmeReo8rCx6mmRBxUWXhA.jpeg"}}},{"node":{"id":"5b93833f87be056953db7e41","title":"The practical guide to having a remote company. – Yala Inc.","source":"medium_search_remote","summary":"The practical guide to having a remote company.\nSince the world is your oyster — you’re remote, remember — you can identify interesting contributors, read their blogs, and judiciously solicit their help on your project.\nTherefore even if you’re having a bad day, you can still be nice.\nRemote work is task oriented.\nRemote work is suitable people who like to explore, nature-lovers, moms, dads, introverts, people that love location-independence, people who can’t move and are located far away.","info":{"author":"Gary Levitt","top_img":"https://cdn-images-1.medium.com/max/1200/1*iHgw5HqErwL7lLdiZAsS7w.png"}}},{"node":{"id":"5b93833d87be056953db7e40","title":"Exploring Firebase on Android & iOS: Remote Config – Joe Birch – Medium","source":"medium_search_remote","summary":"What can we do with Firebase Remote Config?\nRemote Config gives us the power to: Quickly and easily update our applications without the need to publish a new build to the app / play store.\nRemote Config Process Flow Remote Config works by primarily using in-app defined values to decide how the it is you’re configuring is to be configured.\nRemote Config itself essentially only requires four simple steps in it’s setup and maintenance flow: Parameters, Rules and Conditions Within Remote Config we define key-value pairs which are known as parameters.\nRemote Config Architecture Now we know a little more about the hows and whats of Remote Config, it’s important to understand the flow of communication between our application, the Firebase API and the server-side operations.","info":{"author":"Joe Birch","top_img":"https://cdn-images-1.medium.com/max/1200/1*Bnx0KZgPIBQ75F5rjLx70g.png"}}},{"node":{"id":"5b93833a87be056953db7e3f","title":"RDP hijacking — how to hijack RDS and RemoteApp sessions transparently to move through an…","source":"medium_search_remote","summary":"RDP hijacking — how to hijack RDS and RemoteApp sessions transparently to move through an organisationHow you can very easily use Remote Desktop Services to gain lateral movement through a network, using no external software — and how to defend against it.\nAlexander Korznikov demonstrates using Sticky Keys and tscon to access an administrator RDP session — without even logging into the server.\nNow, you might be saying ‘If you’re SYSTEM, you’re already root… You can already do anything’.\nSo, you have full blown RDP session hijacking, with a single command.\nGroup Policy — I strongly recommend you use Group Policy to log off disconnected sessions, either immediately or soon after the user disconnects.","info":{"author":"Kevin Beaumont","top_img":"https://cdn-images-1.medium.com/max/1200/1*bd6ZhReKUzjJwunNpA6cDg.gif"}}},{"node":{"id":"5b93833987be056953db7e3e","title":"Creating a strong ‘office’ culture for remote workers","source":"medium_search_remote","summary":"Creating a strong ‘office’ culture for remote workers How the dispersed team at Student Loan Hero prioritizes communication and connectionAndy Josuweit is the Austin, TX-based CEO you’re more likely to catch in a coffee shop than a corner office.\nThe founder of Student Loan Hero, a solution for managing and repaying student loans, works remotely.\nShaun Moten, the HR Coordinator at Student Loan Hero who helps develop and manage employee culture, says, “Up until December of last year, we had a non-existent turnover rate.\nFor her, Student Loan Hero is “HR heaven.”Josuweit, the CEO, predicts a more remote workforce will become the norm.\n“It comes with its own unique challenges.” But for him and the entire team at Student Loan Hero, the extra effort is worth the reward.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*qE7QGdBvNwn9k-C7ChadTw.jpeg"}}},{"node":{"id":"5b93833887be056953db7e3d","title":"You’re remote to me – Joe Polastre – Medium","source":"medium_search_remote","summary":"You’re remote to meWorking with remote teams isn’t easy, but it’s inevitable with any growing organization.\nWe’re thinking of remote work the wrong way.\nRealize that, from the perspective of the other person, you’re remote!\nWhen working with remote teams, here’s a few things I’ve learned that I hope help you too.\nMake it easy for remote teams to join.","info":{"author":"Joe Polastre","top_img":"https://cdn-images-1.medium.com/max/1200/1*wpeOdgrb3TzY7fh9dquTWw.jpeg"}}},{"node":{"id":"5b93833787be056953db7e3c","title":"Remote 工作是長什麼樣子的 – Remote Taiwan","source":"medium_search_remote","summary":"Like what you read?\nGive Alex Tzeng a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"Alex Tzeng","top_img":"https://cdn-images-1.medium.com/max/1200/1*9LgWCefXSGZKttu4TUlSXQ.png"}}},{"node":{"id":"5b93833587be056953db7e3b","title":"How to work Remotely with 150+ people – Job van der Voort – Medium","source":"medium_search_remote","summary":"How to work Remotely with 150+ peopleWork asynchronously, keep a single source of truth, avoid management overhead and communicate.\nWork in a way that you don’t require or create the requirement for face-to-face communication.\nWrite everything down and keep a single source of truth that everyone has access to and can easily find.\nGive space for flexibility and do not inflate the value of remote work by creating a schedule for other people.\nTeach everyone how to contribute to the single source of truth, no exceptions.","info":{"author":"Job Van Der Voort","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b93833587be056953db7e3a","title":"From office-based to nomadic: 5 varieties of remote working in companies","source":"medium_search_remote","summary":"From office-based to nomadic: 5 varieties of remote working in companiesI’ve recently found myself reflecting a lot on being a distributed team, and the nature of a company where the team works from remote locations to accomplish our work.\nIt is my belief that working to develop a great remote working culture is an investment that will pay dividends for decades to come.\nThe levels of remote workingIn my reflections, I came to the realization that remote working is a scale, and there are actually a number of different options along across spectrum from “not remote” to “fully distributed”.\nA remote team, in a single time zoneThis is where things start to get more truly remote.\nA fully distributed team with nomadic team membersThe most extreme case of remote working, in my mind, is a fully remote team where some of the members of the team are nomadic and traveling.","info":{"author":"Joel Gascoigne","top_img":"https://cdn-images-1.medium.com/max/1200/1*E30e-ztfnbYsZr7kUDvQDg.jpeg"}}},{"node":{"id":"5b93833387be056953db7e39","title":"Why You Can’t Search for a Job From a Remote Location","source":"medium_search_remote","summary":"Why You Can’t Search for a Job From a Remote LocationI’ve had this conversation many times.\n!”Finding the best jobs takes a lot of commitment to taking many different networking meetings with executives, recruiters, entrepreneurs, VCs, lawyers, etc.\nThe best jobs are of course found through personal connections and in-person, eyeball-to-eyeball contact.\nThe best jobs are the ones that have not already been put on a job board.\nBut I want people that I know are committed to living in the city I’m hiring.","info":{"author":"Mark Suster","top_img":"https://cdn-images-1.medium.com/max/1200/1*IHXKvv4PFHi9nzcnH1nNbA.jpeg"}}},{"node":{"id":"5b93833287be056953db7e38","title":"How Doist Makes Remote Work Happen – Ambition & Balance","source":"medium_search_remote","summary":"How Doist Makes Remote Work Happen 51 people in 20 countries building a product used by millions.\nThe idea of building a remote company wasn’t something we explicitly discussed at the start — it simply grew out of necessity.\nDoist’s valuesMicromanaging is inefficient at any company, but at a remote company it’s simply not an option.\nAs in any growing company, we’ve made hiring mistakes, but we’ve worked hard to learn from them.\nMaking sure the way we communicate aligns with our valuesPerks are great, but they only go so far in building a unified, productive remote team.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*nXV5fpJJPrS0z3GHMRIqyQ@2x.png"}}},{"node":{"id":"5b93833087be056953db7e37","title":"Making remote work – Salesforce UX – Medium","source":"medium_search_remote","summary":"Working asynchronouslyOur team is mainly based on the East Coast, with some of us in the UK and others in San Francisco.\nThis means we have to optimize our precious two hours together and make the most of them every day.\nIt also means that we need to be able to work without depending on each other being available to answer our bugging questions.\nRespecting each other’s timeEveryone has to be mindful about the timezones we’re all in and the working hours we like to keep.\nWe use Google Calendar internally which has settings that let you define your working hours and gives a stern notice to anyone trying to invite you to a midnight standup.","info":{"author":"Alasdair Monk","top_img":"https://cdn-images-1.medium.com/max/1200/1*8ZSGSAgX84VsClT-dYmThg.jpeg"}}},{"node":{"id":"5b93832e87be056953db7e36","title":"9 Game Changing Tools That Every Remote Developer Can’t Live Without","source":"medium_search_remote","summary":"9 Game Changing Tools That Every Remote Developer Can’t Live WithoutWhat we use and why we love itAs remote developers at devAcademy, we are working with customers from around the world, from Los Angeles to Lima.\nWe are constantly searching for new productivity and collaboration tools to improve our efficiency and quality of work.\nHere are the 9 must-have remote work tools that have empowered our company, recommended by our remote developers:Octocats are adorable.\nSlack integrates efficient 3rd party team tools like GitHub, Travis CI, and Google Hangouts.\nYou can read more about why we love Slack here:Time trackingWhat is it?","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*IdvZNOwUQE5XZHOrGX1sIw.png"}}},{"node":{"id":"5b93832d87be056953db7e35","title":"Tech companies: make remote work part of your diversity and inclusion efforts.","source":"medium_search_remote","summary":"Tech companies: make remote work part of your diversity and inclusion efforts.\nBeing open to remote work allows companies to get a broad range of candidates who may not have been able to come to the office.\nRemote work opens up another layer of diversity, this time based on location.\nI’d love to hear more about how you approach remote work, and what helps you stay at your best.\nFeel free to reach out to me at margotmazur@gmail.com for any questions or comments around remote work, culture, community, and more.","info":{"author":"Margot Mazur","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b93832b87be056953db7e34","title":"HyperLog: Android Remote Logger Library for Debugging.","source":"medium_search_remote","summary":"HyperLog: Android Remote Logger Library for Debugging.\nHyperLog A utility logger library for Android on top of standard Android Log class for debugging purpose.\nDuring mobile app development, we often find that logcat (for debugging) in Android Studio gets clear when an app reinstalls.\nRemote logging can be used to debug issues in both development and production.\nIntroducing HyperLogHyperLog is a utility logger library for Android on top of standard Android Log class for debugging purpose.","info":{"author":"Aman Jain","top_img":"https://cdn-images-1.medium.com/max/1200/1*yyv3K-X7us0w-CXA0Pg-Hg.png"}}},{"node":{"id":"5b93832a87be056953db7e33","title":"How Are Remote Workers Changing the World’s Cities?","source":"medium_search_remote","summary":"How Are Remote Workers Changing the World’s Cities?\nNumber four is rental cost.”That’s Sten Tamkivi talking about the priorities people have when picking a new city to move to.\nWhat’s more, if you specify your monthly rent and salary, you’ll be shown how much more disposable income you’ll have in different cities around the world.\nI had the money, familial support, career flexibility, and passport power to uproot myself from London and relocate to Gothenburg.\nThese knowledge workers push up local prices, drive longtime residents out of fashionable neighborhoods, and rarely engage in any meaningful way with the local culture and community.","info":{"author":"Duncan Geere","top_img":"https://cdn-images-1.medium.com/max/1200/1*n6IHDp6phULLAvl3LpgwsQ.jpeg"}}},{"node":{"id":"5b93832987be056953db7e32","title":"How to find a remote job in 30 days. My life as a (wannabe) digital nomad","source":"medium_search_remote","summary":"How to find a remote job in 30 days.\nMy life as a (wannabe) digital nomadI recently quit my job to follow my dream of being location independent.\nI read thousands of posts about digital nomad life and, of course, it seemed amazing: full of extreme sports, paradise beaches, colorful cocktails and multicultural friends.\nAnd this is what I’m going to do in the next 30 days: I’m going to look for a job.\nOf course, if you have any feedback on my LinkedIn profile, don’t hesitate to tell me, I will be glad to modify it again!","info":{"author":"Alessia Anniballo","top_img":"https://cdn-images-1.medium.com/max/1200/1*DqYt8PGvc1ihtrox2N6sMg.jpeg"}}},{"node":{"id":"5b93832787be056953db7e31","title":"The 31 tools we use to make our “semi remote” SaaS team work efficiently","source":"medium_search_remote","summary":"Why is ActiveCampaign a must have for remote teams?\nActiveCampaign is not specifically designed for remote teams, it’s valuable for all teams, remote or not.\nIf your customer success team is remote, Salesmachine provides great tools to work collaboratively on your customer success goals without stepping on each other’s toes.\nWith a remote support team, it is key to have a shared knowledge base every team member can access and edit.\nWhy is Receptive a must have for remote teams?","info":{"author":"Emeric Ernoult","top_img":"https://cdn-images-1.medium.com/max/1200/1*7MpvmxqoxRNJHGgCI3IlcQ.jpeg"}}},{"node":{"id":"5b93832587be056953db7e30","title":"Weekly Update Vol. 46 — Featuring glimpses from remote dev team collaboration","source":"medium_search_remote","summary":"News & Opportunities— Congratulations @eric for getting the new front-end dev job this week!\n— Congratulations @nick for getting your dev job in Berlin!\n— Congratulations @dave on getting your dev job!!!\nAutobot meets StandupsIn Voyage-2 we introduced Autobot, the equivalent of a remote dev project sherpa-slackbot that helps guide teams to a successful outcome (shout-out to Autobot’s architect Vampiire).\nThe Autobot organizes the team project process into 3 main Acts and further organizes the Acts into specific Milestones.","info":{"author":"Chance Taken","top_img":"https://cdn-images-1.medium.com/max/1200/1*3GOZi8cllVXbJkKXButVww.png"}}},{"node":{"id":"5b93832187be056953db7e2f","title":"5 Things You Should Avoid If You Plan to be a Remote Software Developer","source":"medium_search_remote","summary":"5 Things You Should Avoid If You Plan to be a Remote Software DeveloperTommy is a remote software engineer turned founder.\nI’ve worked for many years as a remote developer and have also had the opportunity to work with other remote developers in that time.\nToday, I’ll share my top 5 things you shouldn’t do if you plan on being a successful remote software developer.\nHowever, the great remote software developers I know realize this and try to overcompensate by communicating frequently and consistently.\nA great remote worker is a great self manager — remote workers have tasks and goals, but they rarely have their superior prioritizing their workload for the week.","info":{"author":"Altcoin Fantasy","top_img":"https://cdn-images-1.medium.com/max/1200/1*iHuGZrQozpBw5TBZcGHtIQ.jpeg"}}},{"node":{"id":"5b93831f87be056953db7e2e","title":"The Fundamentalist Religious Views That Inspired Ammon Bundy and His Militia to Occupy a Remote…","source":"medium_search_remote","summary":"It didn’t take him long to discover that polygamy wasn’t the only divine principle the modern LDS Church had abandoned in its eagerness to be accepted by American society.\nAnd he was no less intent on adhering to the “true” commandments of his country’s earliest and most sacred texts, as well.\nDan Lafferty was moved by this same desire.\nThe modern LDS Church, Dan had become convinced, was an elaborate fraud.\nAnd he was no less intent on adhering to the “true” commandments of his country’s earliest and most sacred texts, as well.","info":{"author":"Jon Krakauer","top_img":"https://cdn-images-1.medium.com/max/1200/1*xjejpyQckWV_7EYWA8wtVg.jpeg"}}},{"node":{"id":"5b93831e87be056953db7e2d","title":"10 Facebook Groups you can join for free to find your next remote job or project","source":"medium_search_remote","summary":"10 Facebook Groups you can join for free to find your next remote job or project Did you know that there are Facebook Groups dedicated to helping you find remote work?\nClients post their remote jobs and projects in places like Facebook Groups, Twitter, Reddit, community sites, forums, and many more places.\n1) Remote Work & Jobs for Digital Nomads This is one of the more popular remote work groups on Facebook with over 50,000 members and growing.\nLink: https://www.facebook.com/groups/remotestartupjobs/3) REMOTE & TRAVEL JOBS Remote & Travel Jobs is another big group with 36,000 members focused on general remote work.\nLink: https://www.facebook.com/groups/RemoteTravelJobs/4) Remote Jobs, Work Anywhere — Inventive Hub Remote Jobs, Work Anywhere by Inventive Hub has over 22,000 members.","info":{"author":"Derick Sozo","top_img":"https://cdn-images-1.medium.com/max/1200/0*E9_mWqRlC73YKqFA"}}},{"node":{"id":"5b93831c87be056953db7e2c","title":"Here are the top tips I’ve used to land a remote software developer job","source":"medium_search_remote","summary":"Here are the top tips I’ve used to land a remote software developer jobApplying for a remote software developer job means you are voluntarily choosing to compete against the entire country versus people just in one city.\nIt’s true that remote software developer jobs have a large pool of candidates to choose from.\nIf you are currently searching for a remote software developer job, check out this article I published that describes the resources I’ve used to cast a wide net.\nThe freedoms that come with a remote software developer job completely outweigh the effort you have to put into obtaining one.\nI’ve talked to businesses that have gotten hundreds and hundreds of applications for a single available remote software developer job.","info":{"author":"Colin Morgan","top_img":"https://cdn-images-1.medium.com/max/1200/1*ye_xJyTSevirzw4lHXpjyw.jpeg"}}},{"node":{"id":"5b93831b87be056953db7e2b","title":"How remote pair programming works and why it can change your life","source":"medium_search_remote","summary":"That’s what remote pair programming can offer to you.\nHow Remote Pair Programming WorksRemote pair programming is not very different from traditional pair programming.\nBut we will call it remote pair programming.\nIn remote pair programming, each developer will be working from a different computer.\nBy doing remote pair programming, you will have the chance to learn from each other while also mentoring each other.","info":{"author":"Ariel Camus","top_img":"https://cdn-images-1.medium.com/max/1200/1*CzxqkaFNXkD58pDh7XrjnQ.jpeg"}}},{"node":{"id":"5b93831987be056953db7e2a","title":"What I’ve learned from full-time remote pair programming for a month","source":"medium_search_remote","summary":"No matter how well you and your coding partner get along, there will be times when you disagree.\nThe great thing is that even at the times when I have been frustrated, pair programming has been better than working alone.\n(By way of example, the OOP section of The Odin Project has students build two command-line games, Tic-tac-toe and Mastermind.\nWorking with a partner this time makes it much less daunting (plus the program requires us to finish it, which always helps).\nThe main takeaway from this is that working with a partner will sharpen your knowledge of the things you think you know.","info":{"author":"Kyle Lemon","top_img":"https://cdn-images-1.medium.com/max/1200/1*a2cFEVU4AnvOmFqcvzE4kQ.jpeg"}}},{"node":{"id":"5b93831887be056953db7e29","title":"How Remote Work Will Look Like In 2016? – This Publication is Moved – Medium","source":"medium_search_remote","summary":"How Remote Work Will Look Like In 2016?\nRemote work culture is changing the way people live, work and travel the world.\nHow remote work will look like in 2016?\nPete Rojwongsuriya: More industries will realize the possibility of remote working and people will become more and more flexible with their time and will transition slowly to a remote working routine.\nRodolphe Dutel: In 2016, larger remote companies (150+ employees) such as GitHub, Automattic, Invision and Toptal are continuing to strive — I’m currently documenting their best practices in “Distributed — How Remote Teams Work” — a book due in 2016.","info":{"author":"Tomas Laurinavicius","top_img":"https://cdn-images-1.medium.com/max/1200/1*u-3agfCwtzGyL8fpIDeS3A.jpeg"}}},{"node":{"id":"5b93831787be056953db7e28","title":"Remote productivity. – Benjamin De Cock – Medium","source":"medium_search_remote","summary":"Remote productivity.\nI get to travel to SF every two months and work remotely from Belgium the rest of the time.\nIn fact, it’s probably safe to assert I’m kind of lazy and my willingness to procrastinate is all too natural.\nOh, and I’ve two kids, including a 4-month old baby (turns out these little things require a decent amount of time).\nFor some reason, it’s very unusual: most companies are still hostile to remotes, often pretending people work better when physically together.","info":{"author":"Benjamin De Cock","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b93831687be056953db7e27","title":"Tips for working remotely in a Startup and staying productive","source":"medium_search_remote","summary":"Tips for working remotely in a Startup and staying productiveCreating a new business is an exciting adventure.\nHowever, the hard work comes in when you are working remotely for your startup because you have to remain productive.\nHowever, when working remotely this may not always be the case.\nWhile you may feel guilty that your friends and relatives work nine to five jobs without many breaks, when working remotely breaks can actually benefit you.\nHow do you remain productive when you are working remotely?","info":{"author":"Jon Westenberg","top_img":"https://cdn-images-1.medium.com/max/1200/1*ino1yRhlMA39a9e0rmXoig.jpeg"}}},{"node":{"id":"5b93831587be056953db7e26","title":"Documenting Decisions in a Remote Team – Katie Womersley – Medium","source":"medium_search_remote","summary":"Documenting Decisions in a Remote TeamOne of the questions I hear most about our globally distributed team at Buffer is “how do you document decisions”?\nIn a remote team, a more intentional method of making and documenting decisions is needed to help everyone stay in the loop.\nShare That the Decision will HappenFor bigger decisions, it’s really helpful to share ahead what decision is being made, and by whom.\nIt’s really important not to share decisions via Slack only.\nSo, if you’re posting a decision to Slack, make sure you follow up in a more asynchronous medium, too.","info":{"author":"Katie Womersley","top_img":"https://cdn-images-1.medium.com/max/1200/1*oizuL5VWpusDY5L7KxONKQ.jpeg"}}},{"node":{"id":"5b93831487be056953db7e25","title":"How an Instagram’s Story drives me to a Remote Code Execution.","source":"medium_search_remote","summary":"INTRODUCTIONThese days are very hot in the infosec community, especially here in Italy.\nThere are only a few days left before the next political elections and two of the biggest political parties have been hacked, at different levels and in different ways[1][2][3].\nThe discussion about *ethical hacking* reached its peak when a student was reported for revealing a huge vulnerability in Rousseau, a major web-platform of the “Movimento 5 Stelle”, currently the biggest italian political party.\nI don’t want to bring more items to this discussion since enough things have already been said so I thought it was cool to bring my vision of *ethical hacking* with a critical vulnerability that I found by chance thanks to an interesting Instagram Story.\nInstagram Stories: a brief introductionA simple but effective way to describe the idea behind the Instagram Stories is the following statement that I found on a marketing website[4] and translated in english for the readers:After the appropriate corrections, this statement looks perfect for the story I‘m going to share with you:","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*B6EHd2SADThdcK2AwxuFfg.jpeg"}}},{"node":{"id":"5b93831287be056953db7e24","title":"How I’ve Been More Productive Working Remotely From Home","source":"medium_search_remote","summary":"I’ve learnt a few things whilst doing so that have helped me be more productive and effective in my work.\nI’ve personally found that having a place I can go and just be in “work mode” has really helped.\nSure it’s great working on the couch, but it’s a place your head associates with relaxing and there are too many distractions.\nIf you spend days or even weeks isolated from people, working away, you’ll find you can go a bit insane.\nI personally work better if I’m allowed to wake up around 10AM and work my day’s time from there.","info":{"author":"Jamie Syke","top_img":"https://cdn-images-1.medium.com/max/1200/1*_sRfc1QL7fstJt8XoP4VJw.jpeg"}}},{"node":{"id":"5b93831187be056953db7e23","title":"How we organize our remote team using Slack, Trello and Google Drive","source":"medium_search_remote","summary":"On this board we had all the tasks that needed be done in the current sprint (we used Kanban methodology).\nIn Progress (8): Tasks developers were currently doing.\nPlanningThis board was used by developers the day before we had the sprint meeting, and by the product manager everyday.\nOnce a week, developers looked into all of them to see if they needed more info.\nRetrospectiveThis board was used by developers, designers and the product manager to add internal processes that should be improved.","info":{"author":"Javier Escribano","top_img":"https://cdn-images-1.medium.com/max/1200/1*H5pcinyHvFGUY2yoMf9HzQ.png"}}},{"node":{"id":"5b93831087be056953db7e22","title":"Coinbase Is Hiring Remote Full-time Engineers — Here’s Why (And How To Apply If You’re Interested)","source":"medium_search_remote","summary":"Coinbase Is Hiring Remote Full-time Engineers — Here’s Why (And How To Apply If You’re Interested)Historically, our engineering team at Coinbase has been entirely based in San Francisco, CA.\nWorking with remote engineers has gotten easier with large televisions and Google Hangouts in every conference room.\nWithout access to the same ad-hoc communication that happens in HQ, remote engineers need to be excellent in both written and verbal communication.\nWithout access to the same ad-hoc communication that happens in HQ, remote engineers need to be excellent in both written and verbal communication.\nRelatively Close Time Zones — We experienced a few challenges when time zones of remote engineers were vastly different.","info":{"author":"Brian Armstrong","top_img":"https://cdn-images-1.medium.com/max/1200/1*RY5safzX5ZS3rvm0px5joA.jpeg"}}},{"node":{"id":"5b93830f87be056953db7e21","title":"Who Benefits from Remote Work? – The Startup – Medium","source":"medium_search_remote","summary":"Who Benefits from Remote Work?\nIn their eyes, it’s a reward for good behavior: if you show up on time and do your work, then you get to work remotely someday.\nWhat’s rarely acknowledged, however, is that remote work also benefits the employer.\nSo instead of touting remote work as an employee “perk,” it should be regarded as a workplace feature that enables employees to do great work.\nI, as an employee, work how and where I like, and my company reaps the results, since I get far more quality work done when I work in an environment that fits my needs.","info":{"author":"Amy M Haddad","top_img":"https://cdn-images-1.medium.com/max/1200/1*nCei5-biuarAE-wOZ6_BDQ.jpeg"}}},{"node":{"id":"5b93830e87be056953db7e20","title":"3 remote developers, 1 million happy users – Lonely Planet product – Medium","source":"medium_search_remote","summary":"Embrace limitations & differencesWe are a very small team trying to change how things work at a company that’s been inspiring travelers for almost 44 years.\nWe couldn’t so we didn’t, and as a result, the app has been reduced to its most essential, valuable features.\nFrom design to development, we’ve strived to make things simpler and easier, not only because we wanted to, but also because we had to.\nDirect feedback channels with usersWe have multiple channels of communication with users such as Helpshift, Zendesk and Google Forms.\nOne more thing that we’ve done is hook App and Play Store reviews into Slack using AppFigures.","info":{"author":"Fran Sevillano","top_img":"https://cdn-images-1.medium.com/max/1200/1*AzlA-d13c8XY9rMqzkYfHA.png"}}},{"node":{"id":"5b93830c87be056953db7e1f","title":"Giving Remote Control: how to build and scale a remote start-up","source":"medium_search_remote","summary":"‍What’s been successful about building a remote team this way?\nHowever, right from the start, we worked as if we were remote workers in the same team.\n‍What’s been less successful about building a remote team?\nStage 5The final stage, Stage 5, is where we set up a call between the candidate, the hiring manager and myself.\nI think it’s probably one of the specific issues with remote working.","info":{"author":"Bretton Putter","top_img":"https://cdn-images-1.medium.com/max/1200/1*DESv5IYnT3irJ97E_M5LQA.jpeg"}}},{"node":{"id":"5b93830a87be056953db7e1e","title":"Remote Çalışmanın İlk Ayı – Türkçe Yayın – Medium","source":"medium_search_remote","summary":"Like what you read?\nGive Selçuk a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*AH9ZFZVoaShiwAJwiqWHGA.jpeg"}}},{"node":{"id":"5b93830987be056953db7e1d","title":"A NEW UPS POE TELE-MANAGED SOLUTION FOR REMOTE TELECOMMUNICATIONS INFRASTRUCTURE","source":"medium_search_remote","summary":"Like what you read?\nGive Cristian Randieri, Phd a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"Cristian Randieri","top_img":"https://cdn-static-1.medium.com/_/fp/icons/favicon-rebrand-medium.3Y6xpZ-0FSdWDnPM3hSBIA.ico"}}},{"node":{"id":"5b93830887be056953db7e1c","title":"Apps That Make Our Remote Agency Tick – 3drops – Medium","source":"medium_search_remote","summary":"Apps That Make Our Remote Agency TickOver the past seven years we have experimented with a variety of apps that enables us to run a digital product agency remotely.\nKeep in mind that while the apps recommended herein work for us, every team has its own set of unique workflows to consider.\nProject and Team managementWe tried numerous different apps to manage our projects and team before we finally found our groove.\nWe use Sketch for product design and depending on client requirements either Flinto, Principle or Framer for prototyping.\nWe specifically use Redpen for client feedback because they get it (hint: did you also experience the recently recurrent server failures on Redpen?","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*j9sSSU_PIyDQUiKrRNz2wg.png"}}},{"node":{"id":"5b93830687be056953db7e1b","title":"Remote Control – The Startup – Medium","source":"medium_search_remote","summary":"Sure enough, a detailed response followed chiming in on the latest iteration of the redesign of our print quarterly.\nSuch is the collaborative process at Makeshift, a media company that covers often-dangerous topics under an umbrella we call hidden creativity.\nAnd right now we’re winning: in the last quarter we tripled distribution of our flagship print mag.\nBusiness leaders have wavered on the merits of remote vs. co-located teams.\nThe truth is remote collaboration is a reality — and often an advantage — of a globally networked economy, and its consequences are more nuanced than such a hard-line measure would lead one to believe.","info":{"author":"Steve Daniels","top_img":"https://cdn-images-1.medium.com/max/1200/1*h5jhbzoouisWa_t_1eNPWw.jpeg"}}},{"node":{"id":"5b93830587be056953db7e1a","title":"Why You Shouldn’t Accept My Invitation to Join Me on Remote.com (Because I Didn’t Send It)","source":"medium_search_remote","summary":"Why You Shouldn’t Accept My Invitation to Join Me on Remote.com (Because I Didn’t Send It)This morning I found an email in my inbox from a journalist I respect, but don’t know well.\nDid I want to “connect” my Google account?\nAccepting this Remote.com thing, said one.\nBy not revealing what “connecting” your Google account will do, Remote.com violates any trust it could hope to have with users.\nRemote.com is wrong to access the email accounts of users in this way, and Google is wrong to permit it.","info":{"author":"K.J. Dell'Antonia","top_img":"https://cdn-images-1.medium.com/max/1200/1*VoOcdjzPNojAaHrGOJpGJg.png"}}},{"node":{"id":"5b93830487be056953db7e19","title":"The Remote Manifesto – Go Remote – Medium","source":"medium_search_remote","summary":"Remote work is more than just another means to feed the travel bug or hit the gym in the middle of the day.\nIt represents a latent discontent with social expectations and a collective veto of what it means to be “normal”.\nIf you are job hunting, look for companies that already hire remote workers.\nFollow blogs created by remote workers and attend meetups to get a taste of how achievable this lifestyle is.\nIf you’ve made it this far and none of this speaks to you, please just pardon our dust — the remote work movement is underway.","info":{"author":"Greg Caplan","top_img":"https://cdn-images-1.medium.com/max/1200/1*8sIBAjC0CUMh9hEA1Xdonw.jpeg"}}},{"node":{"id":"5b93830287be056953db7e18","title":"Pass the Remote: User Input on TV Devices – Netflix TechBlog – Medium","source":"medium_search_remote","summary":"Pass the Remote: User Input on TV Devicesby Andrew EichackerThe Netflix TV team works with device manufacturers to explore new input methods (like your phone!)\nPointer navigation should be familiar to most web developers, as it is very similar to mouse/touch input.\nAs a result, most devices have introduced modality to the remote: when using the pointer, only the pointer behavior is respected.\nWe also save the last focused element so that the focused element can be reset when switching to LRUD mode, making the LRUD/pointer switch a breeze.\nDoes this spark your interest, or do you have a better idea for handling TV input?","info":{"author":"Netflix Technology Blog","top_img":"https://cdn-images-1.medium.com/focal/1200/632/50/54/1*Dn5xmHMBfPvjuBVW78tnGA.png"}}},{"node":{"id":"5b93830087be056953db7e17","title":"The Ultimate List of Resources for Remote Workers – Hacker Noon","source":"medium_search_remote","summary":"The Ultimate List of Resources for Remote WorkersSince the acquisition of my previous startup 5 years ago, I’ve been working remotely and loving it.\nI’m now the founder of Microverse, an online school for remote software developers where we teach our students how to take advantage of opportunities regardless of where they are.\nThis guide is a living collection of resources that I often use or recommend to other people who want to become remote workers.\nIf you have anything that you want to add or update, please leave a comment.\nCheck out this spreadsheet with more than other 600 companies hiring remotely:CommunitiesCo-livingJob boardsNewslettersBooksPodcastsToolsCommunicationVideo conferencingProgrammingTime trackingProject managementTimezone management","info":{"author":"Ariel Camus","top_img":"https://cdn-images-1.medium.com/max/1200/1*UZ8QAj8s-pA65VRG46VPjg.jpeg"}}},{"node":{"id":"5b9382fe87be056953db7e16","title":"The Secret to Remote Work? It’s Not All About You – Taking Note – Medium","source":"medium_search_remote","summary":"The Secret to Remote Work?\nThat’s because when remote work gets mentioned, it can conjure up all kinds of notions.\nBut we all experience remote work and collaboration in some way, whether we have an occasional ‘WFH day’ or work virtually with teammates and other offices that are scattered across the globe.\nRemote work requires good listening, communication, and collaboration skills.\nOne final tip: Our friends at Trello recently put together a handy guide to remote work, full of tips and strategies.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*p5Ed9u3a1StzT5serZXhwQ.png"}}},{"node":{"id":"5b9382fc87be056953db7e15","title":"My personal insight after working a year remote as a Designer","source":"medium_search_remote","summary":"Increase communicationCommunication might be the main downside of working remotely.\nPeople tend to disappear or fly under the radar, and I understand why companies are still hesitant on letting employees work remotely, but you have to fight against that.\nSounds a bit micromanaging, but it helps the team know what you’re doing, and for you to know what everyone is doing.\nIn an overall sense, it’s not because you’re working remote that all the interactions you had in real life has to be set aside.\nChecking in, checking out, I wasn’t use to announcing what I was doing.","info":{"author":"Philippe Hong","top_img":"https://cdn-images-1.medium.com/max/1200/1*OUE_yH7ZVHXUck-Un9s24A.png"}}},{"node":{"id":"5b9382fb87be056953db7e14","title":"Chromecast now works with your TV’s remote control – Janko Roettgers – Medium","source":"medium_search_remote","summary":"Well, complain no more: A recent update to Google’s streaming stick has added the ability to pause and resume playback with any old TV remote control (hat tip to Reddit/r/chromecast).\nPlayback via Chromecast, paused with my old TV remote control.\nPause and resume functionality for HDMI-CEC was added to Chromecast with the latest 27946 firmware update.\nPlayer state is reported back to your mobile device, so you can pause playback with your remote control and resume it with your phone if you feel like it.\nNot being able to use that remote to control media played back via Google Cast would have been confusing.","info":{"author":"Janko Roettgers","top_img":"https://cdn-images-1.medium.com/max/1200/1*KJcTL5MednxOYTFbI5vlnw.jpeg"}}},{"node":{"id":"5b9382fa87be056953db7e13","title":"The pros and cons of working remotely – Remote Work – Medium","source":"medium_search_remote","summary":"You’ll love the flexibilityThe best part about working remotely is that you get to work from anywhere.\nIt’s for this reason that many remote workers will take the occasional chance to work outside, at a nearby cafe or library, or even alongside other remote workers.\nAs with most of the new paradigms transforming our world today, working remotely comes with significant advantages and disadvantages.\nThis article is part of a new publication called Remote Work which focuses on tips, tricks, and secrets for remote workers and teams.\nRemote Work is published by Lift, an awesomely remote team, who just recently launched RemoteJobs.com, the best place to find remote jobs.","info":{"author":"Chris Wallace","top_img":"https://cdn-images-1.medium.com/max/1200/1*fnpxI_LzQuV6wu2h64OuFg.jpeg"}}},{"node":{"id":"5b9382f887be056953db7e12","title":"10 free places to find your next remote web development freelance project","source":"medium_search_remote","summary":"10 free places to find your next remote web development freelance project Are you a web developer looking for your next remote freelance project?\nIn this post, I’m going to share with you 10 different websites you can check to find your next remote freelance web development project.\nYes, there are many full-time positions posted here, but many freelance contract positions also get posted here.\nLink: https://stackoverflow.com/jobs3) Authentic Jobs Authentic Jobs is another great resource to check on your search for a remote web development position.\nMost of the jobs posted here are related to front-end web development and sometimes are very specific to the React.js framework.","info":{"author":"Derick Sozo","top_img":"https://cdn-images-1.medium.com/max/1200/1*kCNVsH8gEpjTOiFzJ7FkyA.png"}}},{"node":{"id":"5b9382f687be056953db7e11","title":"How we Build and Sustain a Remote Team – This Publication is Moved – Medium","source":"medium_search_remote","summary":"How we Build and Sustain a Remote TeamThe terms “remote team” or “distributed team” have become familiar concepts in the startup world.\nIt does help to recruit people with prior remote work experience, though.\nWeekly face to face phone calls - We’ve noticed that people tend to avoid face to face interaction as time passes.\nWith more and more remote team members on board, we’ve invested in proper time together this year and flew people in for a company trip in Australia.\nBut with proper tools and working habits, you can build a team of happy and passionate people who value their freedom.","info":{"author":"Marta Olszewska","top_img":"https://cdn-images-1.medium.com/max/1200/1*m0qGNEXlg4s8zV9Ekg7twg.jpeg"}}},{"node":{"id":"5b9382f587be056953db7e10","title":"How to Land A Remote Job Offer – The Mission – Medium","source":"medium_search_remote","summary":"How to Land A Remote Job OfferMany of us are working in jobs they’re not super excited about.\nAside from lower costs, companies that do remote work have happier employees who feel more respected and valued at work.\nBut now, remote jobs are available to more people in a variety of different fields.\nYou can follow these steps to land your dream remote job, and add some insane flexibility into your schedule.\nA remote job can be your “shortcut” to that lifestyle.","info":{"author":"Raghav Haran","top_img":"https://cdn-images-1.medium.com/max/1200/1*hLqiCKXOMs361CZit0h9eg.jpeg"}}},{"node":{"id":"5b9382f387be056953db7e0f","title":"3 myths of distributed work and remote employees – Pluralsight – Medium","source":"medium_search_remote","summary":"3 myths of distributed work and remote employeesWorking in slippers.\nIn his session, The future of work is distributed, Lisbi elaborated on how Andela adopted this mentality to make remote work a big win.\nRemote working options are a top priority.” –Lisbi Abraham, Andela CIOMyth: Lack of communicationWorking distributed can actually improve team communication.\nMake sure all employees work to include in-person and distributed employees through their actions.\nIt shows the distributed employees they’re just as important to the success of that meeting as the ones who are actually local.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*cfN3joXNfnh6MT_uwEYNZQ.jpeg"}}},{"node":{"id":"5b9382f287be056953db7e0e","title":"Working Remotely; Work From Where You Like – Enric Enrich – Medium","source":"medium_search_remote","summary":"The team behind Doist is distributed all around the world; we work remotely.\nI’ll be updating it while I learn new tips and ways to improve how I work remotely.\nThis is one of the most amazing things of working remotely; you can work from whatever you want, whenever you want.\nIt’s not the same working from a co-working space where everyone goes there to work, than if you work from home.\nObviously, working remotely makes it really easy to tweak your schedule to adapt it to special events or things that you have to do.","info":{"author":"Enric Enrich","top_img":"https://cdn-images-1.medium.com/max/1200/1*sjpeJdx9jGWr9MPEfZIZJg.jpeg"}}},{"node":{"id":"5b9382f187be056953db7e0d","title":"I Finished Remote Year: What The Hell Do I Do Now? – Go Remote – Medium","source":"medium_search_remote","summary":"I Finished Remote Year: What The Hell Do I Do Now?\nI didn’t give a shit about the song, and I couldn’t help but dance.\nIt was Week 2 of Remote Year, and four of our new friends had turned a lie about having a pool into a 5-hour extravaganza drinking and dancing around kiddie pools.\nWe had won, we were happy, we were ready for 11 months of trying to top it.\nThe song without words, the song that was not our type of music, the song that nobody knew except for our then-unfamiliar DJ from Amsterdam.","info":{"author":"Matt Rudnitsky","top_img":"https://cdn-images-1.medium.com/max/1200/1*rKygNwsyfwBXoiqKEZ7WoQ.jpeg"}}},{"node":{"id":"5b9382ef87be056953db7e0c","title":"Bumpers – Bumpers – Medium","source":"medium_search_remote","summary":"Remote podcasting w/ BumpersTurns out, like most things, podcasting is better w/ friends.\nBecause today, right now, Bumpers (download now), is launching a new feature that we call: “Remote Recording”.\nRemote Recording works by giving “you” the ability to connect to “me” — from anywhere in the world (using the ✨internet✨).\nThe host sends the room URL to their remote friends.\nDownload bumpers now, give it a shot, and let us know what you think!!","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*xXCftUbZkR7TlJN7ueBLFg.png"}}},{"node":{"id":"5b9382ed87be056953db7e0b","title":"Remote work: 9 tips for eliminating distractions and getting things done","source":"medium_search_remote","summary":"Tips for regaining control and getting things doneHere are a few tips that I picked up from others or learned from my own mistakes and applied to my life.\nWrap up work and disconnectIf you work remotely it doesn’t mean that you need to work all the time.\nThe best way to get motivated is getting things done — even if it’s little things.\nDedicate a room to workIf possible, dedicate a room to work, you know, like a study.\nGetting things done spreadsheetThis is my systematic approach to getting things done.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*4xyEoSGFub-gqviOuZ1s5w.jpeg"}}},{"node":{"id":"5b9382ec87be056953db7e0a","title":"Running A Company Remotely Is Possible But Not Easy — Here Are Some Tips To Make It Easier","source":"medium_search_remote","summary":"At Power Level Studios, we have a simple but efficient system that has worked really well for us.\nHave Everyone RemoteI have worked remotely for a company where pretty much everyone worked from the same office.\nIn Power Level Studio’s case, we’re releasing Soul Reaper: Unreap Commander on April 3rd.\nLimit The Need To Communicate VerballyWe never communicate verbally at Power Level Studios.\nIn fact, we rarely communicate at all.","info":{"author":"Danny Forest","top_img":"https://cdn-images-1.medium.com/max/1200/1*MOEndck-bj47wvLeP5jk7g.png"}}},{"node":{"id":"5b9382ea87be056953db7e09","title":"3 Tips for Coaching Your Team, Remotely – Rodolphe Dutel – Medium","source":"medium_search_remote","summary":"You can also check teammates’ time zones with Timezone.io or EveryTimeZone, then I’ll access their Google Calendar to check for conflicts.\nIf you use Slack, you can also select a teammate’s profile — it will show you their local time!\nOne thing that I picked up during my time working at Google is that we seldom need to meet for exactly a standard hour.\nWe use Zoom.us to connect and chat via video, we chat once a week for an hour on most weeks.\nThis way I can come into a meeting with a pre-set agenda of items you may want to be ticking off throughout the conversation.","info":{"author":"Rodolphe Dutel","top_img":"https://cdn-images-1.medium.com/max/1200/1*wOvTomnwBFYU7jESHaPFhA.jpeg"}}},{"node":{"id":"5b9382e887be056953db7e08","title":"Book Review: “Remote: Office Not Required” – Power the People","source":"medium_search_remote","summary":"Book Review: “Remote: Office Not Required”I recently read Remote: Office Not Required by Jason Fried and David Heinemeier Hansson.\nFirst chapter: The time is right for remote workAll the benefits of remote work were listed here e.g.\nA few aspects of remote work are not so rosy.\nI felt there was no need to sell remote work to me/my company since they already practice it heavily.\n🤷🏽‍ConclusionI think this book was a good read and it did a great job of highlighting all the things to know about remote work.","info":{"author":"Moyinoluwa Adeyemi","top_img":"https://cdn-images-1.medium.com/max/1200/1*jrjT3tkGXjRYRimKqIx9Wg.jpeg"}}},{"node":{"id":"5b9382e787be056953db7e07","title":"A Pin on our Remote Map – Go Remote – Medium","source":"medium_search_remote","summary":"From our inaugural group of 75 remotes, we’ve evolved into a growing nation of over 500 traveling professionals.\nThe quality of work that has been produced on Remote Year is creating waves in the professional community.\nLooking AheadWe are excited to welcome some new faces to our Remote Nation.\nWith this new funding, we can double down on providing the best infrastructure, programming, communities and team for the Remote Year experience.\nAs more people take part in this movement and our Remote Nation continues to grow, we’ll help the world become a more connected community and a better place for everyone.","info":{"author":"Greg Caplan","top_img":"https://cdn-images-1.medium.com/max/1200/1*MJ7BwtOCO1jvsKsskBKB2Q.jpeg"}}},{"node":{"id":"5b9382e687be056953db7e06","title":"Remote product management: challenges and opportunities","source":"medium_search_remote","summary":"Remote product management: challenges and opportunitiesEven though more and more companies are getting comfortable with remote work, the field of product management still seems to push back against this trend quite forcefully.\nI do believe it’s harder to make the product management role work remotely than some other roles like customer success or development.\nBut it is possible, and I believe that companies need to start being more open to hiring remote product managers.\nWe often hear about the drawbacks of remote work, but it’s important to remember that there are certain things that remote work is naturally better suited for than on-premise work.\nMost importantly, remote work makes it much easier to develop and instill a rhythm of collaboration and focused time for a team.","info":{"author":"Rian Van Der Merwe","top_img":"https://cdn-images-1.medium.com/max/1200/1*iPUdWfl9CS3IKFcZM7nbPw.jpeg"}}},{"node":{"id":"5b9382e587be056953db7e05","title":"Cara Mudah Melacak Jam Kerja Karyawan Remote – Asep Bagja – Medium","source":"medium_search_remote","summary":"Like what you read?\nGive Asep Bagja Priandana a round of applause.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.","info":{"author":"Asep Bagja Priandana","top_img":"https://cdn-images-1.medium.com/max/1200/1*Rs2fAcWfjvxUt6LBWK62tw.jpeg"}}},{"node":{"id":"5b9382e487be056953db7e04","title":"10 Sites to Find Remote Work – Hacker Noon","source":"medium_search_remote","summary":"We are moving closer and closer to a truly digital world in which anyone can contribute their talents from anywhere.\nRemote work is taking off, and it has only just begun as companies are, more and more, finding ways to enable a powerful fleet of remote workers from around the globe.\nSo where do you find jobs if you are looking for remote work?\nI put together a list of 10 of the best sites to find remote work, here they are:Thanks so much for reading!\nIt would mean a ton to me if you could:If you ever have any questions, send me an email jordangonen1 at gmail dot com !","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*re9HRHGaUnWyNlCjGBqKuw.jpeg"}}},{"node":{"id":"5b9382e287be056953db7e03","title":"Why I Trust My Remote Team Completely (And What To Do If You Don’t Trust Yours)","source":"medium_search_remote","summary":"Why I Trust My Remote Team Completely (And What To Do If You Don’t Trust Yours)Kristina & Tom from Team Edgar, feeling very trustworthyWhen I launched my first software startup, MeetEdgar, I was pregnant with my first child.\nThe first step to building a team that you trust is to only hire people that you trust.\nIf you really don’t trust an employee, you need to end that relationship right now!\nYou don’t need to “earn my trust;” that would be a waste of time.\nI assume that everyone on my team wants to do their best work and wants the company to succeed as much as possible.","info":{"author":"Laura Roeder","top_img":"https://cdn-images-1.medium.com/max/1200/1*9mLk_30uFuTvieKyVQOpLg.jpeg"}}},{"node":{"id":"5b9382e187be056953db7e02","title":"Thoughts on leading a remote design team – John Maeda – Medium","source":"medium_search_remote","summary":"Thoughts on leading a remote design teamA keyboard I re-made back in 1992-ish …I thought I’d take advantage of Gutenberg‘s imminent release to use it as often as I can for what it was designed for: writing.\nBut I’ve been wondering what to write about …On a recent visit to Silicon Valley, I noted how there are more than a few major technology companies that are wondering how to make a fully distributed (aka “remote”) design team work well.\nSecondly, I should start out by finding what folks would like to know about remote design teams.\nAutomattic is a 700-person all-remote company with one key secret to how we work well in an all-distributed fashion: it’s got to work.\nThe idea of safeguarding the Internet’s global, distributed nature is sacrosanct for us — so our values overlap perfectly with how we operate.","info":{"author":"John Maeda","top_img":"https://cdn-images-1.medium.com/max/1200/1*KzSKkihLraLGsI4kI_QHnQ.jpeg"}}},{"node":{"id":"5b9382df87be056953db7e01","title":"Essential Lessons for Success when Working Remotely","source":"medium_search_remote","summary":"Essential Lessons for Success when Working Remotely“ Liberty means responsibility.\nThe effectiveness of a remote workforce is already established, but how can a company effectively lay a foundation to manage the remote workforce environment?\nBelow are essential lessons for success when working remotely.\nSuddenly you will understand real benefit of working remotely, which is the simple fact that all that counts are only results of your work.\nLearning how to plan and structure days productively is essential so team working remotely can be more productive.","info":{"author":"Dario Sipos","top_img":"https://cdn-images-1.medium.com/max/1200/1*cXnAOdW4Fr53mKNn84i3_w.jpeg"}}},{"node":{"id":"5b9382de87be056953db7e00","title":"How a remote control with just one button could make your TV great again","source":"medium_search_remote","summary":"How a remote control with just one button could make your TV great againYes, just one, big, nice button.\nThey weren’t on the channel my TV was left on when it was last turned off, so I didn’t.\nYour job is to watch TV, not to switch channels, let alone watch it switching channels.\nYou know, for those situations where you actually want to watch TMZ.\nIn any case, you’ll most likely end up with fewer button presses than if you had to traverse menus, TV guides and search fields with your current remote.","info":{"author":"Morten Just","top_img":"https://cdn-images-1.medium.com/max/1200/1*Nyd6_w4LOmPyqkYj2LQ0mA.png"}}},{"node":{"id":"5b9382dc87be056953db7dff","title":"What is Remote Year, How Much Does it Cost & Can I Afford it?","source":"medium_search_remote","summary":"What is Remote Year, How Much Does it Cost & Can I Afford it?\nTo help you better understand Remote Year and the costs associated with it, I’m going to drop some knowledge.\nRemote Year Cousteau’s Positive Impact event- School Refurbish in Buenos AiresHow Much Does Remote Year Cost?\nRemote Year Darien showing their Bollywood dance skills at the Prague farewell eventCan I Afford It?\nRemotes can expect to be spending anywhere from $1000-$2,000 USD per month outside of program costs.","info":{"author":"Remote Year","top_img":"https://cdn-images-1.medium.com/max/1200/1*vvl0E2oYA2iClX9eYeUO5A.jpeg"}}},{"node":{"id":"5b9382db87be056953db7dfe","title":"How We Support Remote Employees at DigitalOcean – Inside DigitalOcean","source":"medium_search_remote","summary":"How We Support Remote Employees at DigitalOceanWritten by Amanda BrazzellRemote culture at DigitalOcean is one of my favorite things to talk about when discussing my job.\nWhen I first joined the company in June of 2015, there was already a substantial percentage of existing remote employees (better known as our “remotees”).\nSince I’ve never been remote, I educated myself on best practices for companies with remote employees and how we could expand our top-notch employee experience to those outside of our HQ.\n: The “DO Docking In” program supports remote employees joining the rest of their team in the office all at once.\nShe has helped build an effective Remote Experience program that drives dispersed employee engagement and job satisfaction.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/0*hwy-P0pGB-uggXFP.png"}}},{"node":{"id":"5b9382d987be056953db7dfd","title":"7 Remote Working Tips from 1 Month in Rural Italy – flux – Medium","source":"medium_search_remote","summary":"7 Remote Working Tips from 1 Month in Rural ItalyI feel like I’ve done the impossible — been more relaxed, productive, healthy, and gluttonous than ever.\nMost days I’ve gone to bed around 00:30 and woken up naturally at 08:30.\n6hr working days (including a 1hr lunch break)Time remaining today at the moment of writing.\nBut the reality is that:Most people’s working days are full of shit that they don’t need to be doing.\nWhen you’ve only got 5 working hours in the day, and you like your job, you make sure that you get shit done in that time.","info":{"author":"Jim Ralley","top_img":"https://cdn-images-1.medium.com/max/1200/1*aNC6cNl18rZSle6eMP7Qtw.jpeg"}}},{"node":{"id":"5b9382d887be056953db7dfc","title":"If you ever get one these 5 Chingus on your team, you just hit the remote dev jackpot","source":"medium_search_remote","summary":"If you ever get one these 5 Chingus on your team, you just hit the remote dev jackpotAnd why you want them on your teamBelow are examples of excellent team-mates who deserve to be applauded.\nDan is working on another ambitious project now and like all projects he takes on, it will be finished.\nYou’ll also likely get a real sense of what it feels like to work in a professional software team.\nKim can join even a faltering team and instantly change the dynamic with her work ethic.\nAsk anyone on the DevGaido team (and likely anyone who has been on a team with her), they’ll tell you how unlikely it is to be able to find a better team-mate.","info":{"author":"Chance Taken","top_img":"https://cdn-images-1.medium.com/max/1200/1*QopA_EAHEoYib2Wk20Y40g.png"}}},{"node":{"id":"5b9382d687be056953db7dfb","title":"Be careful when using Firebase Remote Config control for pre-announced feature","source":"medium_search_remote","summary":"Be careful when using Firebase Remote Config control for pre-announced featureFirebase Remote Config is an excellent tool that enables us to ship a feature hidden from the user, and get turned on at the designated time.\nHowever, if we are not careful, the hidden feature might be exposed without us knowing it.\nHence we turn on the Feature first, to ensure our Firebase Remote Config works accordingly.\nBut he has not launch the App, so no latest Firebase Remote Config value is fetched.\nAssuming at the time he launch the App, the Internet is Down; the Firebase Remote Config fetch would fail.","info":{"author":"","top_img":"https://cdn-images-1.medium.com/max/1200/1*EB84q1gQaQ9c0cPtV3-f_A.png"}}},{"node":{"id":"5b9382d587be056953db7dfa","title":"Getting Remote Critique Right – Building Creative Market – Medium","source":"medium_search_remote","summary":"Getting Remote Critique RightRemote work brings with it some challenges that need careful pruning to create a successful and happy team.\nHere are a few steps you can take to ensure people are happy and you’re getting the best feedback you can to build a great product.\nUnderstand that giving critique is sometimes as hard as receiving critique, so create an environment that encourages people to provide that critique.\nI’m not getting it’ or ‘what does this do?’) and always re-frame the feedback to avoid ambiguous critique.\nFew things beats being in a room with your team and work through a problem at the same time.","info":{"author":"Luke Jones","top_img":"https://cdn-images-1.medium.com/max/1200/1*pQPF5GJVcTDEe5IaXGhrHQ.jpeg"}}},{"node":{"id":"5b9382d487be056953db7df9","title":"Learnings from 4000+ interviews for hiring remote employees","source":"medium_search_remote","summary":"Learnings from 4000+ interviews for hiring remote employeesAfter successfully building a 100% remote working company with 500 members from 40 countries, we know what you need to ask to hire the top talent.\nRemote working is the future of work.\nWe have conducted 4000+ interviews, we have hired 400+ members and we have had to fire 10.\nRemote work is all about independence.\nCommunication is now so easy with remote work.","info":{"author":"Nitesh Agrawal","top_img":"https://cdn-images-1.medium.com/max/1200/0*48pTA-tTASy67Y9L"}}},{"node":{"id":"5b9382d287be056953db7df8","title":"Build, hack, learn: 50+ remote developer projects from the Chingu cohorts to start your day off…","source":"medium_search_remote","summary":"Build, hack, learn: 50+ remote developer projects from the Chingu cohorts to start your day off rightHello again rambunctious learners and voracious coders!\nWe’ve done nonprofit projects, teams have built impact-generating apps, and at this rate, it won’t be too long before we reach 1000 projects finished.\nThe Chingu Moonshot is to one day see a team build a project that turns into a product and they go from trying to get a dev job to creating dev jobs.\nBasically we’re kind of organizing work and collaboration at a scale that were just unthinkable before and seemed impossible.\n😜The ProjectsNote: I apologize in advance as I have inevitably made several mistakes with links, missing projects,names etc.","info":{"author":"Chance Taken","top_img":"https://cdn-images-1.medium.com/max/1200/1*HHzK9ZkAcg196JNfzrsEJw.png"}}},{"node":{"id":"5b9382ce87be056953db7df7","title":"How Working Remote Worked for Me – AIGA Orange County – Medium","source":"medium_search_remote","summary":"Regular collaboration is not only critical, its humanLiving minutes from John Wayne Airport (SNA) and affordable 70min Southwest flights made these 1 day on-site trips fairly easy.\nThe main goal of these shotgun trips was to get face-to-face time with with the full Android Auto UX team.\nBe efficient, available, & over communicateHaving one day committed to travel, team collaboration, and in-person meetings allowed me to have efficient and (mostly) uninterrupted time designing in the Google Irvine Office.\nA specific point I want to make is that even though I was being distracted less, doesn’t mean that I wasn’t available.\nThere are a couple notable attributes that allowed to be remote, available, and accessible.","info":{"author":"Joel Beukelman","top_img":"https://cdn-images-1.medium.com/max/1200/1*wNJaT35re6BgHLSxbAyalA.jpeg"}}}]}},"pageContext":{"source":"medium_search_remote","alias":"on_the_road","label":"已在路上"}}