{"data":{"mongodbDatabaseArticles":{"id":"5b95ee0687be0583274900c5","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">25 Handy Thailand Travel Tips and Life Hacks</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-16973\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/Thailand-Travel-Tips-Life-Hacks-1000px.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Thailand Travel Tips &amp; Life Hacks Header.j\" width=\"1000\" height=\"550\"><br>\nDuring the 3+ years we&#8217;ve lived in Thailand, we&#8217;ve picked up a fair share of clever tips and great advice that has helped us adjust to life abroad. Some of these hacks have made our daily life more comfortable and safe. Some have saved us a significant amount of time or money while we&#8217;ve explored, vacationed, or otherwise traveled around Southeast Asia. But one thing&#8217;s for sure: first-time vacationers looking for Thailand travel tips or expats in search of some life hacks to make Thailand feel more like home will find the following suggestions helpful.</p>\n<h2><p id=\"Thailand_Travel_Tips\"><p>Thailand Travel Tips</p></p></h2>\n<h3><p id=\"Use_Grab_Taxi_to_get_around_major_towns\">Use Grab Taxi to get around major towns</p></h3>\n<p>Grab Taxi is a successful ridesharing app that can be found in many of Thailand&#8217;s major cities including:<br>\n</p><ul>\n<li>Bangkok</li>\n<li>Chiang Mai</li>\n<li>Chiang Rai</li>\n<li>Khon Kaen</li>\n<li>Nakhon Ratchasima (Korat)</li>\n<li>Pattaya</li>\n</ul>\n\t\t\t\t<ul>\n<li>Phuket</li>\n<li>Songkhla &amp; Hat Yai</li>\n<li>Surat Thani &amp; Koh Samui</li>\n<li>Ubon Ratchathani</li>\n<li>Udon Thani</li>\n</ul>\n\t\t\t\t<p class=\"clear\"></p>Grab Taxi is easy to book through its app and it&#8217;s relief to have a car waiting right at our front door. It beats walking down the street while waiting for a taxi or songthaew to drive by, especially if we&#8217;re in a rush or headed to the airport. Plus, there&#8217;s no intimidating haggling involved, no waiting for other passengers to get on or off, and you don&#8217;t have to worry whether or not the driver is going to use the meter.\n<p>Grab Taxi is easy to book through its app and it&#8217;s relief to have a car waiting right at our front door. It beats walking down the street while waiting for a taxi or songthaew to drive by, especially if we&#8217;re in a rush or headed to the airport. Plus, there&#8217;s no intimidating haggling involved, no waiting for other passengers to get on or off, and you don&#8217;t have to worry whether or not the driver is going to use the meter.</p><p>Overall, we&#8217;ve had excellent experiences with Grab Taxi drivers and the app is user-friendly.</p>\n\n\n\n<p><strong>TIP:&#160;</strong></p> <strong>If you&#8217;re new to Grab Taxi, g</strong><strong>et 100 THB off your first ride&#160;when you download the Grab app&#160;and use our discount code:</strong>&#160;<strong><p>GRABTIETOTHAI</p>&#160;</strong>(<a href=\"https://www.tielandtothailand.com/recommends/grab/\"><strong>or just sign up here</strong></a>).\n\n\n\n<h3><p id=\"Get_a_re-entry_permit_before_traveling_internationally\">Get a re-entry permit before traveling internationally</p></h3>\n<p><img class=\"aligncenter size-full wp-image-16957\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/ReEntry-Permit.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Thailand Life Hack: Get a Re-Entry Permit for long term stayers\" width=\"1000\" height=\"550\"><br>\n<strong>A re-entry permit is only required for people who have a single entry Non Immigrant Thai Visa (for all you students, teachers, retirees, and other long-term stayers out there)</strong> or a single entry Thai Tourist Visa&#160;and want to travel to a different country. If this describes your situation, then be sure to buy a <a href=\"https://www.tielandtothailand.com/thai-re-entry-permit-explained/\">re-entry permit</a> before you leave Thailand. This permit is stamped into your passport and will allow you to exit the country and then re-enter without forfeiting your Thai visa. Without it, you&#8217;ll be SOL.</p>\n<p>People who do not need a re-entry permit are those who are on either a multiple entry Non Immigrant&#160;Visa or a&#160;<a href=\"https://www.tielandtothailand.com/thailand-multiple-entry-tourist-visa-requirements/\">multiple entry Tourist Visa (METV)</a>.</p>\n<p>If you have a visa-exempt stamp in your passport, then you do not qualify for a re-entry permit.</p>\n<h3><p id=\"Drive_legally_with_an_international_driver8217s_permit\">Drive legally with an international driver&#8217;s permit</p></h3>\n<p>A driving license from your home country doesn&#8217;t cut it in Thailand. To legally drive (although the rental agencies only want to see a passport) you must have an international driver&#8217;s permit in the vehicle type you plan to drive.</p>\n<p>If you<a class=\"thirstylink\" title=\" drive a car\" href=\"https://www.tielandtothailand.com/recommends/thailand-rental-cars/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> drive a car</a>, you need an international driver&#8217;s permit for a car. <strong>If you drive a motorbike, you must have an international driver&#8217;s permit for a motorcycle.</strong> If you get caught without the correct one, you will be fined. It&#8217;s not much &#8211; 500 to 1,000 THB (roughly 14 USD to 28 USD) &#8211; but it&#8217;s a cost that could be easily avoided with the correct document.</p>\n<h3><p id=\"Use_landmarks_not_addresses_to_get_around_town\">Use landmarks (not addresses) to get around town</p></h3>\n<p>The best thing to tell a taxi, songthaew, or tuk-tuk driver is the nearest&#160;landmark, major store, or building to your final destination. You may have to walk a minute or two after being dropped off, but it beats trying to explain the exact address of some hole-in-the-wall caf&#233; or brand new hotel down a really narrow alley.</p>\n<p>Alternatively, tell the driver the nearest intersection. This usually comprises of a road (tanon) and a small alley (soi). For example, Chulalongkorn Road Soi 42 (spoken: tanon&#160;chulalongkorn soi see-sip-song). The downside is that Thai street names are often difficult to pronounce or have too many syllables to easily remember without consulting a map. Stick with the nearest landmark instead.</p>\n\n\n\n<p><strong>TIP:</strong></p> If you&#8217;re traveling around Chiang Mai, tell the songthaew driver the nearest temple.\n\n\n\n<h3><p id=\"Think_outside_the_hotel_box\">Think outside the hotel box</p></h3>\n<p>If you&#8217;re new to traveling, it&#8217;s easy to stick with what&#8217;s in your comfort zone and what you know: a hotel. What&#8217;s cool is that Thailand has a variety of accommodations with many platforms to help you access them.</p>\n<p>Budget travelers should try <a title=\"Couchsurfing\" href=\"https://couchsurfing.com/?utm_source=blogs&amp;utm_campaign=tieland\" rel=\"nofollow\">CouchSurfing</a> in Bangkok.&#160;Big families or large groups of friends should consider renting out a <a title=\"Lofty Villas in Phuket\" href=\"http://www.loftyvillas.com\">villa in Phuket</a>.&#160;Everyday travelers can find a <a title=\"Guesthouses in Krabi with Agoda.com\" href=\"https://www.agoda.com/city/krabi-th.html?cid=1608701\" rel=\"'nofollow&quot;\">guesthouse in Krabi using Agoda</a> or a house in Chiang Mai with <a title=\"Get $27 credit if you book $73+ with AirBnB\" href=\"https://www.airbnb.com/c/chrisa264\" rel=\"nofollow\">AirBnB</a>. Definitely explore these options.</p>\n<h3><p id=\"Withdrawal_the_maximum_amount_from_ATMs_to_minimize_fees\">Withdrawal the maximum amount from ATMs to minimize fees</p></h3>\n<p>Thailand is a cash-based society so you can expect to handle bills and coins the entire time you&#8217;re here. Unfortunately, ATM fees in Thailand are outrageous. As in 200 THB (6.50 USD!) per transaction outrageous. And that amount doesn&#8217;t include the international exchange fee or your home bank&#8217;s fee, either.</p>\n<p>Some non-Thailand banks (like those from Australia or Ireland) may limit the withdrawal amount to 10,000 THB. If you don&#8217;t have that restriction (or if you call your bank and ask for a withdrawal increase), check out these Thailand banks with the greatest maximum withdrawal limits:</p>\n<p><img class=\"aligncenter size-full wp-image-16960\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/Thailand-Banks.jpg?resize=1000%2C195&amp;ssl=1\" alt=\"Thailand Banks\" width=\"1000\" height=\"195\"></p>\n<ul>\n<li><p>Citibank: 50,000 THB</p></li>\n<li><p>CIMB Bank: 30,000 THB</p></li>\n<li><p>Krungsri Bank: 30,000 THB</p></li>\n<li><p>Thai Military Bank: 30,000 THB</p></li>\n<li><p>Bangkok Bank: 25,000 THB</p></li>\n</ul>\n<h3><p id=\"Ask_your_hotel8217s_front_desk_staff_to_buy_your_bus_or_train_ticket\">Ask your hotel&#8217;s front desk staff to buy your bus or train ticket</p></h3>\n<p>As easy as it is to book an airline ticket online or to step outside and hail a taxi or songthaew (in major towns), there is a gray area to buying a bus or train ticket. In our experience, few Thai companies have made the switch to online reservations. Those who have switched advertise in Thai. The alternative is to spend an afternoon physically going to the bus or train station to buy tickets in advance or else you risk a sold-out trip if you arrive just hours before departure.</p>\n<p>Instead, don&#8217;t be shy to ask your guesthouse&#8217;s or hotel&#8217;s front desk staff for help. They are usually ok with passing along the task to one of <strong>their workers who, for a small fee, will go to the bus or train station and buy your tickets and bring them back to you.</strong></p>\n<h3><p id=\"Travel_around_Thailand_during_low_season\">Travel around Thailand during low season</p></h3>\n<p>Thailand&#8217;s low season is roughly from the beginning of May to the end of October. It may be hot, rainy, or both, but this time of year is when we prefer to do most of our travel. Why? Hotel and guesthouse prices are slashed, crowds are waaaay smaller, service is more personalized, and most of the time the skies are gorgeous.</p>\n<p>Read what we had to say about the season in our recent article&#160;<a href=\"https://www.tielandtothailand.com/best-time-visit-thailand/\">When the best time to visit Thailand?</a></p>\n<h3><p id=\"Save_your_national_park_entry_ticket_for_free_visits_elsewhere\">Save your national park entry ticket for free visits elsewhere</p></h3>\n<p>Sadly, Thailand has a&#160;<a href=\"https://www.tielandtothailand.com/thai-dual-price-system/\">dual price system</a>&#160;for national parks. Flashing a Thai license or work permit doesn&#8217;t get you the local price anymore. However, it is possible to get access to all the national parks in that same province, on the same day, using your original ticket. So save your ticket and visit any neighboring parks at no extra charge.</p>\n<h2><p id=\"Food_Advice\"><p>Food Advice&#160;</p></p></h2>\n<h3><p id=\"Don8217t_be_afraid_to_buy_meat_from_the_market\">Don&#8217;t be afraid to buy meat from the market</p></h3>\n<p>As one guy asked on a forum some time back, &#8220;Is it safe to eat meat that&#8217;s been sitting out in hot temperatures for hours with an abundance of flies constantly landing on the meat doing their thing?&#8221;</p>\n<p>No. The answer is no.</p>\n<p><strong>No one&#160;should buy meat that&#8217;s been sitting out in the heat covered in flies.</strong> Avoid that horrible combination by sticking to these rules:</p>\n<ul>\n<li>Buy meat that&#8217;s been sitting on ice. Oftentimes it&#8217;s on a banana leaf with ice underneath.</li>\n<li>Use the metal tongs on display to set aside the pieces of meat on top of the pile. Select the pieces from the bottom of the stack (the meat that&#8217;s in direct contact with the ice or banana leaf).</li>\n<li>Look for vendors that have a homemade fan above their stall&#8217;s meat. It should be constantly revolving and swatting away the flies.</li>\n<li>Buy the meat when the vendor first opens, whether that&#8217;s in a morning market or an evening market. That&#8217;s around 6 am and 3 pm for our local market but opening times can vary. Don&#8217;t buy near the end of their shift.</li>\n</ul>\n<p>On the flip side, if there are no flies on the meat but there are no fans swatting the bugs away, then don&#8217;t buy it. Chances are the meat has been sprayed with a chemical to keep the bugs away, which can be dangerous if consumed.</p>\n<h3><p id=\"Learn_the_difference_between_salt_sugar_and_MSG\">Learn the difference between salt, sugar, and MSG</p></h3>\n<p><img class=\"aligncenter size-full wp-image-16964\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/Sugar-vs-MSG-in-Thai-food.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Sugar vs MSG in Thai food\" width=\"1000\" height=\"550\"></p>\n<p>If you ever sit down at a table at a Thai restaurant or food stall and reach for the salt in the condiment container &#8211; stop. Those white crystals aren&#8217;t salt. If you see white crystals, it&#8217;s either one of two things: sugar or MSG. We know what you&#8217;re thinking: Isn&#8217;t MSG a brown sauce?</p>\n<p><strong>MSG is somewhat sparkly. It&#8217;s also shaped like a hexagonal tube,</strong> so the grains will be a little longer than they are wide. On the flip side, sugar and salt are dull and cubic.</p>\n<p>If you&#8217;re still unsure, take a tiny taste of the white crystals before you go adding it to your stir fry or soup dish. Even though MSG is a controversial substance in some countries and some people even argue that it&#8217;s not unhealthy, a little sampling won&#8217;t hurt. But one thing&#8217;s for sure &#8211; it makes food delicious if you&#8217;re willing to use it.</p>\n<h3><p id=\"Bring_a_bottle_of_rum_to_the_beach_for_adult_fruit_smoothies\">Bring a bottle of rum to the beach for adult fruit smoothies</p></h3>\n<p>As far as we can tell, you can bring your own alcohol to&#160;Thailand&#8217;s beaches. Rather than buying overpriced pi&#241;a coladas from a beach bar (or lounging on a beach that has no bar), plan ahead by buying a bottle of rum from the nearest Tesco Lotus, 7-Eleven, or FamilyMart and pack it in your beach bag. Before settling down on the sand, find a vendor who sells fruit smoothies. Buy a few for a mere 1 or 2 USD a pop, ask for an extra cup or two, and then split and mix drinks with friends. It&#8217;s convenient and affordable. We do it every time we visit <a href=\"https://www.tielandtothailand.com/visiting-ao-nang-thailand/\">Ao Nang Beach</a> in Krabi. Of course, use discretion and clean up after yourself before you leave.</p>\n<h3><p id=\"Get_drinking_water_from_filtered_water_dispensers\">Get drinking water from filtered water dispensers</p></h3>\n<p>If you&#8217;re spending more than a few days in one town, keep an eye out for&#160;filtered water dispensers. Instead of buying 1.5 L or 6 L water containers from Tesco, FamilyMart, or 7-Eleven, and throwing away the empty plastic bottles when finished, save them and refill them with filtered water.</p>\n<p>If you&#8217;re in a permanent residence, get your drinking water delivered in bottles (ranging from a pallet of 1 L glass bottles to a 20 L jug) from your local water company.</p>\n<h3><p id=\"Look_for_ice_with_holes_in_it\">Look for ice with holes in it</p></h3>\n<p><strong>If the ice has holes in it, you know it&#8217;s come from a filtered water source.</strong> It&#8217;s safe to drink. If you are not comfortable with drinking ice, then avoid consuming anything that&#8217;s made with shaved ice.</p>\n<p>And while we&#8217;re on the subject of ice, it&#8217;s customary to drink beer with ice. Order a bucket of ice alongside a round of beers to keep your beverages cool. The beer bottles are usually not very cold&#160;when served and often warm up faster than they&#8217;re being drunk.</p>\n<h2><p id=\"Packing_Tips\"><p>Packing Tips&#160;</p></p></h2>\n<h3><p id=\"Keep_a_universal_plug_adapter_in_your_travel_bag\">Keep a universal plug adapter in your travel bag</p></h3>\n<p><img class=\"aligncenter size-full wp-image-16956\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/Thailand-Plugs.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Thailand hacks: know your electrical plug's shape\" width=\"1000\" height=\"550\"><br>\nThailand&#8217;s plugs are shaped differently than those in Europe and the Americas. Plus, the wall sockets are often double pronged rather than triple pronged. Surprise! That proves to be frustrating after checking into a hotel and being unable to plug in a&#160;laptop.</p>\n\n\n\n<p><strong>TIP:</strong> </p>Yes, you can plug in dual voltage electronics such as cellphones and computers. No, you cannot plug in single voltage electronics such as electric razors or hair dryers. Fry they will.\n\n\n\n<h3><p id=\"Bring_an_umbrella_for_a_double_dose_of_sun_protection\">Bring an umbrella for a double dose of sun protection</p></h3>\n<p>Using an umbrella on a sunny day in the USA was a laughable offense. But in Thailand, it&#8217;s all too common to see locals walking around with umbrellas.</p>\n<p>For one, sunblock is ridiculously expensive in Thailand and often has whitening agents. Plus, standing in the shade is always cooler than standing in the direct sun. <strong>An umbrella blocks the sun, which prevents your skin from burning and keeps you significantly cooler.</strong> A collapsible umbrella is not inconvenient to include in a day pack and well worth the benefits.</p>\n<h3><p id=\"Always_carry_wet_wipes\">Always carry wet wipes</p></h3>\n<p>Wet wipes double as toilet paper and hand soap. You&#8217;ll never know when you stumble into a restroom that lacks both. It happens more regularly than you&#8217;d think, often in the worst possible situation!</p>\n<h3><p id=\"Stay_dry_with_body_powder\">Stay dry with body powder</p></h3>\n<p>Keeping your skin cool and dry is essential in a humid country. No matter how few or many curves on your body, everyone is prone to getting heat rash or candidiasis in areas where skin meets skin &#8211; toes, armpits, thighs, wherever. We like to use a medicated cooling powder to stay comfortable, preferably <a href=\"https://amzn.to/2IGDsza\" target=\"_blank\" rel=\"noopener\">Snake Brand Prickly Heat Body Powder</a>.</p>\n\n\n\n<p><strong>TIP:</strong></p> Body powder also doubles as dry shampoo, although it blends in easiest on people with lighter hair.\n\n\n\n<h2><p id=\"Expat_Advice\"><p>Expat Advice&#160;</p></p></h2>\n<h3><p id=\"Pay_your_bills_at_7-Eleven\">Pay your bills at 7-Eleven</p></h3>\n<p>Pay your water, phone, and <a href=\"https://www.tielandtothailand.com/how-to-pay-thai-electric-bill/\">electricity bills</a> at 7-Eleven. You can even reserve airline tickets online and then pay the balance at 7-Eleven, too. Luckily, there are about 8,000 7-Elevens throughout the country, so it&#8217;s relatively convenient to take care of. Just be sure to bring your receipt with the barcode so that the cashier can scan it. Just hand it over and the cashier will know what to do.</p>\n<h3><p id=\"Watch_out_for_8216whitening8217_skincare_products\">Watch out for &#8216;whitening&#8217; skincare products</p></h3>\n<p>You might not notice it right away but many skincare products in Thailand contain whitening chemicals. Items include body lotion, face washes, face masks, sunblock, face powder, BB creams, and even deodorant.</p>\n<p>After much trial and error, we&#8217;ve found skincare products that don&#8217;t lighten and pinkify our skin. Go with these brands: Dove, Nivea, Rexona, Bior&#233;, and Vaseline to name a few.</p>\n<h3><p id=\"Sit_in_front_of_a_fan_to_avoid_mosquitoes\">Sit in front of a fan to avoid mosquitoes</p></h3>\n<p>To combat mosquitoes, people tend to slather themselves with repellent or they wear pants, socks, and/or long-sleeved shirts. We offer another solution: sit in front of a fan. This works even for people who are prone to getting bitten eaten alive. It is physically impossible for a mosquito to fly against the air current produced by a fan, so you&#8217;re in the clear as long as the air current is blowing on you.</p>\n<h3><p id=\"Actively_reduce_plastic_bag_use\">Actively reduce plastic bag use</p></h3>\n<p><img class=\"aligncenter size-full wp-image-16971\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/Thailand-soda-or-coffee-in-a-bag.jpg?resize=1000%2C549&amp;ssl=1\" alt=\"'Soda-in-a-bag' Thai style\" width=\"1000\" height=\"549\"></p>\n<p>Thailand is the land of plastic bags and <a href=\"http://ilefthome.com/7-eleven-suffocating-thailand-plastic/\">we&#8217;re not the only ones who&#8217;ve noticed</a>. Vendors and cashiers are eager to use plastic bags, even for single items or tiny-sized purchases. They&#8217;ll even go Russian-doll on you and put bags inside bigger bags. This is especially true when buying&#160;produce&#160;from a&#160;local market or snacks (like this &#8216;soda-in-a-bag&#8217; above) from a roadside stall.</p>\n<p>It&#8217;s easy to be up to your eyeballs in one-time-use plastic bags in just a few week&#8217;s time. If you&#8217;re environmentally conscientious, politely decline items from being placed in bags or use alternative containers such as a reusable cloth bag or a thermos instead.</p>\n<h3><p id=\"Beat_the_heat_by_lounging_outside\">Beat the heat by lounging outside</p></h3>\n<p>Here&#8217;s more talk about shade. It may sound counter-intuitive, but sitting outside in a perpetually shady area (preferably near lots of plants) and with a nice cross-breeze can be surprising cooler than staying inside. A room can get stuffy without proper airflow and hot if the sun is pouring through the windows. Go to a nice <a href=\"http://www.paperplanesblog.com/50-of-the-best-cafes-in-chiang-mai/\">outdoor caf&#233;</a> or restaurant and bring your laptop, book, or sketch pad and you&#8217;ll see what we mean.</p>\n\n\n\n<p><strong>NOTE:</strong> </p>This is no match to closing your home&#8217;s windows and blasting the icy AC. But then again, you&#8217;ll have to settle for a massive electric bill at the end of the month.\n\n\n\n<h3><p id=\"Get_a_discount_movie_night_in_theaters_on_Wednesdays\">Get a discount movie night in theaters on Wednesdays</p></h3>\n<p>Wednesday night discounts seem&#160;to be a&#160;trend all across Thailand. Major movie theaters in Bangkok and Chiang Mai offer discounted rates for movies, but we think we&#8217;ve seen it span to other types of entertainment venues and even restaurants, too.</p>\n<h3><p id=\"Collect_7-Eleven_and_Tesco_Lotus_stamps_for_discounts_or_prizes\">Collect 7-Eleven and Tesco Lotus stamps for discounts or prizes</p></h3>\n<p><img class=\"aligncenter size-full wp-image-16958\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/7-Eleven-Stamps.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Collect 7-Eleven's stamps for prizes\" width=\"1000\" height=\"550\"></p>\n<p>You may have received a few cutesy cartoon-embossed stamps with your receipt at 7-Eleven. No, you cannot use them as postage stamps to send mail. What you can do, though, is either to exchange these stamps for a discount on your next purchase (for their face value of 1 THB or 3 THB).</p>\n<p>Tesco Lotus hands out stamps, too, but these are used to redeem a prize. Collect them in a little booklet in exchange for a cute prize such as a cup, umbrella, or stuffed animal.</p>\n<p>There you have it. Whether you&#8217;re a first-time visitor or plan to live in Thailand, hopefully you&#8217;ll put most of them to good use the next time you&#8217;re in town.</p>\n<p><strong>Do you have any additional tips, advice, or hacks for Thailand?</strong></p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"pinit aligncenter wp-image-16975 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/12/Thailand-Travel-Tips-Life-Hacks.jpg?resize=400%2C667&amp;ssl=1\" alt=\"Thailand Travel Tips &amp; Life Hacks | Tieland to Thailand\" width=\"400\" height=\"667\"></p>\n<p>Disclosure: This post contains some affiliate links. There&#8217;s no extra cost if you click one, but in doing so it helps compensate us for our time researching and sharing great finds with readers like you. Thanks!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"25 Handy Thailand Travel Tips and Life Hacks"}},"pageContext":{"id":"5b95ee0687be0583274900c5"}}