{"data":{"mongodbDatabaseArticles":{"id":"5b9624ae87be058327490ed1","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">29 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p>Jose Mariano is an MIT-trained aerospace engineer from Spain, a father of two children and an avid badminton player. In the year 2002 he authored a paper named &#8220;The role of balloons in the future development of space tourism&#8221;. He is bringing us <a href=\"http://0ll00.com/\">that future now</a>.</p>\n<p><em><img src=\"http://www.foxnomad.com/wp-content/uploads/2011/04/Jose-Mariano-Lopez-Urdiales.jpg\" alt=\"jose mariano lopez urdiales\" width=\"690\" height=\"460\"><br>\n</em></p>\n<p>I had the pleasure of meeting Jose in Sofia, Bulgaria during the <a href=\"http://www.ecommerceacademy.net/en/events/sofia-17-march-2011.html\">Space Tourism &amp; Travel Trends Summit</a>. Talking with him and hearing about <a href=\"http://www.inbloon.com/en/index.php\">bloon</a> was captivating, and the idea of traveling beyond Earth will trigger your imagination as well..a reality in the very-near future.</p>\n<p><strong><img src=\"http://www.foxnomad.com/wp-content/uploads/2011/04/6616_microbloon_n0.jpg\" alt=\"bloon\" width=\"317\" height=\"178\">What is the dream behind bloon?</strong></p>\n<p>Seeing with one&#8217;s own eyes that the Earth is round, blue and immersed in a black sea of stars.</p>\n<p><strong>How does bloon work exactly?</strong></p>\n<p>By lifting to the right altitude a closed pod where up to 6 people fit. The altitude is about 36km. To reach it we use the simplest means possible, that is the gas balloon. Then, after 2 hours enjoying the beauty of our blue planet, the pod separates from the balloon and falls back to Earth on a guided parafoil.</p>\n<p><strong>You get asked all the time what could go wrong, so, how safe is bloon?</strong></p>\n<p>We aim for the same safety as a small airplane or hot air balloon flight. Simpler systems are easier to make safer. Our solution is dramatically simpler than any guided missile modified to carry people. In bloon, there is no rocket, there is no high speed re-entry. We have no catastrophic failure modes. Just like on commercial airplanes, when something goes wrong, there are several redundant systems, for instance we carry 2 back-up parachutes in addition to the nominal parafoil.</p>\n<p><img src=\"http://www.foxnomad.com/wp-content/uploads/2011/04/nbloon_media0.jpg\" alt=\"bloon flag\" width=\"690\" height=\"518\"></p>\n<p><strong>How much does a bloon ride cost and when will the first travelers go up?</strong></p>\n<p>110,000 Euro for 1 person. We expect the commercial flights to start sometime between 2013 and 2015. I find it more prudent not to provide a specific date.</p>\n<p><strong>What motivates you personally to make bloon a success?</strong></p>\n<p>I was privileged to have a astronomer father and marvel at the beauty of the universe and our planet since I remember. I want to share that with as many people as possible. And I believe that if most decision makers, role models and other powerful people got to see the Earth from bloon and felt one with the planet, the world would be a better place.</p>\n<p></p>\n<p><strong>Looking into a crystal ball, where does the technology behind bloon go &#8211; what could be next?</strong></p>\n<p>We humans have been flying for a very little time. Most of our flying vehicles are modified weapons. I&#8217;m sure human creativity, given the right incentives, will out-innovate our current WW2 legacy technology and come up with flying solutions that are cleaner, safer and more capable. To me bloon is just a step in that direction.</p>\n<p>Thank you very much for taking the time to answer my questions Jose, I look forward to the day that we can all look back down at our precious planet. You can learn more about <a href=\"http://www.inbloon.com/en/index.php\">bloon</a> and <a href=\"http://0ll00.com/\">zero2infinity</a> on their respective websites. I also encourage you to <a href=\"https://twitter.com/#!/flyabloon\">follow zero2infinity on Twitter</a> and <a href=\"https://www.facebook.com/group.php?gid=295548126166\">on Facebook</a> as well.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Talking Near-Future Space Tourism On bloon With zero2infinity CEO Jose Mariano"}},"pageContext":{"id":"5b9624ae87be058327490ed1"}}