{"data":{"mongodbDatabaseArticles":{"id":"5b9629e987be0583274911be","content":"<div><p>Welcome to Backpacker&#8217;s Boutique. Every Sunday, this spot will feature the luxury side of an awesome city.&#160;Guest bloggers will&#160;share about either their hometown or a town they are expat in and know very deeply so that you get a guide straight from a local.&#160;&#160;E-mail me if you&#8217;d like to be featured.</p><h1>A Luxury Guide to&#160;<p class=\"s1\"><b>Leuven</b></p></h1><p class=\"p2\"><b><i>Tell us a little about&#160; yourself and tell us why you&#8217;re an expert on luxury travel in Leuven, Belgium</i></b></p><p class=\"p2\">Hi there! I&#8217;m Sofie and I&#8217;ve been living in the university city of <a href=\"http://wonderfulwanderings.com/leuven/\">Leuven</a> for six years now. Before that, I studied here for four years, with a short break after during which I lived in Antwerp for a year. Although I didn&#8217;t grow up in Leuven, it&#8217;s a city I frequently visited both with friends and family. It&#8217;s where we went to the movies, went shopping, attended summer events and more. </p><p class=\"p2\">Whenever I&#8217;m in Belgium, I work from the apartment I share with my boyfriend just outside the city center and so it&#8217;s not rare for me to jump on my bike and head into town when I need a break.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20434\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/heverlee-woods.jpg?resize=800%2C533&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"533\"></p><p class=\"p2\"><b><i>What makes </i></b><b><i>Leuven</i></b><b><i> a perfect destination for travelers seeking a glamorous trip?</i></b></p><p class=\"p2\">Leuven is known as a university city but don&#8217;t let that fool you. It has some amazing restaurants, medieval architecture and even some UNESCO sites. Leuven is also home to the international brewing company AB Inbev and with the Belgian beer scene just being honored with the title of UNESCO World Heritage, it&#8217;s the perfect place to go for some quality beer tastings.</p><p class=\"p2\">Luxury in Leuven isn&#8217;t screamy or glittery, it&#8217;s classy, subtle and you need to know where to find it.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20437\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/small-beguinage.jpg?resize=800%2C533&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"533\"></p><p class=\"p2\"><b><i>What 5 star hotel is the best in </i></b><b><i>Leuven?</i></b></p><p class=\"p2\">I would definitely recommend the <a href=\"http://www.anrdoezrs.net/links/7623084/type/dlg/https://www.hotelscombined.com/Hotel/Martins_Klooster_Hotel.htm\">Martin&#8217;s Hotel</a>. It&#8217;s a four-stars, but perfectly illustrates the luxurious side of the city. </p><p class=\"p2\">Martin&#8217;s Hotel used to be a monastery with a history dating back 500 years. It&#8217;s a listed building combining historical charm with modern comforts. The hotel offers guests the option of booking a golf pass with which they can reserve greens at a preferential rate at no less than 19 golf courses in the area.</p><p class=\"p2\"><b><i>What about boutique hotels in </i></b><b><i>Leuven,</i></b><b><i> of them all, which would you send your friends or family to stay at?</i></b></p><p class=\"p2\">I would tell them to check out Guesthouse Begijnhof. This too is a historical building, dating back to the 17th century, and it&#8217;s located right outside from the <a href=\"http://wonderfulwanderings.com/grand-beguinage-leuven-unesco-site/\">Big Beguinage</a>, Leuven&#8217;s top UNESCO site.&#160; The Guesthouse is tastefully renovated, offering guests all modern comforts as well as a homemade breakfast buffet every morning. </p><p class=\"p2\">In winter, you can socialize with other guests in the communal living with fireplace, while in summer the garden doors are wide open.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20433\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/Grand-Beguinage.jpg?resize=800%2C600&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"600\"></p><p class=\"p2\"><b><i>Are there any fun luxury activities for the adventurous traveler in </i></b><b><i>Leuven</i></b><b><i>?</i></b></p><p class=\"p2\">Where I live, just outside the city center, Heverlee Woods starts. In this large forest you can go mountain biking or even go on a carriage ride. </p><p class=\"p2\">Leuven is also the town of the River Dijle, which means you can go kayaking, canoeing, or supping. </p><p class=\"p2\">True adventurers take part in the &#8220;Vaartchallenge&#8221; or &#8220;Canal Challenge&#8221; that takes place once a year in summer and tests teams by letting them do all kinds of tests on the water.</p><p class=\"p2\"><b><i>Where are the best hang outs during the day in </i></b><b><i>Leuven</i></b><b><i>?</i></b></p><p class=\"p2\">Leuven is home to many fun caf&#233;s but there&#8217;s only one real place to be: the Old Market. This square is also known as Europe&#8217;s longest bar as all except for one building on this square houses a cafe or eatery. For a trendy establishment, head to the back of the square where you can find bar Louvain Louvain serving great cocktails.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20436\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/old-market.jpg?resize=800%2C533&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"533\"></p><p class=\"p2\"><b><i>If you have a big date night, what are the most delicious restaurants in </i></b><b><i>Leuven </i></b><b><i>and what are their best dishes?</i></b></p><p class=\"p2\">Couvert Couvert on the Sint-Jansbersesteenweg 171 in Heverlee, just outside the city center, boasts a Michelin star. It&#8217;s refined French cuisine is served by an always- friendly staff.</p><p class=\"p2\">If you want to stay in the city center, head to Zarza on Bondgenotenlaan 92. The dishes look like artwork and what you get to taste here is true Belgian cuisine. </p><p class=\"p2\"><b><i>Let&#8217;s talk desserts- what place makes the best?</i></b></p><p class=\"p2\">There are lots of places serving a delicious dessert, but if you want to do it &#8220;the Leuven way&#8221;, you&#8217;ll go to ice cream bar &#8216;t Galetje in the Tiensestraat. This place is iconic and in summer it&#8217;s not unusual to find lines so long they block the street here. All the ice cream sold here is homemade.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20432\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/design-district.jpg?resize=800%2C533&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"533\"></p><p class=\"p2\"><b><i>Tell us all the hot shopping spots in </i></b><b><i>Leuven</i></b><b><i> who&#8217;s carrying the trendy local designers?</i></b></p><p class=\"p2\">The Diestsestraat and the Bondgenotenlaan are Leuven&#8217;s two main shopping streets, but that&#8217;s not where you need to be to find the trendy independent boutiques. Although&#8230; there&#8217;s one exception. At P.J. Van Benedenstraat 5, a small street connecting the Diestsestraat and the Bondgenotenlaan, you can find WEAR. They sell casual smart clothes for men and women that are hard to find elsewhere.</p><p class=\"p2\">Luz de Luxe at Parijsstraat 40 offers selected brand items for women who both want to look good and feel at ease, while Hippo Royale at number 44 is a must-shop for those who want a vintage look without shopping second-hand.</p><p class=\"p2\">LIV at Mechelsestraat 16 sells stylish, no-frills Scandinavian and French brands while Belva back at Parijsstraat 16 is the place to be for fashion by Belgian female designers.</p><p class=\"p2\">And if interior design is more your thing, head to Design District (Justus Lipsiusstraat 18), where you can find a nice selection of Scandinavian furniture and decorative elements.</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20435\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/m-museum.jpg?resize=800%2C533&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"533\"></p><p class=\"p2\"><b><i>Where should art lovers go in Leuven?<br> </i></b>The M Museum always has some nice exhibitions on and often combines historical with modern art. The Schouwburg or City Theater puts on the bigger plays, while art center STuK is known for its experiential performances. The latter is also a great place to catch international (non-Hollywood) movies.</p><p class=\"p2\"><b><i>Time for a great sunset view&#8230; where would you go?</i></b></p><p class=\"p2\">I&#8217;d take the bus out of the center to Kessel-Lo, a borough of Leuven, where I&#8217;d go to the Kesselberg. From that hill you can see all over Leuven. It&#8217;s the perfect spot to catch a sunset!</p><p class=\"p2\"><img class=\"aligncenter size-full wp-image-20431\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/botanical-garden.jpg?resize=800%2C533&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"800\" height=\"533\"></p><p class=\"p2\"><b><i>Now that the sun&#8217;s gone down, fill us on the best places to go for some evening drinks or a great pre-gaming spot. </i></b></p><p class=\"p2\">De Professor and Bar Entreprise (Naamsestraat 20 and 18) are two icons in Leuven&#8217;s cocktail scene, offering great drinks in a cozy ambiance. De Professor&#8217;s interior is rather basic, while the mood at Entreprise is warm, with comfortable couches, high chairs and wooden tables.</p><p class=\"p2\">For a more trendy place, head to Mattiz (Naamsestraat 53) where you can also get tapas or Bar Nine (Oude Markt 9), where you can enjoy your cocktail in a vintage interior and dance the night away on the weekends.</p><p class=\"p2\"><b><i>If you end the night at a fancy club in </i></b><b><i>Leuven</i></b><b><i> which one do you head towards? </i></b></p><p class=\"p2\">Being a rather small city, Leuven doesn&#8217;t really have a club scene. People will be more likely to head to a dance caf&#233; on the Oude Markt for some cocktails and shaking or attend a live show at a place like At The Bebop (Tiensestraat 82).</p><p class=\"p2\"><img class=\"wp-image-20438 size-thumbnail alignleft\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/Sofie-Couwenbergh-Wonderful-Wanderings-in-Bulgaria-700-1.jpg?resize=150%2C150&amp;ssl=1\" alt=\"luxury guide to leuven\" width=\"150\" height=\"150\">In 2012, Sofie launched her travel blog <a href=\"http://www.WonderfulWanderings.com\">WonderfulWanderings.com</a> as a passion project. Since then, she&#8217;s turned it into her full-time job and has successfully collaborated with over 80 brands and destinations worldwide. All while wearing sneakers, of course. She writes practical travel stories with a personal touch, helps travelers plan their itineraries and is a regular contributor for Expedia and Discover Benelux. Traveling the world, crafting articles or taking a dance class when she&#8217;s home, Sofie loves it all&#8230; as long as she can have a cup of tea first.&#160;Want to get in touch? You can find Sofie on <a href=\"https://www.instagram.com/wonderfulwanderings/\">Instagram</a>, <a href=\"https://www.facebook.com/WondWanderings/\">Facebook</a>, <a href=\"https://twitter.com/wondwand/\">Twitter</a> and <a href=\"https://plus.google.com/u/0/+SofieCouwenbergh\">Google+.</a></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Luxury Guide to Leuven"}},"pageContext":{"id":"5b9629e987be0583274911be"}}