{"data":{"mongodbDatabaseArticles":{"id":"5b95ea9e87be05832748ffbd","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/thaifoodpark1.jpg\" alt=\"Thai lady serving thai food in a market in Berlin\"><br> Updated: 06/02/18 | June 2nd, 2018</p><p>I&#8217;ve left pieces of my heart in many places around the world: New York, Paris, Stockholm, and Hong Kong to name a few. But no place has a bigger piece than Thailand. <a href=\"https://nomadicmatt.com/travel-blogs/living-in-bangkok/\" target=\"_blank\" rel=\"noopener\">It was my home for a long time</a> (and in many ways <a href=\"https://nomadicmatt.com/travel-blogs/place-called-home/\" target=\"_blank\" rel=\"noopener\">still is</a>). No amount of time there is long enough, and any amount of time away is too long. Whenever I miss it, I head to a Thai restaurant, shock the staff by speaking Thai, enjoy a quick conversation with them, and eat my weight in food.</p><p>But I always leave disappointed.</p><p>Even the best dishes at the most authentic restaurants are never as good as in Thailand. The food only temporarily fills a hole in my heart. I walk away satiated but never satisfied. It only makes me miss Thailand more.</p><p>But then I came to Berlin, and my world changed.</p><p>A few months ago, my friend <a href=\"http://www.legalnomads.com\" target=\"_blank\" rel=\"noopener\">Jodi</a> found delicious soup at a Thai weekend market in Berlin and proclaimed it the best she&#8217;d had outside of Thailand. I stared at the photo of her red pork noodle soup. I was in shock. Despite my years of searching, I&#8217;ve never found it outside Thailand.</p><p>So while in Berlin two weeks ago, I found myself at that market for lunch. I was like a moth to the flame, except my fire came in the form of soup. As I approached the park and saw colorful umbrellas shooting from ground with the scent of cooking food emanating from beneath them, my walk turned into a sprint. My expectations were high&#160;&#8212;&#160;the online reviews of this market vouched for its authenticity, and the pictures made it seem like the real deal. But could I really have found Thai street food in a park in Berlin?</p><p>I roamed the market, spotting vendors crouched down on mats, cooking on camping stoves, mashing chilies, and shouting in Thai back and forth to each other. It sure felt like the real thing, but what about the taste? Would it be real? I spotted a soup lady and, walking over, I saw it in all its glory:</p><p><img src=\"https://media.nomadicmatt.com/thaifoodpark4.jpg\" alt=\"Thai red pork noodle soup photo\"></p><p>There it was:&#160;kuay tiew moo dang. Red pork noodle soup.</p><p>My heart welled up with joy. Because of how the broth sits out collecting flavor for hours, you can&#8217;t find this soup outside of Thailand&#160;&#8212; food safety laws in Western countries don&#8217;t allow it. But there it was. Here in this park, German officials looked the other way as women crushed up chilies to make som tam without wearing any gloves, vendors poured authentic Thai iced tea, pad kra pao gai (spicy chicken and basil) was prepared as in Thailand (minced up and quickly fried), and soup was cooked the way it should be. There was no refrigeration, no sink to clean the utensils.</p><p>I ordered the soup, sat down to eat on the grass, and was transported home. The sweet and spicy flavor of the broth, the red pork, the texture of the noodles, and the crunch of the rind were all as perfect as they could be.</p><p>When I was done, all that popped into my mind was &#8220;more.&#8221;</p><p><img src=\"https://media.nomadicmatt.com/thaifoodpark2.jpg\" alt=\"Spicy Thai food delicious\"></p><p>I roamed the market, weaving in between rows and around vendors, and ate like a king. I dived into spicy (yet so sweet) som tam that made my mouth burn, ate sticky rice wrapped in banana leaves (licked my fingers clean), and made multiple trips to the woman who sold Thai iced tea. &#8220;Back again?&#8221; she&#8217;d ask.</p><p>&#8220;Yes!&#8221; I said with a smile as I drank half the cup in one gulp. Closing my eyes, I remembered all the hot Bangkok days this drink cooled me down on.</p><p><img src=\"https://media.nomadicmatt.com/thaifoodpark5.jpg\" alt=\"Photos of the best Thai food market in Germany\"><br> <img src=\"https://media.nomadicmatt.com/thaifoodpark6.jpg\" alt=\"Food stall with Thai delicacies in Berlin Germany\"></p><p>Everything about the market brought back home &#8212;&#160;from the way the food was cooked to the little bags takeout orders were put in, to the style of spoon, and even the little step stools, so popular throughout <a href=\"https://nomadicmatt.com/travel-guides/southeast-asia-travel-tips/\" target=\"_blank\" rel=\"noopener\">Southeast Asia</a>, that you sit on while you eat.</p><p>This place is as close to <a href=\"https://nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener\">Thailand</a> as you can get without actually going there.</p><p>The next day I went back with a group of friends, ordered a bunch of dishes, and ate family-style. It was too good not to go back again. If the market was open every day, I&#8217;d be there, my face buried in some Thai dish, but, sadly, it&#8217;s only open on the weekend.</p><p><img src=\"https://media.nomadicmatt.com/thaifoodpark3.jpg\" alt=\"Lots of plates of Thai food to share from the Berlin market\"></p><p>Berlin has a lot going for it:&#160;cool hipsters, food, music, and art. And now it has something nowhere else outside Thailand has &#8212;&#160;authentic Thai food. This is the best Thai food I&#8217;ve found outside of Thailand. Don&#8217;t miss this if you&#8217;re in Berlin and love Thai food. Berlin will now be the hub of my future travels through Europe so I can gorge on the <a href=\"https://nomadicmatt.com/travel-blogs/the-best-thai-food-you-can-eat/\" target=\"_blank\" rel=\"noopener\">Thai food</a> I only dream about.</p><p>The Thai food market has been in Berlin for twenty years and shows no signs of going away, which is good because, with all the travel I&#8217;m doing to Berlin these days, I want my fix.</p><p><strong>How to get there</strong><br> Take the U-Bahn to Fehrbelliner Platz and it&#8217;s in the park outside the train station. The market is open on Saturdays and Sundays in the summer if there&#8217;s no rain. It starts around 12 p.m. and ends around 8 p.m., with the peak time being 1-5 p.m. There are more people and vendors on Sunday, though Saturday has become increasingly popular with sellers.</p><h4>Book Your Trip to Berlin: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Berlin by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Berlin with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Berlin?</strong><br> Be sure to visit our robust <a href=\"https://www.nomadicmatt.com/travel-guides/germany-travel-tips/berlin/\" target=\"_blank\" rel=\"noopener\">destination guide on Berlin</a>&#160;for even more planning tips!</p></div>","title":"Berlin's Thai Food Market is the Best Thai Food Outside of Thailand"}},"pageContext":{"id":"5b95ea9e87be05832748ffbd"}}