{"data":{"mongodbDatabaseArticles":{"id":"5b9248a287be056953db7bc9","content":"<div><p>Earlier this year, I set myself the challenge to <a href=\"http://levels.io/i-am-learning-3d/\">learn 3d in a month</a> by modeling this scene in Tokyo:</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"/wp-content/uploads/2016/02/makashiwakui_header.jpg\"> <p>Previously, I've only really done web development and before that music. So it's been pretty challenging but I've been trying to brute force myself through it. Learning only the minimal needed while making something.</p> <p>After a month of pain, <a href=\"/from-web-dev-to-3d/\">I modeled this entire street</a> and got the basics down + I added cats! &lt;3</p> <p></p><p></p>  <p>Now I had a 3d scene.But my end goal was to <strong>walk in my own modeled street in virtual reality</strong> though. How would I do that?</p> <p>First, I needed some hardware.</p> <h2>Hardware</h2> <p>VR doesn't work with MacBook's yet as their GPU isn't powerful enough. So I had to get a PC. I searched around a bit and found <a href=\"//twitter.com/_kzr\">Keijiro</a>, a great 3d designer, and copied <a href=\"//docs.google.com/spreadsheets/d/1NhoK4qB_K9GUTLT9j728-yYaXJguoTKnEyvwRAqJw0M/edit?usp=sharing\">his new rig</a> and made a few adjustments:</p> <p></p> <p>I went for the GTX 1080 as that's the fastest GPU you can get now.</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-12-00.37.30.png\" alt=\"screenshot-2016-10-12-00-37-30\" width=\"1698\" height=\"1062\" class=\"alignnone size-full wp-image-7177 responsively-lazy\"> <p>I chose the <a href=\"http://phanteks.com/Enthoo-Evolv-ATX.html\">Phanteks Enthoo ITX case</a> because I wanted to travel with it (as carry-on), apparently I could've gone smaller but it was okay:</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-12-00.38.41.png\" alt=\"screenshot-2016-10-12-00-38-41\" width=\"2158\" height=\"1450\" class=\"alignnone size-full wp-image-7178 responsively-lazy\"> <p>The case is 23 cm x 37.5 cm x 39.5 cm. The <a href=\"http://www.qatarairways.com/us/en/baggage.page\">carry-on allowance</a> for Qatar Airways (to give an example) is 25 cm x 37 cm x 50 cm. So just 0.5cm too big but that can be considered a margin of error so it's probably okay. There's VR laptops now but they are prone to overheat and break. Don't buy them. I also got a Dell 24\" dislay. Not too big, and this could actually fit in my rolling suitcase.</p> <img src=\"/wp-content/uploads/2016/10/94080c255295dda89e680ceabdf77127.jpg\" alt=\"94080c255295dda89e680ceabdf77127\" width=\"1500\" height=\"825\" class=\"alignnone size-full wp-image-7185 responsively-lazy\"> <p>Why try be mobile with AN ENTIRE VR SET UP? Well, I had this epic plan to go live on a beach in Bali at the end of 2016 and learn to surf in the day and learn VR dev at night. I know, ridiculous.</p> <img src=\"/wp-content/uploads/2016/10/htc-vive-set.0.jpg\" alt=\"htc-vive-set-0\" width=\"2040\" height=\"1213\" class=\"alignnone size-full wp-image-7179 responsively-lazy\"> <p>I chose the HTC Vive (made in co-op with Valve and Steam) as it seems like the best choice of headset now. It has room scale VR by default, which means you can walk around freely in your room. Oculus just added it too (with Touch) but it's lagging behind a lot in features. They're quickly catching up though (see <a href=\"//www.oculus.com/blog/oc3-reveals/\">OC3's Oculus announcements</a>). I also like that the Vive is built around a future open source SteamVR framework, which means other headsets will be able to use the technology.</p> <p>After a few weeks I got my setup in the mail:</p> <img src=\"/wp-content/uploads/2016/10/photo44036811243249501.jpg\" alt=\"photo44036811243249501\" width=\"960\" height=\"1280\" class=\"alignnone size-full wp-image-7159 responsively-lazy\"> <img src=\"/wp-content/uploads/2016/10/photo44036811243249493.jpg\" alt=\"photo44036811243249493\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-7167 responsively-lazy\"> <img src=\"/wp-content/uploads/2016/10/photo44036811243249498.jpg\" alt=\"photo44036811243249498\" width=\"960\" height=\"1280\" class=\"alignnone size-full wp-image-7162 responsively-lazy\"> <p>And the neighborhood cat used the PC box as her new home ^_^</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-12-00.50.26.png\" alt=\"screenshot-2016-10-12-00-50-26\" width=\"1536\" height=\"1216\" class=\"alignnone size-full wp-image-7187 responsively-lazy\"> <p><strong>Hardware Update 2017-02-22: It's been 4 months and there's actually pretty good VR-ready laptops available now, primarily by MSI and Alienware. If you're moving around, I suggest getting those because traveling with a 12kg rig was terrible! Emirates broke my $300 Dell monitor I checked in in my suitcase (even as I insulated it). The PC still works but carrying it through customs (where they ask many funny questions) and all to the gate (there's no carts AFTER customs did you know that?) is intense. TL;DR get a VR laptop if you move a lot.</strong></p> <h2>Software</h2> <p>Just like with <a href=\"/from-web-dev-to-3d/\">3d modeling</a>, most of game development can now happen with just one tool: <a href=\"http://unity3d.com/\">Unity</a>:</p> <img src=\"/wp-content/uploads/2016/10/Unity_3D_1.jpg\" alt=\"unity_3d_1\" width=\"1681\" height=\"1020\" class=\"alignnone size-full wp-image-7180 responsively-lazy\"> <p>I remember years ago being scared of even getting close to Unity as it seemed so complicated, but having mastered the basics of Cinema 4D, this seemed like a smooth ride. It feels, looks and acts a lot like Cinema 4D. The difference is everyhting in Unity is primed for interactivity. <a href=\"//unity3d.com/get-unity/download\">Unity is free</a>, although if you release your game I think you have to pay them a % of your revenue. There's also <a href=\"//www.unrealengine.com/what-is-unreal-engine-4\">Unreal Engine</a>, which looks better and appears more photorealistic:</p> <img src=\"/wp-content/uploads/2016/10/171.jpg\" alt=\"171\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-7181 responsively-lazy\"> <p>...but I feel Unity is more noob-friendly and more people use it, so you can find answers to questions you have easily.</p> <p>Everything I write now I learnt by just Googling again and watching lots of YouTube tutorials...</p> <h2>Let's start</h2> <p>I started by making a new project and importing my entire scene from Cinema 4D into Unity as an asset:</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-12-00.04.09.png\" alt=\"screenshot-2016-10-12-00-04-09\" width=\"1676\" height=\"740\" class=\"alignnone size-full wp-image-7175 responsively-lazy\"> <p>That instantly crashed Unity as I think the scene was too complex. So instead I made an empty project in Unity, quit Unity. Then I went into the project's Assets folder and put the C4D file there. Then I loaded the project and my scene was in the Library. Dragging it into the viewer, there it was!</p> <p>It didn't go perfect though. I had to reskin ALL textures as they were missing:</p> <img src=\"/wp-content/uploads/2016/10/tokyo_2016-05-16-2.jpg\" alt=\"tokyo_2016-05-16-2\" width=\"2880\" height=\"1620\" class=\"alignnone size-full wp-image-7202 responsively-lazy\"> <p>...this seems to be a common problem as <a href=\"http://twitter.com/vanschneider\">@vanschneider</a> had the same issue.</p> <img src=\"/wp-content/uploads/2016/10/photo44036811243249471.jpg\" alt=\"photo44036811243249471\" width=\"720\" height=\"1280\" class=\"alignnone size-full wp-image-7174 responsively-lazy\"> <p>Also all light and physics (e.g. gravity) was gone. Oh well...</p> <h2>Making a project VR-ready</h2> <p>To make a Unity project VR-ready for Vive, you need to go into the Unity Assets Store and download the SteamVR script:</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-09-17.38.39.png\" alt=\"screenshot-2016-10-09-17-38-39\" width=\"1730\" height=\"990\" class=\"alignnone size-full wp-image-6888 responsively-lazy\"> <p>Drag the CameraRig and SteamVR object inside the SteamVR/Prefabs folder into your project and you instantly make it VR-ready. The blue line is you room's boundaries and help you scale your scene relatively:</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-09-17.46.27.png\" alt=\"screenshot-2016-10-09-17-46-27\" width=\"2294\" height=\"1024\" class=\"alignnone size-full wp-image-6889 responsively-lazy\"> <p></p> <p>Add some random objects and bam:</p> <p></p> <p>Literally that's how easy it is. It even adds the Vive's controllers into your project. When you click Play in Unity, you put on your headset and it works!</p> <p>Or well...So I tried it with my scene but the scale was completely off. I was in a giant street about 100x off scale. It took a few minutes to scale it down to 0.075x. I literally just measured with my controllers how big or small the scale should be and adjusted accordingly.</p> <img src=\"/wp-content/uploads/2016/10/photo44036811243249489.jpg\" alt=\"photo44036811243249489\" width=\"1280\" height=\"960\" class=\"alignnone size-full wp-image-7171 responsively-lazy\"> <p>But then it worked. And amazingly the scale was pretty consistent too even though I designed it in 3d from just that photo:</p> <p></p> <p>Yay! From <a href=\"/i-am-learning-3d/\">idea</a>, <a href=\"/from-web-dev-to-3d/\">to 3d</a>, to VR in just a few months. So. Easy.</p> <p>Apart from the skins, the lights weren't properly imported either, so I had to rebuild them in Unity. That took a while.</p> <h2>Adding interaction</h2> <p>Now that I had a scene, how could I let the controllers touch and interact with stuff? Because by default you simply move through objects that remain static and can't interact with anything. Well, you use the <a href=\"//vrtoolkit.readme.io/\">VR Toolkit (VRTK)</a> by <a href=\"http://twitter.com/thestonefox\">@thestonefox</a>. You simply add VRTK's scripts to objects that you want \"interactable\" and can modify the properties on there, for example selecting \"grabbable\" lets you pick up objects by clicking your controllers:</p> <img src=\"/wp-content/uploads/2016/10/Screenshot-2016-10-12-01.18.02.png\" alt=\"screenshot-2016-10-12-01-18-02\" width=\"3838\" height=\"2090\" class=\"alignnone size-full wp-image-7193 responsively-lazy\"> <p></p> <p>There we go:</p> <p></p> <p>Then if you apply physics to the object, by adding a rigid body with gravity and a box collider (a box around so it can collide with other objects):</p> <img src=\"/wp-content/uploads/2016/10/maxresdefault-1.jpg\" alt=\"maxresdefault-1\" width=\"1280\" height=\"720\" class=\"alignnone size-full wp-image-7194 responsively-lazy\"> <p>...it becomes an object that acts like real life and SHIT JUST TURNED REAL (sorry my mic was a bit soft here but there's frustration here, haha):</p> <p></p> <p>You can go crazier though, Unity has cloth physics, which you can use to make curtains:</p> <p></p> <p>Sorry, textures are a bit off here:</p> <p></p> <p>Cool, right?!</p> <h2>WebVR</h2> <p>I didn't want to write this post about learning VR as a web dev and not even mention WebVR. There's lots of cool stuff happening here with React just announcing <a href=\"//developer.oculus.com/webvr/\">ReactVR</a> which lets you build entire VR scenes with just HTML/CSS like code:</p> <blockquote class=\"twitter-tweet\"> <p lang=\"en\" dir=\"ltr\">We just announced the React VR project during the Oculus Connect Keynote, here's the Hello World of VR: <a href=\"//t.co/VArPTYQlFs\">pic.twitter.com/VArPTYQlFs</a></p> <p>&#8212; React (@reactjs) <a href=\"//twitter.com/reactjs/status/784088700460204032\">October 6, 2016</a></p></blockquote> <p></p> <p>Or frameworks like A-Frame which let you do it with even simpler code:</p> <blockquote class=\"twitter-tweet\"> <p>I made something dumb in A-Frame <a href=\"//t.co/R5SdsGzQjf\">https://t.co/R5SdsGzQjf</a> <a href=\"//twitter.com/hashtag/vaporwave?src=hash\">#vaporwave</a></p> <p>&#8212; Ada Rose Edwards &#127875; (@Lady_Ada_King) <a href=\"//twitter.com/Lady_Ada_King/status/785593035899883521\">October 10, 2016</a> </p></blockquote> <p></p> <p>The cool thing about Unity is that <a href=\"//hacks.mozilla.org/2016/05/exporting-an-indie-unity-game-to-webvr/\">it can actually export easily to WebVR</a>. That means once my VR game is finished, I can deploy it to web in a day or less. Awesome!</p> <h2>Conclusion</h2> <p>I'm amazed how easy it is to get a 3d scene you made into VR. There's some challenges and pains but in the end it went pretty smooth. I was expecting a lot more bugs, errors and weird problems. They weren't there.</p> <p>I'm not sure why I started modeling with Cinema 4D, as importing it from there caused some pain (reskinning, relighting) , so it seems easier to just start in Unity immediately from next time. Sorry Cinema 4D! Unity here we come!</p> <h2>What's next</h2> <p>I now need to add more interactivity to my scene, the plan is to add walking street cats that you have to catch with a fishing net. Here's a start with this cat I rigged on <a href=\"http://mixamo.com/\">Mixamo</a>, an auto rigger service (rigging means making a skeleton for your 3d character so you can move it like a real animal/human):</p> <p></p> <p>Also I want you to be able to walk (or teleport) into the restaurants and bars in the street. Maybe make the doors slideable like real Tokyo doors. And maybe add a ramen bar on the right where you can eat ramen with your controllers (and get high scores for it), I'll make them extra slippery so it's hard to eat. Here's a start:</p> <p></p> <p>Then at the end of this year I'd like to try and get it into the SteamVR store for free and I'll close the year having learnt 3d, VR and released my first VR game/experience.</p> <p>And...I already have a cheesy cover for it:</p> <img src=\"/wp-content/uploads/2016/10/3art2.png\" alt=\"3art2\" width=\"1400\" height=\"788\" class=\"alignnone size-full wp-image-7199 responsively-lazy\">  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"From web dev to VR: How to get started with VR development"}},"pageContext":{"id":"5b9248a287be056953db7bc9"}}