{"data":{"mongodbDatabaseArticles":{"id":"5b95eeae87be0583274900ed","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Three Ways to Fund an Overseas Adventure</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>Back in the day, when had the big dream to move to the romantic mountains of Chiang Mai, we quickly brought ourselves back to reality by asking, &#8220;How will we be able to afford this trip for the long term?&#8221; The fact of the matter was, we wanted to responsibly fund our overseas adventure rather than wing it and risk having money problems later. Although we were putting a portion of each paycheck towards our Thailand fund, we wanted to earn more; our goal was to have enough money in savings to last us for one year.</p>\n<p><strong></strong></p>\n<h2><p>Three Ways We Funded Our Overseas Adventure:</p></h2>\n<ol>\n<li>Sold our belongings via <a title=\"Sell your stuff on Craigslist\" href=\"https://www.tielandtothailand.com/cash-in-on-craigslist/\">Craigslist</a>, eBay, consignment shops, and yard sales</li>\n<li>Stockpiled vacation days to later be cashed out</li>\n<li>Signed up for <a title=\"Start earning miles with rewards credit cards.\" href=\"https://www.tielandtothailand.com/credit-card-miles/\">rewards credit cards</a> to earn free airline miles</li>\n</ol>\n<p>We saw it as a win-win situation. Even if we never ended up moving, it still gave us a warm, fuzzy feeling knowing we purged our apartment of things we no longer needed or wanted, saved up a ton of vacation to be used at a later date, and earned enough miles for several out-of-states trips to visit friends and family.</p>\n<p>But alas, our dream of moving to another country came true. It took us one year to sell our belongings down to three suitcases each and a few boxes that went into storage. We earned roughly $27,500 from selling our stuff, which was more than enough money to fund a frugal, yet comfortable year living in Thailand. The vacation days earned at work were cashed out as a lump sum check after resigning, and we earned huge airline mile bonuses after signing up for some credit cards, which ultimately resulted in free airline tickets to Thailand ($$$!) See, all of our hard work paid off!</p>\n<p>Finding ways to fund our overseas adventure was incredibly rewarding and actually quite fun! We loved seeing our savings accounts grow and grow after each thing we sold, and we happily anticipated using our two &#8220;free&#8221; airplane tickets to fly to Thailand.</p>\n<p>What&#8217;s stopping <i>you</i> from selling some stuff for a little extra dough? Why don&#8217;t you start your own &#8220;Overseas Adventure&#8221; fund!?</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Three Ways to Fund an Overseas Adventure"}},"pageContext":{"id":"5b95eeae87be0583274900ed"}}