{"data":{"mongodbDatabaseArticles":{"id":"5b93833387be056953db7e39","content":"<div><h1 name=\"0dbb\" id=\"0dbb\" class=\"graf graf--h3 graf--leading graf--title\">Why You Can&#8217;t Search for a Job From a Remote&#160;Location</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*IHXKvv4PFHi9nzcnH1nNbA.jpeg\"><p name=\"7faf\" id=\"7faf\" class=\"graf graf--p graf-after--figure\">I&#8217;ve had this conversation many times. A friend calls me up from: Boston, New York, Chicago, San Francisco, wherever and says, &#8220;I&#8217;m thinking about moving to Los Angeles (or SF, NY, etc) and I&#8217;d love to start interviewing. Let me know if you hear of anything interesting.&#8221;</p><p name=\"5cd8\" id=\"5cd8\" class=\"graf graf--p graf-after--p\">I usually slip into counsel mode and tell them it&#8217;s a lost cause unless they&#8217;re truly committed to living in that city and if they are they should move there first and job search second.</p><p name=\"6b56\" id=\"6b56\" class=\"graf graf--p graf-after--p\">If you really are committed to moving to a new city you simply won&#8217;t find the best or right job without feet on the street&#8202;&#8212;&#8202;no matter what anybody else may have told you. At a minimum you need to put yourself in that city for weeks in a row and appear to be local to maximize the quality of the job you get or the probability of getting one in the first place.</p><p name=\"5261\" id=\"5261\" class=\"graf graf--p graf-after--p\">Intuitively you know it&#8217;s kind of obvious that you can&#8217;t realistically search remotely but it&#8217;s hard to make a commitment to actually moving unless you&#8217;re confident you&#8217;d get a great job so you have a chicken-and-egg problem of &#8220;what if I move there and don&#8217;t find the right job!?!&#8221;</p><p name=\"ec1d\" id=\"ec1d\" class=\"graf graf--p graf-after--p\">Finding the best jobs takes a lot of commitment to taking many different networking meetings with executives, recruiters, entrepreneurs, VCs, lawyers, etc. The best jobs are of course found through personal connections and in-person, eyeball-to-eyeball contact.</p><p name=\"a93a\" id=\"a93a\" class=\"graf graf--p graf-after--p\">The best jobs are the ones that have not already been put on a job board. The best jobs are the ones that haven&#8217;t gone out to an executive recruiter. The reason these are the &#8220;best&#8221; jobs for you is that once it goes to an executive recruiter there will be a stack of 100 prospective recruits, 20 amazingly qualified resumes that will have in-person interviews with the recruiter of which the company will meet 5&#8211;6. So unless your last job is a mirror image of your next then good luck with those odds.</p><p name=\"231c\" id=\"231c\" class=\"graf graf--p graf-after--p\">So it takes &#8220;on-the-ground work&#8221; to find the right job. And that ain&#8217;t gonna happen from your LinkedIn messages to buddies you haven&#8217;t spoken to in 3 years. It&#8217;s not even going to happen from your 3-day exploratory trips every 6&#8211;8 weeks. It takes a sustained effort to get the right job. Sure, you can land &#8220;a&#8221; job, just not &#8220;THE&#8221; job.</p><p name=\"d4b2\" id=\"d4b2\" class=\"graf graf--p graf-after--p\">And there are other reasons.</p><p name=\"1a24\" id=\"1a24\" class=\"graf graf--p graf-after--p\">If you really think you&#8217;re committed to Los Angeles&#8202;&#8212;&#8202;then just move there. Make a life decision. None of this wishy-washy hedging your bets, &#8220;Well I don&#8217;t want to move to LA only to find out that I get a job in San Fran and now I have to move twice. I mean I&#8217;d love to live in LA but what I really want is the perfect job wherever that is.&#8221; OK, great. So you&#8217;re in NY and you move to neither LA nor SF and you&#8217;re going to sub optimize your job opportunities in both LA and SF. Let&#8217;s see how that works out.</p><p name=\"ed72\" id=\"ed72\" class=\"graf graf--p graf-after--p\">Any hiring manager at a company who has any operational experience and common sense will never want to hire somebody remotely anyways. Anybody with experience has been burned by somebody else just like you who wanted to get hired for a remote job. Here&#8217;s a few flavors:</p><p name=\"5233\" id=\"5233\" class=\"graf graf--p graf-after--p\">- &#8220;I&#8217;m going to move to LA but my kids are in school. As soon as the school year ends they&#8217;re going to move out.&#8221; Code for, &#8220;I&#8217;m going to see how I like the job for 6 months. I can&#8217;t drag my family to LA and then have to drag them back again if I don&#8217;t like the job.&#8221; Fair enough. I can understand the logic. But I want people that I know are committed to living in the city I&#8217;m hiring. If a hiring manager can find an equivalent candidate already living in that city you can be sure you&#8217;re on the bottom of that candidate stack. So the odds of the best jobs are against you.</p><p name=\"853d\" id=\"853d\" class=\"graf graf--p graf-after--p\">- &#8220;I&#8217;m going to move my family to NYC but I need to sell the house first. I can&#8217;t afford to take a loss on it. So I&#8217;ll commute for the first 6&#8211;12 months.&#8221; Code for, &#8220;OK, I really DO have to sell my house but I also have a great excuse to hedge my bets and see whether I really like the company before truly committing to moving.&#8221; &#8220;Yeah, I know I could probably rent the house out&#8202;&#8212;&#8202;but why should I do that? I don&#8217;t mind commuting.&#8221; Long distance, long-term commuting usually = unhappy family life = unhappy employee = less productive employee = unhappy you. The reality is that the &#8220;I can&#8217;t move until I sell my house&#8221; is yet another hedge and great hiring managers see right through it.</p><p name=\"04d4\" id=\"04d4\" class=\"graf graf--p graf--startsWithDoubleQuote graf-after--p\">&#8220;My wife is finishing up her masters at University of Chicago. So I can&#8217;t move until she finishes.&#8221; Again, understandable. If she&#8217;s not up for transferring to Berkeley&#8202;&#8212;&#8202;that&#8217;s fine. Call me in 2 years when she&#8217;s graduated. But if I sign up to hiring you and you commute from Chicago I&#8217;m only signing up to problems in 9 months. So I&#8217;ll look for a better suited candidate.</p><p name=\"6a9f\" id=\"6a9f\" class=\"graf graf--p graf-after--p\">So&#160;&#8230;.</p><p name=\"f439\" id=\"f439\" class=\"graf graf--p graf-after--p\">If you&#8217;re deeply committed to living in a city&#8202;&#8212;&#8202;move there. If you really care about having the perfect job then being in-market increases your probability 100x. Choose life. Choose your location. Move there. Get settled in. Take the time to know the city. Get your partner or family bedded down and comfortable with the place without the stress of your new work hours. And then set out to shake every hand and kiss every baby in town until you&#8217;ve networked yourself into the ideal role.</p><p name=\"132b\" id=\"132b\" class=\"graf graf--p graf-after--p\">And if you&#8217;re not ready to make this commitment&#8202;&#8212;&#8202;which is totally understandable&#8202;&#8212;&#8202;then better you acknowledge it to yourself and stay put into you&#8217;re really ready to move. Hunker down&#8202;&#8212;&#8202;enjoy your time locally until you&#8217;re ready for a move.</p><p name=\"6758\" id=\"6758\" class=\"graf graf--p graf-after--p\">And if you&#8217;re a hiring manager considering hiring somebody who has to commute for a year or two&#8202;&#8212;&#8202;caveat emptor. I&#8217;m not saying it would never work. But unless you truly have no local candidates&#8202;&#8212;&#8202;why take the risk?</p><p name=\"6c41\" id=\"6c41\" class=\"graf graf--p graf-after--p graf--trailing\">Good luck.</p></div>","title":"Why You Can’t Search for a Job From a Remote Location"}},"pageContext":{"id":"5b93833387be056953db7e39"}}