{"data":{"mongodbDatabaseArticles":{"id":"5b95eb0d87be05832748fff2","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/anxiety08.jpg\" alt=\"Solo girl traveler posing at the Grand Canyon USA\"><br> When I was younger, I was very socially awkward. I got anxiety trying to talk to strangers. Travel forced me to get over that and become what is termed a &#8220;learned extrovert.&#8221; It&#8217;s sink or swim on the road and, since I wanted to travel and be on the road so much, I decided to swim. </p><p>For many, it&#8217;s an even harder challenge. My friend Lauren of Never Ending Footsteps suffered such bad panic attacks when she was younger that she barely left the house, developed an eating disorder, and never took public transportation. Today, Lauren writes in-depth about her panic attacks, how travel helped her cope, and gives advice to others facing the same issues.</p><p>I was 16 when I had my first panic attack. I thought I was going to die. I was drenched in sweat within seconds, I had pins and needles everywhere, my chest was tight, and my left arm was tingling in a way that convinced me I was having a heart attack.</p><p>These panic attacks would take hold of my life &#8212; I was having as many as ten a day. I developed an eating disorder and was unable to leave my house for months at a time.</p><p>I&#8217;m not alone &#8212; <a href=\"http://www.nimh.nih.gov/health/statistics/prevalence/any-anxiety-disorder-among-adults.shtml\">18% of the population in the United States suffers</a> from an anxiety disorder, with around a quarter of these cases classified as severe. Fewer than 40% of anxiety sufferers are receiving treatment for their disorder.</p><p>I didn&#8217;t seek out treatment either. Instead, I decided to travel, hoping that would make me the self-assured, confident person I longed to be and realizing that having a panic attack on a beach in Thailand had to be better than having one at home.</p><p><img src=\"https://media.nomadicmatt.com/anxiety02.jpg\" alt=\"Female Lauren standing in front of lush Australian landscape\"></p><p>My family and friends disagreed and told me that traveling would be a huge mistake. They didn&#8217;t think I was strong enough to deal with unfamiliar situations and were convinced I would be home within a week. In a way, their lack of faith in me spurred me on. I wanted to prove that I wasn&#8217;t as weak as they thought I was.</p><p>By the time I left, my anxiety had improved, but I was still suffering from panic attacks anywhere from once a month to several times a day. In the four years I&#8217;ve been on the road, though, I can count the number of attacks I&#8217;ve had on two hands. Despite what everyone told me, travel can actually help you overcome your anxiety.</p><p>But how do you actually work up the courage to leave? How do you deal with anxiety on the road? And how does traveling actually help reduce anxiety?</p><h3>Dealing with anxiety before you leave to travel</h3><p><img src=\"https://media.nomadicmatt.com/anxiety04.jpg\" alt=\"Girl posing in from of the mall in Washington dc\"></p><p>Here&#8217;s how to calm your mind and get yourself out on the road.</p><p><strong>Remind yourself why you want to travel &#8211; </strong>Whenever you think about canceling your trip, picture yourself in the place you most want to visit, and tell yourself that you have to get there and see what it&#8217;s like.</p><p>Imagine yourself in that place, living the life you&#8217;ve dreamed, without any anxiety in sight. These positive affirmations will calm you down, and doing it repeatedly helps you grasp the idea that you can successfully travel the world.</p><p><strong>Imagine your life a year from now &#8211; </strong>What will happen if you decide to cancel your trip? It&#8217;s likely that a year from now, you&#8217;ll find yourself thinking, Damn, I had the chance to travel and I didn&#8217;t take it. It was the fear of living with regrets that forced me to take a chance and leave.</p><p><strong>Find a community &#8211; </strong>There are a dozen forums out there for anxiety sufferers &#8212; my favorite is <a href=\"http://www.nomorepanic.co.uk/\">No More Panic</a> &#8212; where you can post whenever you&#8217;re struggling and receive help and support from community members, as well as calming tricks to talk yourself down. Integrate yourself into a community like this before you leave, so that if anxiety does hit you when you&#8217;re on the road, you won&#8217;t feel like you&#8217;re struggling on your own.</p><p><img src=\"https://media.nomadicmatt.com/anxiety03.jpg\" alt=\"Solo female traveler learning to surf in Bali Indonesia\"></p><p><strong>Meticulously plan out your first few days &#8211; </strong>Anxiety often stems from feeling like you&#8217;re not in control, so a way to negate this is to plan out every detail of your first day or two on the road. Some suggestions:</p><ul><li>Look for a map and photos of the arrivals terminal of the airport and plan your route through the building.</li><li>Google what to do if your luggage gets lost and write down a set of instructions for this eventuality.</li><li>Plan to take a taxi from the airport to your accommodation so you don&#8217;t have to deal with unfamiliar transport on your first day.</li><li>Write down a list of things you want to do during your time there.</li></ul><p>By focusing on each step at a time, you can feel like you&#8217;re in control, and you won&#8217;t fear the unexpected as much.</p><p><strong>Remember you can always go home &#8211; </strong>If you try it for a few weeks and realize travel isn&#8217;t for you or that this isn&#8217;t the right time, you can always go home. <a href=\"https://www.nomadicmatt.com/travel-blogs/going-home/\">It doesn&#8217;t mean you&#8217;re a failure</a>; it means you tried something and you didn&#8217;t like it.</p><h3>Dealing with anxiety when you travel</h3><p><img src=\"https://media.nomadicmatt.com/anxiety05.jpg\" alt=\"Lauren travels to Guanajuato to see the colorful homes\"></p><p>If you&#8217;re like me, your biggest concern will be over how you&#8217;ll cope if you have a panic attack abroad. What if it happened in a dorm room or &#8212; even worse &#8212; when you&#8217;re on a flight and can&#8217;t escape? You&#8217;ll have to deal with these fears &#8212; on top of the ones nonanxious travelers face: <a href=\"https://www.nomadicmatt.com/travel-blogs/travel-mistakes/\">getting lost</a>, <a href=\"https://www.nomadicmatt.com/travel-blogs/ten-health-safety-tips/\">getting sick</a>, <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-overcome-being-alone/\">not making friends</a>, and <a href=\"https://www.nomadicmatt.com/travel-blogs/the-travel-slump-and-how-to-deal-with-it/\">not enjoying it</a>.</p><p>I still experience occasional panic attacks on the road, but there are plenty of ways to reduce anxiety:</p><p><strong>Form a routine</strong> &#8211; Travel can be stressful and disorienting, and it&#8217;s often the lack of routine that increases your risk of anxiety. In order to feel like you have some control over your life, create a routine so that there&#8217;s always a part of your day when you&#8217;ll know exactly what will happen.</p><p>Try setting an alarm every morning and then heading out for a morning run. Even though the location changes, the simple act of doing the same thing morning after morning gives you something to expect and look forward to. Similarly, you could try eating a sandwich every day for lunch, or having dinner at the same time every evening. You could even set aside one day of a week as a &#8220;treat day,&#8221; where you go for a massage and head to the cinema to watch a movie. It&#8217;s all about staying in control, and these small constants help with that.</p><p><strong>Ignore your intuition &#8211; </strong>Practically every article I&#8217;ve ever read about staying safe on the road tells you to listen to your intuition. The problem for anxiety sufferers is that your instincts will always tell you something bad is always going to happen. If I paid attention to my intuition, I would rarely ever step outside my house, would have never gone on my trip, and would never have accepted an invitation from new friends on the road.</p><p><img src=\"https://media.nomadicmatt.com/anxiety09.jpg\" alt=\"Backpacking around Canada and visiting the lush landscape and lake in Whistler\"></p><p><strong>Set money aside for the bad days &#8211; </strong>Everyone likes to save money on the road, but forcing yourself to always go for the cheapest options can negatively affect your mental health. Staying in dorm rooms night after night, long bus journeys to save a few dollars here and there &#8212; it can all add up to one big panic attack. I recommend keeping a few hundred dollars aside for these situations.</p><p>In Laos, I experienced the unluckiest 48 hours of my life: it involved eating a cockroach, staying in the dirtiest accommodation I&#8217;ve seen, watching a woman die from malaria, sitting next to the woman and her grieving husband for several hours, getting locked inside the next guesthouse I stayed in, having another cockroach run over my face as I slept, and being sexually assaulted by a backpacker.</p><p>I was on the verge of flying home, but instead I decided to blow a week&#8217;s worth of travel costs on a night of recovery. I booked myself into the highest-rated hotel in the city, I spent a day inside catching up on sleep and watching movies, I treated myself to an expensive meal, and I got a manicure and pedicure. Taking time for myself helped reduce my anxiety and regain my confidence so that I felt able to travel again.</p><p>It&#8217;s unlikely you&#8217;ll ever be as unlucky as me on the road, but if you ever experience something stressful and traumatizing, <a href=\"https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\">book yourself into a fancy hotel room</a>, treat yourself to room service, and have a long, hot bath to relax. Take time out of your schedule to make yourself feel good.</p><p>The trick is to not allow yourself to do this for too long. Once I get into the habit of staying inside, it can be tough to pull myself back out of my hole and start exploring again. In cases of burnout, exhaustion, or bouts of anxiety, I recommend spending three days inside to recover and then doing something intimidating on the fourth day. (<strong>Note</strong>: Your mileage may vary, pick the time that works for you.)</p><p><img src=\"https://media.nomadicmatt.com/anxiety01.jpg\" alt=\"Backpacker sitting in the sand dunes of the Sahara Desert\"></p><p><strong>Remember bad luck can often be good luck &#8211; </strong> Whenever I&#8217;ve had to deal with bad luck while traveling, I&#8217;ve felt disheartened and even considered returning home. What helped to keep me on the road was changing the way I viewed these unpleasant experiences.</p><p>Anxiety leads to irrational thoughts and will forever have you worrying about the worst-case scenario. Sometimes that scenario will actually happen &#8212; and you&#8217;ll survive it. You&#8217;ll realize you&#8217;re far stronger than you thought you were, that the things you were most anxious about are never actually as bad as you expected, and that you&#8217;re well equipped to deal with things going wrong.</p><p><img src=\"https://media.nomadicmatt.com/anxiety07.jpg\" alt=\"Female traveler swimming in the clear water in the Maldives\"></p><p><strong>Leave your comfort zone &#8211;</strong> Repeated exposure to your fears is <a href=\"https://www.psychologytoday.com/blog/insight-therapy/201009/overcoming-fear-the-only-way-out-is-through\">more successful at treating anxiety than avoidance</a>, and the best way to conquer anxiety is by <a href=\"http://lifehacker.com/5973996/baby-steps-the-best-way-to-overcome-your-greatest-fears\">doing one thing a day that scares you</a>. Travel is great for this!</p><p>Whether it&#8217;s figuring out the public transport in an unfamiliar city or accepting an invitation to hang out with a local, try stepping out of your comfort zone and doing something new every day.</p><p>But what if everything is new and frightening? Google it! I had never been on a bus before I went abroad, so I spent half an hour researching how they worked and what you were supposed to say when you stepped onboard. It helped lessen my anxiety and made me feel more capable.</p><p>Calming exercises and simple tricks are also great for helping you gain the confidence to step outside your comfort zone. Try breathing in for five seconds and out for seven seconds. Or place an elastic band around your wrist and snap it against your skin to keep you distracted. If I&#8217;m particularly intimidated by a new experience, the combination of those two things helps me take that step into the unknown.<br> <img src=\"https://media.nomadicmatt.com/anxiety06.jpg\" alt=\"Solo girl traveler hikes to the top of a mountain in Mexico\"></p><p><strong>Avoid your triggers &#8211; </strong>Alcohol always makes my anxiety worse, so I tend to avoid it when I travel. Before you leave, come up with a list of everything that triggers your anxiety and try to minimize your exposure to it on the road. Not many people consider teetotaling when they travel, but if it prevents you from having a panic attack, it&#8217;s well worth it.</p><p><strong>Don&#8217;t compare your experiences &#8211; </strong>It&#8217;s easy to beat yourself up when you look at your friends&#8217; travel experiences or read a travel blog full of beautiful photos and glowing trip reports. It <a href=\"http://www.nytimes.com/2011/04/10/business/10ping.html?src=recg&amp;_r=0\">can increase feelings of inadequacy</a> and make you feel as if you&#8217;re the only person who&#8217;s suffering. If all you ever see is people having the most incredible time of their life, it can leave you feel like you&#8217;re doing something wrong or not making the most of the opportunity you&#8217;ve been given. Don&#8217;t let these feelings lead to more anxiety.</p><p>Remind yourself that <a href=\"https://www.nomadicmatt.com/travel-blogs/pretentious-travelers-fill-hate/\">everyone curates</a>, so you often won&#8217;t see the bad side of their travels. Don&#8217;t compare yourself to anyone else, because you never know who&#8217;s battling with anxiety behind the scenes.</p><h3>Turning my anxiety into a positive</h3><p><img src=\"https://media.nomadicmatt.com/anxiety10.jpg\" alt=\"Solo girl traveler in a sand storm in New Zealand\"><br> Writing about <a href=\"http://www.neverendingfootsteps.com/2014/01/17/on-anxiety-and-travel/\">my anxiety on my travel blog</a> was the best thing I ever did. Until that point, I&#8217;d hidden it from my writing, because no other bloggers were discussing mental health issues in public. I was afraid that people would judge me if I wrote about the panic attacks I&#8217;d had around the world &#8212; almost as if it was a sign that I was a bad traveler or I wasn&#8217;t making the most of my opportunities.</p><p>Instead, the opposite happened. People related to my article and shared with me their personal stories of traveling with anxiety. I&#8217;ve received hundreds of emails from those who have an anxiety disorder but decided to travel the world anyway (and succeeded!), and I&#8217;ve received hundreds more from people who dream of traveling but are too nervous to take the plunge.</p><p>My story of how my travel misadventures helped me overcome anxiety even caught the attention of a major publisher. My book, <a href=\"http://www.neverendingfootsteps.com/how-not-to-travel-the-world/\">How Not to Travel the World</a>, is about getting out of your comfort zone no matter how many panic attacks life throws at you. It&#8217;s about dealing with unfavorable situations, learning to push yourself out of your comfort zone, and falling in love with life on the road.<strong>&#160;</strong></p><p>**********</p><p>Five years ago, I sat home and tentatively <a href=\"https://www.nomadicmatt.com/getting-started-new/\">planned out an itinerary for my dream trip around the world</a>. I didn&#8217;t ever really think I&#8217;d be able to work up the courage to leave. Today, I&#8217;m in an apartment in Madrid, four years into my travels, with 60 stamps in my passport. I&#8217;ve had a total of two anxiety attacks in the past 12 months.</p><p>Travel has been the one thing that helped me conquer my anxiety more than anything else. Sometimes it downright terrifies me, but it also challenges me by forcing me to leave my comfort zone and comforts me by giving me the freedom to do whatever I want whenever I want. The combination of all three has done wonders for my mental health. I&#8217;ve reached the point where I struggle to even think of something that would take me out of my comfort zone, and I&#8217;ve proven that it&#8217;s possible to travel the world with a debilitating anxiety disorder.</p><p>Lauren Juliff runs the website <a href=\"http://www.neverendingfootsteps.com/\">Never Ending Footsteps</a> and is author of the recent book <strong><a href=\"http://amzn.to/1DVEuUn\">How Not To Travel the World: Adventures of a Disaster Prone Backpacker</a></strong>. I finished it earlier this week and would definitely recommend it as good summer read. But I&#8217;m probably biased since Lauren is my friend so I&#8217;ll add that I gave the book to a girl on my Morocco tour and she hasn&#8217;t put it down. She loves it and now she&#8217;s talking about a solo trip of her own! I think that&#8217;s a big vote of confidence! Right now, the book is only available in bookstores in the UK but <a href=\"http://amzn.to/1DVEuUn\">you can order it from Amazon and get it shipped to you anywhere in the world or download it on Kindle</a>! </p><h3>Conquering Mountains: The Guide to Solo Female Travel</h3><p><a href=\"https://www.nomadicmatt.com/the-guide-to-fearless-solo-female-travel/\"><img class=\"\" src=\"https://media.nomadicmatt.com/siteimages/NM_Conquering_Mountains.jpg\" alt=\"conquering mountains: solo female travel by kristin addis\" width=\"220\" height=\"284\"></a>For a complete A to Z guide on solo female travel, check out Kristin&#8217;s new book, Conquering Mountains. Besides discussing many of the practical tips of preparing and planning your trip, the book addresses the fears, safety, and emotional concerns women have about traveling alone. It features over twenty interviews with other female travel writers and travelers. <a href=\"https://www.nomadicmatt.com/the-guide-to-fearless-solo-female-travel/\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"How NOT to Let Anxiety Stop You From Traveling"}},"pageContext":{"id":"5b95eb0d87be05832748fff2"}}