{"data":{"mongodbDatabaseArticles":{"id":"5b921d1987be0571ac1b04f5","content":"<div><p></p><img class=\"wp-image-23370 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/05/Home-House-Real-Estate.jpg\" alt=\"countries-with-no-property-taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Last update: October 20, 2017</p>\n<p>Dateline: Belgrade, Serbia</p>\n<p>We frequently discuss the idea that governments thrive on <a href=\"http://nomadcapitalist.com/2014/10/25/who-creates-jobs-worlds-rich-radio-show-58/\">taxing the &#8220;evil rich&#8221;</a>. It&#8217;s no secret. </p>\n<p><a href=\"http://nomadcapitalist.com/2016/07/20/ways-to-live-digital-nomad/\">Nomadic entrepreneurs</a> are engaged in a different business: looking out beyond their own borders to find countries that offer something better.&#160;Where can I pay <a href=\"http://nomadcapitalist.com/tax-reduction/\">less tax legally</a>? What countries are welcoming to people who want to internationalize and establish a home without paying high tax on their property?</p>\n<p>We also discuss the idea that history repeats itself, and why that is cause for diversifying your talents and your assets around the world. Governments have taken the same attitude toward taxes, including property taxes, almost since the beginning of time. </p>\n<p>Their attitude: the <a href=\"http://nomadcapitalist.com/2017/08/07/countries-with-the-highest-tax/\">higher the taxes</a>, the better.</p>\n<h2>Brief history of countries with property taxes</h2>\n<p>As far back as Egypt, Babylon and Persia, countries have used property taxes to collect money from the well-off. Since the vast majority of the population was poor, governments were able to demand money from the wealthiest landowners based on the productivity of their land.</p>\n<p>Had a great harvest? The local tax collector would happily take his piece of the action. And since tax assessors and tax collectors were one in the same, landowners had little choice but to hand over part of their well-earned bounty to the tax authorities.</p>\n<p>In ancient Egypt, for example, taxes were levied against a land&#8217;s production of grain, as well as cattle output and oil. While very few members of the population were literate, some of those who were, took up jobs as scribes and devised one of the earliest tricks known to government: keep records of who owned what property for the express purpose of taxing it.</p>\n<p>In exchange for scribes serving as assistants in tax collection, their efforts were often rewarded by being allowed to live whenever the king or pharaoh died. So valued were their efforts that they were the only members of the royal court not buried with the pharaoh. That&#8217;s how much the government wanted to skim cash from property owners.</p>\n<p>Today, of course, the situation is much the same; only with &#8220;more sophisticated&#8221; methods.</p>\n<h2>What is a property tax?</h2>\n<p>Property taxes are a reality of life for almost every property owner in the world.</p>\n<p>As Investopedia <a href=\"http://www.investopedia.com/terms/p/propertytax.asp\">defines</a> it- A&#160;tax&#160;assessed on real estate by the local government. The&#160;tax&#160;is usually based on the value of the property&#160;(including the land) you own.</p>\n<p>In the Land of the Free, some homeowners pay five-figure sums every year to live in modest homes in places like New York and Southern California.</p>\n<p>Heck, people in New York are paying tens of thousands of dollars each year just to live in their own homes. If insane real estate prices and <a href=\"https://www.numbeo.com/cost-of-living/in/New-York\">cost of living</a> wasn&#8217;t enough, the government comes in to take more of your cash simply from owning property. </p>\n<p>Going as far back as ancient Egypt, these mandatory tithes to the government are proof that you don&#8217;t really OWN your home or land. Rather, you are indebted to the government for the use of that land and, consequently, must pay.</p>\n<p>Unlike many private sector services, you can&#8217;t simply buy a &#8220;lifetime membership&#8221; for annual multiple and call it a day. You must pay property taxes by the due date each and every year &#8212; and not a moment too soon.</p>\n<p>Such is the government&#8217;s commitment to maintaining power that a business owner and friend of mine has been prohibited from paying the property taxes on his businesses&#8217; land holdings even one day in advance.</p>\n<p>If you own property in the western world, not only have you taken a long position on your government&#8217;s <a href=\"http://nomadcapitalist.com/2013/06/20/fiat-currency-is-the-bad-dog-food-big-government-forces-us-to-eat/\">declining currency</a>, but you have also signed up for a lifetime of indentured servitude.</p>\n<p>For all of your government&#8217;s efforts to promote homeownership over renting, the reality is that property owners are the biggest renters of all. However, internationalization tells us that we can <a href=\"http://nomadcapitalist.com/five-magic-words/\">&#8220;go where we&#8217;re treated best&#8221;</a> when it comes to almost anything. The same is true when it comes to owning a property. </p>\n<p>You may know that I actively <a href=\"http://nomadcapitalist.com/2014/04/01/five-reasons-buy-us-real-estate/\">discourage people</a> from buying real estate in the United States. In addition to all of the other reasons, high property taxes are one of the contributing concerns.</p>\n<p>Sure, you could go from one bankrupt state <a href=\"http://nomadcapitalist.com/2014/01/30/free-state-united-states-matter/\">to the next</a>, but that&#8217;s no better than catching a falling knife. When North Dakota &#8212; allegedly one of the most free states in the USA &#8212; <a href=\"http://money.cnn.com/2012/06/13/pf/north-dakota-property-tax/\">voted overwhelmingly NOT</a> to do away with the state&#8217;s property tax a few years ago, you learned everything you need to know about Americans&#8217; opinions on property taxes.</p>\n<p>Seventy-six percent of them voted &#8220;no&#8221;, actually, even as the state&#8217;s coffers are overflowing with revenue from oil activity going on there.</p>\n<p>Looking for states with no property tax is a common reaction for many Americans and others when the smart reaction would be to think more in terms of countries with no property tax. That&#8217;s why owning real estate in faster growing safe haven jurisdictions not only offers better yield and appreciation potential, but also the potential for significantly lower property taxes&#8230; or none at all.</p>\n<p>Not only is foreign real estate owned in your own name, a <a href=\"http://nomadcapitalist.com/2013/10/16/the-two-non-reportable-offshore-assets-you-should-consider/\">non-reportable asset</a> for US persons, it also offers many other benefits, so long as you can keep carrying costs low.</p>\n<p>&#160;</p>\n<h2><b>List of Countries with No Property Tax</b></h2>\n<p>Yes, there actually ARE countries with no property taxes. If you were to tell that to a US politician, they might tell you that if that happened here, the schools would all shut down and people wouldn&#8217;t be able to get an education. </p>\n<p>To them, the $28,000 a year in Washington, DC or $21,000 a year in New York isn&#8217;t enough to offer education. This is the crux with owning real estate in a country that charges you for doing so: The money taken from you is never enough.</p>\n<p>Moreover, since they know they can depend on your money through property taxes, politicians often have less incentive to find more reasonable ways to pay for schools, roads, and other public works. </p>\n<p>Many countries &#8212; specifically those that are engaged in expanding their economy and gaining more attention on the international stage &#8212; are realizing that in order to grow, they need to create an environment that is attractive to investors and property owners.</p>\n<p> And at Nomad Capitalist, we are all about finding the best.</p>\n<p>So, here is a list of countries with no property taxes where you can actually own your home.</p>\n<h2>EUROPE</h2>\n<h3><b>Monaco</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-22697 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/09/Monaco-residency-and-citizenship.jpg\" alt=\"monaco-residency-citizneship-countries-with-no-property-taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Europe&#8217;s smallest non-theocratic micro-state, Monaco, has no property taxes. However, like nearby Liechtenstein, be ready to pay. Monaco&#8217;s glistening shoreline and luxurious homes are a major goal of many high-achieving entrepreneurs, and avoiding property taxes helps make property ownership here even more attractive. </p>\n<p>If you wish to rent out your Monaco property, there is a 1% tax, although it is payable by the tenant. Overall, Monaco maintains its important place among the list of countries with no taxes &#8212; making it a continued favorite playground for the wealthy. </p>\n<p>If you are interested in finding out more about Monaco residency and citizenship, we have published <a href=\"http://nomadcapitalist.com/2017/09/01/ultimate-guide-monaco-residency-citizenship/\">a guide </a>with all the details.</p>\n<h3><b>Malta</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-22936 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/09/Malta-Residency.jpg\" alt=\"malta-residency-global-resident-programme-countries-with-no-property-taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Malta, located off the coast of Italy, is a very popular relocation place for expats around the world. It even ranked in top 10 on our 2017 <a href=\"http://nomadcapitalist.com/nomad-quality-of-life-index/\">Nomad Quality of Life Index</a>.&#160; </p>\n<p>We have recently discussed at Nomad Capitalist the <a href=\"http://nomadcapitalist.com/2017/09/21/malta-residency/\">Malta Global Resident Programme,</a> designed by the Maltese government to strengthen the property market in this up-and-coming island country and EU member state. Malta offers the benefits of a European lifestyle while offering powerful incentives for property owners and investors, including non-existent property tax. Malta does, however, assess a stamp fee in lieu of property tax. Malta is gaining the attention of many entrepreneurs who see EU residency and potential of <a href=\"http://nomadcapitalist.com/2015/02/10/citizenship-malta-freedom-price-tag/\">economic citizenship</a> as a key part of their internationalization plan. </p>\n<p>Outside of Europe, there are a few interesting countries with no property tax. Not surprisingly, several of these are tropical island nations that would be of interest to foreigners escaping the daily grind.</p>\n<h2>OCEANIA</h2>\n<h3><b>Fiji&#160;</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-7441\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/05/fiji-countries-with-no-property-taxes-e1401538364220.jpg\" alt=\"Fiji and countries with no property taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Fiji does not assess property tax on freehold land. Less than ten percent of all of Fiji is freehold land, much of it set aside by the British to entice farmers to come and create agricultural goods years ago, but some suggest Fiji real estate is one of the best investments in the region. One of my VC friends loves the place.</p>\n<p>Owning land in Fiji is a relatively straightforward way to get <a href=\"http://nomadcapitalist.com/2014/03/09/top-5-best-second-residency-programs-central-south-america/\">permanent residency</a> there. Fiji also has a <a href=\"http://nomadcapitalist.com/2013/05/10/tax-freedom-starts-with-a-territorial-tax-system/\">territorial tax system</a> that allows residents to pay no tax on income earned outside of Fiji, such as through an <a href=\"http://nomadcapitalist.com/offshore-company/\">offshore company</a>. Fiji is a favorite real estate investment by many as it boast competitive rates relative to the Pacific and is a major tourist destination.</p>\n<h3><b>Cook Islands</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"size-full wp-image-14174\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/01/cookislands-1.jpg\" alt=\"\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>In addition to no wealth taxes or <a href=\"http://nomadcapitalist.com/2014/04/06/top-5-expat-friendly-countries-with-no-capital-gains-taxes/\">capital gains taxes</a>, the Cook Islands in the South Pacific doesn&#8217;t assess property taxes. This island chain, in free association with New Zealand, has recently gained attention for <a href=\"https://www.nytimes.com/2013/12/15/business/international/paradise-of-untouchable-assets.html\">its asset-protection trusts</a> and favorable no-property-tax policies. However, land cannot be easily owned by foreigners in freehold form and instead the government requires leases for non-Cook Islanders that max out at 60 years. This semi-sovereign island chain may become more important for real estate but for now may present some challenges for foreign investors, in spite of its Pacific paradise draw. </p>\n<h2>CARIBBEAN REGION</h2>\n<h3><b>Cayman Islands</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-5866\" src=\"http://nomadcapitalist.com/wp-content/uploads/2013/05/cayman-islands-no-income-tax.jpg\" alt=\"Cayman Islands has no income tax no property tax\" width=\"701\" height=\"467\"><p>The Cayman Islands once again makes the list as a longstanding name in the offshore world: No property taxes, no personal income taxes, no capital gains taxes, no corporate taxes, no payroll taxes and no withholding taxes on domestic of foreign entities. In other words, the Cayman Islands is very friendly to nomadic investors who want to get a piece of this Caribbean property market. </p>\n<p>Property prices seem to be rising especially along the main areas of Seven Mile Beach, in light of recent luxury developments and increased demand. The islands are among the most developed in the Caribbean and boast excellent beaches and good business infrastructure, although cost of living can be higher in this region. </p>\n<h3><b>Dominica</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-23367 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/05/2.-Dominica.jpg\" alt=\"countries-with-no-property-taxes-dominica\" width=\"700\" height=\"467\"><p>Dominica has no property taxes and is a major contender in the <a href=\"http://nomadcapitalist.com/second-passport/dominica/\">second citizenship</a> world, offering one of the most cost-effective <a href=\"http://nomadcapitalist.com/2016/10/16/dominican-citizenship-investment/\">citizenship by investment programs</a>. </p>\n<p>This Caribbean island nation is known as the &#8216;nature island&#8217; and is English-speaking, having obtained independence from the United Kingdom in 1978. One thing to note is that municipal taxes are levied on properties in Roseau and Canefield urban areas, but otherwise, there are no traditional property taxes associated with most nations. </p>\n<h3><b>Turks &amp; Caicos</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-5666\" src=\"http://nomadcapitalist.com/wp-content/uploads/2013/02/turks-and-caicos.jpg\" alt=\"Turks and Caicos\" width=\"700\" height=\"466\"><p>&#160;</p>\n<p>There is no property tax in the Turks &amp; Caicos, but there is an annual stamp duty which is on a progressive scale. </p>\n<p>The Turks &amp; Caicos, a British Overseas Territory, is also on our list of <a href=\"http://nomadcapitalist.com/2015/09/07/tax-free-countries-second-residency/\">18 tax-free countries where you can get second residency</a> and is generally worthwhile for our readers to look into not only from a financial incentive standpoint but for the excellent lifestyle and quality of destination (especially beaches!) it offers.</p>\n<p> The luxury real estate market is generally booming here and many of our readers may be interested in what owning property here could offer to diversify their residence or investment choices.</p>\n<h2>AFRICA</h2>\n<h3><b>Seychelles</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"size-full wp-image-15654\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/03/Seychelles-Africa-offers-economic-citizenship.jpg\" alt=\"Seychelles, Africa offers economic citizenship, countries with no property taxes.\" width=\"700\" height=\"467\"><p>The Seychelles has no property taxes, but requires almost 7% of a property&#8217;s value to be paid in various stamp taxes and notarial fees at sale. It also requires foreigners to deposit monies in advance before buying property. Plus, foreigners may have to get government permissions. (Their banks <a href=\"http://www.seychellesnewsagency.com/articles/1634/BMI+Offshore+bank+open+but+unable+to+process+foreign+transactions+as+overseas+agent+bank+cuts+ties\">aren&#8217;t so good</a>, either). </p>\n<p>Seychelles is one of my favorite jurisdictions for setting up a non-transactional offshore company, but I can think of a lot of places I&#8217;d rather own real estate. However, this highly-developed African island nation might be part of your plan if you enjoy the lifestyle and want to avoid property tax. Optimizing what each country can offer you is what comprises the very idea behind <a href=\"http://nomadcapitalist.com/flag-theory/\">planting flags</a>.</p>\n<h2>ASIA &amp; MIDDLE EAST</h2>\n<h3><b>Sri Lanka</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"wp-image-23368 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2014/05/Sri-Lanka.jpg\" alt=\"countries-with-no-propety-taxes-sri-lanka\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Sri Lanka has no property taxes and rental income earned by non-residents is taxed at 20%. </p>\n<p>This nation, located below India in the Indian Ocean, is more and more of interest to many entrepreneurs and nomads because of its growing tourism industry and potential towards more pro-business policies. </p>\n<p>The economy has had steady growth rates in recent years and is home to major industries such as precious metals, agriculture, IT, and textiles. Capital gains tax was abolished in Sri Lanka over a decade ago and rental income is taxed at a flat rate. &#160;</p>\n<p>&#160;</p>\n<h3><b>United Arab Emirates</b></h3>\n<p>&#160;</p>\n<p></p><img class=\"size-full wp-image-22900\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/09/dubai.jpg\" alt=\"dubai-countries-with-no-propety-taxes\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>The Middle East is also becoming known as a zero tax region, with many countries there touting <a href=\"http://nomadcapitalist.com/2013/11/24/top-5-livable-countries-income-tax/\">no income taxes</a>. Dubai, number 2 on our<a href=\"http://www.nomadcapitalist.com/nomad-quality-of-life-index/\"> QOL Index List for 2017</a> is a place where you can have a home base and an actual home.</p>\n<p>Dubai is a &#8220;country&#8221; with no property tax, although it also assesses a one-time fee upon purchase of the property. </p>\n<p>The UAE is home to some of the most innovative and impressive (the world&#8217;s tallest building, largest mall, etc.) real estate projects and is also arguably the most welcoming part of the Middle East to international investment and tax-free incentives. </p>\n<h3><b>Gulf Countries: Bahrain, Kuwait, Oman, Saudi Arabia &#160;</b></h3>\n<p>Other Middle Eastern countries like Bahrain, Kuwait, Oman, and Saudi Arabia are all property tax-free, as well. While many Westerners might not be paying as much attention to opportunities in this region, the extremely capitalist-friendly (and in some cases nonexistent) tax codes regarding property are appealing.</p>\n<p><br>\nThe region can create challenges for some foreigners regarding permissions or cultural adjustment in the case of residential property. Kuwait, for example, does not allow for foreign ownership except by other GCC countries, and Saudi Arabia restricts non-Muslisms from ownership in the holy cities of Medina and Mecca. Regardless, no property tax is a huge benefit for those looking to reduce their government burden. </p>\n<h2><b>Conclusion </b></h2>\n<p>There are relatively few countries that truly have no property tax. Many have merely allowed property owners to pay a front-loaded sum in the form of a stamp tax or other fee that eliminates the need for never ending taxation.</p>\n<p>Given the choice between two evils, I&#8217;d rather pay a front-end fee and be able to limit my costs going forward. I also have to wonder if the presence of a significant stamp tax depresses prices slightly, as buyers must have more liquid cash upfront.</p>\n<p>I suspect many Westerners, used to putting 1.2% down when buying real estate, would scoff at the idea of investing overseas for that reason. If you&#8217;re buying property for your own enjoyment or for yield, I imagine there may be some tiny benefit from such upfront taxes.</p>\n<p>At least in countries with no property taxes on an annual basis, you can actually keep more of your own money in your pocket each and every year. That&#8217;s something most governments don&#8217;t want you to do.</p>\n<p>If you&#8217;re interested in high-yield and high appreciation real estate opportunities, you can <a href=\"http://nomadcapitalist.com/shop/nomad-strategy-call\">apply for help&#160;</a>so we can determine your best options as part of a personalized and completely legal offshore plan.</p>\n<p>&#160;</p>\n</div>","title":"Countries with no property taxes where you REALLY own your home"}},"pageContext":{"id":"5b921d1987be0571ac1b04f5"}}