{"data":{"mongodbDatabaseArticles":{"id":"5b93833887be056953db7e3d","content":"<div><h1 name=\"b86f\" id=\"b86f\" class=\"graf graf--h3 graf-after--figure graf--title\">You&#8217;re remote to&#160;me</h1><p name=\"f434\" id=\"f434\" class=\"graf graf--p graf-after--h3\">Working with remote teams isn&#8217;t easy, but it&#8217;s inevitable with any growing organization. I&#8217;ve worked remotely in 3 different organizations&#8202;&#8212;&#8202;opening <a href=\"http://www.ericsson.com/thecompany/company_facts/businesses/acquisitions/sentilla\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">my startup&#8217;s</a> offices in London and Singapore, as <a href=\"https://18f.gsa.gov/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">18F</a>&#8217;s first employee in the San Francisco office, and from <a href=\"https://medium.com/@eejackson/i-asked-if-i-could-visit-medium-s-nyc-office-they-said-uh-ok-25ab9579a450#.x2kskx8nf\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">Medium&#8217;s New York City office</a>. Despite being completely different organizations, none cracked the nut on remote teams.</p><p name=\"fe48\" id=\"fe48\" class=\"graf graf--p graf-after--p\">I scratched my head. Why is the experience of the remote worker always so horrendous? Then it dawned on me. We&#8217;re thinking of remote work the wrong way. Even the term &#8220;remote&#8221; stigmatizes people not physically next to you. What is their perspective? How do I feel when working remotely? Then I realized&#8230;</p><blockquote name=\"ec91\" id=\"ec91\" class=\"graf graf--pullquote graf-after--p\">They&#8217;re remote to&#160;me.</blockquote><p name=\"b611\" id=\"b611\" class=\"graf graf--p graf-after--pullquote\">Let&#8217;s say you&#8217;re sitting at headquarters in San Francisco, on a video call with someone in New York. Realize that, from the perspective of the other person, <strong class=\"markup--strong markup--p-strong\">you&#8217;re remote!</strong> When you internalize this observation, your perspective changes. You start asking if Jacob in New York has anything to add. Or mention that Josie in Singapore has a great idea we should consider, and yield the floor.</p><p name=\"9ec8\" id=\"9ec8\" class=\"graf graf--p graf-after--p\">When working with remote teams, here&#8217;s a few things I&#8217;ve learned that I hope help you too.</p><p name=\"a609\" id=\"a609\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Make it easy for remote teams to join.</strong> You know where your colleagues work and when they&#8217;re at work. I&#8217;m sure their calendar tells you when they&#8217;re busy or OOO. Add a remote dial in, a Google hangout, or whatever your team uses. If they decline, you can carry out the meeting as usual. <a href=\"https://support.google.com/a/answer/4362302?hl=en\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Turn Google Hangouts on for your organization by default</a> (many admins have disabled this feature, sadly).</p><p name=\"9ec2\" id=\"9ec2\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Remote connections have a delay.</strong> It is amazing how many people don&#8217;t realize this. From our NY to SF office there can be a 3 to 5 second delay. Whenever you start to talk, you end up talking over a conversation that started 5 seconds ago. Pause. Prompt them. Most importantly, wait. Embrace the awkward silence. Go around the virtual room. If you think it is hard to get a word in at a meeting, imagine the frustration of those not physically in the room.</p><p name=\"e0c2\" id=\"e0c2\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Remote technology is annoying. </strong>Obviously, being remote isn&#8217;t as good as being there in person. You&#8217;re annoyed that the audio or video keeps cutting out on that person? Guess what? It&#8217;s doing the same for the other person. Be flexible. Pick up your cell phone and call them. Be patient. These are your teammates. Gain empathy for your teammates&#8202;&#8212;&#8202;conduct all your meetings as if they were remote. You may not notice how important the small things are until you try it yourself.</p><p name=\"bb8f\" id=\"bb8f\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Test it out.</strong> Part of your organization&#8217;s on-boarding should be figuring out your remote tools. We all hate fumbling through tools, switching, and losing time. But again, be patient and switch quickly. Stop fussing with a broken system.</p><p name=\"11b6\" id=\"11b6\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Slack is not a substitute. </strong>Have you ever tried to catch up on thousands of messages in #general because you went home for the day at your normal time (or God forbid, went on vacation)? Slack is not a replacement for properly communicating. Don&#8217;t expect anyone has read what you wrote on Slack unless you DM&#8217;d them.</p><p name=\"8a00\" id=\"8a00\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Be on time. </strong>There&#8217;s nothing more frustrating than staring at an empty room or an unanswered hangout.</p><p name=\"5484\" id=\"5484\" class=\"graf graf--p graf-after--p graf--trailing\">And most importantly, if it wasn&#8217;t clear already, <strong class=\"markup--strong markup--p-strong\">be patient and be respectful. </strong>You&#8217;re just as remote to the other person as they are to you.</p></div>","title":"You’re remote to me – Joe Polastre – Medium"}},"pageContext":{"id":"5b93833887be056953db7e3d"}}