{"data":{"mongodbDatabaseArticles":{"id":"5b95ef1b87be058327490109","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Cost of Living in Thailand 2015</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/cost-living-thailand-2015/\"><img class=\"aligncenter size-full wp-image-14957\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Cost-of-Living-in-Thailand.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Cost of Living in Thailand\" width=\"1000\" height=\"550\"></a></p>\n<p>What&#8217;s the cost of living in Thailand? It&#8217;s been way too long since we&#8217;ve done any sort of budget report&#160;so we put together a huge post&#160;that covers what the two of us spent during the entire year in 2015. It includes our day-to-day spending on food and general living expenses, but we also divulge how much we spend on expat-related responsibilities, on our well-being, and on travel. Here goes!</p>\n<p><strong>Here&#8217;s a quick recap of&#160;our routine as expats:</strong></p>\n<p>We&#8217;re a married American couple living&#160;in Chiang Mai, a major city in Northern Thailand. We have a small house not far from the city center, which we share with our cat that we brought from the USA.</p>\n<p>We spend several hours most days doing blog-related tasks. We go out in the evenings&#160;about once a week with friends for drinks and eat at Western Restaurants two or three meals per&#160;week.</p>\n<p>In our spare time we go to the gym regularly and for half the year we took Thai lessons two times per week.</p>\n<p>We also spent about a third of the year traveling throughout Thailand and to several of its neighboring countries in Southeast Asia.</p>\n<h2><p id=\"Cost_of_Living_in_ThailandnbspBreakdown_2015nbsp\"><p>Cost of Living in Thailand&#160;Breakdown 2015&#160;</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-14951\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Thailand-Expenses-2015-General-4.png?resize=1000%2C500&amp;ssl=1\" alt=\"Cost of Living in Thailand 2015 General\" width=\"1000\" height=\"500\"></p>\n<p>We spent an average of 100,338&#160;baht <strong>(2,826 USD)&#160;per month in 2015. </strong>That&#8217;s a&#160;total of 1,204,052 baht (33,917 USD) for the entire year.</p>\n<p><strong>Our cheapest months were January (51,451 baht or 1,449 USD) and April&#160;(49,326 baht&#160;or 1,389 USD)</strong>. That&#8217;s no surprise to us because those were the two months we didn&#8217;t do any traveling. Instead we stayed in Chiang Mai and spent time with friends at our favorite hangout spots, regularly cooked at home, and went to the gym several times per week.</p>\n<p><strong>Our most expensive month was July. That&#8217;s when&#160;we flew halfway across the world</strong> and spent four&#160;weeks in the US. Talk about prriiicceeeyy! December was&#160;our&#160;second most expensive month because&#160;we spent two weeks island hopping around Koh Samui, Koh Phi Phi, Koh Lanta, and Phuket. We figured out pretty quickly that traveling in southern Thailand is much more expensive than traveling up north!</p>\n<p><img class=\"aligncenter wp-image-14947\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Thailand-Expenses-2015-Specific-3.png?resize=1000%2C500&amp;ssl=1\" alt=\"Cost of Living in Thailand Breakdown 2015 Specific\" width=\"1000\" height=\"500\"></p>\n<h3><p id=\"Monthly_Rent\"><p>Monthly Rent</p></p></h3>\n<p><strong>Total Cost: 14,000 baht / 394 USD per month</strong></p>\n<p>We still live in the same&#160;<a title=\"Our house in Chiang Mai\" href=\"https://www.tielandtothailand.com/new-house-chiang-mai/\">two bedroom house</a> just outside Chiang Mai&#8217;s Old City. It is our second biggest contributor to our cost of living in Thailand but worth every penny. We can&#8217;t ask for anything better and love its location, structural integrity, Western furnishings and amenities, and layout.</p>\n<p>Even though there are plenty of two bedroom homes in Chiang Mai at half the price we pay,&#160;they simply don&#8217;t offer the same quality and comfort level at such a great spot near&#160;the Old City. We are very happy with the place and it really feels like a home to us. Cable TV and high speed internet (21 mbps download) is included in the cost of our rent.</p>\n<h3><p id=\"Utilities_Motorbike_and_Monthly_Bills_nbspSubscriptions\"><p>Utilities: Motorbike and Monthly Bills &amp;&#160;</p><p>Subscriptions</p></p></h3>\n<p><strong>Total Cost: 5,151&#160;baht / 145 USD per month</strong></p>\n<p><img class=\"aligncenter size-full wp-image-14955\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Electric-Bills-2.png?resize=1000%2C550&amp;ssl=1\" alt=\"Cost of Electric Bills in Chiang Mai 2015\" width=\"1000\" height=\"550\"></p>\n<p>Just as our electric bill fluctuated with the seasons back in the USA, our electric bill in Chiang Mai does, too. <strong>We run the&#160;air conditioning &#160;pretty steadily during the hottest months</strong>, but we admit our bill is unusually expensive because our house gets the most direct sunlight during June, July, and August. It&#8217;s hard not to blast the AC during the day because otherwise our house&#160;gets over 90&#8304;F (low 30s &#8304;C) inside. No joke!</p>\n<p>Other than that we pay roughly the same every month for our water (home use and drinking) and two cellphone bills. Our gas tank, which we use solely to cook on our two gas burners, has been replaced three times.</p>\n<p>We also have a <a class=\"thirstylink\" title=\"VPN\" href=\"https://www.tielandtothailand.com/recommends/pure-vpn/\" target='_blank\"' rel=\"nofollow\">VPN</a> subscription to get access to our Pandora and Netflix accounts; all three are monthly subscriptions.</p>\n<p>We have a&#160;<a title=\"300cc Honda Forza\" href=\"https://www.tielandtothailand.com/a-big-white-monster-forza/\">Honda Forza</a> and use it to get around Chiang Mai and to go on&#160;short road trips. Other than gas and an oil change, it costs us barely anything (1,410 baht or 40 USD per month) to maintain.</p>\n<p>We put new plastics on the Forza&#160;this year after we had an incident where a Thai food cart (on it&#8217;s way to work) ran straight into the back of our parked motorbike causing it to topple over on its side and get scratched up. It was about time to replace those pieces anyways;&#160;sun and rain exposure had dulled out the paint&#160;and it was looking pretty&#160;tired.</p>\n<p>Whenever we use songthaews in the Old City, we pay between 20 and 40 baht per&#160;person per&#160;trip.</p>\n<h3><p id=\"Expat_Expenses\"><p>Expat Expenses</p></p></h3>\n<p><strong>Total Cost: 5,048&#160;baht / 142 USD per month</strong></p>\n<p>Part of our&#160;cost of living in Thailand is&#160;the expense&#160;associated with being an expat. For us this included what we&#8217;ve spent on&#160;getting a Thai license and the required medical exam and <a href=\"https://www.tielandtothailand.com/certificate-residency/\">Thai residence certificate</a>, applying for and maintaining a Thai visa (application fees, supporting documents and professional support, extensions, photos), as well as unexpected costs&#160;like getting extra pages added to our passports.</p>\n<p>A small portion of our expat expense goes to&#160;Thai language lessons. We consider it appropriate to include here because&#160;we wouldn&#8217;t be taking them&#160;if we weren&#8217;t living in Thailand.</p>\n<h3><p id=\"Household_and_Gifts\">Household and Gifts</p></h3>\n<p><strong>Total Cost: 1,575&#160;baht / 44 USD per month</strong></p>\n<p><strong>We&#8217;re completely settled in our house in Chiang Mai and live a&#160;relatively&#160;minimalist lifestyle.</strong>&#160;We&#8217;re happy without a lot of extra stuff like fancy cooking appliances, second or third&#160;vehicles, or the latest home accessories. We also can&#8217;t be bothered with going through the process of&#160;<a href=\"https://www.tielandtothailand.com/cash-in-on-craigslist/\">selling our belongings</a>&#160;again&#160;as we did before moving here. It was hard work! Plus we realize that there are several&#160;challenges to&#160;selling secondhand items in Chiang Mai that we didn&#8217;t have to deal with when living in&#160;Northern Virginia.</p>\n<p>Since we bought the basics during&#160;our&#160;first few months in&#160;Thailand like&#160;linens, rugs, cushions, fans, and pillows, now we only spend money on little things such as trash bags, sponges, dish soap, and laundry detergent.</p>\n<p>The only other household expense is our cat. Between food, litter, the occasional new toy and one yearly checkup, he doesn&#8217;t cost us much.</p>\n<p>We also tracked what we spent on gifts to people for birthdays, get-wells, and in appreciation for watching our cat when we are on travel.</p>\n<h3><p id=\"Travel_Vacations_and_BloggingnbspTrips\"><p>Travel: Vacations and Blogging&#160;Trips</p></p></h3>\n<p><strong>Total Cost: 22,251&#160;baht / 627&#160;USD per month</strong></p>\n<p><img class=\"aligncenter size-full wp-image-14944\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Traveling-Expenses-4.png?resize=1000%2C650&amp;ssl=1\" alt=\"Thailand Traveling Expenses 2015\" width=\"1000\" height=\"650\"></p>\n<p>We did a TON of traveling this year! In fact, we totaled it up and we were traveling for 110 out of 365 days. That&#8217;s across five&#160;countries and twenty cities. Most trips were our own personal vacations while some were partnerships with tourism boards, various travel companies, and hotels.</p>\n<p><strong>Transportation costs made up a significant portion of our traveling expenses.</strong> These include domestic and international flights, buses, vans, and&#160;ferries to get to our destination and then whatever public transportation we used to get around town such as the metro, motorbike rentals, and taxis to and from the airport.</p>\n<p>We also&#160;spent money on&#160;hotels, activities, and entertainment once we arrived. And we can&#8217;t forget&#160;the costs associated with non-Thai&#160;visas and&#160;re-entry permits when we traveled internationally.</p>\n<p>Although we didn&#8217;t include them in this list&#160;(they went into the &#8220;consumables&#8221; category below), we spent a significant amount of money on eating out, bottled water, and alcohol&#160;on the days we&#8217;re on travel.</p>\n<h3><p id=\"Consumables_Groceries_Eating_Out_and_Drinking\"><p> Consumables: Groceries, Eating Out, and Drinking </p></p></h3>\n<p><strong>Total Cost: 27,013 baht / 678&#160;USD per month</strong></p>\n<p><img class=\"aligncenter size-full wp-image-14940\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Consumables-1.png?resize=1044%2C477&amp;ssl=1\" alt=\"Cost of Consumables Living in Thailand 2015\" width=\"1044\" height=\"477\"></p>\n<p>Purely out of curiosity, <strong>we divided our consumption&#160;habits into what we spent at cheap Thai markets, pricier&#160;Western grocery stores, going out to eat, and consuming alcoholic beverages.</strong></p>\n<p>Half of our groceries came from a&#160;<a title=\"Thai market shopping tips\" href=\"https://www.tielandtothailand.com/thai-food-market-shopping-tips/\">local open-aired Thai market</a>. We bought fruit, vegetables, condiments, protein, grains,&#160;and the occasional Thai snack. We went&#160;shopping there about three or four times a week and bought just enough to cook&#160;two or three meals.</p>\n<p>The other half of our groceries were <a title=\"Cost of grocery shopping in Chiang Mai\" href=\"https://www.tielandtothailand.com/cost-grocery-shopping-thailand/\">purchased from an international grocery store</a> to help to add variety to our diet. We bought dairy, choice cut protein, high fiber grains, canned and jarred goods, and sauces and oils. We went&#160;shopping there twice a month and stock up.</p>\n<p><strong>When we weren&#8217;t traveling, we cooked our meals at home.&#160;</strong>We made our simple meals from scratch&#160;using a combination of local produce and imported products. We did this because it&#8217;s more affordable than going out to eat but also because we count our macros (protein, carbohydrates, fat) to help us stay in shape.</p>\n<p>We ate&#160;out probably two, maybe three meals per week while in Chiang Mai. Most of the time it was dinner at mid-range Western restaurants, but sometimes we went&#160;to cheap Thai food stalls and mom and pop restaurants, and a handful of times we went to very expensive places.</p>\n<p><strong>When we were traveling, we ate&#160;out every meal and it was often at touristy Thai and Western restaurants.</strong> We don&#8217;t go out of our way to hunt down a lone&#160;food stall if whatever hotel we are staying at has its own restaurant. We&#8217;ve also noticed that&#160;<a href=\"https://www.tielandtothailand.com/chiang-mai-gate-food-stalls/\">Chiang Mai&#8217;s food stall scene</a>&#160;has spoiled us and we rarely stumble upon such a&#160;collection of stalls at&#160;the places we&#8217;ve been&#160;to.</p>\n<p><strong>When we go out, we stuck to the local brews</strong> (Singha and Leo) or Sangsom and soda water simply because they are a fraction of the cost of imported beers and liquor. We didn&#8217;t go out much in Chiang Mai but we do drink most nights while we travel. Occasionally we have a glass or two of wine at home.</p>\n<h3><p id=\"Personal_Care_Medical_Expenses_Grooming_Wardrobe_Healthy_Habits\"><p>Personal Care: Medical Expenses, Grooming, Wardrobe, Healthy Habits</p></p></h3>\n<p><strong>Total Cost: 13,062&#160;baht / 368 USD per month</strong></p>\n<p><img class=\"aligncenter size-full wp-image-14939\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Healthy-Habits-1.png?resize=1000%2C375&amp;ssl=1\" alt=\"Health Expenses Chiang Mai 2015\" width=\"1000\" height=\"375\"></p>\n<p>We went to the doctor a few times for minor ailments and routine checkups, a cosmetologist, a dentist for general teeth cleanings, and spent a little money on first aid items. We didn&#8217;t pay for health insurance and instead self-insure.</p>\n<p><strong>We spent a good amount of money staying healthy</strong> and had a monthly gym membership, dropped in on the occasional yoga class, and bought appropriate workout gear. We also bought health supplements and&#160;got several massages every month.</p>\n<p>Most of the original clothing we brought over from the US is&#160;either worn out or no longer fits right, <strong>so we made several purchases this past year time to replenish our wardrobe.</strong> I can buy my clothes for cheap from Thai markets because I can fit into them. On the other hand, Chris buys clothes and shoes from malls for his 6&#8217;2&#8243; frame at Western prices. We also bought some clothes while we were in the US and brought them back to Thailand with us.</p>\n<p>Other than that, throughout the year we got regular haircuts (about 300 baht a pop for Chris but twice as much for me) and several rounds of highlights (expensive!) for me as well. We&#8217;ve also spent money on favorite makeup and grooming products (shampoo, face wash, toothpaste, floss, deodorant, razors, hand soap, lotion, body powder). Hey, we like to look and smell nice!</p>\n<h3><p id=\"Blog_Expenses_and_Electronics\"><p>Blog Expenses and Electronics</p></p></h3>\n<p><strong>Total Cost: 12,208&#160;baht / 345 USD per month</strong></p>\n<p><strong>Running a blog has its price.</strong> Now that Tieland to Thailand has grown, we invested in bigger and better services that allow&#160;the site to run&#160;more smoothly and look more professional. We upgraded to a more reliable and faster <a class=\"thirstylink\" title=\"hosting platform\" href=\"https://www.tielandtothailand.com/recommends/a2-hosting/\" target=\"_blank\" rel=\"nofollow\">hosting platform</a> and invested in a <a class=\"thirstylink\" title=\"new page theme\" href=\"https://www.tielandtothailand.com/recommends/elegant-themes/\" target=\"_blank\" rel=\"nofollow\">new page theme</a> when we re-launched our blog. We also invested in services that&#160;allowed us to handle our emails and manage our&#160;social media better.</p>\n<p><strong>We&#8217;ve also spent a lot on upgraded electronics this year for the blog.</strong> We bought a new camera with two lenses along with a dozen&#160;extra batteries, some cleaning tools, a small new travel camera case, and a big travel bag to carry all of our gear if needed. Before starting a <a href=\"https://www.youtube.com/user/TielandtoThailand\" target=\"_blank\">YouTube</a> channel, we bought several top-of-the-line audio recording devices and extra accessories for our GoPro including a gimbal for super smooth recording. We also invested in a back-up hard drive so that we don&#8217;t lose precious photos and videos.</p>\n<p>Since starting a <a title=\"Tieland to Thailand Periscope\" href=\"https://www.periscope.tv/TielandThailand\" target=\"_blank\">Periscope</a> account, we upgraded a phone to a Samsung Galaxy Note 5 with 4G capability and upped our data usage from 2Gb to 10Gb per month (650 baht to 1,500 baht). This makes for better, clearer live streaming.</p>\n<h2><p id=\"A_More_Realistic_Thailand_Budget\"><p>A More Realistic Thailand Budget</p></p></h2>\n<p>We admit, <strong>we don&#8217;t represent the typical&#160;demographic that lives in Thailand</strong>. Sure, we call Chiang Mai our home as many expats do, but we traveled for a third of the year in 2015 and we also run a blog. Most people don&#8217;t do&#160;either of these and therefore don&#8217;t have the subsequent expenses.</p>\n<p>If you took away what we spent on the blog (345 USD) and on travel (627 USD) every month, it&#8217;s a very rough yet better estimation of what an average Western couple would spend living in Thailand.</p>\n<p>The total budget ends up being 2,826 USD &#8211; 345 USD &#8211; 627 USD = <strong>1,854 USD per month for two people</strong>, which isn&#8217;t too shabby!</p>\n<p><strong>Have you considered <a href=\"https://www.tielandtothailand.com/thailand-coaching-sessions/\">moving to Thailand</a>? Do you think this budget is within your means?&#160;</strong></p>\n<p>&#8595;&#160;PIN THIS POST FOR LATER&#160;&#160;&#8595;</p>\n<p><img class=\"aligncenter size-full wp-image-15057\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/01/Cost-of-Living-in-Thailand-Pinterest.jpg?resize=500%2C832&amp;ssl=1\" alt=\"Cost of living in Thailand: A breakdown of our entire budget living and traveling in Thailand in 2015 | Tieland to Thailand\" width=\"500\" height=\"832\"><br>\n&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Cost of Living in Thailand 2015"}},"pageContext":{"id":"5b95ef1b87be058327490109"}}