{"data":{"mongodbDatabaseArticles":{"id":"5b95eab287be05832748ffc7","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/curbfreecory.jpg\" alt=\"cory lee who travels the world in a wheelchair\"><br> A few months ago, I was browsing the Internet when I came across a travel blog written by a guy who traveled the world in a wheelchair. For hours, I read his blog, intrigued by what he did. I love when people don&#8217;t let their limitations hold them back. I love it when people say &#8220;I can&#8221; instead of &#8220;I can&#8217;t.&#8221; Cory embodies the ongoing theme on this blog that where there is a will, there is a way. Cory is a guy who wouldn&#8217;t let a disability define or confine him.</p><p>His is an inspirational story and I was hooked on his blog, so I invited Cory to share his story and advice for others who might be in a similar situation and wondering how to make travel happen.</p><p><strong>Nomadic Matt: Tell everyone about yourself.&#160;</strong><br> <strong>Cory:</strong> My name is Cory Lee and I&#8217;m a 25-year-old travel addict, peanut butter connoisseur, and the brains behind <a href=\"http://www.curbfreewithcorylee.com/\">Curb Free With Cory Lee</a>. I was born and raised in the tiny town of Lafayette, Georgia. It&#8217;s a rather boring town, but luckily my mom loved traveling so we hit the road pretty frequently. I was diagnosed with spinal muscular atrophy at the age of two and have been in a wheelchair ever since. My wheelchair and I have been to&#160;14&#160;countries and have plans to visit many more. Since graduating from the University of West Georgia with a degree in marketing last year, I&#8217;ve put all of my energy into growing my website. Aside from traveling and working on my blog, I love going to concerts, binge watching Netflix shows (Orange Is The New Black is my favorite), and trying new foods.</p><p><strong>How did you get into travel?</strong><br> My mom was a teacher so she was off work every summer. We used that time to travel locally and took a lot of road trips along the East Coast. Disney World was a popular choice. When I turned 15, we tried our hand at traveling internationally and went to the <a href=\"https://www.nomadicmatt.com/travel-guides/caribbean-travel-tips/the-bahamas/\">Bahamas</a>. These trips made me fall in love with travel and showed me that there&#8217;s so much out there in the world.</p><p><strong>Did you think your disability was going to limit you? What made you say &#8220;Screw it, I&#8217;m gonna do this anyway?&#8221;</strong><br> My mom always told me &#8220;If you can&#8217;t stand up, stand out&#8221; and I try to live by that mentality daily. I might not be able to stand physically, but I can stand. I can stand for anything that I desire, like traveling. A disability is not going to limit me from seeing the world. I refuse to even entertain the thought that my disability could have that sort of power. I&#8217;ve also never really known another way of life, so I guess I&#8217;ve just kind of learned to accept my circumstances and then plan with them in mind.</p><p><img src=\"https://media.nomadicmatt.com/coryinterview1.jpg\" alt=\"cory traveling the world in a wheelchair\"></p><p><strong>Has that been a challenge? How do you deal with naysayers?</strong><br> Over my life, yes. It was a challenge, especially when I was younger. I specifically remember being in elementary school and wondering why I couldn&#8217;t go on one of the field trips. My fifth grade class was going to a camp for a few nights, and one of my teachers said that it wouldn&#8217;t be possible for me to go because of my disability. They simply didn&#8217;t think that I would be able to do anything, so they didn&#8217;t see any reason for me to go. My mom furiously went up to that teacher and explained that I would be going and that they needed to accommodate every student, not just the ones that could walk.</p><p>Going to that camp is actually one of my favorite memories from elementary school. I had nonstop fun with my friends in the wilderness for a few days. There are naysayers out in the world, but I&#8217;ve learned to be patient and explain that even though I might not be able to do things exactly the way others do, I can still enjoy being there and do them to the best of my ability.</p><p><strong>What limitations do you have due to your disability?</strong><br> Spinal muscular atrophy makes my muscles weaker than the average person&#8217;s, which makes me unable to walk and limits my ability to raise my arms, transfer, etc. It also deteriorates my muscles over time so I may not have the same abilities in five years as I do now. This fact is constantly in the back of my mind and why I&#8217;m so motivated to see the world. I may not be able to travel&#160;10 years from now, but I am definitely having fun now.</p><p><strong>How do you get around&#160;on the road?</strong><br> I always travel with someone, usually my mom or a friend, because traveling solo would be pretty impossible. I need assistance boarding the planes, opening doors, and getting into bed, for example, so having someone there with me is extremely helpful.</p><p>Also, I try to get an idea of how accessible certain attractions are and then make a rough itinerary. While a lot of attractions and museums are accessible, one of the biggest obstacles when planning a trip is finding transportation. In more modern countries, there are accessible buses, trains, and taxis, but this information is not always easy to find online. I don&#8217;t really travel to destinations unless I know for sure that I&#8217;ll be able to easily get around once there. Hopefully eventually finding this information will be easier, and I&#8217;m certainly trying to help the cause with my site.</p><p>In Europe, many of the trains are accessible so it&#8217;s fairly easy to get around from city to city, but in the <a href=\"https://www.nomadicmatt.com/travel-guides/united-states-travel-guide/\">United States</a>, it&#8217;s a bit harder and more expensive since we don&#8217;t rely on trains as much. I&#8217;ve waited more than three hours for an accessible taxi in <a href=\"https://www.nomadicmatt.com/travel-guides/united-states-travel-guide/los-angeles/\">Los Angeles</a> before, which is valuable time during which&#160;I could&#8217;ve been out exploring the city.</p><p><img src=\"https://media.nomadicmatt.com/coryinterview2.jpg\" alt=\"cory traveling the world in a wheelchair\"></p><p><strong>Do you work? Or have a savings? How do you afford your travels?</strong><br> I just started freelance writing and, now that my site is growing, I&#8217;ve started making money from it as well. However, in previous years I&#8217;ve pretty much became an expert at saving. I literally save every dollar I can in order to travel and I also take advantage of SkyMiles and other rewards programs. I have the Delta SkyMiles debit card, and for every dollar that I spend, I earn one mile. I&#8217;ll often book family vacations or anything else that I can on my card, and then get them to pay me back, so that I can earn lots of miles. I also like the Hilton HHonors program, since Hilton is one of the most wheelchair-accessible hotel brands. They have roll-in showers&#160;and&#160;spacious rooms, and often they&#8217;ll even have an access lift on the pool.</p><p><strong>A lot of people will wonder &#8220;what happens if something goes wrong?&#8221; Well, what does happen?</strong><br> Trust me, I&#8217;m the king of bad luck. Seriously, if anything can go wrong, it will go wrong with me. I&#8217;ve been trapped on a burning bus in <a href=\"https://www.nomadicmatt.com/travel-guides/united-states-travel-guide/washington-d-c/\">Washington, DC</a>. I plugged my wheelchair battery charger into the wall in <a href=\"https://www.nomadicmatt.com/travel-guides/germany-travel-tips/\">Germany</a> (with the proper converter) and it blew up. Literally. Sparks were flying and the power in the entire hotel went out for about 15 minutes.</p><p>The worst thing that has ever happened to me was in 2007 in Washington, DC. I was there with the Global Young Leaders Conference and started feeling really sick&#160;on&#160;July 4th. I started throwing up as well as passing out repeatedly. My mom took me to the hospital and I ended up being admitted for two weeks and missed the entire second half of the conference. In addition to being severely dehydrated, I also had pneumonia. Pneumonia can be pretty lethal to people with spinal muscular atrophy, but luckily the doctors fixed me up by inserting a needle in my back and draining my lungs. It wasn&#8217;t the most enjoyable experience, but it did the trick. Now, whenever I travel somewhere, I always travel with my medication and have insurance.</p><p>And honestly, things could go wrong in the comfort of your own home, so wondering &#8220;what if?&#8221; constantly will do you no good. Embrace the unexpected.</p><p><strong>How do you cope with countries that&#160;might not be handicap or wheelchair friendly?&#160;</strong><br> There are definitely <a href=\"http://www.curbfreewithcorylee.com/2014/11/20/most-wheelchair-accessible-beaches-in-the-world/\">some countries that are more wheelchair friendly than others</a>. I use the magical powers of Google and talk to other wheelchair users in the area to determine if a destination is accessible or not before I book a trip. I try to visit places that have accessible taxis and other transportation because I&#8217;m pretty much stuck without it. Paris is probably <a href=\"http://www.curbfreewithcorylee.com/2015/02/09/least-wheelchair-accessible-cities/\">the least accessible place</a> that I&#8217;ve been. The metro wasn&#8217;t accessible and there was only one taxi in the whole city that was available to accommodate my needs. We ended up renting this one taxi for an entire day and it cost us about $600. This was crazy expensive, but there really weren&#8217;t any other options. I definitely learned to book taxis further in advance and research accessible transportation more before going somewhere. Trying to do anything spur of-the-moment as a wheelchair user is next to impossible.</p><p><img src=\"https://media.nomadicmatt.com/coryinterview3.jpg\" alt=\"cory traveling the world in a wheelchair\"></p><p><strong>Are there some countries you just can&#8217;t go to?</strong><br> I used to think that any country would be somewhat accessible if I just tried to make it work hard enough, but it turns out that some countries are next to impossible to navigate with a wheelchair. My friend and I looked at visiting some more extreme destinations like Iran, North Korea, or Jordan, and I couldn&#8217;t find any information about accessibility online. I even emailed every tour company that I could find and asked if they knew of any accessible tours, and they basically told me that there weren&#8217;t any.</p><p><strong>Is it expensive to travel with a disability? Are there precautions you have to take or added costs for services?&#160;</strong><br> It is much more expensive to travel as a wheelchair user. For example, last year I was in Puerto Rico, and while most tours were about $50 per person, a wheelchair-accessible tour was $200 per person. It&#8217;s crazy that they can charge so much more, but companies usually say that the cost is due to the need to put a special lift on the van and make other modifications. Taxis in many parts of the world do the same thing.</p><p>While traveling the world on $50 a day probably wouldn&#8217;t be possible in a wheelchair, there are strategies that can be implemented to save a little money. For example, I always book trips way in advance (6+ months in advance) and I usually can get better deals on flights and hotels by doing this. I also need more time to plan because I have to plan with accessibility in mind. Also, <a href=\"https://www.nomadicmatt.com/guide-to-travel-hacking/\">rewards points are my best friend</a>! By using SkyMiles and saving $400 on a flight, I can afford to go on that ridiculously priced $400 accessible tour.</p><p><strong>What advice would you give to others in your situation?</strong><br> I would tell them to just go for it. That&#8217;s easier said than done, but for every problem there is a solution. If the airline damages your chair, they will fix it. If your chair messes up while you&#8217;re at a destination, use the powers of Google and make a list of wheelchair repair shops in the area before you go. This came in really handy for me after my wheelchair charger blew up in London. I just looked at my list of repair shops in the area, called one, and within a couple hours I had a brand new charger that worked.</p><p><img src=\"https://media.nomadicmatt.com/coryinterview4.jpg\" alt=\"cory traveling the world in a wheelchair\"></p><p><strong>Are there any groups or organizations people should know about?</strong><br> There are several others that are rocking the accessible travel scene as well. <a href=\"http://www.lonelyplanet.com/travel-tips-and-articles/travel-for-all-join-lonely-planets-accessible-travel-project\">Lonely Planet launched a &#8220;Travel for All&#8221; Google+ community</a> a while back, and they are committed to promoting accessible tourism. They even launched the first ever LP guidebook devoted entirely&#160;to accessibility this past year. Also, <a href=\"http://pantou.org/taritas-travel-connections\">Tarita&#8217;s Travel Connections</a> is great if you need help planning your accessible trip. Tarita is a travel agent with multiple sclerosis and she truly knows how to plan the perfect trip for any abilities. <a href=\"http://www.mobilityworks.com\">MobilityWorks</a> is an awesome company that rents wheelchair-accessible vans as well. They have locations in 33 states, so if you&#8217;re traveling in the US, then you are set. If you&#8217;re not traveling in the US and need information on accessibility in your chosen destination, contact the local tourism board and they should be able to point you in the right direction.</p><p>Cory Lee is a 25-year-old travel addict and recent college graduate. He decided to start a wheelchair travel blog because he&#8217;s always had a strong passion for traveling. His blog, <a href=\"http://www.curbfreewithcorylee.com/\">Curb Free with Cory Lee,</a> is devoted to sharing the world from a wheelchair user&#8217;s perspective.</p><h3>Become the Next Success Story</h3><p>One of my favorite parts about this job is hearing people&#8217;s travel stories. They inspire me, but more importantly, they also inspire you. I travel a certain way but there are many ways to fund your trips and travel the world, and I hope these stories show you that there is more than one way to travel and that it&#8217;s within your grasp to reach your travel goals. You can send me an email at <a href=\"/cdn-cgi/l/email-protection#dfb2beabab9fb1b0b2bebbb6bcb2beababf1bcb0b2\">[email&#160;protected]</a> if you want to share your story!</p><p>We all come from different places, but we all have one thing in common:</p><p>We all want to travel more.</p><p>Make today the day you take one step closer to traveling &#8212;&#160;whether it is buying a guidebook, booking a hostel, creating an itinerary, or going all the way and buying a plane ticket.</p></div>","title":"How to Travel the World in a Wheelchair"}},"pageContext":{"id":"5b95eab287be05832748ffc7"}}