{"data":{"mongodbDatabaseArticles":{"id":"5b9629f387be0583274911c6","content":"<div><p>I am such a huge fan of Airbnb and have used it all over the world, in over 20&#160;cities &#8211; and it&#8217;s now my preferred way to book lodging. I am going to share what it&#8217;s like your first time using Airbnb, show you how to set up an account, what types of places to search for, and my tips for using the website. I also have a $40 off Airbnb promo code. This Airbnb discount code is only for your first time using Airbnb and setting up a new account.</p><p>I remember&#160;before I used the website, I found it all a little confusing and daunting. At a hotel, I knew I would have someone there to greet me when I showed up and help me get situated or help if something went wrong. With an Airbnb, I wasn&#8217;t sure where I&#8217;d meet someone to get the keys and what would happen if something went wrong in the middle of the night. Basically, it seemed sketchy.</p><p>But look at these places &#8211; wouldn&#8217;t you rather stay somewhere like this than a hotel if it were cheaper? It usually is.</p><p><img class=\"aligncenter size-full wp-image-27485\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-1.jpg?resize=1024%2C499&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"499\"> <img class=\"aligncenter size-full wp-image-27486\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-2.jpg?resize=1024%2C503&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"503\"></p><p>So, I started out with Airbnb in my own hometown, Goa, India. I tried out all the top Airbnb&#8217;s here and even wrote a post about <a href=\"https://hippie-inheels.com/find-a-house-in-goa/\">my favorite ones</a> (I found some gems!). Once I was comfortable, I started using it on all my travels. Recently, I bounced around Merida, Mexico for weeks and stayed in some <a href=\"https://hippie-inheels.com/airbnb-in-merida/\">very cute ones</a> as well. I&#8217;m going to share why I am such a convert to Airbnb below and also walk you through how to use the platform and all my tips for choosing a host.</p><h2>Airbnb Promo Code: How It Works</h2><p>Maybe you&#8217;ve had someone mention to you before that there is an Airbnb first time coupon &#8211; and it&#8217;s true! The Airbnb discount code is currently set at $40 off your first booking but it always changes. It has gone as low as $25 and $40 is the highest I&#8217;ve seen it. The amount is set by Airbnb.</p><blockquote><p><strong><a href=\"http://www.airbnb.co.in/c/rjones894?s=8\">Click here</a></strong> to make an account and receive $40 in credit.</p></blockquote><p>The great news is that if you&#160;sign up, you get $40 off and I get $20 off my next booking. Then, you get <strong>your own link</strong> and you can even get $20 each time you recommend friends to sign up.</p><h2>Beginner&#8217;s Guide to Using Airbnb</h2><h3>Setting up an account</h3><p>This is the easy part. <a href=\"http://www.airbnb.co.in/c/rjones894?s=8\">Click this link</a>. Click &#8220;sign up with email&#8221;. Follow the easy setup instructions by giving them your name, email, birthday, and create a password for your account. Once you&#8217;ve entered that information click the big red button that says &#8220;sign up&#8221;.</p><p>You&#8217;re good to go! You can now &#8220;edit your profile&#8221; and add some information about yourself. Your host will want to make sure you are a good person and someone they want to allow in their house.</p><h3>Finding your way around the Airbnb website</h3><p>I will take you through finding a cool place to stay. I&#8217;m going to pick Charlotte, North Carolina as I love that city and used to live there (and I&#8217;m actually really curious what Airbnb&#8217;s are there).</p><ol><li>In the top left, click on the empty search box and start typing &#8220;Charlotte&#8221;. It will auto-populate. Click search.</li><li>Click the &#8220;dates&#8221; button and input your dates. I put May 15-17. Click &#8220;apply&#8221;.</li><li>Click on &#8220;guests&#8221; and put how many. I put two.</li><li>Now it will say &#8220;homes&#8221; or &#8220;restaurants&#8221;. Click &#8220;homes&#8221;.</li><li>You&#8217;ll see search results.</li></ol><p><img class=\"aligncenter size-full wp-image-27487\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-3.jpg?resize=1024%2C502&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"502\"></p><p>Now, it&#8217;s time to filter them out. Under &#8220;home type&#8221; you can choose &#8220;entire home&#8221;, &#8220;private room&#8221;, or &#8220;shared room&#8221;. I usually go entire home unless I&#8217;m somewhere very expensive and need to rent a room in someone&#8217;s home. I did this in <a href=\"https://hippie-inheels.com/3-days-in-dublin-howth-cliffs/\">Dublin</a> and it was okay, but I prefer to take a whole home so I&#8217;ll choose &#8220;entire home&#8221; and click &#8220;apply&#8221;.</p><p>Next, filter your price. I put mine at a $200 maximum per night. I like to make it high so that I can see all the fun results even if I&#8217;m not really hoping to spend that much &#8211; but if I see someone I&#8217;m obsessed with, I might splurge!</p><p>You can click &#8220;more filters&#8221; and add in other things you want or need like the number of bedrooms, bathrooms, if there is A/C, if there is a&#160;pool, if pets are allowed, if smoking is allowed, and dozens of other filters.</p><p>I set it to &#8220;two bedrooms&#8221;. Now, I can see my new search results.</p><p><img class=\"aligncenter size-full wp-image-27488\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-4.jpg?resize=1024%2C509&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"509\"></p><p>To the right, you see a map. You might know which area you want to be in. For example, you want to be in the downtown area (called &#8220;uptown&#8221; in Charlotte). So, you can just click on the plus sign to zoom in on the map and zoom to the area you want to stay &#8211; you&#8217;ll see just the places now that are in that area.</p><p><img class=\"aligncenter size-full wp-image-27489\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-5.jpg?resize=1024%2C500&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"500\"></p><blockquote><p>You&#8217;ll want to save ones you like. You can just hover over the little heart until it turns red and it will save to your favorites. In the top right, you&#8217;ll see &#8220;saved&#8221;. You can make lists for &#8220;Hawaii homes&#8221; or &#8220;NYC pads&#8221;.</p></blockquote><p><img class=\"aligncenter size-full wp-image-27490\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-6.jpg?resize=1024%2C640&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"640\"></p><p>Once you save all your favorites to Charlotte to your list, you can then look at them all in one place on your &#8220;wishlists&#8221; and compare them or show them to your travel buddy to see which one you want to do. I narrowed it down to four. It will show you all four and also have a map to the side showing where each of them are.</p><p>My favorite is the &#8220;chic loft&#8221; for $85. Once I was to split with my travel buddy that is just $42 for each of us per night &#8211; plus you can use the $40 sign up bonuses on your booking. I can also see that this is a &#8220;superhost&#8221; which is great and I&#8217;ll explain that later (it&#8217;s something you can filter for when you search). This loft actually has FOUR beds.</p><p><img class=\"aligncenter size-full wp-image-27491\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/Airbnb-Promo-Code-Guide-7.jpg?resize=1024%2C499&amp;ssl=1\" alt=\"$40 Airbnb Promo Code + Beginner's Guide For Your First Time Using Airbnb\" width=\"1024\" height=\"499\"></p><p>Once I clicked through, the rate actually went down to $79 per night. You can click the main image and scroll through images of the whole house. Next, read all the booking details. The host sets their own: cancellation policy, smoking policy, pets policy&#8230; they are all there. If you want a place that you can cancel for a full refund, you can choose that in your filter when you search.</p><p>They will have a personalized note for each heading. For example:</p><ul><li><p>Guest access:&#160;</p><p>Entire space is included in this rental. Please, make yourself at home.&#160;</p></li><li><p>Interaction with guests:&#160;</p>I am here for you during your stay, but our level of interaction is up to you. I&#8217;m only a phone call/message away. You will be able to self check-in<p> upon arrival.</p></li><li>Cancellation: Moderate &#8211; Cancel up to 5 days before check in and get a full refund (minus service fees). Cancel within 5 days of your trip and the first night is non-refundable, but 50% of the cost for the remaining nights will be refunded. Service fees are refunded when cancellation happens before check-in<p> and within 48 hours of booking.</p></li></ul><p>Checking out is easy you just click BOOK! It will automatically add your promo code and you just enter your debit or credit card information.</p><p>Sometimes hosts will require you to &#8220;request to book&#8221;. This would mean that you request it, they look at your profile to see if you are cool, then they accept it. They have 24 hours to accept or decline. If you don&#8217;t want to deal with this, then you can filter for &#8220;instant booking&#8221; when you search.</p><h3>Choosing a host</h3><p>When you look at a host, the best way to see if they are good is to read the reviews and see how the host responds to people. You can also choose a &#8220;superhost&#8221; which will be someone who was a great host and has perfect reviews.</p><p>Always read reviews!</p><h3>Leaving reviews &amp; getting reviews</h3><p>Most Airbnb users take reviewing quite seriously.</p><p>Here is a review of this Charlotte property: &#8220;The instructions on how to check in were remarkably detailed. I loved the space. It was so chic. Jay was great at communicating. The loft was extremely clean. If you look to the left on the balcony you will see a lovely view of the city. There are two small beds upstairs that aren&#8217;t particularly comfortable for a couple but perfect if you are traveling alone or with a friend. Also, my spouse is over 6ft tall and his feet dangled off of the bed so if you&#8217;re really tall that may also be an issue. Due to the fact that the loft is directly in front of the entrance, I often heard the door slamming shut from other residents coming and going throughout the day but it wasn&#8217;t unbearable. We did order food and it was easily accessible for the driver which was great. In conclusion, I would recommend the space.&#8221;</p><p>Remember that YOU get a review, too. Here are some ways to be a good Airbnb guest:</p><ul><li>Arrive to meet them to get the keys when you say you will, and message them if you are going to be late due to traffic or a flight delay.</li><li>Keep the noise to a minimum and only contact your host if someone goes wrong.</li><li>Clean up before you go.</li><li>There is usually a list of rules in the house for you to follow. They might say &#8220;please strip the beds and leave the bedding on the floor so we know which beds you used&#8221;. This would be because if you made the bed to be nice, they might not think you used that bed. They might say to leave the dirty towels in the laundry room or to load the dishwasher for them to run it once you leave.</li><li>Basically, be polite and follow their rules.</li></ul><h3>How to handle issues with your stay</h3><p>If your house&#8217;s A/C breaks or you lose the key, it&#8217;s not the end of the world &#8211; your Airbnb host will help you fix the problem.</p><p>When the problem cannot be fixed or you don&#8217;t want to stay anymore due to the place not being as described, you simply contact Airbnb. They are known for always giving back your money if you show them proof of your claims and will help you book a new place. Their customer service is known to be good but in my years of using Airbnb, I&#8217;ve never had to reach out to them.</p><h2>Why I love Airbnb</h2><ul><li>The first reason is that it saves me a ton of money. When traveling alone, a studio apartment is so much cheaper than a hotel. With a group, you can get an amazing villa on Airbnb, split the cost, and always come out cheaper than if everyone in that group had gotten individual hotel rooms. In small towns where there are only one or two hotels, the prices are usually high &#8211; so that is a great time to try Airbnb (I do this in Ben&#8217;s cute hometown in England).</li><li>Usually, the small hotel room that I can afford is nowhere near as cute and charming as renting out a whole apartment or house on Airbnb.</li><li>You get to live like a local. Imagine wandering through the alleys in Paris and looking up at the cute windows with balconies above. You might daydream about what it would be like to live in one &#8211; but the thing is, you can Airbnb one probably cheaper than what a hotel would cost.</li><li>They usually leave you coffee, tea, and other little bits like shampoo and such in the showers. It&#8217;s often their home, so it&#8217;s stocked up with the things you&#8217;d likely need.</li><li>You have your own kitchen and can choose a house that fits all your needs. If you have pets or need a home that is wheelchair accessible, you can filter that out and search for it. I stayed in an epic place in Mumbai with my pets.</li><li>You&#8217;re also helping the person you stay with pay their rent or mortgage and are helping them make some money on the side.</li><li>In the same way that you got used to Uber and now think it&#8217;s saving you a ton of money and is so easy to use &#8211; Airbnb will give you that for lodging. After your first stay, you&#8217;ll be hooked.</li><li>Now you can also book experiences and restaurants through Airbnb.</li></ul><h2>Here is the Airbnb promo code again: <a href=\"http://www.airbnb.co.in/c/rjones894?s=8\">click here to sign up</a></h2><p>I hope you enjoy your first Airbnb stay! Comment with any questions you have.</p><h3>Pin this guide to Airbnb and Airbnb promo code for later:</h3><p><img class=\"aligncenter size-full wp-image-27492\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2018/04/airbnb-guide.jpg?resize=735%2C1102&amp;ssl=1\" alt=\"guide to Airbnb and Airbnb promo code\" width=\"735\" height=\"1102\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"First Time Using Airbnb Guide - Hippie in Heels"}},"pageContext":{"id":"5b9629f387be0583274911c6"}}