{"data":{"mongodbDatabaseArticles":{"id":"5b937af687be056953db7cfc","content":"<div><p name=\"5ef2\" id=\"5ef2\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--figure\">I recently gave a talk at DNX Global on running a profitable business from anywhere in the world. I didn&#8217;t pick the title, but it gave rise to an interesting question. Running a profitable business after all has nothing to do with being a digital nomad and vice versa. However, being on the move poses challenges to running a business (regardless if profitable or not).</p><p name=\"e914\" id=\"e914\" class=\"graf graf--p graf-after--p\">At the core of this issue is continually enabling a state of flow. This is the single most important component of an individual that not only produces, but also grows from within. As you&#8217;re alone and on the road, you have no other choice than to grow and move upwards, stagnating isn&#8217;t an option.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*BPqmpdjb0HiPp7kamS9AvQ.jpeg\"><p name=\"8a1d\" id=\"8a1d\" class=\"graf graf--p graf-after--figure\">We always associate digital workers with the need to continually be online, which I disagree with. This argument only sets you up for failure as the assumption is made that being offline is equated with being unproductive.</p><p name=\"e155\" id=\"e155\" class=\"graf graf--p graf-after--p\">When you think of your creative exertions, few require you to be online. Be it writing, designing or staring out the window when everyone else on the plane is asleep. Your body is motionless, but your mind is racing. If anything, being online has worn us out.</p><p name=\"cd0f\" id=\"cd0f\" class=\"graf graf--p graf-after--p\">You obviously have no choice when you&#8217;re completely offline, but having just that little bit of internet is even worse. It teases you by downloading half the page, by allowing you to receive an e-mail but not the attached PDF. It&#8217;s frustrating, but only if you let it. When your internet is that shaky, it&#8217;s better to just pull the plug so you can completely switch to your offline work.</p><p name=\"bc70\" id=\"bc70\" class=\"graf graf--p graf-after--p\">I use <a href=\"https://ia.net/writer/mac/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">iA Writer</a>/<a href=\"http://dayoneapp.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Day One</a> to write and <a href=\"http://www.sketchapp.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Sketch</a> to design/visualise ideas. This has nothing to do with being a writer or designer, but rather empowering you to communicate with yourself (introspection) as well as being able to express yourself outwards (communication in remote teams). Regardless of what title or job role we&#8217;ve given ourselves, we still need to know the basics. It just so happens that the basics aren&#8217;t just e-mail anymore.</p></div>","title":"Nomad and Flow – This Publication is Moved – Medium"}},"pageContext":{"id":"5b937af687be056953db7cfc"}}