{"data":{"mongodbDatabaseArticles":{"id":"5b95ea7387be05832748ffa9","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/globalgaz4.jpg\" alt=\"Ric from Global Gaz with a tuk tuk in an Indian rally\"><br> There are some amazing overland adventures around the world like the Mongol Rally and the Rickshaw Run. Overland travel is one of my favorite ways to travel. I believe the closer you get to the ground, the more countryside you visit, the better to get to understand a place. Sadly, I&#8217;ve never done a big overland rally but one of our community members has! Ric, another fellow Bostonian, has driven almost 7,000 miles in races and rallies across the globe. He&#8217;s an adventurous traveler, and in this interview he shares his tips and insight to help anyone learn how to travel off-the-beaten path!</p><p><strong>Nomadic Matt: Hey Ric! Thanks for doing this! Tell everyone about yourself.</strong><br> <strong>Ric:</strong> I&#8217;m Ric from Boston. I am just a guy who previously worked in the financial services industry after college. Now, I&#8217;m based in Bangkok for about half of the year. I go back to the US to visit for a couple of months, and then I am traveling and exploring for about four months a year.</p><p>Besides my blog, <a href=\"http://globalgaz.com/\" target=\"_blank\" rel=\"noopener\">GlobalGaz</a>, I am a podcaster at <a href=\"http://globalgaz.com/counting-countries/\" target=\"_blank\" rel=\"noopener\">Counting Countries</a>, where I interview people who have traveled to every country in the world (I&#8217;m hoping to accomplish that goal one day soon). I co-lead Bangkok&#8217;s Travel Massive as well as organize a 2,500-person Meetup.com group. I enjoy bringing together people who love to travel to share their passion.</p><p>I&#8217;ve also published three books: two on road rallies I participated in through India and the Caucasus region, and the third is a photo journal of when I slept over at Chernobyl (I am a bit obsessed with photography). I have produced two full-length travel documentaries, including <a href=\"https://vimeo.com/ondemand/hittheroadcambodia\" rel=\"noopener\" target=\"_blank\">Hit the Road: Cambodia</a>, and keynoted at the PATA Adventure Travel and Responsible Tourism Conference.</p><p>When not on the road I enjoy hanging out with my wife and our new dog Khan Mak, a Pomeranian and Chihuahua mix.</p><p><strong>It sounds like you&#8217;re on an epic quest! How did you get started traveling? </strong><br> Getting fired was helpful! I was laid off from my job on three different occasions in five years. Each time I got laid off, I took the severance package and embarked on months-long international road trips. On the third trip, I realized I couldn&#8217;t go back to my former corporate life and needed to make my passion &#8212; traveling &#8212; my life.</p><p>Since then, each year I spend more and more time overseas &#8212; now typically 9-10 months a year. My goal is to visit 20 new countries this year.</p><p><strong>What led you to embrace this nomadic lifestyle?</strong><br> While I was making good money in the financial services, it was not a fulfilling career. I began to dread going into the office more and more. I had volunteered a bunch of times in Armenia, Tanzania, and Thailand, and these experiences are what really drew me to living overseas.</p><p>In 2004, I volunteered in Yerevan, Armenia, at an orphanage. I am ethnically Armenian, so this was a great way to connect with my roots. I spent a lot of time bonding with the kids &#8212; who today are young adults &#8212; and have been back every year to visit them; from 2004 to 2010, I hosted <a href=\"http://armenianvolunteer.blogspot.com/2006/09/zatik-orphanage-summer-festival.html\" target=\"_blank\" rel=\"noopener\">an annual festival</a> for the children at the orphanage. I also volunteered at an after-school group where the children learned about film, photography, and journalism.</p><p>In Thailand, I have been fortunate to be associated with <a href=\"http://globalgaz.com/volunteering-in-the-slums-of-bangkok-klong-toey/\" target=\"_blank\" rel=\"noopener\">the Mercy Centre</a> in Bangkok. For the last three years, I&#8217;ve been a volunteer teacher for kindergarteners. The time spent working with others has made a big impact on me, and I find it to be very rewarding.</p><p><img src=\"https://media.nomadicmatt.com/globalgaz2.jpg\" alt=\"Ric from Global Gaz in a race in Eastern Europe\"></p><p><strong>You&#8217;re trying to go to every country in the world. Can you tell us more about that?</strong><br> As I visited more and more countries, I decided that I wanted to visit every country in the world. According to the UN, there are 193 countries. I have been to 110 so far. As the list dwindles, the countries become more difficult to visit, whether it is a difficult visa to get, a remote country, or simply dangerous to visit.</p><p>I celebrated <a href=\"http://globalgaz.com/100th-country-kurdistan-iraq/\" target=\"_blank\" rel=\"noopener\">my 100th country</a> last year in Iraq. Iraq is not your typical holiday spot, but I found my trip to be both rewarding and educational. I was received with warmth and gracious hospitality by the local Iraqis. I spent an entire afternoon with an elderly gentleman who I met drinking tea. He escorted me around the local market, introduced me to his friends, and treated me to lunch.</p><p>I also have had some interesting experiences visiting countries that &#8220;don&#8217;t exist&#8221; such as Transnistria, a country of 500,000 people located between Moldova and <a href=\"https://www.nomadicmatt.com/travel-guides/ukraine-travel-tips/\" target=\"_blank\" rel=\"noopener\">Ukraine</a>. Transnistria is not recognized by the UN as a sovereign country; however, you need a Transnistrian visa to enter it. It has its own flag, currency, army, and government. It is a quirky place to visit, if you get a chance.</p><p><strong>What do your friends and family think about your constant travels? What did they think when you first started?</strong><br> My dad has always been supportive of my travels. In fact, he has joined me on some epic trips, such as traveling to <a href=\"https://www.nomadicmatt.com/travel-blogs/my-tour-through-the-galapagos-islands/\">the Gal&#225;pagos Islands</a> and Antarctica.</p><p>My friends are sometimes intrigued with my travel tales and will come to me for travel advice, and the more adventurous ones will join me on a trip. I&#8217;ve also made an entire new group of friends from around the world who are fellow travelers and travel bloggers. They are a great resource for support and advice.</p><p><strong>What&#8217;s your number one piece of advice for new travelers? </strong><br> Of course, the first piece of advice is just to get out there. If you are apprehensive or not experienced, start out slowly. If you want to dip your toe in the water, start off with Western Europe. If you want to take the next step, consider <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener\">Thailand</a>, <a href=\"https://www.nomadicmatt.com/travel-guides/bulgaria/\" target=\"_blank\" rel=\"noopener\">Bulgaria</a>, or <a href=\"https://www.nomadicmatt.com/travel-guides/argentina-travel-tips/\" target=\"_blank\" rel=\"noopener\">Argentina</a> (countries with good tourist infrastructure and very affordable). As you get more comfortable and experienced, spread your wings, and travel to more off-the-beaten path places.</p><p>To make your travel and life more fulfilling, I would make two suggestions:</p><ol><li><strong>Volunteer</strong> &#8211; This is an effective way to become part of the community. You will be able to build genuine friendships with the locals and really learn about the culture and country you are visiting.</li><li><strong>Join an adventure rally</strong> &#8211; Rallies allow you to get off the beaten path and see parts of the country that you would not typically visit. The rallies allow for real interactions with the locals.</li></ol><p><img src=\"https://media.nomadicmatt.com/globalgaz3.jpg\" alt=\"the jeep car that Ric from Global Gaz drove in a global rally\"></p><p><strong>Tell us more about rally races. What are they and how did you get into them? </strong><br> A &#8220;rally&#8221; is a challenging adventure, where participants travel from point A to point B within some sort of parameters (think Amazing Race). Some rallies specify what kind of transportation to take, such as a tuk-tuk. Other rallies require participants to ride a cart led by oxen, ride a sailboat off the island of Zanzibar, or pilot a paramotor for 1,000 miles in the sky.</p><p>My first rally, known as &#8220;the Caucasian Challenge,&#8221; was 17 days, 11 countries, and 7,000 km and from Budapest to Yerevan. In 2010, two friends and I bought a 1993 Jeep Cherokee in Budapest for $2,300 USD with 250,000 km already on it. Our team, named &#8220;The Yerevan Express,&#8221; competed against 10 other teams. During our journey we got lost and ended up in Montenegro (a country not on the itinerary), and we witnessed the breathtaking mountains of northern Albania. The rally ended when I literally <a href=\"http://globalgaz.com/threw-away-car-mans-land/\" target=\"_blank\" rel=\"noopener\">abandoned my car</a> between Georgia and Armenia and took a bus to the airport to leave the country.</p><p>Next was the <strong>&#8220;Rickshaw Challenge.&#8221; </strong>In 2012, I embarked on a 12-day, 2,000km sprint across India (during the monsoon season!) piloting an auto-rickshaw. India is amazing, but it can also be a bit overwhelming on the senses. This is especially true when attempting to navigate the country in a seven-horsepower (think a riding lawnmower) rickshaw. During these 12 days, we were constantly running out of petrol, driving up to 14 hours a day, getting detained by the police, and eating too many samosas to count. Needless to say, crossing &#8220;the Rickshaw Challenge&#8221; finish line was rewarding.</p><p>After that came the <strong>&#8220;Cambo Challenge&#8221;</strong> in 2015, organized by Large Minority (a company that organizes awesome rallies in Sri Lanka, the Amazon, Cambodia, and the Philippines). This was a 1,600km circular route through Cambodia over 12 days. The rally took place on a Cambodian tuk-tuk (for anyone who has been in one, you&#8217;ll understand the struggle!). We navigated our way through the magnificent temples of Angkor Wat, drove past floating villages, stayed with families in an ecovillage called Chambok, camped near temples, and swam in the Gulf of Thailand. &#8220;The Cambo Challege&#8221; was another great way to discover realness of this commonly overlooked country while also giving back with Large Minority&#8217;s commitment to local community (10% of their revenues support local projects).</p><p>I documented both &#8220;the Rickshaw Challenge&#8221; and &#8220;the Cambo Challenge&#8221; by producing a full-length, <a href=\"http://globalgaz.com/film/\" target=\"_blank\" rel=\"noopener\">adventure travel documentary</a>. My partners and film crew were my former students from Manana, the after-school group in Yerevan.</p><p><img src=\"https://media.nomadicmatt.com/globalgaz1.jpg\" alt=\"Ric from Global Gaz getting injuredin rural Cambodia getting stiches from rally accident\"></p><p><strong>What advice would you have people if they wanted to do this? What resources are out there?</strong><br> Great question! Had I not seen a captivating banner hanging in an Armenian caf&#233;, I&#8217;d have never known myself. There are four primary companies that organize most of these rallies:</p><p>Some of these rallies provide virtually no support, while others provide guidance and assistance (such as route planning, luggage support, or even an ambulance) as you race across the country. Some rallies last ten days (like the Lanka Challenge) while others can top two months (the longest is the Mongol Rally).</p><p>You have to fund these rallies yourself (or get a sponsor). Some rallies provide the vehicle, hotels, and support for an inclusive price (which can total a couple thousand dollars per team). Other organizers require you to provide the car and practically everything else, and offer minimal support, for a smaller entry fee (several hundred dollars). Other costs vary greatly, based on what type of accommodations you stay in, the food you eat, the cost of your airplane ticket, and of course, if you have to buy a car for the rally.</p><p>You can participate in rallies around the globe. &#8220;The Ice Run&#8221; takes place in the Siberian Arctic for 12 days. You can participate in &#8220;the Monkey Run&#8221; in the Saharan Desert covering 1000km. &#8220;The Banjul Challenge&#8221; follows the coast of West Africa for three weeks. &#8220;The Philippines Challenge&#8221; places you in the crystal blue waters of the Philippines over nine days.</p><p>Besides the official websites, check out this overview of some of the <a href=\"https://www.yahoo.com/style/a-crazy-new-kind-of-amazing-race-international-117138357567.html\" target=\"_blank\" rel=\"noopener\">best rallies</a>, and these specific blog posts about <a href=\"https://www.adventureinyou.com/philippines/the-philippines-sailing-challenge-large-minority/\" target=\"_blank\" rel=\"noopener\">the Philippines Challenge</a>, <a href=\"https://onestep4ward.com/riding-tuktuks-across-sri-lanka-lanka-challenge/\" target=\"_blank\" rel=\"noopener\">the Lanka Challenge</a>, <a href=\"http://www.joaoleitao.com/driving/central-asia-rally/\" target=\"_blank\" rel=\"noopener\">the Central Asian Rally</a>, <a href=\"http://www.traveldudes.org/travel-tips/taking-amazon-challenge-large-minority/139770\" target=\"_blank\" rel=\"noopener\">the Amazon Challenge</a>, and <a href=\"https://www.ottsworld.com/mongol-rally-2011/\" target=\"_blank\" rel=\"noopener\">the Mongol Rally</a>.</p><p><strong>What&#8217;s been the biggest lesson you&#8217;ve learned so far?</strong><br> I have learned so much from being on the road. But there are two lessons I always try to remember: perspective and the power of perception.</p><p>In my former corporate life, I would have spent several thousand dollars on a luxury watch, but not now. I&#8217;ve grown to value experiences and relationships more than material possessions. Travel definitely changes your perspective.</p><p>When it comes to the power of perception, I have one story that stands as a telling example. In 2004, I was chatting up a bartender in Moscow. After I informed him that I was from the US, he told me how much Russians hate Americans (I was a bit surprised, naively thinking the Cold War was over!). He went on about how Europe and the US fabricated Serbia&#8217;s hostilities against its neighbors and used false facts to justify attacking Serbia (Russia&#8217;s ally). When I mentioned the mass graves of Muslims in Srebrenica, he told me that they didn&#8217;t exist and the West fabricated their existence. So my second lesson from the road is your truth is not the universal truth.</p><p>*********</p><p>All of Ric&#8217;s adventures stemmed from his desire breakthrough the normal 9-5 and explore the world. He didn&#8217;t jump into adventure races and rallies on his first trip, he took one trip, then another, and built up his confidence on the road. Eventually, he began driving across the world!</p><p>Hopefully, this post will inspire you to think outside the box a bit and figure out ways to use your passion and skills to get out there, escape the cubicle, and see more of this world.</p><h3>Become the Next Success Story</h3><p>One of my favorite parts about this job is hearing people&#8217;s travel stories. They inspire me, but more importantly, they also inspire you. I travel a certain way but there are many ways to travel the world.&#160;I hope these stories show you that there is more than one way to travel and that it is within your grasp to reach your travel goals. Here are more examples of people who are traveling the world in a unique (some may call it strange) way:</p><p><strong>P.S.</strong> &#8211; Want to travel with me? There are only 2 spots left on my next reader tour! I&#8217;ll be taking readers on an intimate group tour of Vienna and Prague, where we will visit all my favorite sights, restaurants, bars, and off the beaten path places! <a href=\"https://www.nomadicmatt.com/travel-blogs/tours-2017/\" target=\"_blank\" rel=\"noopener\">Come explore the world with me!</a></p></div>","title":"Adventure Races and Overland Travel: An Interview with Ric"}},"pageContext":{"id":"5b95ea7387be05832748ffa9"}}