{"data":{"mongodbDatabaseArticles":{"id":"5b95ef3587be05832749010d","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Dollar Dollar&#8230;Baht?</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img title=\"Thai Money\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/03/20130330-145418.jpg?resize=563%2C448&amp;ssl=1\" alt=\"Thai Baht Money Wallet \" width=\"563\" height=\"448\"></p>\n<p>It only took a day or two in Thailand and a few baht bills later to realize that we took for granted the convenience of using a debit or credit card for everyday purchases. Back in the States, we used to simply whip out a debit or credit card and make a purchase with one, smooth swipe. Not only is it physically easier to use a card than it is to use cash, it was just more convenient for us to have access to our money electronically than to have cold, hard cash.</p>\n<p><strong></strong></p>\n<h2>The Many Shapes and Colors of the Thai Baht</h2>\n<img title=\"Thai Baht Notes\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/03/20130330-145514.jpg?resize=563%2C508&amp;ssl=1\" alt=\"Thai Baht Bills\" width=\"563\" height=\"508\"><p>Here in Thailand, we find ourselves paying in cash because that is the only option accepted, at least when we buy food at the market or the street stalls. What&#8217;s the problem with paying in cash? At first, we had a hard time actually <i>handling</i> the money, as we often fumbled over the Thai baht bills. It was so strange to be touching it, counting it, organizing it numerically, and then straightening it up before tucking it back in our wallets. On top of that, we (still) have to simultaneously convert numbers in our heads when given the final price, and then we have to do <i>math</i> to double check our change. Using cash certainly takes more brain power!</p>\n<p>Oh and coins? We forgot how awkward they are to carry around. We&#8217;ve figured out that it works well if I carry a separate little pouch where we put the change, rather than keep change in Chris&#8217;s wallet.</p>\n<img title=\"Thai Money\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/03/20130330-145418.jpg?resize=563%2C448&amp;ssl=1\" alt=\"Thai Baht Money Wallet \" width=\"563\" height=\"448\"><p>And did I mention that cash runs out? That means we have to go to the ATM every few days. We are actually forced to budget and be more aware of what cash we physically have on us. We&#8217;ve since gotten used to handling money, but it was just one of those little things we weren&#8217;t expecting!</p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Dollar Dollar…Baht?"}},"pageContext":{"id":"5b95ef3587be05832749010d"}}