{"data":{"mongodbDatabaseArticles":{"id":"5b93832187be056953db7e2f","content":"<div><h1 name=\"f008\" id=\"f008\" class=\"graf graf--h3 graf--leading graf--title\">5 Things You Should Avoid If You Plan to be a Remote Software Developer</h1><p name=\"8080\" id=\"8080\" class=\"graf graf--p graf-after--h3\">Tommy is a remote software engineer turned founder. His previous company was backed by 500Startups, a well-known Silicon Valley tech accelerator. He&#8217;s currently working on an educational platform for people to learn about cryptocurrencies and how to trade them via a <a href=\"https://altcoinfantasy.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">crypto trading simulation game called Altcoin Fantasy.</a></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*iHuGZrQozpBw5TBZcGHtIQ.jpeg\"><p name=\"d981\" id=\"d981\" class=\"graf graf--p graf-after--figure\">In my opinion, being a software developer is the best job in the world. One of the reasons is the flexibility&#8202;&#8212;&#8202;all you need is a laptop and you can work and live anywhere in the world. I&#8217;ve had the pleasure of working from the back of an RV with a beautiful mountain backdrop in Utah to pushing code while on a white sand beach in Thailand, overlooking crystal clear turquoise waters. I&#8217;ve worked for many years as a remote developer and have also had the opportunity to work with other remote developers in that time. While many people talk about the things you need to do as a remote developer, no one talks about the things you shouldn&#8217;t do. Today, I&#8217;ll share my top 5 things you shouldn&#8217;t do if you plan on being a successful remote software developer.</p><p name=\"bf21\" id=\"bf21\" class=\"graf graf--p graf-after--p\">1. Don&#8217;t treat remote work any differently than if you were going into an office</p><p name=\"5c3b\" id=\"5c3b\" class=\"graf graf--p graf-after--p\">A lot of people confuse the concept of working remotely with having unlimited freedom to do whatever they want. This is not the case at all. The developers I know who have been able to successfully transition to being fully remote always have work at the back of their minds. Though they may not be physically in the office, they are still very committed to their jobs and the success of the company. Just because you&#8217;re remote doesn&#8217;t mean you have less responsibilities than your peers who are in the office or that you should act any differently.</p><p name=\"dfc3\" id=\"dfc3\" class=\"graf graf--p graf-after--p\">A good example of this is meetings. Oftentimes, working remote means you&#8217;re on a different timezone and there are certain times where you may have to take meetings while you&#8217;re on the go, but the best remote workers I know schedule their meetings in a quiet, office friendly environment to show they are serious about the meeting.</p><p name=\"89b1\" id=\"89b1\" class=\"graf graf--p graf-after--p\">The most often cited benefit to working remotely is being able to roll out of bed and work in your pajamas. This detracts away from adopting a professional mindset. To structure your work day to feel more like you&#8217;re going into the office, take a walk around the block of your place to mimic &#8220;commuting&#8221; to work every morning and dress up in office attire to simulate working in an office environment.</p><p name=\"29cd\" id=\"29cd\" class=\"graf graf--p graf-after--p\">I personally believe that being able to work remote is a privilege, not a right. Therefore, you need to constantly make sure you are earning the privilege by working just as hard, if not harder, than if you were working in the office.</p><p name=\"e86b\" id=\"e86b\" class=\"graf graf--p graf-after--p\">2. Don&#8217;t do just the bare minimum</p><p name=\"08d3\" id=\"08d3\" class=\"graf graf--p graf-after--p\">It&#8217;s easy to be distracted by a new surrounding and therefore be inclined to prioritize leisure over work. The best remote developers I know are cognizant of this danger and ensure that they don&#8217;t let it affect their jobs. To show you&#8217;re engaged don&#8217;t just do what&#8217;s minimally required for the job.</p><p name=\"0956\" id=\"0956\" class=\"graf graf--p graf-after--p\">Devote some spare time to help out the company with any side projects and/or any processes that can be streamlined. Are the tests on the build server failing intermittently? Devote some time after work to investigate and fix it. Learned a new framework while working on a feature at work? Take some extra time to prepare some slides and volunteer to give a lunch and learn to the team. Or perhaps you can leverage your situation to help out the team. If you are on a different timezone than the rest of the team, you can offer to be on standby to support any production issues.</p><p name=\"26df\" id=\"26df\" class=\"graf graf--p graf-after--p\">The great remote developers are curious problem solvers and they always looking for ways to improve things.The point here is to show the rest of the team that you are engaged and not just a warm body on the team. To earn the trust and respect of the team, the best remote devs take on more than just what is required to show the rest of the team that they care very much about their role. This also prevents you from being forgotten or passed over, which can sometimes be a danger of working remotely.</p><p name=\"16ee\" id=\"16ee\" class=\"graf graf--p graf-after--p\">3. Avoid staying stagnant&#8202;&#8212;&#8202;Don&#8217;t stop learning!</p><p name=\"ebd1\" id=\"ebd1\" class=\"graf graf--p graf-after--p\">Being remote has its benefits. However, when it comes to knowledge sharing, a lot of that happens during face to face interactions and collaborations. Being remote hinders this. Though there are tools to help with pair programming, I find that information sharing and transfer is still best shared with in person. With this in mind, it&#8217;s easy to see that remote developers have a disadvantage when it comes to keeping up to date with the latest and greatest developments and technologies. In order to be on top of things when it comes to new technologies, great remote workers spend their off time polishing their skills and honing their craft. Whether it&#8217;s spending a few weekends a month learning about new concepts such as machine learning or cryptocurrencies, going to hackathons/meetups and learning new tools and skills, or spending some time writing technical blog articles for Hackernoon =), do not stay stagnant.</p><p name=\"5481\" id=\"5481\" class=\"graf graf--p graf-after--p\">You might be tempted to explore the world in front of you, but the best remote developers know that in order to continue to enjoy their freedom, their skills need to be in demand in order for them to continue to be digital nomads, so do not stay stagnant!</p><p name=\"537a\" id=\"537a\" class=\"graf graf--p graf-after--p\">4. Avoid losing track of time</p><p name=\"7717\" id=\"7717\" class=\"graf graf--p graf-after--p\">Let&#8217;s face it&#8202;&#8212;&#8202;procrastination is something that we all deal with. As a remote developer, you have a ton of freedom to do whatever you want. However, this will be one of the biggest double edged swords you wield as a remote worker. Left unchecked, this will erode productivity and undermine the trust with your co-workers and superior.</p><p name=\"eb4f\" id=\"eb4f\" class=\"graf graf--p graf-after--p\">A great remote developer is frank with their assessment of their productivity and employs strategies to cope with any loss of time due to unproductive things. One strategy that I employ that works amazing well is the Pomodoro technique. <a href=\"https://francescocirillo.com/pages/pomodoro-technique\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">The <strong class=\"markup--strong markup--p-strong\">Pomodoro Technique</strong></a> is a time management method developed by Francesco Cirillo in the late 1980s. The technique uses a timer to break down work into intervals, usually 25 minutes in length, separated by short breaks of 5 minutes. Throughout this 25 minute of uninterrupted work, if there is anything that pops out in your head, instead of acting on it and becoming distracted from your main focus, you jot it down on a notebook and come back to it after the pomodoro is over. This way, you are training your brain to stay focused.</p><p name=\"ac76\" id=\"ac76\" class=\"graf graf--p graf-after--p\">5. Don&#8217;t under communicate</p><p name=\"51d1\" id=\"51d1\" class=\"graf graf--p graf-after--p\">Teamwork is all about communication, and when you&#8217;re a remote worker, this is especially important because you may be disadvantaged when it comes to team communication. However, the great remote software developers I know realize this and try to overcompensate by communicating frequently and consistently. A general rule of thumb here is to err on the side of more communication rather than less. Here are a few specific examples that great remote developers use to ensure they are always communicating to the team:</p><ul class=\"postList\"><li name=\"adf0\" id=\"adf0\" class=\"graf graf--li graf-after--p\">Come to meetings on time (or even a couple minutes early) and don&#8217;t have distractions in the background. Always show your webcam and share your screen to show full transparency.</li><li name=\"4eac\" id=\"4eac\" class=\"graf graf--li graf-after--li\">Try to participate in remote code reviews. If that&#8217;s not possible, at least comment in your Pull Requests to ensure the other party know your motivation when it comes to design decisions and/or things to look out for.</li><li name=\"6104\" id=\"6104\" class=\"graf graf--li graf-after--li\">Let your team know if you will be out of the office via Slack (or whatever your team communication app is)&#8202;&#8212;&#8202;including when you&#8217;re on your lunch break or running errands.</li></ul><p name=\"0af3\" id=\"0af3\" class=\"graf graf--p graf-after--li\">Remember that communication is a key cornerstone of building trust in a team, so a good remote worker always puts this in the back of his/her mind. A great remote worker is a great self manager&#8202;&#8212;&#8202;remote workers have tasks and goals, but they rarely have their superior prioritizing their workload for the week. They need to manage their own work and keep track of their own time. Got any other things to avoid? Comment below!</p></div>","title":"5 Things You Should Avoid If You Plan to be a Remote Software Developer"}},"pageContext":{"id":"5b93832187be056953db7e2f"}}