{"data":{"mongodbDatabaseArticles":{"id":"5b92397187be0583cfde6803","content":"<div><p class=\"et_post_meta_wrapper\">\n<h1 class=\"entry-title\">How to Use an Offshore Company for Cryptocurrency Tax Benefits</h1>\n \n</p><img class=\"wp-image-24999 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/cryptocurrency-for-nomads-1.jpg\" alt=\"Cryptocurrency for nomads 1\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Dateline: Kuala Lumpur, Malaysia</p>\n<p>Go to any financial website, entrepreneurial blog, or social media platform where the nomad community is present these days and you will hear the constant buzz about one thing: cryptocurrency.</p>\n<p>In fact, it won&#8217;t take you long to find someone claiming that it is the future of money.</p>\n<p>Especially Bitcoin.</p>\n<p>Here at Nomad Capitalist, we have <a href=\"http://nomadcapitalist.com/2013/06/24/bitcoin-regulation-isnt-a-recipe-for-economic-freedom/\">followed Bitcoin</a> and other cryptocurrencies for years. However, only recently have I begun to see clients who run crypto-based businesses. Helping these individuals create the perfect <a href=\"http://nomadcapitalist.com/2016/11/06/belt-and-suspenders-strategy/\">offshore plan</a> has proven to be a challenge. There are ways to make it work, but they often require a bit more work and planning on both ends.</p>\n<p>Each case is so individual and has to be customized, so there is not a lot of general advice I can hand out on the subject of creating the perfect offshore plan for your personal cryptocurrency strategy. However, we can go over the most important cryptocurrency basics, and I can give you some general warnings about how to handle your cryptocurrency dealings based on personal and client experience.</p>\n<p class=\"et_post_video\"></p>\n<p>&#160;</p>\n<h2><strong>Cryptocurrency 101</strong></h2>\n<p>In its most basic form, cryptocurrency is a decentralized digital currency.</p>\n<p>If you want a slightly more complicated explanation, it is a peer-to-peer exchange of digital information through blockchain technology that allows for the purchase and sale of goods and services.</p>\n<p>The first cryptocurrency &#8212; <a href=\"https://en.wikipedia.org/wiki/Bitcoin\">Bitcoin</a> &#8212; emerged in 2008 in the wake of the financial crisis and Occupy Wall Street protests when faith in big banks was at its lowest. Bitcoin conveniently eliminated the corrupt middleman, stamped out interest fees, and made transactions transparent.</p>\n<p>What was never clear was the exact identity of Bitcoin&#8217;s creator, who has only ever been known by the pseudonym, <a href=\"https://en.wikipedia.org/wiki/Satoshi_Nakamoto\">Satoshi Nakamoto</a>. Nakamoto published a <a href=\"https://bitcoin.org/bitcoin.pdf\">proof of concept</a> in October of 2008 that provided the necessary mathematics to make Bitcoin possible and even &#8220;mined&#8221; the first 50 units of the currency on January 3, 2009, before he left the Bitcoin project in 2010 and disappeared, leaving other developers to continue the work.</p>\n<p>The beauty of Bitcoin and cryptocurrency, in general, is that there is no need for someone to be in charge, thus, Nakamoto&#8217;s departure did not negatively affect the growth of the digital currency. Even today, you do not have to receive anyone&#8217;s permission to use cryptocurrency. You simply download the software for free and begin receiving and sending Bitcoins or other cryptocurrencies.</p>\n<p>Over the past nine-plus years since Bitcoin&#8217;s inception, the currency&#8217;s value has risen to incredible levels.</p>\n<p>On December 16, 2017, it reached its highest point yet of almost $19,200. However, since then it has fallen as low as $7,000 USD and &#8212; at the time of writing &#8212; currently sits just above $10,000 USD per Bitcoin with 16.9 million units in circulation.</p>\n<p>You can use Bitcoin to buy products from over 100,000 merchants, including companies like <a href=\"http://Overstock.com\">Overstock.com</a>, REEDS Jewelers, Dell, Expedia, PayPal, Microsoft, and even a private hospital in Poland. You can accept Bitcoin Payments for your store with a Bitcoin POS system, and you can even get paid in Bitcoin by certain websites for completing tasks. You can also always buy or exchange Bitcoins from individuals.</p>\n<p>Best of all, Bitcoin is an international currency, which means that you do not need to deal with exchange rates and extra charges. And, while governments are now trying to regulate the disclosure and use of cryptocurrencies, they do not control them as they control fiat currencies.</p>\n<p>&#160;</p>\n<h2><strong>Potential Obstacles for Crypto-Based Businesses</strong></h2>\n<img class=\"wp-image-25000 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/cryptocurrency-for-nomads-2.jpg\" alt=\"cryptocurrency for nomads 2\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>Still, cryptocurrencies are not without their challenges.</p>\n<p>The high price volatility, the susceptibility to hackers, and the transaction delays form part of the overall challenges. However, there are additional challenges for Nomad Capitalists who want to set up a crypto-based business that is conducive to<a href=\"http://nomadcapitalist.com/tax-reduction/\"> low-tax</a>, offshore strategies. The following are some of the most important ones you should take into account.</p>\n<h3><strong>Money</strong></h3>\n<p>One of the first things you should consider if you hold most of your assets in cryptocurrencies is how you are going to convert those assets into cash.</p>\n<p>You may be able to use Bitcoin with over 100,000 merchants, but chances are you will still need to make some purchases in regular fiat money.</p>\n<p>So far, our clients have not had any issues converting their Bitcoin into cash. This is thanks, in large part, to <a href=\"http://www.jrotbart.com/\">J.Rotbart &amp; Co.,</a> a precious metals company that allows individuals to purchase precious metals with cryptocurrency.</p>\n<p>In the case of one of our clients, he was able to buy gold at J.Rotbart &amp; Co. with Bitcoin and then sell his gold for cash and place it in his bank account.</p>\n<p>It is also possible to use modern multiple-currency accounts and cards like <a href=\"http://nomadcapitalist.com/2017/12/15/revolut-card-review-fee-free-future-international-exchanges/\">Revolut</a> to transfer your cryptocurrencies into 25 different fiat currency accounts.</p>\n<h3><strong>Structure</strong></h3>\n<p>In regards to your overall offshore structure, setting up a cryptocurrency company in and of itself is not the issue. There are jurisdictions like<a href=\"http://nomadcapitalist.com/2016/12/09/hong-kong-tax-rates/\"> Hong Kong</a>, BVI, Bulgaria, and Estonia where it is quite simple to set up a company that uses cryptocurrencies.</p>\n<p>The real challenge is finding a bank that will allow you to tie an account to a company that is involved with cryptocurrencies.</p>\n<p>The simplest solution is &#8211; rather than convincing your current bank to let you participate in crypto activities &#8211; to find banks that already engage with companies involved in cryptocurrencies.</p>\n<p>Through experience, we have found that Singapore, in general, is not crypto-friendly and no reputable Singapore bank will take on crypto-based companies. So far, I have found good banks in the BVI and Hong Kong that are involved with crypto businesses and I am now looking into Bulgaria.</p>\n<h3><strong>Institutions</strong></h3>\n<p>Nomad Capitalists regularly have to interact with institutions like embassies, whether they are working to obtain a<a href=\"http://nomadcapitalist.com/second-passport/\"> second passport</a> or stopping in to pick up a visa to their next destination. And embassies like to see that you have a normal bank account with steady cash flow.</p>\n<p>If you are involved in cryptocurrencies, you will need to ensure that you do not keep all of your assets in crypto. You will need at least some fiat money in your bank account. We had a client who basically had no money in the bank. Needless to say, this made our entire process far more complicated.</p>\n<p>Consider making regular monthly payments to your bank account so you can show paychecks, or at least steady cash flow, whenever an institution makes such a request.</p>\n<h3><strong>Employees</strong></h3>\n<p>You will need to be careful how you represent your crypto business to any potential employees. You will need to be prepared to pay them in fiat currency instead of crypto as not everyone will be as willing as you to jump on the crypto train.</p>\n<p>That said, it will be helpful to find a candidate who is of a certain mindset who is open to cryptocurrencies. If you are looking for an employee in a more conservative environment, you may run into problems.</p>\n<p>Not only will you have issues finding someone willing to come on board, but you may meet some resistance from the individual or their families if they are unfamiliar or uncomfortable with such a forward-thinking approach to currency and payment for their services.</p>\n<p>&#160;</p>\n<h2><strong>Tax &amp; Increasing Regulations</strong></h2>\n<img class=\"wp-image-25001 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/cryptocurrency-for-nomads-3.jpg\" alt=\"cryptocurrency for nomads 3\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>There is still quite a bit of confusion in many countries regarding how cryptocurrency should be categorized and taxed.</p>\n<p>If it were up to most folks involved in cryptocurrency, Bitcoin and other crypto ownership would remain anonymous.</p>\n<p>The way Bitcoin and other cryptocurrencies are designed, there are no account numbers, names, social security numbers, or any identifying features connected to your account. However, this has not stopped governments from insisting that you tell them about your crypto-holdings</p>\n<p>In the United States, there are several laws coming down the pipe that could affect anyone holding cryptocurrencies. In fact, for folks with quite a bit of wealth stored in Bitcoin, being a US citizen could be a very costly situation.</p>\n<p>I recently worked with a couple of guys who are big into cryptocurrency and, while their offshore plans were simple in many ways, the big elephant in the room was that they were US citizens.</p>\n<p>It was an obstacle that kept us from making substantial progress because new laws in the US will force US persons to disclose their Bitcoin holdings just as FATCA forces the disclosure of foreign bank accounts.</p>\n<p>And this does not only apply to individuals. Recently, the IRS prevailed against <a href=\"https://www.coinbase.com/\">CoinBase</a> in a ruling that stated that the company has to report anyone who has an account with them worth $20,000 or more. There are, no doubt, many people who hold their money in CoinBase who have millions of dollars in Bitcoin and the IRS wants to know so that they can impose substantial capital gains or ordinary income tax on their Bitcoin holdings.</p>\n<p>The challenge that makes Bitcoin so difficult is that it can be targeted by so many different types of tax. It could qualify for<a href=\"http://nomadcapitalist.com/2014/04/06/top-5-expat-friendly-countries-with-no-capital-gains-taxes/\"> capital gains taxes</a>, but it could also qualify for ordinary income if you are trading it, and if you run a business that involves Bitcoin, it could potentially qualify for business income tax as well.</p>\n<p>The US government is always going to say that cryptocurrencies support money laundering and terrorism so, of course, they&#8217;re going to come down like a ton of bricks. But now they are also coming in with the tax component and a lot of people are going to be in a world of hurt when this new law comes into effect.</p>\n<p>Now, like with many things, what you have already done in the past may not be fixable. If you&#8217;ve incurred a lot of capital gains that you have not paid, there&#8217;s probably not a lot you can do to go back and fix that. But, going forward, <a href=\"http://nomadcapitalist.com/2017/04/21/how-choose-best-second-passport/\">having a second passport</a> is going to be very important for Bitcoin owners and investors &#8212; really, of any citizenship, but especially US citizens &#8211; who want to get out from under the tax burden their government is about to impose.</p>\n<p>There are many <a href=\"https://www.youtube.com/watch?v=LU-bMcYhsH0\">ways that you can get a second passport</a> in a short amount of time and, if you are successful with your Bitcoin investments, even the $1 million price tag for <a href=\"http://nomadcapitalist.com/2016/06/20/best-citizenship-by-investment-programs/\">European citizenship by investment</a> may not be a problem for you.</p>\n<p>2018 will be a year when Bitcoin starts to really show up on the radar of the IRS and other tax authorities in a bigger and bigger way. This is why, especially if you are a US citizen, it is worth having a second passport so that you can get out if things get even worse. And, with the recent price drops, now may be the perfect time to get out.</p>\n<p>&#160;</p>\n<h2><strong>The Silver Lining of Crypto Price Drops</strong></h2>\n<img class=\"wp-image-25002 size-full\" src=\"http://nomadcapitalist.com/wp-content/uploads/2018/03/cryptocurrency-for-nomads-4.jpg\" alt=\"cryptocurrency for nomads 4\" width=\"700\" height=\"467\"><p>&#160;</p>\n<p>As mentioned earlier, Bitcoin <a href=\"https://www.telegraph.co.uk/technology/2018/03/14/bitcoin-drops-month-low-google-bans-cryptocurrency-adverts/\">suffered a rather large loss</a> following its peak valuation in December 2017 of over $19,000 USD. However, there is a silver lining for those who have yet to get out of their current tax situation.</p>\n<p>If you&#8217;re looking to get into the Nomad Capitalist lifestyle, the drop in cryptocurrency prices may actually be a good thing for you.</p>\n<p>One thing that people often ask me is <strong>how to avoid tax on their cryptocurrency gains?</strong></p>\n<p>Someone with $100,000 now can easily expect that amount to increase to $500,000 or even $1-2 million in the next six months and it would be a rather unfortunate situation if you had to pay tax on all of that.</p>\n<p>But here&#8217;s the truth: If you&#8217;re living in your home country (whether it&#8217;s the US, the UK, Australia, or wherever), eventually, you&#8217;re going to have to pay capital gains tax on any gains you make with cryptocurrencies.</p>\n<p>Whether it&#8217;s long- or short-term, you&#8217;re going to have to pay. And if you want to leave your home country&#8217;s tax situation, when you leave, chances are you&#8217;re going to have to pay a one-time exit tax, too.</p>\n<p>If you&#8217;re a US citizen, the only way to get out of tax obligations for passive investments is to <a href=\"http://nomadcapitalist.com/expatriation/\">renounce your US citizenship</a> (and you will still have to pay the exit tax if you&#8217;re over a certain net worth). For everyone else, the way to do it is to become tax non-resident in your home country.</p>\n<p>And many of those countries, like Australia, have an exit tax similar to the US when you are deemed a non-resident. You may be able to avoid some of those fees, but in most cases, it is better to pay them upfront if you have crypto-holdings.</p>\n<p>But here&#8217;s why the decline in prices is good for a lot of people: if you&#8217;re looking to get out of a tax situation and you&#8217;re priming yourself for big gains in the future, you want to reduce the base on which you&#8217;re paying that exit tax.</p>\n<p>So, a couple months ago when you had $19,000 Bitcoin, if you would have<a href=\"http://nomadcapitalist.com/2018/01/17/renounce-us-citizenship-ultimate-guide/\"> renounced your US citizenship</a> on that large base, you would have taken a big long- or short-term capital gains hit. Now that bitcoin is about half that price, you have effectively reduced your base by half.</p>\n<p>Even better, for some (especially in the United States) this may also mean that your net worth is now low enough that you won&#8217;t need to pay any exit tax at all. And, even if you have to pay a one-time tax, it will be lower.</p>\n<p>The best news of all is that once you pay whatever fee you are required to pay, you are free. Whether you still hold your Australian, Canadian, or other western passport and you are now tax non-resident, or whether you have renounced your US citizenship, you can now go somewhere where you do not have to pay tax and you can set up an entire global strategy.</p>\n<p>The lower Bitcoin prices have reduced your cost to get out, and any of the upside, once you&#8217;re out, is all yours. So, if you think that Bitcoin is going to go up to $40,000, you should see the price drop to $10,000 USD as your opportunity to get out before Bitcoin begins its steady climb to the top.</p>\n<p>I know you may be licking your wounds a little bit because you feel like you have less money now than you did a few months ago, but now is the time to regroup and get things in order for your global plan and start your <a href=\"http://nomadcapitalist.com/lifestyle-design/\">Nomad Capitalist lifestyle</a> at a great discount and enjoy all the gains from here on out, tax-free.</p>\n<p class=\"et_social_bottom_trigger\"></p> </div>","title":"How to Use an Offshore Company for Cryptocurrency Tax Benefits"}},"pageContext":{"id":"5b92397187be0583cfde6803"}}