{"data":{"mongodbDatabaseArticles":{"id":"5b95eeb587be0583274900ee","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">A Life Changing E-mail</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>So, how did we do this, huh? &#160;Why did this life-changing idea even come about. &#160;What on earth was going through our heads to make us want to give it all up? &#160;Well, partly because Chris was daydreaming and surfing the web at the office when he should have been working.<br>\n<strong></strong></p>\n<h2><p>A Simple Life in Thailand</p></h2>\n<p>No jobs. No debt. All the time in the world. Spending time with each other. Oh, and with our cat.</p>\n<p>The first time the idea of living in another country crossed our minds was in May 2011. I was introduced to Chiang Mai, Thailand in July 2011, with Chris&#8217;s email:</p>\n<p><i>Hey Sweetie,</i></p>\n<p>Check out this site. This community seems awesome! Check out the pics, etc.<br>\nhttp://www.thesparesorts.net/residence-investment/why-chiang-mai (this link has since been discontinued)<i></i></p>\n<p>The 2 bedroom villa is $139,986 (1270sq ft)&#8230;and the one bedroom is between $82,000 and $108,000 (914sq ft)</p>\n<p>On the resort they have pulls, spa services, one of the worlds top 50 restaurants, an organic farm, etc.</p>\n<p>Love,<br>\nChris</p>\n<p>The thought of buying a condo in a foreign Asian city for $100-$150k sounded daring, but intriguing. Where could we get something like that in the States? To put it in perspective, a similar place in Northern Virginia would have cost $400-$500k. And what else does NoVA have to offer? Well, some very wonderful things on top of the incredibly overpriced cost of living, mind-numbing traffic, and the constant demand by social media to buy things that are bigger, better, faster, etc. And to be honest, all of that was starting to get old.</p>\n<h2><p>Call it a Mid-Life Crisis </p></h2>\n<p>Ok, not really, because we really hope we live longer than 50. &#160;But really, we both realized that there is more to life than spending 40+ hours a week working, slowly building up a retirement fund, while wasting away our healthiest years sitting in a cubicle. Not only do we not know what our retirement age will be, but saving for retirement is in itself a gamble because it is based on the assumption that we will be physically capable of traveling when we are finally free to do so. We asked ourselves, why wait? What are we afraid of?</p>\n<p>So we dove deeper and did our research. Some <i>serious and meticulous </i>research. We zeroed in on Chiang Mai and figured out what we needed to do to get there. The idea to move over-seas started out just for fun, almost casual. We changed our lifestyle bit by bit. We started spending a little less, saving a little more, and stared selling some of our belongings. Then it sort of snowballed.</p>\n<p>And here we are.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"A Life Changing E-mail"}},"pageContext":{"id":"5b95eeb587be0583274900ee"}}