{"data":{"mongodbDatabaseArticles":{"id":"5b95ef7987be058327490114","content":"<div><h2><p id=\"REDESIGN_GOALS\"><p>REDESIGN GOALS</p></p></h2>\n<p>We had several reasons for redesigning our blog. We wanted a more attractive and user-friendly site that WOWed anyone who came across it. Plus, we wanted to make it easier to browse our content all while loading in a snap.</p>\n<h3><p id=\"01_Sleek_Professional_Look_with_a_Responsive_Theme\"><strong><p>01 </p><p>Sleek, Professional Look with a Responsive Theme</p></strong></p></h3>\n<p><strong>It was time our blog received a virtual makeover.</strong> Since first slapping a basic design on it nearly three years ago, it was time we upgraded to a <a href=\"https://www.tielandtothailand.com/recommends/elegant-themes/\" target=\"_blank\" rel=\"nofollow noopener\">premium WordPress theme</a>. Sure, our site has tons of information but it bothered us that it didn&#8217;t have a quality look. We opted for a sleek landing page, a wider layout to showcase our pictures (we had so much wasted space on the sides!) and a responsive theme that looks great whether you&#8217;re viewing our site on a PC, tablet, or a smart phone.</p>\n<h3><p id=\"02_Streamlined_Navigation\"><strong><p>02 </p><p>Streamlined Navigation</p></strong></p></h3>\n<p>While we believed that portions of our site were easy to navigate, there were other parts that were severely neglected. <strong>We wanted to make sure that our readers, whether dedicated followers or new, were able to find exactly what they were looking for intuitively.</strong> We merged some of the older categories together (ones that had only a few articles each) while the other overly saturated categories were expanded out.</p>\n<h3><p id=\"03_Speedy_Load_Time\"><strong><p>03 </p><p>Speedy Load Time</p></strong></p></h3>\n<p>We noticed our old blog lagged in load time. As in over 10 seconds to load at one point not too long ago. How embarrassing! We, too, are guilty of clicking off pages that don&#8217;t load within a few seconds, so we knew we were losing readers. <strong>Our new theme loads in a snap</strong>, so you&#8217;ll have near immediate access to our content anytime you visit.</p>\n\t\t\t\t</div>","title":"We Made Some Big Changes"}},"pageContext":{"id":"5b95ef7987be058327490114"}}