{"data":{"mongodbDatabaseArticles":{"id":"5b9248cc87be056953db7bf5","content":"<div><p>After <a href=\"http://levels.io/co-working-spaces-in-bangkok-hubba/\">discovering Bangkok's most famous co-working space HUBBA</a> and working there for a few days, I decided to check out other spaces too. After HUBBA, the second most popular is Launchpad, they are stationed <a href=\"http://goo.gl/maps/ymEbD\">around the Surasak BTS Skytrain station</a>.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"100%\"><img src=\"https://levels.io/wp-content/uploads/2013/05/LAUNCHPAD-logo-medium.png\" width=\"100%\"> <p>Launchpad is housed in a large office building and hard to miss as their name is written on the first floor window in huge letters. I quickly went inside but to my shock it looked dark inside and there was no one there. </p> <img src=\"https://levels.io/wp-content/uploads/2013/05/705272_496169157087316_1219175288_o.jpg\" alt=\"705272_496169157087316_1219175288_o\" width=\"100%\" class=\"alignnone size-full wp-image-762 responsively-lazy\"> <p>By sheer conincidence, Launchpad's co-founder Vince just came walking by and asked me if I was here to buy a sandwich. Well I love sandwiches but I was mostly here to work. Vince told me that Launchpad was closed due to the May 1 Thai holiday of Worker's Day. Nonetheless, Vince gave me a private tour of Launchpad's office.</p> <img src=\"https://levels.io/wp-content/uploads/2013/05/launchpad.jpg\" width=\"100%\" class=\"alignnone size-full wp-image-764 responsively-lazy\"> <p>Launchpad is absolutely huge compared to other spaces. It has two floors and looks pretty much like any big San Francisco or Silicon Valley startup. There's probably space for about 200 desks, there's lot of beanbags and couches, silent rooms and they even have a game room! Many of their rooms feature (fake) grass carpeting which make the rooms more fun to work in. A small coffee place (with those sandwiches!) features near the entrance. </p> <img src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\" width=\"300\" height=\"135\" class=\"alignnone size-full wp-image-770 sl_lazyimg\"><img src=\"https://levels.io/wp-content/uploads/2013/05/2013-05-01-Launchpad-speed-2680431226.png\" width=\"300\" height=\"135\" class=\"alignnone size-full wp-image-770\"> <p>They have a constant 20mpbs up and 20 mbps down (!) connection. That upload rate is ridiculously high</p> <img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_1935-1024x764.jpg\" class=\"alignnone size-large wp-image-859 responsively-lazy\" width=\"100%\"> <p>I also met Launchpad's other founder Sam. Vince and Sam seem like two really cool internationally-minded people.</p> <img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_1934-1024x764.jpg\" width=\"100%\" class=\"alignnone size-large wp-image-812 responsively-lazy\"> <p>After seeing Launchpad from the inside, I was preparing to get kicked out since they were closed today, but Vince &amp; Sam were so sweet to let me work here anyway. Great because otherwise I'd be stuck in some Starbucks with shitty WiFi and overpriced coffee again. After work they took me out for lunch. How cool is that? You come in to a random place in the world, visit a space like this, they're closed and they let you work for free and take you out for lunch. The sweetest bunch of people ever!</p> <img src=\"https://levels.io/wp-content/uploads/2013/05/IMG_1944-1024x764.jpg\" width=\"100%\" class=\"alignnone size-large wp-image-858 responsively-lazy\"> <p>Launchpad is very distinct from HUBBA. Where HUBBA tries to be more like a small communal 'hub' to build a Thai startup environment, Launchpad is more international and business-oriented. HUBBA is more for the startup 'scene' where Thai people like to shoot ideas across the room and build a community, where Launchpad is more about building and growing your company.</p> <p>Now that I had a place to work, I still needed to know <a href=\"http://levels.io/bangkok-dive-bar-cheap-charlies-roof-top-bar-above-11/\">where to have fun during Bangkok's nights! &#187;</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Co-working spaces in Bangkok: Launchpad"}},"pageContext":{"id":"5b9248cc87be056953db7bf5"}}