{"data":{"mongodbDatabaseArticles":{"id":"5b95edfb87be0583274900c2","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">First Impressions of Koh Tao</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-18604\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/First-Impressions-of-Koh-Tao-1000px.png?resize=1000%2C550&amp;ssl=1\" alt=\"First Impressions of Koh Tao, Thailand\" width=\"1000\" height=\"550\"><br>\nIf you told us this time last month we&#8217;d have our toes in the sand at Koh Tao we wouldn&#8217;t have believed you. That&#8217;s because we&#8217;ve never been really drawn there. But things changed when we were invited by&#160;the Tourism Authority of Thailand to see the island&#8217;s efforts in sustainable tourism. Rather than turn down the opportunity to go to a place we hadn&#8217;t visited yet, we decided to check out this &#8216;good news story&#8217; and share our first impressions of Koh Tao, Thailand with our readers.</p>\n<p>First and foremost, Koh Tao is gorgeous. The island is pristine, it&#8217;s easy to get around, and it&#8217;s buzzing with activity. It also happens to be the place to get your PADI certification and see some of the world&#8217;s most beautiful reefs and marine creatures.</p>\n<p>We visited Koh Tao in the middle of the rainy season (July) but all we saw were clear skies.</p>\n<p>We had a bumpy start: after arriving at the Mae Haad Pier and hopping off the ferry, we pushed through an endless crowd of bare-skinned tourists hauling backpacks and weathered Thai men shouting, &#8220;Where you go?&#8221; right in our faces. It was an overwhelming five minutes, but then we were in our ride and off to explore the island!</p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"pinit aligncenter wp-image-18635 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/First-Impressions-of-Koh-Tao-Pinterest-New.png?resize=400%2C609&amp;ssl=1\" alt=\"Here are our first impressions of Koh Tao, the tiny island in the Gulf of Thailand best known for diving, and its infrastructure, beaches, safety and more. | Tieland to Thailand\" width=\"400\" height=\"609\"></p>\n<h2><p id=\"A_Growing_Infrastructure\"><p>A Growing Infrastructure</p></p></h2>\n<p><img class=\"aligncenter wp-image-18617 size-full\" title=\"Boats of Tanote Bay Koh Tao Thailand\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Drone-Tanote-Bay-Beach-Koh-Tao.jpg?resize=1000%2C562&amp;ssl=1\" alt=\"Drone Boats Tanote Bay Koh Tao Thailand\" width=\"1000\" height=\"562\"></p>\n<p>It&#8217;s clear that the diving tourism has been good to Koh Tao. The clean, concrete streets looked brand new as did many of the shops, restaurants, and hotels. In fact, many of the businesses along the main roads looked inviting and well-kept and reflected better building quality and trendier decorations than other beach towns we&#8217;ve been to.</p>\n<p><img class=\"aligncenter wp-image-18618 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Roads-Koh-Tao-Thailand.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Roads Koh Tao Thailand\" width=\"1000\" height=\"563\"></p>\n<p>We saw loads of shop signs advertising:</p>\n<ul>\n<li><p>Clinics and pharmacies that treat scrapes, sunburns, and tummy problems</p></li>\n<li><p>Motorbike rental shops with pricing starting as low as 150 THB (5 USD) per day</p></li>\n<li><p>Cafes serving espresso drinks (rather than the infamous instant 3-in-1 coffee)</p></li>\n<li><p>ATMs to conveniently grab cash when we needed to without hunting for an ATM or worrying about bringing stacks of cash with us</p></li>\n</ul>\n<p>Given that we visited right in the middle of the rainy season, shops and restaurants had the light buzz of customers. People were out and about driving around on motorbikes or walking along the streets. We had expected it to be rather quiet but it was definitely not.</p>\n<p>Wifi connection was reliable in our hotel. Although dtac&#8217;s cell phone coverage was not good, TrueMove had a solid 4G connection throughout the island.</p>\n<p><img class=\"aligncenter wp-image-18619 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Pier-Koh-Nang-Yuan-Thailand.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Pier Koh Nangyuan Thailand\" width=\"1000\" height=\"563\"></p>\n<p><strong>As far as getting to around Koh Tao, the island provides solid, reliable methods (ferries, taxis, and motorbikes) with no added frills.</strong> However,&#160;given Koh Tao&#8217;s proximity to the nearest airports (Chumphon Airport on the mainland and Koh Samui Airport on a neighboring island), it is one of the least accessible islands we&#8217;ve ever been to.&#160;That&#8217;s because visitors are at the mercy of the ferries&#8217; schedules, which don&#8217;t exactly line up well with train or flight schedules. D&#8217;oh! Let&#8217;s just say, there&#8217;s a lot of waiting involved getting to and from the island.</p>\n<h2><p id=\"Things_to_Do_on_Koh_Tao\"><p>Things to Do on Koh Tao</p></p></h2>\n<p><img class=\"aligncenter wp-image-18620 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Drone-Dive-Boats-Koh-Tao-Thailand.jpg?resize=1000%2C562&amp;ssl=1\" alt=\"Drone Dive Boats Koh Tao Thailand\" width=\"1000\" height=\"562\"></p>\n<p>The top thing to do on Koh Tao is to get your PADI certification and go scuba diving. And there 84 dive schools to choose from! This island is arguably among the most popular places in the world (and most affordable, too). We were told it pumps out 100,000 certified divers each year.</p>\n<p>A few diving companies that we came across during our time there were Ban&#8217;s Diving Resort, Big Blue Diving, Goodtime Adventure, and Roctopus Dive.</p>\n\n\n\n<p><strong>TIP:</strong></p> The best diving months are in January through May. If you want to swim with whale sharks, come in February. Monsoon season is in October and November.\n\n\n\n<p>When you&#8217;re not diving, there are several great natural sites and outdoor activities to keep you occupied. Get ready to watch sunrises and sunsets from the dozen or so beaches, go sunbathing, ocean kayaking, shooting at a gun range, and rock climbing.&#160;Some of the best snorkeling can be found in Hin Wong Reef.</p>\n<p><img class=\"aligncenter wp-image-18621 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Kayak-Koh-Tao-Thailand.jpg?resize=1000%2C621&amp;ssl=1\" alt=\"Kayaking Koh Tao Thailand\" width=\"1000\" height=\"621\"></p>\n<p>There are many opportunities to hike and visit viewpoints on Koh Tao, too. There are:</p>\n<ul>\n<li><p>Love @ Khao Tao Viewpoint</p></li>\n<li><p>Mango Bay Viewpoint</p></li>\n<li><p>Two View</p></li>\n<li><p>Chalok Viewpoint</p></li>\n<li><p>John Suwan Viewpoint</p></li>\n<li><p>Koh Nang Yuan Viewpoint</p></li>\n</ul>\n<p>It&#8217;s great for those who need a break from scuba diving and would prefer a little fresh, uncompressed air.</p>\n<p><img class=\"aligncenter wp-image-18622 size-full\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Drone-Shot-Koh-Nang-Yuan-Near-Koh-Tao-Thailand.jpg?resize=1000%2C562&amp;ssl=1\" alt=\"Drone Shot Koh Nang Yuan Near Koh Tao, Thailand\" width=\"1000\" height=\"562\"></p>\n<p>We didn&#8217;t have the opportunity to stay out too late because our days were full and started early. However, from what we did experience until around 9 pm, there is a decent selection of colorful bars playing the latest pop and rock music. Although the island is generally quiet during the day, it ramps up at night when everyone returns from diving. The 20s-something crowds were sipping on buckets, local beers, and tropical cocktails. There&#8217;s also a Koh Tao Pub Crawl on Mondays, Wednesdays, and Fridays. Fire dancers put on shows long after the sunset, too.<strong>&#160;</strong></p>\n<h2><p id=\"Ecotourism_Movement_Toward_Sustainability\"><p>Ecotourism Movement Toward Sustainability</p></p></h2>\n<p><img class=\"aligncenter wp-image-18623 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Sairee-Beach-Cleanup-Koh-Tao.jpg?resize=1000%2C650&amp;ssl=1\" alt=\"Sairee Beach clean up on Koh Tao, Thailand\" width=\"1000\" height=\"650\"></p>\n<p>Koh Tao is best known for its diving. But one thing that this trip brought to light was Koh Tao&#8217;s sustainability efforts and all the businesses that are collectively reducing their negative impact on the environment.</p>\n<p>This teeny tiny island in Thailand&#8217;s Gulf has nearly a half million tourists visit every year. And along with that comes a lot of waste. Construction and packaging waste. Food waste. Bathroom waste, too. But businesses on this island seem to be ahead of the game and are actively keeping Koh Tao clean and beautiful by encouraging visitors to leave less of a footprint.</p>\n<p><img class=\"aligncenter wp-image-18624 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Recycle-Koh-Tao-Thailand.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Recycle glass, plastics, and cans Thailand\" width=\"1000\" height=\"563\"></p>\n<p>Trash Hero Koh Tao is one of the prominent non-profit organizations keeping the island spotless for future visitors. Their message encourages everyone &#8211; tourists and local Thais alike &#8211; to &#8220;Get involved.&#8221; They tackle sustainability issues two-fold:&#160;By arranging beach and reef clean-up campaigns to reduce waste as well as encouraging people to change their behavior and not use one-time-use plastic straws, plastic water bottles, and plastic bags.</p>\n<p><img class=\"aligncenter wp-image-18625 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Bans-Diving-Resort-Koh-Tao-Thailand.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Bans Diving Resort Koh Tao, Thailand\" width=\"1000\" height=\"563\"></p>\n<p>Koh Tao&#8217;s hotels are involved in this effort, too. We stayed at <a title=\"Ban's Diving Resort on Koh Tao\" href=\"https://www.agoda.com/ban-s-diving-resort/hotel/koh-tao-th.html?cid=1608701\" target=\"_blank\" rel=\"noopener\">Ban&#8217;s Diving Resort</a> and they compost vegetable and fruit scraps, sort recyclables, purify and reuse gray water, and even have a building dedicated to converting other organic waste into soaps and detergents. It was Angela&#8217;s chemical engineering dream come true (are you hiring?!) They also have organic gardens that supplement their restaurants.</p>\n<h2><p id=\"First_Impressions_of_Koh_Tao8217s_Beaches\"><p>First Impressions of Koh Tao&#8217;s Beaches</p></p></h2>\n<p><img class=\"aligncenter wp-image-18626 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Drone-ao-leuk-beach-koh-tao.jpg?resize=1000%2C562&amp;ssl=1\" alt=\"Drone Ao Leuk Beach Koh Tao, Thailand\" width=\"1000\" height=\"562\"></p>\n<p>What can we say? With all the beach cleanups and recycling programs, they are stunning. <strong>Koh Tao is a picture-perfect island of white sands, aquamarine waters, and palm trees caressing its coastline.</strong> When we think back to what we&#8217;d picture Thailand&#8217;s beaches, Koh Tao is where we&#8217;d image ourselves staying in a beachside hut and lying in a hammock listening to the surf and feeling the breeze on our skin.</p>\n<p><img class=\"aligncenter wp-image-18627 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Chairs-Ao-Leuk-Beach-Koh-Tao.jpg?resize=1000%2C595&amp;ssl=1\" alt=\"Beach Chairs Ao Leuk Beach Koh Tao\" width=\"1000\" height=\"595\"></p>\n<p>We visited a half-dozen beaches during our trip. Sai Daeng and Ao Chalok Ban Kao were peaceful and empty. Sairee Beach, Ao Luek, and Tanote Beach had some small crowds but we could imagine that it&#8217;d be quite packed during the high season. All were gorgeously white and the water was so clear you&#8217;d have to visit yourself to believe it.</p>\n<p><img class=\"aligncenter wp-image-18628 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Ao-Chalok-Beach-Koh-Tao.jpg?resize=1000%2C667&amp;ssl=1\" alt=\"Ao Chalok Ban Kao on Koh Tao, Thailand\" width=\"1000\" height=\"667\"></p>\n<p>One thing that really stood out about the sand was that, although beautiful in brightness and color, it was sometimes uncomfortable under our bare feet. Instead of finely polished grains, many of the beaches contained sharp fragments of bleached coral. Be sure to keep your flip-flops on, although the beach at Chaloke Harbor was soft to walk on.</p>\n<h2><p id=\"Is_Koh_Tao_Safe\"><p>Is Koh Tao Safe?</p></p></h2>\n<p>The other reason we went on this trip was out of curiosity over the island&#8217;s safety. Koh Tao has gotten a bad rap in recent years because there have been several suspicious tourist deaths. Although travelers die every year in popular tourist destinations, it was how these deaths were handled by the local authorities that make travelers uneasy.</p>\n<p><img class=\"aligncenter wp-image-18629 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Dangerous-Koh-Nang-Yuan-Thailand.jpg?resize=1000%2C575&amp;ssl=1\" alt=\"Be Careful! Sign on Koh Nang Yuan near Koh Tao, Thailand\" width=\"1000\" height=\"575\"></p>\n<p>Although the latest incident was three years ago, we thought it was strange to see no police presence on the island aside from the handful of officers at the Mae Haad Pier when we first arrived. This is different from any other touristy town we&#8217;ve visited, beach or not. Also, we were surprised to hear that there are only two English-speaking tourist police officers.</p>\n<p>That being said, we had the chance to speak with organizers and hotel owners who have lived on the island about the incidents. Several have lived on the island for years and they said they felt safe and never had any incidents.</p>\n<p><img class=\"aligncenter wp-image-18631 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Young-Women-Beach-Koh-Tao-Thailand.jpg?resize=1000%2C563&amp;ssl=1\" alt=\"Young Women Beach Koh Tao Thailand\" width=\"1000\" height=\"563\"></p>\n<p>We spent two nights on the island and felt safe. We encourage visitors to take the following precautions to reduce the chances of getting hurt or in trouble:</p>\n<ul>\n<li><span><a></a><p>If you rent a motorbike, take photos of all scratches, give a photocopy of your passport (not the original), ALWAYS wear your helmet, have a motorcycle International Driver Permit, and travelers insurance (like <a class=\"thirstylink\" title=\"World Nomads\" href=\"https://www.tielandtothailand.com/recommends/world-nomads/\" target=\"\" rel=\"nofollow\">World Nomads</a> </p></span></li>\n<li><p>Travel at night in groups (more than one other person when possible) and never walk alone</p></li>\n<li><p>If you go exploring alone by day, check in with a hotel staff member or a friend who knows your whereabouts</p></li>\n<li><p>Don&#8217;t drink buckets. It&#8217;s easy to underestimate how much alcohol you consume. Sadly, it is also an open invitation to have your drink drugged &#8211; for both men and women</p></li>\n<li><p>Wear life jackets on the speedboats whether or not you can swim</p></li>\n</ul>\n<h2><p id=\"Our_Final_Thoughts\"><p>Our Final Thoughts</p></p></h2>\n<p><img class=\"aligncenter wp-image-18632 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Drone-Tanote-Bay-Koh-Tao.jpg?resize=1000%2C562&amp;ssl=1\" alt=\"Drone Tanote Bay Beach Koh Tao, Thailand\" width=\"1000\" height=\"562\"></p>\n<p>Koh Tao is clean and beautiful and we love that many of its businesses are actively reducing their environmental impact. It gives us a warm and fuzzy feeling knowing that money spent on this island goes toward the sustainable tourism movement.</p>\n<p>We can absolutely see the appeal in the island from a diver&#8217;s perspective. We can see why it&#8217;s popular to stay a month, get PADI certified, and explore the coral reefs around the island.</p>\n<p>We&#8217;d like to see more English-speaking tourist police there and a hospital in case something serious happened.</p>\n<p>We probably won&#8217;t be rushing back to Koh Tao anytime soon. Neither of us has an interest in diving and it&#8217;s just too far away to go there for a casual beach vacay. However, we&#8217;re glad to have seen it first hand and would recommend it to anyone who wants to experience world-class diving and snorkeling.</p>\n<p><strong>Is Koh Tao on your bucket list or are you afraid to visit? If you&#8217;ve been there before, what were your thoughts on Koh Tao?</strong></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"First Impressions of Koh Tao"}},"pageContext":{"id":"5b95edfb87be0583274900c2"}}