{"data":{"mongodbDatabaseArticles":{"id":"5b937af287be056953db7cf6","content":"<div><h1 name=\"b1f3\" id=\"b1f3\" class=\"graf graf--h3 graf--leading graf--title\">10 Signs That Your Digital Nomad Guru or Advisor Is a&#160;Crackpot</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*0kQIFOccEmAkMZXYmNH_JA.jpeg\">I&#8217;d probably enjoy hanging out with this person but I wouldn&#8217;t pay for their advice on protective headgear.<p name=\"b8a8\" id=\"b8a8\" class=\"graf graf--p graf-after--figure\">Free advice. Paid advice. There&#8217;s so much advice out there on the internet that you&#8217;d be hard pushed to make a sensible decision on who is full of &#8220;incredible action points&#8221; and who is full of crap. So let&#8217;s bottom this out shall we?</p><h3 name=\"5dbb\" id=\"5dbb\" class=\"graf graf--h3 graf-after--p\">Sign Number One&#8202;&#8212;&#8202;They Make Ridiculous Promises Regarding Work&#160;Hours</h3><p name=\"b669\" id=\"b669\" class=\"graf graf--p graf-after--h3\">Let&#8217;s get this straight. Tim Ferris works more than 4 hours a week, a lot more than 4 hours a week. He spins this work as &#8220;not really work because I like it&#8221; but if you&#8217;re going to be a digital nomad&#8202;&#8212;&#8202;you probably ought to choose work you like anyway.</p><p name=\"8314\" id=\"8314\" class=\"graf graf--p graf-after--p\">Work is work. That is, by definition, something you do for other people when you could be spending that time on yourself.</p><p name=\"ac17\" id=\"ac17\" class=\"graf graf--p graf-after--p\">You are not going to make $1 million dollars a year in less than 4 hours a week unless you already have millions more dollars that you can invest. If you had $100 million dollars, you could walk into a bank, open an interest bearing account and wait a year. You&#8217;d have worked no time at all for your $1 million.</p><p name=\"847e\" id=\"847e\" class=\"graf graf--p graf-after--p\">The rest of us have to work. You can, of course, choose to minimize your life. If you can earn $100 an hour and you only need $800 to live on&#8202;&#8212;&#8202;you can work 8 hours a month. But you&#8217;re not &#8220;crushing it&#8221;, you&#8217;re not &#8220;living like a king&#8221; at this point, you&#8217;re surviving. That&#8217;s cool. This movement is about making your own choices. It&#8217;s not cool if you&#8217;re misrepresenting this.</p><p name=\"1218\" id=\"1218\" class=\"graf graf--p graf-after--p\">If you want a simple test of the reality of an idea. Simply find 100 successful examples of the idea in practice. If you can work 4 hours a week and make a six-figure salary, then there should be other people doing it, right? Tim&#8217;s book has sold over 1.4 million copies. That&#8217;s a lot of people who wanted that 4 hour work week, it should be a doddle&#8202;&#8212;&#8202;if those people succeeded&#8202;&#8212;&#8202;to find 100 examples of that success. Go look, you won&#8217;t find them.</p><p name=\"b284\" id=\"b284\" class=\"graf graf--p graf-after--p\">If you read the book&#8202;&#8212;&#8202;you&#8217;ll quickly come to understand why. Tim&#8217;s headline is a marketing decision. The book was almost called &#8220;how to sell drugs and get away with it&#8221; because that was an even more popular Google search term with no real competition.</p><p name=\"c0f4\" id=\"c0f4\" class=\"graf graf--p graf-after--p\">Don&#8217;t get me wrong, there&#8217;s plenty of good material in Tim&#8217;s book&#8202;&#8212;&#8202;it&#8217;s just that whole 4 hour workweek thing is pure marketing guff.</p><h3 name=\"63e1\" id=\"63e1\" class=\"graf graf--h3 graf-after--p\">Sign Number Two&#8202;&#8212;&#8202;They Tell You That You Won&#8217;t Need to Spend&#160;Money</h3><p name=\"3b5e\" id=\"3b5e\" class=\"graf graf--p graf-after--h3\">You don&#8217;t need to spend a lot of money to start a business but unless somebody hands you an existing business for free or a bunch of free stock&#8202;&#8212;&#8202;you&#8217;re going to have to spend some.</p><p name=\"be0e\" id=\"be0e\" class=\"graf graf--p graf-after--p\">More importantly, whilst setting up a business can be low cost&#8202;&#8212;&#8202;running one generally isn&#8217;t. Those &#8220;free marketing tools&#8221;? They&#8217;re worth roughly what you pay for them and in some cases they&#8217;re worth much less.</p><p name=\"4df5\" id=\"4df5\" class=\"graf graf--p graf-after--p\">If you want to start a business online, for example, (and let&#8217;s be fair that&#8217;s what digital nomads do) you can buy a web domain pretty cheaply and you can buy hosting cheaply too. That&#8217;s got you online. Now, you just need people to find your website.</p><p name=\"54fb\" id=\"54fb\" class=\"graf graf--p graf-after--p\">You have two main options here (there are other options but they&#8217;re all variations on a theme):</p><p name=\"1d4d\" id=\"1d4d\" class=\"graf graf--p graf-after--p\">1. <strong class=\"markup--strong markup--p-strong\">You can decide that SEO (search engine optimization) is the way to go and you&#8217;ll do it yourself because that&#8217;s &#8220;free&#8221;.</strong> Good luck with that. Keyword ranking is competitive. Very competitive. Google wants to see a site with lots of content, with keywords used properly and with lots of incoming links to that site. This takes a whole bunch of time and effort to achieve. That&#8217;s time in which you are not getting paid. So whatever your hourly rate is&#8202;&#8212;&#8202;multiply it out by the 20+ hours a week you&#8217;re going to be spending for the next 6&#8211;12 months and that&#8217;s the cost of your &#8220;free&#8221; SEO. Oh and if you didn&#8217;t have much money in the bank to pay yourself for that time&#8202;&#8212;&#8202;you&#8217;re probably broke before your site ranks. Thanks for playing &#8220;free marketing&#8221;.</p><p name=\"1a8a\" id=\"1a8a\" class=\"graf graf--p graf-after--p\">2. <strong class=\"markup--strong markup--p-strong\">You can pay for traffic to help you get started.</strong> But that&#8217;s not free. In fact, it&#8217;s increasingly expensive because in a world where Google gets its algorithm exactly right&#8202;&#8212;&#8202;Google takes all the profits in paid search and leaves you with a token amount. The same is true for Facebook, Twitter, ad networks, etc. You&#8217;ll also need to spend quite a bit of money learning to get this kind of advertising right. Make a mistake and you&#8217;ll be broke before you know it.</p><p name=\"5e96\" id=\"5e96\" class=\"graf graf--p graf-after--p\">Real businesses spend money on equipment (your laptop and software aren&#8217;t &#8220;free&#8221;), they spend money on overhead (your home and your electricity and Wi-Fi aren&#8217;t &#8220;free&#8221;), they invest in marketing, etc.</p><p name=\"8352\" id=\"8352\" class=\"graf graf--p graf-after--p\">You can get started with next to no money but if you want to build a business where you earn a decent living&#8202;&#8212;&#8202;sooner or later you need to invest in that business.</p><h3 name=\"c203\" id=\"c203\" class=\"graf graf--h3 graf-after--p\">Sign Number Three&#8202;&#8212;&#8202;Their Main Income Source Isn&#8217;t From What They&#160;Teach</h3><p name=\"db1b\" id=\"db1b\" class=\"graf graf--p graf-after--h3\">It&#8217;s a bit worrying when a drop shipping &#8220;guru&#8221; makes almost all of their income selling courses about drop shipping. It suggests that they&#8217;re not actually much of a guru.</p><p name=\"998c\" id=\"998c\" class=\"graf graf--p graf-after--p\">This is doubly so when their &#8220;income&#8221; from the thing they teach includes items which aren&#8217;t actually drop shipping. If you sell a website, it&#8217;s not drop shipping income&#8202;&#8212;&#8202;it&#8217;s website sales income.</p><p name=\"7704\" id=\"7704\" class=\"graf graf--p graf-after--p\">If somebody says they&#8217;re going to show you how to make a six or seven figure income from something; they should be doing exactly that themselves. If they&#8217;re not. It seems unlikely you&#8217;re going to learn anything of the sort.</p><h3 name=\"f6d2\" id=\"f6d2\" class=\"graf graf--h3 graf-after--p\">Sign Number Four&#8202;&#8212;&#8202;They Share Dubious Income&#160;Reports</h3><p name=\"74b9\" id=\"74b9\" class=\"graf graf--p graf-after--h3\">I&#8217;m not a fan of income reports. People who have to tell you what they&#8217;re earning to get you to listen to them are usually not very nice people.</p><p name=\"ae0a\" id=\"ae0a\" class=\"graf graf--p graf-after--p\">However, if you think you need an earnings statement from somebody to decide whether to buy their course or not here&#8217;s what to look for:</p><p name=\"76ad\" id=\"76ad\" class=\"graf graf--p graf-after--p\">&#183; <strong class=\"markup--strong markup--p-strong\">A named source of income.</strong> If they&#8217;re not willing to share the details of where their income comes from&#8202;&#8212;&#8202;move on. Don&#8217;t let them spin you about a need for secrecy. Move on. When Joe Bloggs and Son file their accounts (which you would use to make an investment decision) they don&#8217;t hide anything. A guru who hides where they make their money isn&#8217;t a guru&#8202;&#8212;&#8202;they&#8217;re a shyster.</p><p name=\"17aa\" id=\"17aa\" class=\"graf graf--p graf-after--p\">&#183; <strong class=\"markup--strong markup--p-strong\">A full profit and loss breakdown.</strong> Have you ever noticed that the majority of income statements include no costs? Somebody taking in $1 million a year in revenue can still be losing money (and in fact they often are losing money). If they can&#8217;t show you what their costs are and exactly how these costs are allocated&#8202;&#8212;&#8202;it&#8217;s time to move on. Profits are the only thing that matters for a business&#8202;&#8212;&#8202;revenues figures are simply used in their place to distract you from asking hard questions.</p><p name=\"3ef6\" id=\"3ef6\" class=\"graf graf--p graf-after--p\">&#183; <strong class=\"markup--strong markup--p-strong\">A history of profits.</strong> Last month&#8217;s numbers are no use on their own. How long did it take this person to make money? How much money do they make on an average month? What was their biggest loss making month (all businesses lose money at some point or another)?</p><p name=\"1727\" id=\"1727\" class=\"graf graf--p graf-after--p\">&#183; <strong class=\"markup--strong markup--p-strong\">A breakdown of time served.</strong> No business builds itself. How does the self-proclaimed &#8220;guru&#8221; spend their time. What activities do they carry out precisely? What are the expected and measured outcomes of these activities?</p><h3 name=\"b23b\" id=\"b23b\" class=\"graf graf--h3 graf-after--p\">Sign Number Five&#8202;&#8212;&#8202;They Sell Ridiculously Priced Information Products</h3><p name=\"255e\" id=\"255e\" class=\"graf graf--p graf-after--h3\">Back in the days before the internet, an &#8220;information product&#8221; was known as a book or a cassette or a video tape or sometimes a combination of those things. Today, not much has changed. The &#8220;multi-media&#8221; world just means that the book, audio and video are delivered via the Internet rather than in physical format.</p><p name=\"4265\" id=\"4265\" class=\"graf graf--p graf-after--p\">This should help you get a measure of the actual value of information. Go to Amazon. Use their search function to access a book on the topic you&#8217;re looking for a &#8220;guru&#8221; to teach you about. See the costs of that book? It&#8217;ll be somewhere between $1 and $99. That&#8217;s what information products are actually worth.</p><p name=\"cee8\" id=\"cee8\" class=\"graf graf--p graf-after--p\">In fact, as a rule of thumb&#8202;&#8212;&#8202;a course which is purely written should be worth no more than $20. One with audio and video should be worth no more than $100. Sure, these people have brought together information that you can almost certainly find for free using Google and saved you some time and they should be rewarded for that. But there&#8217;s no information product out there that&#8217;s worth $1,000 or more.</p><p name=\"00ad\" id=\"00ad\" class=\"graf graf--p graf-after--p\">This is doubly true in common areas of knowledge. Digital nomad life, dropshipping, blogging, Amazon FBA, etc. these aren&#8217;t tiny niche skills in which a vendor should be charging a lot of money to compensate for low interest and low demand, they&#8217;re mass production skills of the digital age.</p><p name=\"a01f\" id=\"a01f\" class=\"graf graf--p graf-after--p\">Information products aren&#8217;t worth much on their own. Teaching and training are worth something&#8202;&#8212;&#8202;if you get personal input from a teacher or trainer (if it&#8217;s just a video&#8202;&#8212;&#8202;it&#8217;s a book in audio/visual form and nothing more). But information products on their own are pretty worthless. If someone charges more than $100 for information&#8202;&#8212;&#8202;they&#8217;re charging too much.</p><h3 name=\"0fa9\" id=\"0fa9\" class=\"graf graf--h3 graf-after--p\">Sign Number Six&#8202;&#8212;&#8202;They Offer the Forum of the&#160;Blind</h3><p name=\"9eea\" id=\"9eea\" class=\"graf graf--p graf-after--h3\">To help justify the &#8220;guru&#8217;s&#8221; insane charges for information many of these &#8220;gurus&#8221; will create a forum for their (victims) customers to use.</p><p name=\"6af9\" id=\"6af9\" class=\"graf graf--p graf-after--p\">Let&#8217;s be clear about this. When you are brand new to a certain type of business, you can benefit from the input of experienced people in that business to help better shape your business. What you won&#8217;t benefit from is a bunch of other people who are brand new to the game and have as little clue as you do. In fact, you&#8217;re more likely to be misled (by accident or design) by these folks. Their intentions may be good but you can&#8217;t build a business on your soon-to-be competitors intentions.</p><p name=\"fd4d\" id=\"fd4d\" class=\"graf graf--p graf-after--p\">A website forum can be installed for no money. All the content is generated by the users. There&#8217;s no &#8220;value&#8221; in a forum of the blind leading the blind. You should pay exactly what this is worth&#8202;&#8212;&#8202;nothing.</p><h3 name=\"3501\" id=\"3501\" class=\"graf graf--h3 graf-after--p\">Sign Number Seven&#8202;&#8212;&#8202;There Is Guru Saturation</h3><p name=\"3df9\" id=\"3df9\" class=\"graf graf--p graf-after--h3\">If you&#8217;re looking for a guru on a particular topic. Google that topic. If all the top 10 results are gurus selling their services, welcome to guru saturation point.</p><p name=\"96aa\" id=\"96aa\" class=\"graf graf--p graf-after--p\">This is a clear sign that this area of business is no longer profitable. Anybody who once made money has moved on to something else and those that couldn&#8217;t think of anything else are now selling advice on what used to work.</p><p name=\"a2de\" id=\"a2de\" class=\"graf graf--p graf-after--p\">Run and run fast from guru saturation. These &#8220;gurus&#8221; are just failed business people. They could teach you how not to do something but they can&#8217;t teach you how to do anything useful at all.</p><h3 name=\"52fa\" id=\"52fa\" class=\"graf graf--h3 graf-after--p\">Sign Number Eight&#8202;&#8212;&#8202;They Claim to Be Selling&#160;Secrets</h3><p name=\"ce11\" id=\"ce11\" class=\"graf graf--p graf-after--h3\">If a lot of people do a certain type of work, it&#8217;s safe to say there are no &#8220;secrets&#8221; about that kind of work. The stuff most digital nomads do has zero secrets. Drop shipping, blogging, freelancing, Upwork, Mechanical Turk, Amazon FBA, etc. there are no secrets in these business arenas. Anyone selling secrets is straight up lying to you. Avoid them.</p><h3 name=\"3c87\" id=\"3c87\" class=\"graf graf--h3 graf-after--p\">Sign Number Nine&#8202;&#8212;&#8202;Anything of Value Is Behind a&#160;Paywall</h3><p name=\"5d66\" id=\"5d66\" class=\"graf graf--p graf-after--h3\">Credible people demonstrate their value before you pay them. Want to know if Dr. Stephen Hawking has something useful to say? Walk into a bookshop and pick up &#8220;A Brief History of Time&#8221; and read the first chapter or two, nobody will stop you doing this (it&#8217;s why bookshops exist). Now you can make an informed decision as to whether to buy the book or not.</p><p name=\"2364\" id=\"2364\" class=\"graf graf--p graf-after--p\">If every article your would-be &#8220;guru&#8221; writes ends with an invitation to learn something of value by giving them money&#8202;&#8212;&#8202;leave well alone.</p><h3 name=\"ae77\" id=\"ae77\" class=\"graf graf--h3 graf-after--p\">Sign Number Ten&#8202;&#8212;&#8202;They&#8217;re All About Lifestyle Porn</h3><p name=\"9093\" id=\"9093\" class=\"graf graf--p graf-after--h3\">Most people don&#8217;t work from the beach. Their laptops would quickly get full of sand and the sea air&#8217;s not good for electronics either (salt+water in humidity = rust). The glare of the sun makes it hard to read the screen. The weather might just put an end to your electronic kit for good in the blink of an eye. Sun loungers, hammocks and towels on the sand aren&#8217;t comfortable workspaces either.</p><p name=\"c0f9\" id=\"c0f9\" class=\"graf graf--p graf-after--p\">Lifestyle porn suggests that digital nomads work everywhere and the sky&#8217;s the limit. But nobody actually works on a bus in a third world country unless they&#8217;re an idiot or it&#8217;s an emergency. Nobody works on mountaintops or in the middle of the rain forest either.</p><p name=\"6f94\" id=\"6f94\" class=\"graf graf--p graf-after--p\">The truth is that most of digital nomad life is normal life just in a different country. People work mainly from:</p><p name=\"1734\" id=\"1734\" class=\"graf graf--p graf-after--p\">1. <strong class=\"markup--strong markup--p-strong\">Co-working spaces.</strong> Which is a marketing rebadge of &#8220;office&#8221;. Yes, a lot of digital nomads quit their office jobs to be free to work in an office. Let&#8217;s not dress this up. It&#8217;s fine and if it works for you great but let&#8217;s not pretend that calling it a &#8220;co-working space&#8221; makes it anything other than an office.</p><p name=\"2fca\" id=\"2fca\" class=\"graf graf--p graf-after--p\">2. <strong class=\"markup--strong markup--p-strong\">Apartments and hotels.</strong> Which would be &#8220;working from home&#8221; in most people&#8217;s vocabulary. Let&#8217;s be fair about this apartments and hotels are pretty much identical the world over. They may be nice but they&#8217;re a far cry from the shores of a desert island.</p><p name=\"b381\" id=\"b381\" class=\"graf graf--p graf-after--p\">3. <strong class=\"markup--strong markup--p-strong\">Coffee shops, bars, restaurants, etc.</strong> Again these are pretty much the same the world over. You can romanticize a room with cups of coffee anyway you like but in essence that&#8217;s all a coffee shop can be.</p><p name=\"58f4\" id=\"58f4\" class=\"graf graf--p graf-after--p\">Digital nomads will have their interesting travel experiences when they&#8217;re not working. Working is what pays for those experiences. A guru that tries to blur the line between the two is selling lifestyle porn and not reality.</p><h3 name=\"51aa\" id=\"51aa\" class=\"graf graf--h3 graf-after--p\">Bonus: Sign Number 11&#8202;&#8212;&#8202;They&#8217;ve Been in the Game for 10&#160;Minutes</h3><p name=\"e5f4\" id=\"e5f4\" class=\"graf graf--p graf-after--h3\">It&#8217;s amazing how many people&#8217;s first business is telling people about the business they&#8217;ve just started as though they&#8217;ve been running that kind of business for years.</p><p name=\"ae21\" id=\"ae21\" class=\"graf graf--p graf-after--p\">How likely is it that the new blogger has anything of value to teach you about blogging? Not very likely at all. Their &#8220;advice&#8221; is stuff they&#8217;ve rehashed from elsewhere without the benefits of experience to filter the dross from the good stuff.</p><h3 name=\"e016\" id=\"e016\" class=\"graf graf--h3 graf-after--p\">Bonus: Sign Number 12 for Freelancers Only&#8202;&#8212;&#8202;They Encourage You to Work for&#160;Free</h3><p name=\"dc0a\" id=\"dc0a\" class=\"graf graf--p graf-after--h3\">There is a huge difference between an apprenticeship and a grown adult with skills giving their skills away to gain &#8220;exposure&#8221;. People die of exposure. It&#8217;s that simple.</p><p name=\"d9cf\" id=\"d9cf\" class=\"graf graf--p graf-after--p\">A new painting and decorating firm won&#8217;t paint your house for free. A new restaurant won&#8217;t feed people for free. But a new freelancer? According to the &#8220;gurus&#8221; they need to go out and work for free.</p><p name=\"aae1\" id=\"aae1\" class=\"graf graf--p graf-after--p\">You don&#8217;t. In fact, you don&#8217;t need to work for &#8220;cheap&#8221; either. Instead of investing your time in doing work of value to other people and not getting paid for that work&#8202;&#8212;&#8202;spend it learning how to market and sell yourself better. In the long run, one leads to well-paid work, the other leads to the poor house. It should be easy to see which is which.</p><h3 name=\"8350\" id=\"8350\" class=\"graf graf--h3 graf-after--p\">Summary</h3><p name=\"ea20\" id=\"ea20\" class=\"graf graf--p graf-after--h3\">There are no short cuts to building a business. There&#8217;s no magic formula that brings in $1 million a year in four hours a week. There are no secrets. Information is of limited value without real help and support. It can be nice to talk to people at the same stage of business building as you but they&#8217;re not going to have much of value to give you until they&#8217;re successful. Lifestyle porn is sleight of hand. People who have just started doing something know no more than you do about it. Working for free is stupid.</p><p name=\"f7b9\" id=\"f7b9\" class=\"graf graf--p graf-after--p\">Anybody that tries to sell you something that suggests otherwise is not a guru, they&#8217;re a shyster. Spend your money elsewhere.</p><p name=\"782f\" id=\"782f\" class=\"graf graf--p graf-after--p graf--trailing\"><strong class=\"markup--strong markup--p-strong\">Note:</strong> Darren is taking a holiday this week. He&#8217;ll be back next week.</p></div>","title":"10 Signs That Your Digital Nomad Guru or Advisor Is a Crackpot"}},"pageContext":{"id":"5b937af287be056953db7cf6"}}