{"data":{"mongodbDatabaseArticles":{"id":"5b96249587be058327490eb9","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">10 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p>A number of you are planning to travel the world one day, which won&#8217;t happen unless you can overcome these <a href=\"../2009/08/20/2009/08/13/2009/08/06/2009/07/30/2009/07/23/2009/07/12/7-reasons-you-wont-travel-the-world/\">7 obstacles</a>. Here are <a href=\"../2009/08/20/2009/08/13/2009/08/06/2009/07/30/2009/07/23/2009/07/16/overcoming-7-major-obstacles-to-traveling-the-world-1-you-are-comfortable-at-your-job/\">Part 1</a>, <a href=\"../2009/08/20/2009/08/13/2009/08/06/2009/07/23/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-2-you-think-its-too-expensive/\">Part 2</a>, <a href=\"../2009/08/20/2009/08/13/2009/07/30/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-3-you-dont-know-where-youd-go/\">Part 3</a>, <a href=\"../2009/08/20/2009/08/06/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-4-youll-miss-your-family-and-friends/\">Part 4</a>, <a href=\"../2009/08/13/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-5-you-have-kids-or-will-soon/\">Part 5</a>, and <a href=\"http://www.foxnomad.com/2009/08/20/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-6-you-dont-know-what-your-significant-other-will-say/\">Part 6</a> of this series.</p>\n<p><em><img src=\"https://foxnomad.com/wp-content/uploads/2009/08/procrastination-poster1.jpg\" alt=\"procrastination poster\" width=\"690\" height=\"552\"><br>\n</em></p>\n<p>The single biggest obstacle to traveling the world you&#8217;ll face is yourself. It&#8217;s also the most difficult of the <a href=\"http://www.foxnomad.com/2009/07/12/7-reasons-you-wont-travel-the-world/\">7 obstacles</a> to overcome and the hardest to recognize. <strong>Saying you&#8217;re going to travel the world, just not now, but in a few years is a big sign you may never go</strong>. Even if you go through and overcome all of the other 6 external obstacles like leaving your day job (<a href=\"http://www.foxnomad.com/2009/08/20/2009/08/13/2009/08/06/2009/07/30/2009/07/23/2009/07/16/overcoming-7-major-obstacles-to-traveling-the-world-1-you-are-comfortable-at-your-job/\">Part 1</a>) and preparing financially (<a href=\"http://www.foxnomad.com/2009/07/23/overcoming-7-major-obstacles-to-traveling-the-world-%E2%80%93-2-you-think-its-too-expensive/\">Part 2</a>) you&#8217;ve got to contend with all of the elements of each obstacle at once.</p>\n<p>Fear, anxiety, comfort in your routine, all combine and instead of dealing with the cause of all of the obstacles you&#8217;ll do the easiest thing &#8211; procrastinate and make excuses.</p>\n<blockquote><p>It&#8217;s easy to say you&#8217;re going to do something or that you really want to or that other people traveling the world are just very lucky. Don&#8217;t get stuck years later by saying &#8220;I wish I were them&#8221; or &#8220;I wish I had traveled the world&#8221; because you may never get the chance to reflect. Life is unpredictable so take the opportunity and quash this obstacle that sits inside of you &#8211; by discovering it, uncovering it, and overcoming your excuses.</p></blockquote>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/08/face-of-a-ninja1.jpg\" alt=\"face of a ninja\" width=\"358\" height=\"270\"><strong>Fear Is Like A Ninja</strong></p>\n<p>We mostly think of fear as something out of a horror movie &#8211; panic, yelling, and lots of running down dark corridors (well maybe not the last one). Fear about traveling, which encompasses worrying about what your family will think and if you can afford it, hides itself in your subconscious, subtly manipulating your actions.</p>\n<p><strong>How Can You Recognize Fear?</strong></p>\n<p>Here are some of the warning signs:</p>\n<ul>\n<li><strong>Procrastination</strong>. It&#8217;s important to have a good plan, discuss it with your loved ones, and start to break the routines that hold you back. Spending too much time in any of those stages though is bound to put your trip in jeopardy. Don&#8217;t over-complicate things. Set up the basic framework for what you want to do and move on to checking items off your list.</li>\n<li><strong>Only partially overcoming some of the obstacles</strong>. A trap that many fall into. You sell a few of your CDs, casually bring up your dream to travel the world with friends (although you don&#8217;t have any sort of plan), and mentally leave your job. Overcoming the obstacles to traveling the world half-assed can make your current situation more difficult while not getting you any closer to actually traveling the world.</li>\n<li><strong>The phrase &#8220;I would now but&#8230;&#8221;</strong> Except for extreme circumstances this is just fear talking. I&#8217;d ask you, &#8220;so what?&#8221; and you should ask yourself the same thing. Run your excuses by a friend or one of the travel <a href=\"http://www.foxnomad.com/links/\">many people traveling the world</a> for a reality check.</li>\n</ul>\n<p><img src=\"https://foxnomad.com/wp-content/uploads/2009/08/tearing-hair-out1.jpg\" alt=\"tearing hair out\" width=\"258\" height=\"372\"><strong>Fighting Cognitive Dissonance</strong></p>\n<p>In psychology, <strong>cognitive dissonance is what happens when you hold two conflicting beliefs or ideas</strong>. Take wanting to travel the world and having the comfort of your regular life. Your heart wants to travel the world but fear of many things has you holding on to the norm.</p>\n<blockquote><p>Cognitive dissonance is resolved in one of two ways. Either by dropping one of the beliefs or rationalizing both of them. Putting off your trip and all the excuses that come with it is the result of rationalization. You can resolve you own cognitive dissonance by narrowing down the fears you have and replacing each one in your travel plans.</p></blockquote>\n<ul>\n<li>For example I&#8217;m a creature of habit. I need my routines to function and feel at ease. So no matter where I go I make sure that I have a few routines in place to keep me balanced. They&#8217;re simple things &#8211; a big breakfast or coffee in the morning, a run and workout, and maybe a mini-goal like a beer at a pub that looks interesting later in the day.</li>\n</ul>\n<p>At all costs don&#8217;t rationalize. You have to solve your cognitive dissonance by dropping one belief or the other. There&#8217;s no way around it so ask yourself, &#8220;what are you really afraid of?&#8221;</p>\n<p><strong>It&#8217;s All About You</strong></p>\n<p>Realize that in the end the only thing stopping you is&#8230;you. Ultimately that&#8217;s what is a scary thought for everyone &#8211; that the success (or failure) of a trip or traveling around the world is your responsibility. It can also be your triumph, it all depends on what you end up doing. As Benjamin Button say at the end of the movie <a href=\"https://www.amazon.com/gp/product/B001U0HBPG?ie=UTF8&amp;tag=foxnomad-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B001U0HBPG\">The Curious Case of Benjamin Button</a>,</p>\n<blockquote><p>For what it&#8217;s worth: it&#8217;s never too late or, in my case, too early to be whoever you want to be. There&#8217;s no time limit, stop whenever you want. <strong>You can change or stay the same, there are no rules to this thing</strong>. We can make the best or the worst of it. I hope you make the best of it. And I hope you see things that startle you. I hope you feel things you never felt before. I hope you meet people with a different point of view. I hope you live a life you&#8217;re proud of. If you find that you&#8217;re not, I hope you have the strength to start all over again.</p></blockquote>\n<p>What ever you end up doing, don&#8217;t have any regrets. Can you say you won&#8217;t have regrets if you don&#8217;t travel the world?</p>\n<p>Next Thursday I&#8217;ll have a follow up on the entire series of overcoming obstacles to traveling the world. I hope that you&#8217;ll share some of your thoughts and experiences overcoming them in the comments below. </p>\n<p>[photos by: <a href=\"https://www.flickr.com/photos/auburnnewyork/\">auburnxc</a>, <a href=\"https://www.flickr.com/photos/grrphoto/\">R&#8217;eyes</a>, matthewwashcroft]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Overcoming 7 Major Obstacles To Traveling The World – #7 You Will Travel The World…Later"}},"pageContext":{"id":"5b96249587be058327490eb9"}}