{"data":{"data":{"edges":[{"node":{"id":"5b95eb3a87be058327490009","title":"Amsterdam Travel Guide: Expert Travel Advice From Nomadic Matt","source":"nomadicmatt","summary":"Made with love by travelers for travelers!\nUpdated: July 2018Return policy: No risk, 30 Day, 100% Money Back GuaranteeDetails: 96 pages of expert budget travel advice with mapsI loved Amsterdam from the moment I first wandered into the city in 2006.\nIt’s a truly magical place and I want you to love it the way I love it.\nI want you to experience it the way it’s meant to be experienced – the Dutch way!\nIt shares the hidden secrets of the city and offers an authentic local experience into quaint cafes, beautiful parks, and architecture, and overlooked sights.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/NM_Guide_to_Amsterdam_Flat-1.jpg"}}},{"node":{"id":"5b95eb3487be058327490006","title":"Nomadic Matt's Guide to Paris","source":"nomadicmatt","summary":"Paris, a city of 2 million people, has its gems, nooks, and crannies where prices are reasonable and there isn’t a tourist in sight.\n(A very happy me in front of the Eiffel Tower)What’s in this Paris Guide?\nBudget advice – Discover money-saving tips and budget suggestions not found elsewhere, so you’ll know how to save on your upcoming trip.\n– Discover money-saving tips and budget suggestions not found elsewhere, so you’ll know how to save on your upcoming trip.\nA history of Paris – Learn about how Paris became the city it is today.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/07/NM_Guide_to_Paris_Flat.jpg"}}},{"node":{"id":"5b95eb3187be058327490005","title":"Nomadic Matt’s Guide to Iceland","source":"nomadicmatt","summary":"See the Authentic Side of IcelandMade with love by travelers for travelers!\nUpdated: July 2018Return policy: No risk, 30 Day, 100% Money Back GuaranteeDetails: 196 pages of expert budget travel advice with mapsIceland.\nMy love for Iceland became an obsession.\nIceland is a place that many travelers want to go – but are all worried about cost.\nThis guide is meant for travelers looking to see the most of Iceland.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/04/NM_Guide_to_Iceland_Flat-sm.jpg"}}},{"node":{"id":"5b95eb1d87be05832748fffb","title":"Bangkok Travel Guide: Expert Travel Advice from Nomadic Matt","source":"nomadicmatt","summary":"July 2018No risk, 30 Day, 100% Money Back Guarantee110 pages of expert budget travel advice with mapsWondering how you’re going to get around Bangkok or make the most of your visit?\nBangkok is a city that opens itself up when you ditch the typical tourist path.\nI used to hate Bangkok until, on my third visit, wanting to learn Thai, I decided to stay for a month.\nThis guide is meant for travelers looking to see the most of Bangkok.\nYou’ll see the local side of the city as I take you off the tourist trail and show you Bangkok’s inner world.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/05/NM_Guide_to_Bangkok_Flat.jpg"}}},{"node":{"id":"5b95eb0d87be05832748fff2","title":"How NOT to Let Anxiety Stop You From Traveling","source":"nomadicmatt","summary":"Today, Lauren writes in-depth about her panic attacks, how travel helped her cope, and gives advice to others facing the same issues.\nBy the time I left, my anxiety had improved, but I was still suffering from panic attacks anywhere from once a month to several times a day.\nIn the four years I’ve been on the road, though, I can count the number of attacks I’ve had on two hands.\nTurning my anxiety into a positiveWriting about my anxiety on my travel blog was the best thing I ever did.\nI’ve had a total of two anxiety attacks in the past 12 months.","info":{"author":"Yeison Kim, Brittany Herriot, Ryan Biddulph, Nancy Lendved, Suzanne Fluhr, Karadeniz Tur, Tom Miller, Jane M, Lauren Erickson, Jon B","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/anxiety08.jpg"}}},{"node":{"id":"5b95eb0987be05832748fff1","title":"How to Visit New York City on a Budget","source":"nomadicmatt","summary":"See More, Spend Less, Travel DeeperMade with love by travelers for travelers!\nWhen it came time to slow my travels, I knew there was no other city to move to.\nWhen I’m not on the road, I’ve lived in New York City and have used my personal, insider view to write this guidebook.\nI know the city like the back of my hand.\nToo many people think NYC is “too expensive” but actors, writers, and everyday people manage to live in the city without going bust.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/NM_Guide_to_NYC_Flat.jpg"}}},{"node":{"id":"5b95eb0787be05832748fff0","title":"Nomadic Matt’s Guide to Hong Kong","source":"nomadicmatt","summary":"As a traveler, however, Hong Kong can be a difficult place to visit.\nHong Kong is an undeniably vibrant metropolis with so much to offer.\nEvery year, I visit Hong Kong at least two times and have been coming here ever since I fell in love with it five years ago.\nWhat’s in this Hong Kong Guide?\nWhat makes you an expert on Hong Kong?","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/08/NM_Guide_to_Hong_Kong_Flat.jpg"}}},{"node":{"id":"5b95eb0387be05832748ffee","title":"Nomadic Matt’s Guide to the Virgin Islands","source":"nomadicmatt","summary":"Explore the laid back CaribbeanThe Virgin Islands are beautiful, rustic, and a true Caribbean paradise.\nWith this guidebook, you’ll get a look at the Virgin Islands the way they are meant to be seen.\nWhat’s in this Virgin Islands’ Guide?\nA history of the Virgin Islands – Start off with a historical overview of how the islands got to where they are today for a deeper understanding of the people and place.\nThe Virgin Islands don’t need to be an expensive island paradise.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/09/NM_Guide_to_Virgin_Islands_Flat.jpg"}}},{"node":{"id":"5b95eaff87be05832748ffec","title":"Living Lagom in Sweden: An Interview With Lola Akerstrom","source":"nomadicmatt","summary":"Though that relationship didn’t last, my love for Sweden did and, in subsequent years, I learned Swedish and even tried to move to Sweden.\nUnlike me, she’s had success in making a life in Sweden, where she now lives with her husband and son.\nIn her new book, Lagom, she discusses life in Sweden and Swedish culture.\nI have been living in Sweden for eight years, and writing about the country and its culture for even longer.\nSweden consistently ranks in the top 10 happiest countries, so there are clearly things Sweden is getting right.","info":{"author":"Ryan Biddulph, Mark, Kelly Mahan","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/11/lolaakerstrom.jpg"}}},{"node":{"id":"5b95eafd87be05832748ffeb","title":"Thailand Travel Guide: Learn to See More for Less","source":"nomadicmatt","summary":"I fell in love with Thailand in 2005 when I went on a two-week vacation to escape the Boston winter.\nI’ve seen markets spring up only to be torn down.\nAnd, in this travel guide, I share all that knowledge with you.\nThis guide is for someone who doesn’t just want to check off a box but wants to explore.\nI wrote this guide as the guide I wish I had when I had started out – a no fluff guide that gave me exactly the practical, precise, and insider information I couldn’t find elsewhere.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/09/NM_Guide_to_Thailand_Flat.jpg"}}},{"node":{"id":"5b95eafb87be05832748ffea","title":"13 Non-Travel Books That Changed My Life","source":"nomadicmatt","summary":"This month, I wanted to share the non-travel books that have had the most impact on my life and feel have made me a better person.\nI would rather read books and sit by myself than be at a big party filled with strangers.\nMaking better food choices leads to a happy, healthier life.\nI loved how he framed everything around asking yourself what is the one thing you can do to make your life better – daily, weekly, yearly.\nThese books made me reshape my life – often in drastic ways – and I’ve never once regretted reading them.","info":{"author":"Ryan Biddulph, Jon Espina, Harga Marmer, Giovani Freitas, Pilot Mark, Liza Skripka, Lisa De Jong, Bacith M","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/10/nontravelbooks3.jpg"}}},{"node":{"id":"5b95eaf987be05832748ffe9","title":"How to Cope with Travel Mistakes","source":"nomadicmatt","summary":"Despite years of constant travel to over 70 countries, I can’t believe how often I still make rookie mistakes when I should know better.\nIt’s easy to look around and see travel writers as “experts” and “gurus” who seem to travel through the world with seamless effort.\nI long ago stopped beating myself up over my travel mistakes.\nBecause you are going to make a lot of mistakes on the road.\nHow to Travel the World on $50 a DayMy New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences.","info":{"author":"Dave Brett, Ron Mitchell, Jonny Jenkins, Clay Mosley, Pamilla Hiner, Shaun Robertson","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2014/01/travelmistakes1.jpg"}}},{"node":{"id":"5b95eaf787be05832748ffe8","title":"Why Travel Boycotts are a Bad Idea","source":"nomadicmatt","summary":"Moreover, governments can and do change: laws are passed and repealed, voters eject politicians and vote in new ones, and revolutions and sanctions topple dictators.\nGovernments don’t always reflect the will of all their people (or even a majority).\nI certainly didn’t support Bush.\nBut I believe boycotting travel to countries because of one law or its current choice of leader is misguided.\nIf we were to compile a list of places with one policy or leader that we don’t agree with, we would never go anywhere.","info":{"author":"Lauren Meshkin, Manoj Yadav, Jeroen Vogel, Csaba, Darren Keane Storm, James Johnson, Ryan Biddulph","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/04/travelboycotts2.jpg"}}},{"node":{"id":"5b95eaf587be05832748ffe7","title":"The Beginning of the End","source":"nomadicmatt","summary":"My overall answer is that you can never get too much travel in your life.\nBut I do know today marks the beginning of the end.\nOne thing I envy about many gap year travelers is that with a set “end date” to their trip, they have an excitement about them I’ve recently lacked.\nBecause with the end in sight, I have to get it all in before it’s too late.\nTravel will always be a part of my life, but life’s desires change and I must change with it.","info":{"author":"Waegook Tom, Mat Siems, Murissa Maurice, Jason Castellani, Benny Lewis, Sarah Lavender Smith, Kelly Brough, Shannon O'Donnell, Jessica Fitz., Sue Reddel","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/04/beginningofend-1.jpg"}}},{"node":{"id":"5b95eaf387be05832748ffe6","title":"Home: The Death of a Nomad","source":"nomadicmatt","summary":"Since moving here in January, I never managed to spend more than a couple weeks in New York City before having to leave again.\n“I’m trying.\nI’m trying,” I’d reply.\nI was tired of traveling and just wanted to be home in my comfy bed.\nI’m tired of saying “OK, I’ll do it next time.” So I’m not traveling until the end of December when I go to the Philippines.","info":{"author":"Kerwin Mckenzie, Posie Flump, Charles Rahm, Rashad Pharaon","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2013/10/homenomad1.jpg"}}},{"node":{"id":"5b95eaf187be05832748ffe5","title":"The Settled Life in New York City","source":"nomadicmatt","summary":"I’m eating better (though the pizza place next door makes that difficult), but I haven’t joined a gym.\nNew York City has so much to do that I need to better manage my time, so I don’t let the days fly by.\nIf slowing down has taught me one thing, it’s that I don’t like slowing down.\nGet the In-Depth Budget Guide to New York City!\nIt cuts out the fluff found in other guides and gets straight to the practical information you need to travel and save money the city that never sleeps.","info":{"author":"Chuck Kuhn, Cj Thapa, Marcella Prokop, Julio Moreno","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2013/02/settlingnyc11.jpg"}}},{"node":{"id":"5b95eaef87be05832748ffe4","title":"This is Where This Journey Ends","source":"nomadicmatt","summary":"They say everything comes in threes, and I guess my journey has had three big moments.\nFor you see, today is where my journey ends.\nI don’t know what the future holds.\nI don’t know.\nIt’s a new day, and I don’t know what it will bring.","info":{"author":"Matt Diamond, Bobbi Lee Hitchon, Sharon M, Casey Armstrong, Jeff Dobbins, Larissa, Molly Mchugh","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/03/journeyend.jpg"}}},{"node":{"id":"5b95eaed87be05832748ffe3","title":"Why I'm Moving to Sweden, Trust, and Practicing What I Preach","source":"nomadicmatt","summary":"Judging by the emails I get from people, I think I’m successful at getting people onto airplanes and into the world.\nI don’t want to be on my deathbed saying, “I wish I did…” and I think that if I didn’t move to Sweden, I’d always regret it.\nSo in July, I’ll be getting on a plane to Stockholm, where I’ll stay until January >when my book is released.\nI thought about all the messages from the people whose fears I’ve helped vanquish.\nAnd then I thought about how deep down I knew I wanted to move to Sweden.","info":{"author":"Dave Brett, David Nikel, David N, Kae Lani, Victor Tribunsky, Roberto Gallegos Ricci, John Hancq","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/02/swedenmove.jpg"}}},{"node":{"id":"5b95eae987be05832748ffe1","title":"Why Pretentious Travelers Suck (And What I Do About Them)","source":"nomadicmatt","summary":"Nothing irks me more than people disparaging people’s travel choices.\nIsn’t travel supposed to make you open-minded?\nI do what makes me happy, even if it’s some “touristy” destination.\nHere’s how I really feel and what I think you should do when you meet a pretentious, judgmental traveler (also notice the new introduction!\nThe next time someone starts harping on your travel choices or giving you grief, turn the conversation around on them.","info":{"author":"Mark C, Scott, Rashad Pharaon, John Cannon, Suzanne Fluhr, Kenneth Surat, Stephanie Hsu, Jon Brown, Samuel Garza, Hannah Wasielewski","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2014/02/pretentioustraveler.jpg"}}},{"node":{"id":"5b95eae687be05832748ffe0","title":"All Travelers are Created Equal","source":"nomadicmatt","summary":"But let me tell you something: all travelers are created equal.\nYou are not a better traveler simply because:You’ve been traveling for over two years!\nIn my first three years backpacking the world, I’ve only been to about twenty-five or so countries.\nI know terrible travelers who have been to all the countries in the world and know amazing travelers who have only been to a couple.\nIf you are a “real” traveler, you know that all travelers are equal and these false mindsets don’t matter.","info":{"author":"Daniel Noll, Marina Villatoro, Robert Reid, Nomadic Matt, Ross C, Heather Carreiro","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/07/equaltravelers.jpg"}}},{"node":{"id":"5b95eae587be05832748ffdf","title":"Should LGBT Travelers Visit Anti-LGBT Countries?","source":"nomadicmatt","summary":"In this column, we will hear from voices in the LGBT community about their experiences on the road, safety tips, events, and overall advice for other LGBT travelers to get the most out of their time on the road!\nIt’s not always safe or easy for gay travelers (and certainly even harder for LGBT locals living under those laws and customs).\nOut Now Consulting’s LGBT research shows that a key factor for LGBT travelers is determining how welcome they will feel in the places that they visit, and that many of those travelers are choosing purposefully not to visit places with anti-LGBT laws.\nMost LGBT travelers I’ve spoken to about this issue are conflicted.\nHe’s a gay travel expert, writer, and blogger and publishes a series of LGBT-friendly Hipster City Guides from around the world on his gay travel blog, Travels of Adam.","info":{"author":"Mr Adam","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/08/lgbttravelchoice1.jpg"}}},{"node":{"id":"5b95eade87be05832748ffdb","title":"Don't Listen to the Naysayers. I Travel for Myself (And So Should You)","source":"nomadicmatt","summary":"This turned into a debate about giving travel advice, what makes an authentic traveler, and a few other subjects.\nAnd yes, there is more authentic travel, and then there is safe, boring, gap-year circuit travel.\nI’ll think out loud about the nature of travel and my personal thoughts on it as a way to help me hash out my feelings.\nI don’t believe there’s any such thing as must-see or must-do when you travel.\nHow to Travel the World on $50 a DayMy New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences.","info":{"author":"Emily S., Peggy Mcpartland, Adam Costa, Carol White Llewellyn, Jason Stearns, Uttoran Sen, Marian Schembari, Tom Bartel, Priscilla P. Wood, Echo Santos","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/10/forme22.jpg"}}},{"node":{"id":"5b95ead687be05832748ffd8","title":"How to Have (Or Not Have) Sex in Hostels","source":"nomadicmatt","summary":"It’s also less likely someone will come in and bother you here than in a dorm room.\nI can’t count the number of times I’ve seen sheets hanging over the bottom bunk in a dorm room.\nIf you wait until late at night, there’s less of a chance that people will hear you have sex in your dorm.\nSo remember, if you are going to have sex in a hostel, make sure you have sex the right way – without bothering the rest of the hostel.\nI’ve seen some crazy stuff in hostels, but seeing you having sex is something no one wants to see!","info":{"author":"Taylor Davidson, Wendy-Escape Ny, Stevo, China Travel, Fly Girl, Maryam In Marrakech, Gareth Sear, Freeman Carter","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/10/Hostelsex41-1024x536.jpg"}}},{"node":{"id":"5b95eac687be05832748ffd0","title":"Losing the Wonder of Travel","source":"nomadicmatt","summary":"At some point, do we, the endless nomads, lose that sense of wonder and awe?\nI don’t mean that those who spend years on the road lose their desire and love of travel.\nThe more I travel, the more I realize travel is the only thing I want to do and I would never trade my lifestyle for a cubicle.\nAnd so I think- have I lost the wonder of travel?\nHow to Travel the World on $50 a DayMy New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences.","info":{"author":"Andy Jarosz, Lisa Bergren, Caroline Makepeace, Christine Gilbert, Jessica Skelton, Lisa Lubin, Gjermund Glesnes, Kevin Post","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/06/losingwonder001.jpg"}}},{"node":{"id":"5b95eac487be05832748ffcf","title":"Keeping the Relationship Spark Alive on the Road","source":"nomadicmatt","summary":"Posted: 07/28/2011 | July 28th, 2011This is a guest post by Ant, one half of Positive World Travel.\nWhen traveling the world as a couple, there can come a time when your relationship “spark” loses some its brightness.\nSurprisesEven though you‘re traveling together and you may be on a limited budget, a surprise every now and again will always excite your better half.\nElise and I always make sure we not only have time for long-term travel and all that entails but also for making our relationship work on the road and keeping the spark alive.\nAnt is one half of the dynamic duo at Positive World Travel.","info":{"author":"Bjorn Karlman","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/07/keepingthespark.jpg"}}},{"node":{"id":"5b95eac287be05832748ffce","title":"The Challenges of Love on the Road","source":"nomadicmatt","summary":"Naturally, one of the very first questions people ask me is what it’s like to be single on the road.\nAgeMost people assume the biggest hurdle for a woman in her thirties would be to find love at all.\nOne day you meet a great guy and seem to hit it off, spending every moment of the day together.\nBut none of this is to discourage anyone from trying to find love on the road.\nSome are lucky and do find love on the road — and that’s what keeps us all hopeful.","info":{"author":"Michael Figueiredo, Jeremy Branham, Ayu Safinas","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/07/angelalove2.jpg"}}},{"node":{"id":"5b95eabe87be05832748ffcd","title":"Cheap Accommodation: Beyond the Hotel","source":"nomadicmatt","summary":"What are some forms of accommodation that don’t rely on you sharing a room with eight snoring strangers?\nWhat can you do if you don’t want that but also don’t want to pay the money for a hotel room?\nOne of the best ways to save money on accommodations is by not paying for it.\nMy favorite rental websites are:WWOOFingDiscussed in this informative and detailed post, this program will let you stay on a farm and trade your labor for free accommodation.\nUsing hotel points, I stayed at a W Hotel in Barcelona (500 euros per night) for free, and spent a week at the Courtyard Marriott in Hong Kong.","info":{"author":"Ellen Keith, Roni Faida, Colleen Friesen, Stephen S., Senyor Lakwatsero, John Hancq","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/11/cheapaccommodation1.jpg"}}},{"node":{"id":"5b95eabc87be05832748ffcc","title":"A Journey Through Madagascar: Notes on the Privilege of Travel","source":"nomadicmatt","summary":"Two years ago, I wrote about how privileged and lucky we are to be able to travel the world.\nMy visit to Madagascar in September was my most recent reminder of this.\nHope For Madagascar – With a focus on disadvantaged children and women, Hope For Madagascar builds and repairs schools and offers scholarships to children in need.\nReef Doctor works to restore and preserve vulnerable habitats and overexploited resources, while also creating projects to alleviate poverty in Madagascar.\n(And visit Madagascar.","info":{"author":"Kate - Travel For Difference, Maria Cecilia Ramos, Drew Meyers, Sherrie Fabrizi Allbritten, Lewis Nunn, Cara Crawford, Tam Gamble, Christy Tappy, Hannah Cox, Emily Harper","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/11/madagascarpoverty1.jpg"}}},{"node":{"id":"5b95eabb87be05832748ffcb","title":"How to Change the \"I'm Too Poor to Travel\" Mindset","source":"nomadicmatt","summary":"They imagine they can’t travel because, unlike me, they can’t tap the Bank of Mom and Dad, are burdened by their debt, and simply assume I’m just lucky and special.\nto travel” mindset: You’re not.\nIf you wake up today and tell yourself, “I’m too poor to travel” or “I can’t because of reason X,” you’ll never look for ways to start traveling.\nYou see only the reasons why you can’t travel — bills, flights, car payments, debt, family, or more.\n“I’m too poor to travel” is a belief that causes many to lack the confidence to believe travel is possible.","info":{"author":"Britt Jeffs, Marta Kulesza, Andrea Anastasiou, Katie Featherstone, Tom Farrington, David Coulson-Lowes, John Metcalfe","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2014/11/changeyourmindset3.jpg"}}},{"node":{"id":"5b95eab687be05832748ffc9","title":"How This 70 Year Old Couple Traveled the World","source":"nomadicmatt","summary":"Because here is a “senior” couple, limited by some medical issues, engaging in adventures I only dream about.\nAlison (my wife, who is 63) and I didn’t have enough savings to be able to keep our home and do the kind of world travel we wanted to do.\nThe world is an astonishing place, and people are more open-hearted than you’d ever believe from watching the nightly news.\nThey found a way to make travel work for them, and it even made Don a healthier and happier person!\nI travel a certain way but there are many ways to fund your trips and travel the world.","info":{"author":"Adam Finan, Lauren Meshkin, Alison Armstrong, Mark C, Katrina Woznicki, Geoff Byrne, Cheryl, Kelly Kuhn, Carolyn Niethammer, Ray Laskowitz","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2013/08/donandalison2.jpg"}}},{"node":{"id":"5b95eab487be05832748ffc8","title":"Why Being Broke is the Best Time to Travel","source":"nomadicmatt","summary":"I think being broke is the best reason to start traveling.\nWhen you don’t have any money or a great job, there’s little downside to picking up, saying goodbye, and going off to travel.\nIf you’re willing to go out and grab life by the horns, you’ll find plenty of opportunities out there to earn money, travel, and find what you love.\nUnless you seize the moment, that temp job you’re in just until you find something new is more likely to be the job you still have years from now.\nIf I was broke, young, or in a job I didn’t like, I would first try to teach English overseas.","info":{"author":"Lucas Rodrigues, Venkat Ganesh, Cynthia Lewis, Charlie Marchant, Isabella Biava, Mima Isono, Burcu Basar, Al Kadam, Let'S Fly Travel","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/12/nomoneygotravel006.jpg"}}},{"node":{"id":"5b95eab287be05832748ffc7","title":"How to Travel the World in a Wheelchair","source":"nomadicmatt","summary":"A few months ago, I was browsing the Internet when I came across a travel blog written by a guy who traveled the world in a wheelchair.\nThese trips made me fall in love with travel and showed me that there’s so much out there in the world.\nHe decided to start a wheelchair travel blog because he’s always had a strong passion for traveling.\nHis blog, Curb Free with Cory Lee, is devoted to sharing the world from a wheelchair user’s perspective.\nI travel a certain way but there are many ways to fund your trips and travel the world, and I hope these stories show you that there is more than one way to travel and that it’s within your grasp to reach your travel goals.","info":{"author":"Ryan Biddulph, Linzi Clark, Kirsten Burnett, Luke Mitchell, Christian P, Jb, Jessy Shaw","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/04/curbfree1.jpg"}}},{"node":{"id":"5b95eab087be05832748ffc6","title":"How this Indian Couple Gets Visas and Travels the World","source":"nomadicmatt","summary":"My dollar goes far (though not as far as it used to), and I only have to worry about visas to a few countries around the world.\nAnd so today, we talk to Vikram and Ishwinder, an Indian couple who not only managed to save money for their round-the-world trip but also navigated the tough process of getting tourist visas with an Indian passport.\nVikram: We are an Indian couple in our late 20s that loves to travel.\n*********************Become the Next Success StoryIt may be harder for Indian citizens to travel and obtain visas, but it’s not impossible.\nI’ve met many Indian travelers on the road, and as Vikram and Ishwinder’s story shows, it’s possible to successfully get visas.","info":{"author":"Marta Kulesza, Francis Cassidy, Rashad Pharaon","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2014/03/vikram-2.jpg"}}},{"node":{"id":"5b95eaae87be05832748ffc5","title":"Bangkok's Khao San Road: A Complete Visitor's Guide for 2018","source":"nomadicmatt","summary":"Ever since then Khao San Road has become a mythic place in the hearts of all backpackers.\nTips for Visiting Khao San RoadTo help you make the most of your visit to Khao San Road, here are some tips for visiting Khao San Road:The street food on Khao San isn’t that good.\nWhile Khao San closes at 2 am, Soi Rambuttri stays open all night long.\nWith so many drunk foreigners in one place, Khao San Road is an easy target for pickpockets.\nFor a fun (but dated) look at Khao San Road from a few years ago, you can check out this video on Khao San Road below:Get the In-Depth Budget Guide to Bangkok!","info":{"author":"John Bardos, Jill Starley-Grainger","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/12/partybangkok.jpg"}}},{"node":{"id":"5b95eaac87be05832748ffc4","title":"The Saturday City: Chiang Mai","source":"nomadicmatt","summary":"These thick stone sections give an indication of the power that Chiang Mai once wielded, though they’re now left crumbling.\nHence the birth of the zoo, when the Chiang Mai government donated 24 acres to aid in his efforts.\nLocated outside of Chiang Mai, it is currently home to 37 elephants (plus a menagerie of other animals).\nChiang Mai has plenty to offer any traveler, and a few days here can keep you busier than anywhere else in the country.\nBook Your Trip to Chiang Mai: Logistical Tips and Tricks Book Your FlightFind a cheap flight to Chiang Mai by using Skyscanner or Momondo.","info":{"author":"Wendy-Escape Ny, Alan Cuthbertson","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/03/chiang_saturday.jpg"}}},{"node":{"id":"5b95eaaa87be05832748ffc3","title":"How the Internet Will Change Travel","source":"nomadicmatt","summary":"With all the travel plans you can make online, it’s no wonder that many people say the future of travel is on the Internet.\nNowadays, the majority of people look online for travel information before they head to buy a guidebook.\nFurthermore, companies continue to increase their Web profiles as more people use the Internet for information, business, and maintaining social relationships.\nPeople already use the Internet for travel.\nHowever, as young people, accustomed to doing everything online, grow up and start to travel, this digital travel revolution will mushroom from a spark to a wildfire.","info":{"author":"Chris, Mark H, C K","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/11/internetchange01.jpg"}}},{"node":{"id":"5b95eaa987be05832748ffc2","title":"The Saturday City: A Visitor's Guide to Bangkok, Thailand","source":"nomadicmatt","summary":"There were a plethora of temples, the Grand Palace, and some malls, but after two days, I was ready to leave and never return.\nAnd the longer I stayed in Bangkok, the more the city opened up and I realized that there’s always something to do here.\nIt costs 500 THB to enter the Grand Palace.\nThe Train Night Market is absolutely one of the coolest markets in Bangkok.\nThe Train Night Market is absolutely one of the coolest markets in Bangkok.","info":{"author":"Johnny Vagabond","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/05/bangkoksatcity1a.jpg"}}},{"node":{"id":"5b95eaa587be05832748ffc1","title":"Thailand/Bangkok Book Bundle","source":"nomadicmatt","summary":"Buy my Thailand Book, Get Bangkok for Free$14.99June 2018PDF (Instant download)Limited Time Offer!\nRead more about my Thailand book below.\nI’ve seen the tourists come and go, places fall in and out of fashion, hostels boom, the political landscape change, and the food and international cocktail scene exploded.\nI’ve seen markets spring up only to be torn down.\nAnd, in this travel guide, I share all that knowledge with you.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/10/kayla.jpg"}}},{"node":{"id":"5b95eaa187be05832748ffbf","title":"9 Reasons to Visit Thailand in 2018","source":"nomadicmatt","summary":"A picture’s worth a thousand words, and this photo proves why you should visit Thailand better than any words I could say.\nThere are islands for all needs: party islands, resort islands, dive islands, chill islands, empty islands filled with a few huts and not much else… islands with resorts, yoga retreats, or waterfalls, and some that mix a little bit of everything!\nThe best food comes from the street vendors, who serve up the tastiest, spiciest food in the country.\nThere are plenty of good reasons to visit Thailand now and tons of things to do here.\nGet all my best Thailand tips!","info":{"author":"Tina Marshall, Cara Lopez Lee, Naman Kumar","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/12/thaitemple01.jpg"}}},{"node":{"id":"5b95eaa087be05832748ffbe","title":"How to Visit Khao Yai National Park in Thailand","source":"nomadicmatt","summary":"Updated: 04/01/2018 | April 1st, 2018Khao Yai National Park is located about 2.5 hours north of Bangkok and is one of Thailand’s best national parks.\nEstablished in 1962, it was Thailand’s first national park and is now even a UNESCO World Heritage site.\nBut, luckily a got to play tour guide to a friend from Boston on a recent visit and used that as my excuse to finally make it there.\nIf you ever go to Khao Yai, this place comes with my highest recommendation.\nHow to get to Khao Yai National ParkThe park isn’t really easy to get to.","info":{"author":"Wendy-Escape Ny, Ben Reeve","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/09/khaoyai6.jpg"}}},{"node":{"id":"5b95ea9e87be05832748ffbd","title":"Berlin's Thai Food Market is the Best Thai Food Outside of Thailand","source":"nomadicmatt","summary":"Despite my years of searching, I’ve never found it outside Thailand.\nBecause of how the broth sits out collecting flavor for hours, you can’t find this soup outside of Thailand — food safety laws in Western countries don’t allow it.\nAnd now it has something nowhere else outside Thailand has — authentic Thai food.\nThis is the best Thai food I’ve found outside of Thailand.\nHow to get thereTake the U-Bahn to Fehrbelliner Platz and it’s in the park outside the train station.","info":{"author":"Janice Stringer, Megan King, Jeff Schneider","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2014/08/thaifoodpark12.jpg"}}},{"node":{"id":"5b95ea9c87be05832748ffbc","title":"Why this Family Took Their Teens on an Epic RTW Adventure","source":"nomadicmatt","summary":"When I started traveling the world, taking your kids out of school for a year away was weird and social suicide.\nWhat did your friends and family think?\nWhat do your kids think about this experience?\n****When I speak at consumer shows and at conferences, the feasibility of a family traveling the world always comes up.\nI hope stories like this show that family travel is a feasible and inspire you to start planning your own trip","info":{"author":"K. Renae P., Lauren Meshkin, Rob Muhuhu, Ryan Biddulph, Michael Dembenski, Jonny Duncan, Mauricio Campos, Stephen Gollan, Prinita Ganguly","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/01/staciinterview04-2.jpg"}}},{"node":{"id":"5b95ea9787be05832748ffba","title":"Why Travel Can Change the World","source":"nomadicmatt","summary":"Globalization, a force that forces us together, has accelerated change in the world.\nThat’s great because, one of the sad realities is that most Americans don’t travel overseas.\nBut with the youth not as scared of the outside world, I think they will travel more and that travel will change the world.\nThat’s how travel can change the world.\nTraveling won’t make us all sing kumbaya and hold each other’s hands, but it will help tear down some of the walls that divide us.","info":{"author":"Chris Noble, Mark H, Lis, -Travel For The Over, A. Wannabe Travelwriter","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/12/changetheworld.jpg"}}},{"node":{"id":"5b95ea9487be05832748ffb8","title":"9 Reasons to Volunteer on Your Trip Overseas","source":"nomadicmatt","summary":"It’s not paid work experience, but it will give you something to pad out your resume, which is especially helpful for students or recent graduates.\nIt’s not paid work experience, but it will give you something to pad out your resume, which is especially helpful for students or recent graduates.\nIf you’re volunteering in a remote area, you’ll have plenty of people who can’t speak English to practice with.\nIf you’re volunteering in a remote area, you’ll have plenty of people who can’t speak English to practice with.\nThere are lots of people out there who need your help and plenty of local organizations to volunteer with.","info":{"author":"Cornelius Aesop, Natasha Sensenbrenner","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/03/volunteertrip001.jpg"}}},{"node":{"id":"5b95ea8d87be05832748ffb6","title":"Naples Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"– Expect to pay around 15-17 EUR per night for a 4-6 bed dorm room and around 50 EUR for a private room.\nHostels in Naples usually includes free WiFi, breakfast, and linens.\nOn Airbnb, you can find shared rooms starting around 10 EUR per night while entire apartments being at 30 EUR per night.\nThe coperto (table charge) is usually 1-3 EUR and is a rip off, but unfortunately built into every bill.\nTransportation costs – Traffic in Naples is nuts, and taxis tend to be expensive.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/naplesguide-1024x432.jpg"}}},{"node":{"id":"5b95ea8b87be05832748ffb5","title":"Cinque Terre Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"– You should expect to pay around 20-25 EUR a night for a 4-6 bed dorm room and around 50 EUR for a private room.\nOn Airbnb, you can find shared rooms starting around 25 EUR per night and entire apartments starting around 55 EUR per night.\nAverage cost of food – Cinque Terre is an expensive place to eat.\nTransportation costs – Cinque Terre has several ways to get around.\nIf you’re going between all five, purchase a Cinque Terre Card (17 EUR for the day).","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/ctguide-1024x432.jpg"}}},{"node":{"id":"5b95ea8987be05832748ffb4","title":"Venice Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"If you wish to stay in the city, expect to pay around 30-50 EUR per night for a dorm room.\nOn Airbnb, you can find shared rooms starting around 20 EUR per night or you can rent entire homes starting at 45 EUR and up.\nIt’s better to eat out for lunch rather than dinner since lunch menus are often under 20 EUR.\nTransportation costs – Venice is a pedestrian’s city.\nA 1-day ticket is 20 EUR and a 7-day pass is 60 EUR.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/veniceguide-1024x432.jpg"}}},{"node":{"id":"5b95ea8787be05832748ffb3","title":"Things to Do and See in Pompeii","source":"nomadicmatt","summary":"Being such a huge history geek, visiting Pompeii, the city destroyed by Mount Vesuvius in 79 AD, has always been high on my list of things to do.\nThe ForumThe most crowded place in Pompeii, the forum is right near the main gate.\nIt was the main center of life in Pompeii and is also were you can go see the relics they found.\nI bought the audio tour for 10 euros and found it to be a waste of time.\nIn the time I was there, I barely scratched the surface of Pompeii, and I filled a whole day!","info":{"author":"Michael Tyson, Brigit Carroll","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/07/pomeiilead.jpg"}}},{"node":{"id":"5b95ea8587be05832748ffb2","title":"Florence Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"– You’ll pay around 16 EUR a night for a 4-6 bed dorm room and around 40-50 EUR for a private room that sleeps two.\nBudget hotel prices – A night in a 2-star budget hotel in a room that sleeps two starts around 35 EUR (expect to pay nearly double in the high season).\nYou can find cheap sandwich shops all over the city for around 6 EUR a panini, and fast food costs around the same.\nExpect to pay 60 EUR per week for groceries that will include pasta, vegetables, chicken, and other basic foods.\nA bus ticket that’s valid for 90 minutes costs 1.20 EUR (or 2 EUR if purchased on the bus).","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/florenceguide-1024x432.jpg"}}},{"node":{"id":"5b95ea8387be05832748ffb1","title":"Pisa Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Visit the Baptistery of St. JohnLocated right next to the Leaning Tower of Pisa, the Baptistery of St. John is actually slightly taller than the Tower.\nBecause the interior is very plain, it may not be worth battling the crowds to go inside.\nCheck out the Museo dell’Opera del DuomoAt the east end of Piazza del Duomo is the Museo dell’Opera del Duomo.\nSee Piazza dei CavallieriThis square was at one time the center of the medieval Pisa.\nIt has tons of detail and is a good place to see medieval architecture.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/pisaguide-1024x432.jpg"}}},{"node":{"id":"5b95ea8187be05832748ffb0","title":"Milan Travel Guide: : What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Milan is the fifth-largest city in the European Union and is recognized worldwide for being a design and fashion capital.\nBut it has glitz and a few historic sites, for me, Milan is a meh kind of city that didn’t really amaze me.\nTaking the stairs costs 11 EUR and the elevator costs 15.\nMilan is home to two of the world’s best football teams – AC Milan and Inter.\nVisit Pinacoteca di Brera Fine-tune that sweet tooth for art even more by making a visit to the Pinacoteca di Brera.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/02/milanguide-1024x432.jpg"}}},{"node":{"id":"5b95ea7f87be05832748ffaf","title":"Rediscovering Italy","source":"nomadicmatt","summary":"More importantly, this trip would include southern Italy, the place I could never quite seem to get to last time.\nBut that changed when G Adventures offered me a tour through northern Italy.\nThe others on the trip had a limited time in Italy, so for them, the trip was perfect.\nWhile the trip wasn’t the south, it gave me a chance to rediscover all the cities I’d visited years back.\nComing back to northern Italy wasn’t part of the plan, but sometimes it’s when you skip the plan that things work out.","info":{"author":"Jessica Skelton, Sarah Lavender Smith, Sean Miller, Richard Wilson, Michael Tyson, Lara Dunston","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/06/cinqueterre.jpg"}}},{"node":{"id":"5b95ea7d87be05832748ffae","title":"My Favorite Cheesy Tourist Activities and Why I Love Them","source":"nomadicmatt","summary":"Updated: 7/1/2018 | July 1st, 2018Here’s a secret: I love being a cheesy tourist.\nAs much as I love getting off the beaten path and learning about local cultures, sometimes I love the artificial world the mainstream travel industry has created.\nI’ve always found travelers who shun anything “cheesy” to be some of my least favorite.\nSo today, let’s indulge the cheesy tourist in all of us that we don’t want to admit we have and share some of our favorites.\nDisney WorldI love Disney World.","info":{"author":"Richard Woulfe, Tasha Hacker, Anita Mac, Julio Moreno, Burcu Basar","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2013/05/venicegondola.jpg"}}},{"node":{"id":"5b95ea7b87be05832748ffad","title":"Nomadic Matt's Travel Site","source":"nomadicmatt","summary":"We use cookies to ensure you receive the best experience on our site.\nIf you continue to use this site, you are agreeing to our terms and conditions","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/themes/nomadicmatt/images/favicon.ico"}}},{"node":{"id":"5b95ea7987be05832748ffac","title":"Walking the Cinque Terre","source":"nomadicmatt","summary":"The Cinque Terre consists of five beautiful hillside towns (Riomaggiore, Manarola, Corniglia, Vernazza, Monterosso) on the west coast of Italy.\nNot just “This place is beautiful” beautiful but more like “I died and gone to heaven and never want to leave” beautiful.\nIf it wasn’t for the money (The Cinque Terre is as expensive as it is beautiful), I would have stayed longer.\nThe Cinque Terre has amazing walking trails that give you a chance to fully explore the towns, olive groves, vineyards, and surrounding area.\nA trip to Italy just isn’t complete without a trip to the Cinque Terre.","info":{"author":"Marcy Gordon, Johnny Vagabond, Nomadic Matt, Jen Laceda, Kirsten Alana, Wendy Sewell, Dave, Steve Ion, Annette Renee White","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/01/cinqueterre1.jpg"}}},{"node":{"id":"5b95ea7787be05832748ffab","title":"I Still F*ing Hate Ko Phi Phi","source":"nomadicmatt","summary":"That’s how much I hate Ko Phi Phi.\nThe entire coast was devastated, with Phi Phi one of the hardest it.\nIt’s safe to say that the next time the guide needs updating, I won’t be checking up on Ko Phi Phi.\nAs far as I’m concerned, Ko Phi Phi has lost what little soul it had left.\nPhi Phi has no redeeming qualities.","info":{"author":"Ryan Biddulph, Jeffrey L, Eric Coleman, Kathryn Clayton, Breezy Baldwin, Kristoffer Føns, Jeroen Vogel, Ryan Serrano, Peter Line, Kartik Kannan","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/02/phiphimatt11.jpg"}}},{"node":{"id":"5b95ea7387be05832748ffa9","title":"Adventure Races and Overland Travel: An Interview with Ric","source":"nomadicmatt","summary":"Overland travel is one of my favorite ways to travel.\nI have produced two full-length travel documentaries, including Hit the Road: Cambodia, and keynoted at the PATA Adventure Travel and Responsible Tourism Conference.\nI documented both “the Rickshaw Challenge” and “the Cambo Challenge” by producing a full-length, adventure travel documentary.\nI travel a certain way but there are many ways to travel the world.\nI hope these stories show you that there is more than one way to travel and that it is within your grasp to reach your travel goals.","info":{"author":"Gina, Ric Gazarian, Pilot Mark, Izy Berry","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/07/globalgaz4-6.43.05-AM.jpg"}}},{"node":{"id":"5b95ea7187be05832748ffa8","title":"Ko Lipe: The Greatest Month in All my Travels","source":"nomadicmatt","summary":"As we passed deserted, jungle-covered islands, I wandered to the top deck where a guy was playing guitar for the few people going to Lipe.\nAs we walked to the other side of the island, I could see Olivia was right: Ko Lipe was paradise.\nPaul, Jane, and I became close friends as time went by.\nPaul, Jane, Pat, and Olivia were staying and I felt like I was being ripped apart from my family, never knowing when I would see them again.\nPaul, Jane, and I decided to have own our Christmas together.","info":{"author":"Kat Weiss, Ryan Biddulph, Amy Morgan, Bertahan Luxing, Tiffany Grigg, April Hope, Alexander Roberts","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/03/kolipe-beach.jpg"}}},{"node":{"id":"5b95ea6f87be05832748ffa7","title":"Is it Safe to Travel to the United States?","source":"nomadicmatt","summary":"After all, just like how we in the United States have a perception that the rest of the world is unsafe and unwelcoming, so too the rest of the world has that perception of the United States.\nBut, just like Europe, the United States is safe to visit.\nFirst, the United States is very big and very, very diverse.\nAlso, you have less of a chance of dying in a terrorist attack in the United States than dying by a bathtub.\nThe United States is not all filled with gun carrying, immigrant hating, racist, ignorant, fearful yokels.","info":{"author":"Diego Núñez, Pilot Mark, Abhishek Soni, Devesh Joshi, Brian Garcia, Sonal Kwatra Paladini, Jaunting Jen","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/05/usasafe1c.jpg"}}},{"node":{"id":"5b95ea6d87be05832748ffa6","title":"Ko Phangan: An Insider's Guide to This Crazy Paradise","source":"nomadicmatt","summary":"But we’re going to focus on one part of this island: Haat Rin Beach.\nTravelers come for one thing: The Full Moon Party, an event that turns out 10,000-40,000 people each month, depending on the time of year.\nWhat started as a quiet beach party morphed into a beach rave and is now a giant beach drinking festival.\nBut, accept the island for what it is – a tourist party island – and you will open yourself up to just enjoying yourself, free of expectations about authentic travel.\nBe sure to visit our robust destination guide on Ko Phangan for even more planning tips!","info":{"author":"Justin Klein","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/01/kophangan_saturday_city.jpg"}}},{"node":{"id":"5b95ea6b87be05832748ffa5","title":"Nomadic Matt's Travel Site","source":"nomadicmatt","summary":"A lot of people don’t get the best impression of Bangkok, but it’s a city worth seeing!\nOnce you get off the beaten path, away from the tourists, and into the local pace of life, you will discover that Bangkok has a ton to offer!\nHere’s my advice on how to spend 4 days there that will leave you coming back for more!","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/themes/nomadicmatt/images/favicon.ico"}}},{"node":{"id":"5b95ea6987be05832748ffa4","title":"A Visitor's Guide to Songkran (Thai New Year)","source":"nomadicmatt","summary":"Posted: 04/22/2017 | April 22nd, 2017Songkran is a three day water fight that celebrates the Thai New Year.\nSongkran stands to be the most popular festival of Thailand that marks the beginning of a new solar year and is a time of renewal and rebirth.\nThe word Songkran is from the Sanskrit language and means the passage of the sun from one sign of the Zodiac to another.\nSongkran takes place all over the country and, if you are in Thailand during this time, you WILL experience it.\nBe sure to visit our robust destination guide on Thailand for even more planning tips!","info":{"author":"Andy Hayes, Dave","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/04/songkrannye.jpg"}}},{"node":{"id":"5b95ea6487be05832748ffa2","title":"Costa Rica Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Located on the Caribbean coast, this city is popular with expats and backpackers because of its great beaches, surf, and party atmosphere.\nIt is one of my favorite towns in the country because its Rasta influence makes it very different than the rest of Costa Rica.\nVisit San José Costa Rica’s capital is located in the center of the country making it a great hub.\nLearn some Spanish Costa Rica is one of the most popular Latin countries for learning Spanish due to the country’s easy to understand dialect.\nPrograms vary in length and cost, but most offer the opportunity to do a homestay with a Costa Rican family.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/07/costarica-1.jpg"}}},{"node":{"id":"5b95ea6387be05832748ffa1","title":"Morocco Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Get lost in the medinas The medinas are the historic hearts of each city in Morocco: part residential area, part shopping center, part food market.\nIt’s a challenging hike but if you’re looking for something truly different and outdoorsy in Morocco, don’t miss out on this.\nLearn to cook traditional food Traditional Moroccan food is a blend of Berber, Arabic, Turkish, Middle Eastern, and French cuisine.\nCatch some waves Morocco is extremely popular among surfers.\nVisit Tangiers This major city in northern Morocco is located on the North African coast at the western entrance to the Strait of Gibraltar.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/02/moroccoguide-1024x432.jpg"}}},{"node":{"id":"5b95ea6187be05832748ffa0","title":"Rome Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Considered the center of the world for centuries, the birthplace of Caesar, and home to the Catholic Church, Rome is a city built on history.\nRome is Rome.\nRome is tremendous and, though crowded, it is a city filled with life, beauty, and charm.\nExplore the seat of Ancient Rome and experience from where Rome administered its empire.\nSee a show Aside from beautiful auditorium complexes, Rome is often host to world-class operas and concerts performed by international musicians.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/romeguide7-1024x432.jpg"}}},{"node":{"id":"5b95ea5f87be05832748ff9f","title":"Coming Back to Bangkok: The City I Can Never Escape From","source":"nomadicmatt","summary":"As I rode the new train into the city, I wondered what else would be different.\nThough I’ve been away a long time, Bangkok and I are as close as ever.\nYou go home to work?”“Yeah, I work on the Internet, though, so I can work anywhere.”“Why don’t you work here?” she presses.\nShe compliments me on how good my Thai still is, though I think she’s just being polite.\nThere’s nothing unfamiliar about Bangkok and every part of it feels normal to me.","info":{"author":"Drew Meyers, Zablon Mukuba, Sharon M, Rameez Usmani","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/11/bangkok_home.jpg"}}},{"node":{"id":"5b95ea5d87be05832748ff9e","title":"Is Europe Safe to Visit Right Now?","source":"nomadicmatt","summary":"Thanks to a few high-profile terrorist attacks and riots across Europe and ongoing media coverage of things that are only ever bad, I’ve gotten a number of emails asking me if Europe is safe to visit.\nThe questions are always the same:“Is the likelihood of a terrorist attack high?\nWe’re petrified of being in a terrorist attack, but we hardly ever give any thought to getting in a car or the bathtub.\nAs fellow writer Wendy Perrin said, “Is it virtually certain that there will be another terrorist attack in Europe in the next 12 months?\nIt’s highly unlikely you’re going to end up in a terrorist attack or the middle of a riot.","info":{"author":"Scot Mckay, Crystal Obregon, Jesper, The Biveros Effect, Pilot Mark, Le Mans, Roman Melnyk, Jill At Reading The Book, Sedar Travel, Aana Thomas","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/04/europesafe1.jpg"}}},{"node":{"id":"5b95ea5b87be05832748ff9d","title":"Nomadic Matt's Travel Site","source":"nomadicmatt","summary":"I didn’t really like Vienna the first time I went, but over the years the city has changed — and so has my opinion of it.\nWhat was once a stiff capital city is now a more relaxed, arty destination.\nWith tons of museums and history, as well as some great food and wine, Vienna is worth taking the time to visit.\nHere is my suggested itinerary if you’ve got a week to spend in the capital.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/themes/nomadicmatt/images/favicon.ico"}}},{"node":{"id":"5b95ea5787be05832748ff9b","title":"Changing Plans and Getting Personal","source":"nomadicmatt","summary":"I realize I don’t talk about my personal life a lot.\nIt’s not to say I don’t write personal posts.\nBut I’ll be including more personal stories about my life on the road from now on.\nWhile I have an emergency passport, I’ve been warned against traveling back to the States and then to the UK on one.\nI’m going to start the application process for a real passport, then go spend my birthday on the Greek Islands.","info":{"author":"Samuel Jeffery, Alex Cuadrado, Matthew Karsten","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/06/changingplans11.jpg"}}},{"node":{"id":"5b95ea5087be05832748ff98","title":"When Can You Say You Know a Place?","source":"nomadicmatt","summary":"And then we leave saying “we’ve seen a place,” happy in our efforts not to be a tourist.\nAt what point can you leave a place and say “I saw and know something about life in city X.” I don’t think we ever really can.\nThey have come to get to know a place through more than just a few pictures.\nBut despite my short stay here and lack of any “real” sightseeing, I feel like I know Stockholm a bit more than I normally would have otherwise.\nI still would never say I know Stockholm but, through my friends, I got to see how the locals live and, at the end of the day, that is what traveling is all about.","info":{"author":"Nomadic Matt, Dave, Mark H, John Bardos","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/10/knowplace001.jpg"}}},{"node":{"id":"5b95ea4f87be05832748ff97","title":"Thoughts on Long Term Travel: Can you Travel For too Long?","source":"nomadicmatt","summary":"I was pushing her to travel the world like I push everyone to travel the world.\nTravel eventually becomes all you know.\nEven the long, long-term travelers I know eventually get a home base.\nWhen travel becomes a lifestyle, I think it’s a sign you have been on the road too long.\nSometimes I think I’ve been on the road too long.","info":{"author":"Gary Arndt, Robert Reid, Camels, Jen Laceda, Wendy-Escape Ny, Mark, Nora - The Professional Hobo, Prêt À Voyager, Heather Dowd, Jeremy","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/04/toolongtravel001.jpg"}}},{"node":{"id":"5b95ea4887be05832748ff95","title":"Bahamas Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Expect to pay at least 95 BSD a night for a room in a 2-star budget hotel that sleeps two.\nYou can find entire apartments starting around 50 BSD but you’ll find much more inventory if you look at 90 BSD and up.\nFood – You’ll pay around 8 BSD for fish, a side dish, and dessert, which is fairly reasonable for local fare.\nExpect to pay 60 BSD per week for groceries that will include pasta, vegetables, chicken, and other basic foods if you plan on cooking.\nAnother option is the wildly popular water-taxi that runs every hour for 6 BSD from Nassau to Paradise Island.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2017/12/bahamasguide-1024x432.jpg"}}},{"node":{"id":"5b95ea4287be05832748ff93","title":"Cheap Places to Travel on the US Dollar","source":"nomadicmatt","summary":"Yet despite the sorry state of the US dollar, the world is still filled with great and cheap places where the dollar can go far.\nIn fact, there are places in the world where the dollar has actually risen in value over the last few years.\nHere are some cheap destinations where your dollar can go far:Costa RicaCosta Rica is one of the few countries to have its currency lose ground to the dollar.\nVietnamWhile I’m not a huge fan of Vietnam, it’s certainly a cheap country.\nIndiaWhile India has always been a cheap country, the Indian rupee used to ride high at 39 to the dollar.","info":{"author":"Leila Leidtke, Ellen Keith, Ava Apollo, Benson Wallace","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/10/cheapusdollar.jpg"}}},{"node":{"id":"5b95ea4187be05832748ff92","title":"How to Visit Azerbaijan: What to See and Do, and Suggested Itineraries","source":"nomadicmatt","summary":"But honestly, you don’t really need 30 days to visit Azerbaijan.\nOn your first day here, wander around the old city.\nAdditionally, there’s a fortress and few churches in the old town fortress down the street from the caravanserai.\nThere’s really nothing else worth sticking around for.\nBook Your Trip to Azerbaijan: Logistical Tips and Tricks Book Your FlightFind a cheap flight to Azerbaijan by using Skyscanner or Momondo.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/07/azer2.jpg"}}},{"node":{"id":"5b95ea3d87be05832748ff90","title":"Are We All Flashpackers Now?","source":"nomadicmatt","summary":"Eighteen months later when I traveled Australia after living in Thailand, I noticed a lot of travelers had phones, some hostels had Wi-Fi but few had computers.\nNow everywhere I go, I see mobile phones, Wi-Fi available, netbooks, and SLR cameras.\nAnd I see expensive phones, too.\nWhat used to be expensive and inconvenient on the road (and, thus only available to “flashpackers”) is now cheap and easy for all.\nThe term Flashpackers went out of style shortly after I wrote this post because, it turned out, we all became flashpackers.","info":{"author":"Kristina Luna, Tim Bray, Sarah Lavender Smith, Tim L., Dave, Claire Algarme","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/02/flashpackingnow001.jpg"}}},{"node":{"id":"5b95ea3887be05832748ff8e","title":"Ko Chang, Thailand","source":"nomadicmatt","summary":"Located near the Cambodian border, I first heard of Ko Chang during my first visit to Thailand back in 2005.\nI was in Chang Mai and two backpackers were arguing over whether I should go to Ko Chang or Ko Samet.\nI had heard rumors and stories about the island since 2005 about how tourism had exploded on Ko Chang and its neighboring islands.\nKo Chang is the second largest island in Thailand so there is a lot of space to move around and get away from the crowds.\nYet despite its recent increase in tourism, Ko Chang still offers a lot of peace and quiet.","info":{"author":"Jen Laceda, Mary R","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/07/kohchang.jpg"}}},{"node":{"id":"5b95ea3687be05832748ff8d","title":"The Complete Guide to Diving in Koh Tao","source":"nomadicmatt","summary":"There are over 50 scuba diving training systems, but in Koh Tao, the choice almost always comes down to two: PADI or SSI.\nFor divers on Koh Tao, the benefit of doing an SSI certification comes down to best bang for your baht.\nKoh Tao ain’t called a mecca for diving for nothing: there are nearly 50 dive schools on this 13-square-mile rock!\nSail RockSail Rock is an ocean pinnacle located between Koh Tao and Koh Pha Ngan.\nIt is just off the coast of Koh Nang Yuan, a tiny island north west of Koh Tao.","info":{"author":"El Che, Adam Finan","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/02/alexsnorkel.jpg"}}},{"node":{"id":"5b95ea3487be05832748ff8c","title":"Jungle Trekking in Khao Sok, Thailand: A Complete Visitor's Guide","source":"nomadicmatt","summary":"Updated: 07/07/18 | July 7th, 2018Located in the south of Thailand, Khao Sok National Park has always held my imagination.\nGibbons in Khao Sok are rare to see, so it was quite amazing, especially since I love monkeys, though they moved too quickly to be photographed.\nI left Khao Sok with a sense of rawness.\nAnd in Khao Sok, it was just me, the jungle, and that sense of adventure.\nBook Your Trip to Khao Sok National Park: Logistical Tips and Tricks Book Your FlightFind a cheap flight to Thailand by using Skyscanner or Momondo.","info":{"author":"Ray, Deb Hocking, Jon Stark, Marla Fisher, Deepika Arora, Dom Burbidge","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/01/khaosokjungle.jpg"}}},{"node":{"id":"5b95ea3287be05832748ff8b","title":"How Much a Holiday in Thailand Costs","source":"nomadicmatt","summary":"But that changed when my friends came, and why that changed is important for anyone planning to come to Thailand.\nI tell people that backpacking around Thailand costs $30–35 USD per day, depending on how much alcohol you consume and how many days you spend on the islands, where costs are higher.\nThough my intention was to do “Thailand on a budget,” as I traveled with my friends, I realized something I’d forgotten.\nI think a budget of around $50 USD per day would be perfect for a short vacation to Thailand.\nThrow in some extra money for shopping, and a maximum of $55 USD per day would give you a very, very nice budget vacation in Thailand.","info":{"author":"Ronald Robbins, Nate Yomadic, Drew Meyers, Simon P","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2012/01/thaibeach1.jpg"}}},{"node":{"id":"5b95ea2e87be05832748ff89","title":"How to Visit Azerbaijan: What to See and Do, and Suggested Itineraries","source":"nomadicmatt","summary":"But honestly, you don’t really need 30 days to visit Azerbaijan.\nOn your first day here, wander around the old city.\nAdditionally, there’s a fortress and few churches in the old town fortress down the street from the caravanserai.\nThere’s really nothing else worth sticking around for.\nBook Your Trip to Azerbaijan: Logistical Tips and Tricks Book Your FlightFind a cheap flight to Azerbaijan by using Skyscanner or Momondo.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/07/azer2.jpg"}}},{"node":{"id":"5b95ea2a87be05832748ff87","title":"The Catacombs of Paris: What It's Like to Experience Paris' Dark Side","source":"nomadicmatt","summary":"Updated: 04/05/2018 | April 5th, 2018Underneath the city of Paris, you’ll find a honeycomb of tunnels.\nYet, in this maze of tunnels, one part open to the public – the famous “Catacombs” of Paris.\nThe Catacombs of Paris were created at the end of the 18th century.\nTo get to the Catacombs of Paris, you can take the subway and the RER to Denfert-Rochereau or use Bus 38 and 68.\nVisiting the Paris Catacombs is one of my favorite activities in the city and something I highly recommend you don’t skip.","info":{"author":"Dave, Jen Laceda, Spencer Spellman, Erica Connolly, Ryan Biddulph","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/05/catacombsparis2.jpg"}}},{"node":{"id":"5b95ea2887be05832748ff86","title":"Interview with Rolf Potts","source":"nomadicmatt","summary":"Rolf Potts is one of the most famous modern travelers writers out there.\nHe burst onto the scene with his book, Vagabonding, and since then, the book has become a must travel for first time travelers.\nDid you think your first book, Vagabonding, would be so successful?\nI don’t think this attitude is all that new.\nFor more information about Rolf Potts, visit his website Vagablogging.","info":{"author":"Jessie V, Mark H, Byteful Traveller, Lauren Quinn","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2009/01/rolfpotts001.jpg"}}},{"node":{"id":"5b95ea2687be05832748ff85","title":"Crete Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"– An average price of a hostel here is 10-25 EUR per night for a dorm bed.\nBudget hotel prices – You can find rooms at 2-star hotels starting at 25 EUR a night.\nDuring the summer, expect to pay much more as Crete is a popular destination during July and August.\nTransportation costs – Crete has a bus system that is easy and cheap to use.\nRentals prices will vary, but expect to pay around 30 EUR per day for a car.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/crete_guide-1024x432.jpg"}}},{"node":{"id":"5b95ea2487be05832748ff84","title":"Santorini Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"You can book your hostel with HostelworldBudget hotel prices – You can find a hotel room in a budget hotel for 30 EUR per night.\nHotels at this price point offer air-conditioning, free WiFi, a TV, a mini-fridge, a private bathroom and many offer free breakfast.\nOn Airbnb, private rooms start at 25 EUR and entire homes (including studio apartments) can be rented for 40 EUR.\nTransportation costs – A bus trip will cost you between 1.80-2.40 EUR depending on where you are going.\nA daily rental starts at 30 EUR per day.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/santoriniguide-1024x432.jpg"}}},{"node":{"id":"5b95ea2287be05832748ff83","title":"Sparta Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"I wouldn’t suggest skipping Sparta – your visit here will be very rewarding and give you a chance to see Greece without the crowds!\nSparta Lakonia Archaeological Site Sparta is second only to Athens in terms of historical significance.\nThe archeological site in Sparta is great for anyone interested in Greek history, containing many famous ruins and an archeological museum full of ancient artifacts.\nEntrance is 15 EUR, and the guided tour is only in Greek, so you may want to buy an information guide.\nTransportation costs – Sparta is pretty small and walkable, but taking the bus is a good option if you’re staying right in Sparta.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/05/sparta-1.jpg"}}},{"node":{"id":"5b95ea2087be05832748ff82","title":"Ios Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"– Hostels start at about 12 EUR per night for a dorm room and 30-40 EUR for a private room.\nBudget hotel prices – You can find private rooms starting at about 30 EUR per night (expect to pay more in the high-season).\nAverage cost of food – Ios is filled with cheap food thanks to all the backpackers that flood the island.\nMost meals will cost around 8-11 EUR, including a drink.\nThe nicest places on Ios cost around 27 EUR including a glass of wine.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/iosguide-1024x432.jpg"}}},{"node":{"id":"5b95ea1e87be05832748ff81","title":"Connecting on the Island of Ios in Greece: A Travel Story","source":"nomadicmatt","summary":"At the beginning of the year, I decided I’d spend the summer in Europe, with most of my time spent on the island of Ios in Greece.\nI have to return to the US in June to speak at TBEX, cutting my summer trip in half.\nSo, heavy heart in hand, I arrived in Ios more than two weeks ago to stay for four nights.\nNow I’m contemplating spending my last two days in Greece back on Ios.\nBook Your Trip to Ios: Logistical Tips and Tricks Book Your FlightFind a cheap flight to Ios by using Skyscanner or Momondo.","info":{"author":"Jen Laceda, Griffin Stewart, Caz Makepeace, Drew Meyers, Julia Dimon","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/05/iosconnection.jpg"}}},{"node":{"id":"5b95ea1d87be05832748ff80","title":"My Big Fat Greek Festival: The St. John's Festival on Ios","source":"nomadicmatt","summary":"Francesco, the owner of my hostel, had invited me to this festival of all things Greek.\nArriving at the festival at last, Francesco ushered me past the dancers and into the back garden of the tiny monastery.\nIn front of me were Greek women cleaning large food bowls, as well as huge cooking pots heating soup and goat meat.\nHere I was, a stranger in their world, and these old, cigarette-smoking Greek men were enjoying it as much as I was.\nI’d come to watch their festival, but in some ways, their festival was watching me.","info":{"author":"Kelly Coop","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/07/greecefestival1.jpg"}}},{"node":{"id":"5b95ea1a87be05832748ff7f","title":"Mykonos Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"– You can find cheap hostels on Paradise beach for 15 EUR per night (during the low season).\nHowever, most hostels on this island aren’t cheap and cost around 30 EUR per night.\nOn Airbnb, shared rooms start at 15 EUR and entire homes (including studio apartments) can be rented for 50 EUR per night.\nYou can rent a moped for one day for 22 EUR (but as low as 10 EUR per day in the low season).\nBus tickets cost about 1.60 EUR (night buses cost 2 EUR).","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/01/mykonosguide-1024x432.jpg"}}},{"node":{"id":"5b95ea1387be05832748ff7e","title":"Chasing Ghosts Again","source":"nomadicmatt","summary":"Last year, I talked about how travelers are often chasing ghosts.\nBut it had nothing to do with chasing the ghosts of travels past.\nWas I chasing ghosts in Ios?\nEven though I think we as humans are wired to hold onto those highs and try to re-create them, going back to a place you love doesn’t have to be about chasing ghosts.\nJust be there to enjoy a good place as a good place, having a good time without comparing it to the past.","info":{"author":"Matthew Karsten, Katie K","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2011/06/ghostsagain1.jpg"}}},{"node":{"id":"5b95ea1187be05832748ff7d","title":"Diving the Great Barrier Reef","source":"nomadicmatt","summary":"The Great Barrier Reef is one of the best dive sites in the world.\nI was excited to use my newly acquired dive skills and dive this reef.\nEven if you don’t want to dive, most dive trips will let you join and snorkel the reef.\nThe Ningaloo reef has a lot more fish and the reef is more pristine.\nHowever, the Great Barrier Reef is like nothing else I’ve ever seen and if you get away from the areas where all the day trips go, you’ll find a very pristine environment.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2010/03/barrierreef001.jpg"}}},{"node":{"id":"5b95ea1087be05832748ff7c","title":"How to Visit the Philippines on a Budget in 2018: Prices & Ways to Save","source":"nomadicmatt","summary":"The Philippines is one of the most incredible budget travel destinations in the world due to its perfect white-sand beaches, enchanting seas, mesmerizing sunsets, friendly locals, and relaxed, tropical vibes.\nObviously, your budget can balloon, especially if you’re staying at luxurious beachfront resorts, eating out at fancy restaurants, and taking expensive tours.\nHow much it costs to travel in The Philippines really depends on your travel style and where you go.\nStay with locals – Couchsurfing is very popular in the Philippines, and it’s a great way to meet people and save on accommodation costs.\nHe blogs about budget travel and online entrepreneurship at The Broke Backpacker and enjoys a cheeky smoke, a good book, and a perfect sunset to round off the day.","info":{"author":"Will Hatton, Ryan Biddulph, Gabriel K Jones","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/05/philippines.jpg"}}},{"node":{"id":"5b95ea0e87be05832748ff7b","title":"My (Current) Ultimate List of Travel Movies","source":"nomadicmatt","summary":"Way back in 2008, I created a list of ten of the best travel movies ever.\nBesides being a inspiring travel movie, it’s one of my favorite foreign-language movies.\nArtfully shot with intriguing characters and beautiful scenery, this is not only one of my favorite travel movies (and a phenomenal look at Indian culture) but one of my all-time favorite movies ever.\nSeriously, this is my favorite travel movie.\nThere are many travel movies out there — most of them horrible — but out of the countless movies I’ve seen, these are my favorite.","info":{"author":"Caroline Eubanks, Andrea Anastasiou, Sonja Riemenschneider, Everybody Hates A Tourist, Tomáš Vachuda, Elizabeth Hilton, Anca, K. Renae P., Trisha Barnes, Stephen Gollan","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/01/moviescreen-12.jpg"}}},{"node":{"id":"5b95ea0c87be05832748ff7a","title":"Tips for Traveling in “Dangerous” Countries","source":"nomadicmatt","summary":"While common sense should be the traveler’s golden rule no matter where he or she roams, there are a few other tips that you can take along when planning to travel to “dangerous” places.\nKeep an emergency contact card in your pocket, wallet, or bag.\nIn case of an emergency, please contact my husband, Francisco Collazo, at 001-123-456-7890.” Two important tips: (1) Be sure to put the country code of your emergency contact in the phone number.\n(2) Write the card in English and in the language of the country where you’ll be traveling.\nA great way to begin contesting the image of certain countries as dangerous is to share our travels there through blogs or slideshows.","info":{"author":"Wilson Usman","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2008/07/tipsfordangeroustravel06.jpg"}}},{"node":{"id":"5b95ea0987be05832748ff79","title":"Ko Phi Phi Travel Guide: What to See, Do, Costs, & Ways to Save","source":"nomadicmatt","summary":"Fire shows and Thai boxing matches are a regular occurrence at the beach bars.\nPartying is not cheap here and is one of the reasons people end up spending too much money here!\nDive the King Cruiser WreckOne of the best dive sites off Ko Phi Phi is the King Cruiser wreck.\nCheck out Thai BoxingThe Reggae Bar offers Thai boxing nightly.\nHang out on Monkey BeachMonkey Beach is one of the most beautiful beaches in Thailand, not just Ko Phi Phi.","info":{"author":"","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2018/04/kophiguide-1024x432.jpg"}}},{"node":{"id":"5b95ea0887be05832748ff78","title":"Searching for the Perfect Dram on Islay","source":"nomadicmatt","summary":"Located off the west coast of Scotland, Islay is a large island battered by the sea, wind, and rain.\nIt wasn’t until the early 2000s that Islay whisky became world famous.\nIt is this process that gives the whisky the flavor that has made Islay famous.\n(So if you like a real smoky, peaty whisky, get a young one!)\nFrom the friendly people with their small-town charm to the beautiful landscape, distilleries, and sea air, Islay was an island of dreams.","info":{"author":"Rosemary Fletcher, Sean Ogle, Serhat Engul, Raymond Carroll","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/12/islay2-1.jpg"}}},{"node":{"id":"5b95ea0687be05832748ff77","title":"The Mystical Smoo Cave of Scotland: A Traveler's Guide","source":"nomadicmatt","summary":"This month my friend Alex Berger talks about northern Scotland and shares the story of Smoo Cave.\nSmoo Cave isn’t the most grandiose cave you’ll ever explore.\nIn addition to Smoo Cave, Durness is also a popular base for exploring Cape Wrath.\nThere are several hostels and numerous hotels and B&Bs in the area; the most convenient for viewing Smoo Cave is the Durness Youth Hostel.\nSmoo Cave is free to visit but the boat tour costs roughly 5 GBP and typically lasts 20-30 minutes.","info":{"author":"Shaz Lake, Annie Craven, Alex Berger, Kevin Scullion, Jorja Alcorn","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2013/11/smoocavepic.jpg"}}},{"node":{"id":"5b95ea0487be05832748ff76","title":"The Cost of Traveling Laos","source":"nomadicmatt","summary":"), my time there gave me an excellent insight into how much you need to travel around Laos.\nWas I just being oblivious to super cheap Laos?\nI try to uncover as many inexpensive ways to experience a place as possible, but Laos was leaving me stumped.\nThis will allow you to get your own private room, eat local food, drink, and do what you want.\nHow to Save Money in LaosThough expensive relative to its neighbors, Laos is still a cheap country to visit.","info":{"author":"Samantha, Our Traveling Blog, Sarah Attaway, Ahmed Gusto, Gilda Baxter, Brandon A. Trean, Rashaad, Green Global Travel, Claire Algarme, Hn Maxa","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2015/12/costoflaos2.jpg"}}},{"node":{"id":"5b95ea0487be05832748ff75","title":"What to Do and See in Bangkok: A 4 Day Itinerary","source":"nomadicmatt","summary":"But while as a tourist you may not need tons of time to “see” the city, Bangkok is worth more than quick stay most travlers give it.\nCentralWorld – (999/9 Rama I Road, +66 2 635 1111, centralworld.co.th) — CentralWorld is the sixth largest shopping complex in the world.\nWhat to do in Bangkok: Day ThreeShop and eat at the Chatuchak Weekend MarketThe weekend market is one of the best things in Bangkok.\nThe two best are Bangkok Food Tours.\n– Located near Khao San Road, this restaurant is an institution in Bangkok and serves the best vegetarian Thai food in the area.","info":{"author":"Lauren Meshkin, Justin Urbas, Max Neumegen, Stephen Gollan, Abhilash Ps, Chloe Gibson, Jon Espina","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2016/03/4daysbangkok.jpg"}}},{"node":{"id":"5b95ea0087be05832748ff74","title":"How to Visit Alberto Gutiérrez, the Stone Carving Hermit of Nicaragua","source":"nomadicmatt","summary":"But if you’re looking for something different and personable, travel north to Esteli and search out Alberto Gutiérrez, the town’s stone-carving hermit.\n“We’ll head down there to Alberto’s house,” Rodney said to me.\nIf you find yourself in Nicaragua and want to see the most jovial and interesting man in the country, head up to Esteli and visit Alberto.\nTo visit Alberto Gutiérrez, take a bus or taxi to the Tisey Estanzuela Natural Reserve.\nRoam Nicaragua also has a tour for $30 USD if you don’t want to try to find Alberto by yourself!","info":{"author":"Kendra Granniss, Jonathan Look","top_img":"https://www.nomadicmatt.com/wp-content/uploads/2014/04/nicaraguastonecarver.jpg"}}}]}},"pageContext":{"source":"nomadicmatt","alias":"planning","label":"准备出发"}}