{"data":{"mongodbDatabaseArticles":{"id":"5b937b2987be056953db7d2d","content":"<div><h1 name=\"8d0b\" id=\"8d0b\" class=\"graf graf--h3 graf-after--figure graf--title\">6 Tools I&#8217;ve Used to Survive the Digital Nomad Lifestyle</h1><h2 name=\"69cc\" id=\"69cc\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">Everything I&#8217;ve learned to make living &amp; working remotely fun &amp; (mostly) crisis-free.</h2><p name=\"aabd\" id=\"aabd\" class=\"graf graf--p graf-after--h4\">Working remotely sounds like fun (and it is!), but it can be a logistical nightmare sometimes.</p><p name=\"cb2e\" id=\"cb2e\" class=\"graf graf--p graf-after--p\">Occasionally, something as simple as your phone dying while you&#8217;re on the go can set off a chain reaction: your plans for that afternoon go sideways, your productivity sinks, your brain gets overwhelmed, you&#8217;re already straining your budget&#8211;what are you even doing here in the first place!?</p><p name=\"0e2b\" id=\"0e2b\" class=\"graf graf--p graf-after--p\">Trust me, I know.</p><p name=\"5405\" id=\"5405\" class=\"graf graf--p graf-after--p\">I spent <a href=\"https://medium.com/startup-grind/why-i-ditched-the-office-to-work-remotely-ccab92a74482#.6s2eguca1\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">four months working and traveling through Southeast Asia</a>. That may not sound like much to you, but when you&#8217;re a digital nomad who&#8217;s flying solo, every day can present unexpected adventures&#8202;&#8212;&#8202;some more welcome than others. With that said, you got to be extra prepared to face all sorts of disasters and cope with stress while you&#8217;re overseas.</p><p name=\"b800\" id=\"b800\" class=\"graf graf--p graf-after--p\">If you ask me, these are the devices, platforms, and apps you&#8217;ll want to have right at your fingertips before booking a trip.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*Jrs2Wc1W27abCV2Pc3EXTQ.png\">Portable Charger |&#160;Anker<p name=\"c902\" id=\"c902\" class=\"graf graf--p graf-after--figure\">Whenever my phone drops below 50% battery life&#8211;whether that&#8217;s on the streets, on a plane, someplace rural on the edges of town&#8211;I worry. So much, in fact, that I can no longer think about getting any work done. It&#8217;s a major problem, not just for me but for anyone who&#8217;s constantly on the move, trying to hunt down coffee shops or a coworking space where they can do some work before leaving for another country.</p><p name=\"f063\" id=\"f063\" class=\"graf graf--p graf-after--p\">A simple solution is simply to bring a portable charger everywhere you go (<a href=\"http://amzn.to/2mwt1Ej\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">here&#8217;s mine</a>). You won&#8217;t use it every day, but you&#8217;ll be glad you have it on you for the times when you need to power up on the go.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*xSq_Lxw7Vw11cqmtWa3bAQ.png\">Buckets<p name=\"8db9\" id=\"8db9\" class=\"graf graf--p graf-after--figure\">I never really got into Trello. Most people say it&#8217;s the best project management tool and personal tab keeper there is, but to me, it&#8217;s too overwhelming for the individual user. I don&#8217;t use half the features, simply because I need to dig deep before understanding how everything works.</p><p name=\"160d\" id=\"160d\" class=\"graf graf--p graf-after--p\"><a href=\"https://www.buckets.co/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Buckets</a>, on the other hand, is more minimal. You can manage tasks in color-coded boxes, create multiple projects, delegate tasks to team members, make checklists, and connect with your team. And the best part? It&#8217;s completely free! The only investment you&#8217;re really putting in is your time and patience to set up your daily and weekly to-dos.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*4JkKnwUxHP5leOrKAbzlPQ.png\">Pocket<p name=\"e023\" id=\"e023\" class=\"graf graf--p graf-after--figure\">Often during my travels I found myself too busy to read&#8211;especially when I was trying to figure out where to go next and what needed to get done that day. That&#8217;s where <a href=\"https://getpocket.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Pocket</a> came in handy. The app lets you easily save articles from the web and read them on the go&#8202;&#8212;&#8202;whether that&#8217;s waiting for the train, standing in line at the supermarket, or sitting on the toilet. And because they&#8217;re saved to the app until you choose otherwise, you can do all that without an internet connection.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*mrboDlhZSR4wRo1wpTZxvQ.png\">Dashlane<p name=\"a4e8\" id=\"a4e8\" class=\"graf graf--p graf-after--figure\">When I worked overseas, I discovered and tried dozens of apps and tools in order to keep me productive. Some I discarded days or even hours after downloading them, and others (like the six here) I relied on heavily. But cycling through so many apps meant I had more than a few of those &#8220;oh-wait-what-was-my-password-to&#160;.&#160;.&#160;.&#160;?&#8221; moments.</p><p name=\"c271\" id=\"c271\" class=\"graf graf--p graf-after--p\">Don&#8217;t be like me and wreck your brain. Get <a href=\"https://rebrand.ly/dashlcdff\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Dashlane</a>. It stores all of your passwords and automatically fills them in for you. You can also store your credit card, driver&#8217;s license, passport, bank account, receipts, notes, and company information&#8202;&#8212;&#8202;you know, all those personal details you probably wouldn&#8217;t even share with a business partner.</p><blockquote name=\"9971\" id=\"9971\" class=\"graf graf--blockquote graf-after--p\"><strong class=\"markup--strong markup--blockquote-strong\">Bonus:</strong> If you <a href=\"https://www.dashlane.com/en/cs/6wKJx1cYmYF3\" class=\"markup--anchor markup--blockquote-anchor\" rel=\"noopener nofollow\" target=\"_blank\">sign up here</a>, you can get Dashlane Premium for free for six months, which lets you sync passwords across all your devices and in the cloud.</blockquote><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*X2hHy5wm9c8OONxXH3timw.png\">WorkHard Anywhere<p name=\"8f8b\" id=\"8f8b\" class=\"graf graf--p graf-after--figure\">There are loads of coworking spaces, coffee shops, and cafes to work from all over the world. But which ones have reliable Wi-Fi? Which have plenty of seats and electrical outlets? I was left guessing until a good friend of mine introduced me to <a href=\"http://workhardanywhere.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">WorkHard Anywhere</a>.</p><p name=\"14b9\" id=\"14b9\" class=\"graf graf--p graf-after--p\">WorkHard Anywhere pinpoints over 13,000 places to work from, all crowdsourced from freelancers, entrepreneurs, and digital nomads around the world. Each location is evaluated on a linear scale based on a handful of criteria: how fast the Wi-Fi is, the availability of seats, outlets, and parking, and the relative price of the food and drinks. So if you ever need to work someplace on the fly, this handy app can help you sidestep that popular tourist cafe that Yelp recommends, and find the one you&#8217;re really looking for&#8211;where you can get some work done.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*6kQZeMoXpLzUlsROkShxMQ.png\">Simple<p name=\"861c\" id=\"861c\" class=\"graf graf--p graf-after--figure\">Nothing frustrates me more than getting charged a $5 fee from the bank every time I withdraw cash overseas. Thankfully, there&#8217;s a new debit card out there that doesn&#8217;t charge international ATM fees&#8211;not even for overdrafts or card replacement!</p><p name=\"1d92\" id=\"1d92\" class=\"graf graf--p graf-after--p\">Called <a href=\"https://www.simple.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Simple</a>, it&#8217;s a fully online-operated bank. This is really nice for digital nomads, because you can go to any ATM to withdraw cash without getting fleeced by hidden fees. Not only can you monitor your spending habits by setting up &#8220;Goals&#8221; inside the app, you can also instantly transfer money to family and friends who have Simple, too (and vice-versa). In my experience, this was super convenient whenever I was low on cash and needed some fast.</p><p name=\"12c2\" id=\"12c2\" class=\"graf graf--p graf-after--p graf--trailing\">Just <a href=\"https://www.simple.com/friends/C6KQFD2\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">apply here</a> and you&#8217;ll also get a free minimalist wallet along with your card. There&#8217;s one important catch, though: Simple only lets you spend up to $1,000 a day overseas. If your charges go higher than that over 24 hours, you&#8217;ll need to contact Simple to increase your spending limit, which can go as high as $6,000.</p></div>","title":"6 Tools I’ve Used to Survive the Digital Nomad Lifestyle"}},"pageContext":{"id":"5b937b2987be056953db7d2d"}}