{"data":{"mongodbDatabaseArticles":{"id":"5b921d1b87be0571ac1b04f7","content":"<div><p>Picture this:</p>\n<p>You&#8217;re living wherever you want. You know your assets are safe. Your privacy is intact. And your tax obligations?</p>\n<p>Zero.</p>\n<p>It almost sounds too good to be true&#8230; But the strategies behind Flag Theory can lead to a life just like the one you&#8217;re picturing&#8211; A life of zero tax, secure assets, and boundless freedom.</p>\n<p>&#160;</p>\n<h2><b>So what is Flag Theory?</b></h2>\n<p>&#160;</p>\n<p>If you&#8217;ve spent any time here at <a href=\"http://www.nomadcapitalist.com\">Nomad Capitalist</a>, you know we talk about concepts of internationalization: having an <a href=\"http://nomadcapitalist.com/offshore-banking/\">offshore bank account</a>, obtaining a <a href=\"http://nomadcapitalist.com/second-passport/\">second passport</a>, and even <a href=\"http://nomadcapitalist.com/2014/04/11/best-offshore-web-hosts-privacy/\">hosting your website overseas</a>. Flag theory encompasses those ideas, and more.</p>\n<p>Put simply, Flag Theory is the idea that you must &#8220;<strong><a href=\"http://nomadcapitalist.com/2017/05/15/how-to-go-where-youre-treated-best/\">go where you&#8217;re treated best.</a>&#8221; </strong></p>\n<p>Every time you base a part of your life in a new country, you plant a &#8220;flag.&#8221;</p>\n<p>Some concepts behind flag planting have been around for decades (we&#8217;ll go over three flag theory and five flag theory a bit later).</p>\n<p>At Nomad Capitalist, we&#8217;re introducing new ideas to help implement Flag Theory in the 21st century. The goal of planting flags around the world is to diversify your personal and financial affairs so that no one government has control over you or your money.</p>\n<p>Intelligent people who love freedom shouldn&#8217;t be shackled to a single government&#8211;another idea at the core of Flag Theory. This concept flies in the face of almost everything most of us are told.</p>\n<p>Instead of learning how to plant flags, the average person:</p>\n<ul>\n<li>Is born <b>in one country</b>, and spends their entire life living there</li>\n<li>Goes to school&#8211;including university&#8211;<b>in that same country</b></li>\n<li>Gets a job<b> in that country</b></li>\n<li>Opens and maintains all of their bank accounts, retirement accounts, and savings accounts&#8230;<b>in that country</b></li>\n<li>Keeps the entirety of their finances in the national currency <b>of</b> <b>that country</b></li>\n<li>Owns real estate exclusively <b>in that country</b></li>\n<li>Stores their precious metals or other valuables <b>in that country</b></li>\n<li>Has only one passport and it&#8217;s <b>from that country</b> (if they have one at all!)</li>\n</ul>\n<p><strong>&#160;</strong></p>\n<p>In Utopia, that strategy will work out fine.</p>\n<p>But no one lives in Utopia. You live in a world where your government is all too happy to control your movement, tell you how to educate your children, tax you to death, tell you how to invest your money (or outright confiscate it). That&#8217;s not a recipe for a <a href=\"http://nomadcapitalist.com/2016/01/04/law-of-abundance-flag-theory/\">free, abundant life</a>.</p>\n<p>That strategy won&#8217;t save you a hundred thousand dollars in income, every single year. That strategy won&#8217;t net you an extra 1.5 million in your savings account over the next decade.</p>\n<p>Is the average person in your tax bracket paying less than 10% in taxes?</p>\n<p>Is the average person safely staying for months at a time in the countries you dream of visiting?</p>\n<p>No, the average person is not doing those things. The average person hasn&#8217;t learned how to plant flags and live a more prosperous, more adventurous life. Of course, I can&#8217;t guarantee that you&#8217;ll sleep more soundly, or be happier, or have more fun with my strategies&#8211;but I&#8217;d be really surprised if you didn&#8217;t.</p>\n<p>Governments can change on a dime. Being tied to one place is not a good idea. &#160;All throughout history, societies have risen and fallen. Today&#8217;s world leader may be on tomorrow&#8217;s ash heap.</p>\n<p>Flag Theory is a great way to insulate yourself, your family, and your assets from the negative effects of instability.</p>\n<p>With Flag Theory, you lose sleep because you&#8217;re up all night enjoying the <a href=\"http://nomadcapitalist.com/2017/08/14/nomad-guide-living-belgrade-serbia/\">nightlife in Belgrade</a>&#8211;not because you&#8217;re worried about your assets.</p>\n<p>With Flag Theory, your adrenaline is pumping because you&#8217;re <a href=\"http://nomadcapitalist.com/2013/11/15/living-in-kuala-lumpur-malaysia-a-hidden-gem-for-the-asia-expat/\">parachuting in Malaysia</a>&#8211;not because new tax reforms are going to hit your business even harder this year.</p>\n<p></p>\n<h2></h2>\n<h2></h2>\n<h2><b>Why use Flag Theory?</b></h2>\n<p>&#160;</p>\n<p>As a perpetual traveler, I spend time in as many as thirty countries in a year. Do you have to become a perpetual traveler in order to successfully plant flags? No.</p>\n<p>I&#160;became a perpetual traveler (also known as &#8220;PT,&#8221; &#8220;Permanent tourist,&#8221; or &#8220;prior taxpayer&#8221;) as another way to live by my five magic words: &#8220;go where you&#8217;re treated best.&#8221;</p>\n<h3></h3>\n<h3><b>The Original Three Flag Theory</b></h3>\n<p>&#160;</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Harry_D._Schultz\">Harry Schultz</a> devised the original Three Flag Theory, which advises you to plant flags for only three parts of your life:</p>\n<p><strong>1.&#160;</strong><b>Be a resident somewhere that does not tax foreign-source income.</b></p>\n<p>Countries impose three types of taxes on their citizens: territorial taxation, residential taxation, and citizenship-based taxation.</p>\n<p><b>Territorial taxation</b> means that, even if you live in a country, income earned outside of that country is not taxable locally.</p>\n<p>For example, residents of <a href=\"http://nomadcapitalist.com/2013/04/17/economic-freedom-in-singapore-and-why-you-must-be-planting-flags/\">Singapore</a> can earn money anywhere in the world without paying Singapore tax. Only their local income (like their salary) is taxed. That means a Singaporean can own rental real estate in Spain and <i>only pay Spanish tax</i> on the income he earns. Similarly, Singaporeans can operate <a href=\"http://nomadcapitalist.com/offshore-company/\">offshore companies</a> and only pay tax on salaries they take from their own company (or pay no tax at all on dividends).</p>\n<p><b>Residential taxation</b> means that you pay taxes based on <i>where you live</i>. Many countries use a version of the &#8220;183 days&#8221; principle. This means that if you spend at least half your time living in the country, you&#8217;re taxed on your worldwide income.</p>\n<p>Of course, it&#8217;s rarely that simple. The majority of countries have criteria you need to fulfill in order to prove you <i>don&#8217;t</i> have ties to that country. Different countries will have different rules on what &#8220;ties&#8221; you to them. Some of the common ties are: a Wife (or husband), kids, real estate that you own but don&#8217;t rent, a car that you own, bank accounts you&#8217;ve set up&#8230;the list goes on.</p>\n<p>Disqualifying yourself from residential taxation can be a bit complex, depending on the country. It&#8217;s not impossible, but it will take a thorough understanding of the residential tax laws (and some smart flag planting). The payoff is worth it. When you prove you don&#8217;t have ties to a country, you&#8217;re no longer deemed a resident. This means you no longer pay tax on your worldwide income.</p>\n<p><b>Citizenship-based taxation </b>is applied by only two countries: the United States and Eritrea. It means that your income is taxable no matter where in the world you live, or how long you live there, so long as you hold citizenship in that country.</p>\n<p>Eritrea, a war-torn country that broke away from Ethiopia several decades ago, applies a 2% tax on the worldwide income of its citizens (it&#8217;s rarely enforced).</p>\n<p>The United States, on the other hand, taxes your entire income at normal rates. This means even &#8220;<a href=\"https://en.wikipedia.org/wiki/Accidental_American\">accidental Americans</a>&#8221; need a sound offshore strategy to avoid unnecessary taxation.</p>\n<p><strong>&#160;2.&#160;</strong><b>Have your business in stable tax havens.</b></p>\n<p>Once you have a citizenship that does not tax your non-resident income, or you are a resident in a<a href=\"http://nomadcapitalist.com/2015/09/07/tax-free-countries-second-residency/\"> low tax or zero tax country</a>, you can establish businesses and <i>pay no tax</i> on income earned.</p>\n<p>Here&#8217;s how you could set up a tax-free income:</p>\n<p>First, you would set up a company or trust in a stable country that does not tax your income. Countries like the Cayman Islands, British Virgin Islands, Belize, Nevis, Seychelles, and even Hong Kong are great places to plant flags because they impose zero tax on offshore corporations. Many of these offshore havens don&#8217;t do audits, or even require you to file accounting reports. &#160;You can use offshore corporations to run your business just like Google, Apple, and other large companies do.</p>\n<p>If you have investments, you can use them to set up offshore brokerage accounts or open offshore bank accounts. When doing business and banking in a stable <a href=\"http://nomadcapitalist.com/2013/09/16/laws-of-motion-and-the-history-of-offshore-tax-havens/\">tax haven</a>, any interest income or dividends you earn are also tax-free.</p>\n<p>The United States banks are only the 40th safest in the world. The UK banks rank 44th. Setting up an offshore bank account means increased asset protection, greater stability, and much higher interest rates&#8211;the trick is knowing <i>where</i> to set it up.</p>\n<p>Offshore corporations and offshore bank accounts are great flag planting opportunities. Once established, they can give you peace of mind and let you keep more of the money you earn.</p>\n<p><strong>&#160;3.&#160;</strong><b>Live as a tourist in a country for more freedom (and reduced taxes)</b></p>\n<p>This is where the perpetual traveler concept comes back into play.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Perpetual_traveler\">Perpetual travelers </a>are also known as &#8220;permanent tourists&#8221; because they do not take up formal residence in one place. This means they&#8217;re classified as a &#8220;tourist,&#8221; even if they spend three to six months each year in one place.</p>\n<p>When you enter a country, you get your passport stamped with a visa. Holders of passports from wealthy countries can easily enter most of Europe, the Americas, and much of Asia with no visa required. Usually, they&#8217;ll be able to stay for anywhere from three to six months.</p>\n<p>Why is being a tourist important to Three Flag Theory?</p>\n<p>Tourists are treated better than locals in almost all cases. Tourists get their sales tax refunded when they leave and don&#8217;t pay local income tax. After all, they&#8217;re just tourists.</p>\n<p>By flag planting in a few different countries that respect how you earn your income, you can live freely <i>and</i> pay zero tax (in most cases).</p>\n<p>Here at Nomad Capitalist, we talk about how to become a legal resident of certain countries by obtaining<a href=\"http://nomadcapitalist.com/2017/07/10/factors-second-residency/\"> second residences</a>. If becoming a perpetual traveler isn&#8217;t for you, this is a reasonable alternative.</p>\n<p>There are ways to prevent yourself from being taxed at 50%, ways you can pay the low perpetual traveler taxes <i>without</i> the perpetual travel. We&#8217;ll expand on those strategies after a brief look at the extended Five Flag Theory.</p>\n<p><strong>&#160;</strong></p>\n<h3><b>The next step: Five Flag Theory</b></h3>\n<p><strong>&#160;</strong></p>\n<p>W.G. Hill added two additional flag planting strategies to the original Three Flag Theory. His 5 flag theory offers even more international diversification. It&#8217;s a good launching pad before we dive into Nomad Flag Theory.</p>\n<p><strong>&#160;1.&#160;</strong><b>Passport or citizenship in a country that does not tax non-resident income or control your actions.</b></p>\n<p>This flag is similar to the first flag planting strategy from three flag theory, but adds an important element: your country of citizenship should not control your movements.</p>\n<p>United States citizens, for instance, are required to follow many US laws even when outside of the country. This, in addition to the US policy of citizenship-based taxation, makes a US passport bad for Flag Theory.</p>\n<p><strong>&#160;2.&#160;</strong><b>Legal residence in a tax haven.</b></p>\n<p>This differs from the original perpetual traveler theory, and mirrors what we talk about here at Nomad Capitalist. By obtaining <a href=\"http://nomadcapitalist.com/2017/07/24/second-residencies-real-estate/\">legal residence</a> in a country that does not tax overseas income (or any income at all), you can establish a base of operations for your life without having to pay taxes to the local government.</p>\n<p><strong>&#160;</strong><b>3. Business base and salary-earning in a tax haven.</b></p>\n<p>Why base your <a href=\"http://nomadcapitalist.com/2017/08/28/questions-best-offshore-company/\">offshore corporation</a> and initiate salary payments from a tax haven country? Because tax havens will not tax your income.</p>\n<p>And, since you followed the first two flag planting strategies, your offshore income won&#8217;t be taxed by your country of citizenship or your country of residence. That&#8217;s 5 flag theory at its finest.</p>\n<p><strong>&#160;4.&#160;</strong><b>Offshore bank account in a country with stable banking.</b></p>\n<p>Your <a href=\"http://nomadcapitalist.com/2014/04/16/four-offshore-banking-countries-bother/\">banking country</a> may be different from your business base for one reason: stability.</p>\n<p>You want your assets stored in a stable place. As we mentioned earlier, banks in the US and UK are surprisingly low in the stability rankings.</p>\n<p>At Nomad Capitalist, we believe that your business base should be in little-known <a href=\"http://nomadcapitalist.com/2016/06/01/best-countries-in-eastern-europe-business/\">countries</a> that have little interest in making your life difficult (or even the resources to do it).</p>\n<p>But your offshore banking is a different story&#8211;plant your flags for banking in countries with an efficient judicial system, good interest rates, and stable banking conditions.</p>\n<p><strong>5.&#160;</strong><b>Playgrounds where you spend your money, preferably with no sales tax or VAT.</b></p>\n<p>Even if you live in a country with no income taxes, you may have to pay <a href=\"http://nomadcapitalist.com/2017/08/07/countries-with-the-highest-tax/\">high sales taxes</a>.</p>\n<p>Malaysia, for instance, meets the criteria for the citizenship and r<a href=\"http://nomadcapitalist.com/2013/11/11/easy-permanent-residence-in-asia-malaysia-investor-visa-program/\">esidence flag</a> (and the business flag in the state of Labuan), but sales taxes are high and goods can be expensive.</p>\n<p>In this case, you would have a playground where you shop for goods at lower sales tax. A playground can also be useful when you plant flags of citizenship and residency in countries with high costs of living&#8211;as a perpetual traveler, you can go to your playground and make your dollar go further.</p>\n<h2><strong>&#160;</strong></h2>\n<h2><b>Additional ways to plant flags &#8212; Nomad Flag Theory</b></h2>\n<p>&#160;</p>\n<p></p>\n<p>&#160;</p>\n<p><strong>&#160;</strong>Both Three Flag Theory and Five Flag Theory are fine starting points.</p>\n<p>As you continue to understand what Flag Theory really means, you&#8217;ll see many opportunities around the world for flag planting. The more <a href=\"http://nomadcapitalist.com/2015/01/28/3-new-flag-theory-strategies-expats-living-overseas/\">places you plant flags</a> for your life and your assets, the less control any one government has over you (which can make it even easier to plant flags).</p>\n<p>At Nomad Capitalist, we advocate planting flags as often as they&#8217;ll improve your life. If planting a flag serves <i>you</i> (and doesn&#8217;t break any laws), then why not do it?</p>\n<p>For example, I go to Malaysia for routine check ups. I go to Singapore for shopping and for tech stuff.</p>\n<p>Embracing Nomad Flag Theory opens doors you didn&#8217;t even know were there.</p>\n<p>Here are other flags we recommend planting with Nomad Flag Theory:<a href=\"http://nomadcapitalist.com/2017/07/12/residence-planning-lower-taxes/\"> residency</a>, <a href=\"http://nomadcapitalist.com/my-economic-citizenship/\">citizenship</a>, company, offshore banking, <a href=\"http://nomadcapitalist.com/2016/09/28/best-countries-offshore-gold-storage/\">gold storage</a>, <a href=\"http://nomadcapitalist.com/2017/07/17/ultimate-guide-yacht-registration/\">yacht registration</a>, <a href=\"http://nomadcapitalist.com/2016/11/27/real-estate-investing-economic-citizenship/\">real estate,</a> <a href=\"http://nomadcapitalist.com/2014/01/05/top-5-best-countries-medical-tourism/\">medical care </a>and surgery, charity&#8211;it&#8217;s all about going where you&#8217;re treated best.</p>\n<p><strong>&#160;</strong></p>\n<p>Let&#8217;s consider a hypothetical nomad&#8211;we&#8217;ll call him John Smith.</p>\n<p>John is a 26-year-old American guy. He graduated from Stanford with a degree in economics. Shortly after that, he got a job in real estate investments. Feeling a little dissatisfied with his work, he was inspired to open his own company. He quickly grew his business to $250k a year.</p>\n<p>John is a hard worker. He&#8217;d always been a top performer in school. He got into a good school. He did everything he was supposed to do&#8230; But every year the tax man shows up, and John feels like he&#8217;s getting kicked in the stomach. It&#8217;s frustrating for John when the government takes so much of his earnings away. He doesn&#8217;t have the control over his life that he wants. He feels like he&#8217;s locked in a system that takes way more than its fair share.</p>\n<p>He catches himself daydreaming about going to Southeast Asia. He pictures himself living on a beach in South America. He pines over paying less in taxes, keeping more of his money, finally getting his life the way he wants it.</p>\n<p>He wants to meet women in foreign countries. He wants to experience other cultures. He&#8217;s tired of the &#8220;golden boy&#8221; vanilla that he&#8217;s been fed his entire life. And he&#8217;s tired of Uncle Sam dipping that greedy mit so deeply into his pocket.</p>\n<p>One morning John wakes up. He has an epiphany&#8211;he doesn&#8217;t want to wake up in this exact same bed, in this exact same room, preparing for the exact same day ten years from now. No regrets.</p>\n<p>John finally acts. He gets the help he needs to live the Nomad Capitalist life, using the Nomad Flag Theory. He moves his company overseas to Malaysia, a tax friendly jurisdiction. He applies for and receives a <a href=\"http://nomadcapitalist.com/2016/05/17/pay-less-through-tax-residency-georgia/\">residency in Georgia</a>. He invests in<a href=\"http://nomadcapitalist.com/2015/10/15/frontier-market-real-estate-cambodia/\"> real estate in Cambodia</a>. A year later, he buys a summer beach house in<a href=\"http://nomadcapitalist.com/2014/06/11/cost-of-starting-a-business-in-montenegro/\"> Montenegro</a>. He saves 20,000 USD in taxes in his first year.</p>\n<p>He reinvests, buys a house. This time he plants a flag in one of his favorite places: Seychelles. On a vacation to Brazil, he met his current girlfriend.</p>\n<p>They&#8217;re still traveling the world together. Thanks to flag planting, they&#8217;re keeping more of their own money, and spending it on the freedom and the lifestyle they&#8217;d only dreamed of a few years prior.</p>\n<p><strong>&#160;</strong></p>\n<h2><b>How to maximize your freedom with Flag Theory</b></h2>\n<p>&#160;</p>\n<p>To <a href=\"http://nomadcapitalist.com/2015/03/30/flag-theory-strategies-expats/\">maximize your freedom</a>, you need to plant flags in as many countries as possible. There is an abundance of options waiting for you, but you need to be smart about it.</p>\n<p>You wouldn&#8217;t invest your entire nest egg into an individual stock&#8230;So you probably shouldn&#8217;t move your entire savings account to one country or currency. You don&#8217;t want to play any games when it comes to taxes&#8211;Make sure you know exactly what you&#8217;re getting into from a tax standpoint <i>before</i> you make any flag planting decisions.</p>\n<p><a href=\"http://nomadcapitalist.com/2013/03/25/why-i-choose-to-internationalize/\">Diversification</a> plays a big part in making Nomad Flag Theory work best.</p>\n<p>The best way to start with Flag theory is to plant flags one at a time. Slowly diversify your life, business, and assets. If you want to start your flag planting now, one of the easiest places to start is an offshore bank account.</p>\n<p><strong>&#160;</strong>In many ways, Flag Theory lines up with the concept of &#8220;world citizens.&#8221; The goal is to distance oneself from being &#8220;owned&#8221; by any one country.</p>\n<p>Finding the right balance of Flag Theory&#8211;and the right places to plant flags based on your interests&#8211;can help you maximize your freedom and keep more of your own money.</p>\n<p>Practicing Nomad Flag Theory is one of the best ways to access the <a href=\"http://nomadcapitalist.com/2017/06/26/get-best-everything-life-planting-flags/\">international lifestyle </a>you&#8217;re craving. It&#8217;s a way for &#8220;average Joes&#8221; like us to live like stars (rock or movie, take your pick)&#8211;and the best part is, you get to keep more of your hard earned money while you do it.</p>\n<p>Happy planting.</p>\n<p>&#160;</p>\n</div>","title":"Flag Theory and Perpetual Travel"}},"pageContext":{"id":"5b921d1b87be0571ac1b04f7"}}