{"data":{"mongodbDatabaseArticles":{"id":"5b9248c687be056953db7bed","content":"<div><p>Last year, late 2012, I was working on some projects in the night when I suddenly became short-breathed and anxious. I never had experienced anything like this and also never had any real health problems. I had to get out of the house. I went outside and from about 3am I walked outside for three hours trying to figure out what the hell was going on with my mind.</p> <p>I was having a panic attack and I never had one before. My ridiculous intake of over six cups of coffee daily definitely pushed me over the edge, but it was only the catalyst, not the cause.</p> <p>My life was quite good, I was 26 years old, I had just graduated with a master's degree, I was self-employed and <a href=\"http://pandamixshow.com/\">my online business</a> was doing well, I had an awesome 110m2 (1,200 sq. ft) apartment in the center of Amsterdam, I had great close friends and I was working on what I loved: music. I had reached the epitome of Western living and Maslow's \"hierarchy of needs\" pyramid.</p> <p><a href=\"http://en.wikipedia.org/wiki/Maslow's_hierarchy_of_needs\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"https://levels.io/wp-content/uploads/2013/04/Maslow.png\"></a></p> <p>But it hadn't made me happy. Nothing was changing anymore. Everything had become one big routine. Waking up. Having dinner. The nights of working. The weekends of alcohol abuse under the pretense of partying. And it was literally taking my breath away. I had this constant pressure on my chest. It sounded like symptoms of depression to me too, but I didn't feel depressed. I was just too comfortable. I was so comfortable that I needed out. I was becoming physically anxious from my own living conditions.</p> <img src=\"https://levels.io/wp-content/uploads/2013/04/IMG_0875.jpg\" width=\"100%\" class=\"alignnone size-full wp-image-835 responsively-lazy\"> <p>I decided to scrap everything in what sounded like a mid-life crisis, but one happening at a rather early age.</p> <img src=\"https://levels.io/wp-content/uploads/2013/04/IMG_1421-1024x764.jpg\" width=\"100%\" class=\"alignnone size-large wp-image-828 responsively-lazy\"> <p>I was <a href=\"/i-love-minimalist-living\">already living minimalist</a> but it still took me about 4 months to exit my life in Amsterdam, getting rid of my apartment, the interior and all the rest of my stuff and prepare my escape from Europe. I had 2 boxes of memories and nostalgia at my parents. I broke down my super fast workstation PC and sold the parts online. I sold my DSLR camera I used for making <a href=\"//vimeo.com/30370864\">music</a> <a href=\"http://www.youtube.com/watch?v=7WKmOj585kA\">videos</a>, camera stands, and all my musical equipment. Selling the camera was difficult because it also meant that the music videos and the YouTube projects my friend Jim and I worked on would end. It would end anyway though since I'd leave the country. I raised about $3,000 selling everything on eBay. I used this money <a href=\"/how-i-switched-from-pc-to-mac-in-less-than-7-days/\">to buy a MacBook</a> so I could work anywhere.</p> <p>I was now left with a MacBook, an external hard drive with all my data, 4 t-shirts, 2 pants, 6 pieces of underwear and 6 pair of socks and only realising later <a href=\"/the-100-thing-challenge\">I had completed the 100 Thing Challenge</a>.</p> <p>Asia seemed a good destination, since I had <a href=\"http://hassepietersam.nl/?author=4\">already lived in South Korea</a> before. Thailand seemed like a stable, safe start for my life reset. I booked a ticket to Bangkok and flew there mid-April of 2013.</p> <img class=\"alignnone size-large wp-image-831 responsively-lazy\" alt=\"\" src=\"https://levels.io/wp-content/uploads/2013/04/IMG_1757-1024x764.jpg\" width=\"100%\"> <p>And now I'm here. Less than four days ago I arrived and already I have experienced and met so many amazing local people that have showed me around and taken me into their lives. Life is an adventure again and surprisingly my anxiety is gone. I wasn't afraid of things as much as I was afraid of the nothing.</p> <p>Life is like the best video game ever, it has amazing graphics, infinite amounts of levels, a huge map and this ridiculous great freedom. I just needed to pick up the controller.</p> <p><a href=\"http://levels.io/co-working-spaces-in-bangkok-hubba/\">See how I found a place to work from after arriving in Bangkok &#187;</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Reset your life"}},"pageContext":{"id":"5b9248c687be056953db7bed"}}