{"data":{"mongodbDatabaseArticles":{"id":"5b95eef287be0583274900ff","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Chiang Mai Budget Breakdown</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a href=\"https://www.tielandtothailand.com/chiang-mai-budget-breakdown/\"> <img class=\"aligncenter size-large wp-image-9030\" title=\"Chiang Mai Budget Breakdown\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-2.jpg?resize=563%2C599&amp;ssl=1\" alt=\"Shopping on a Chiang Mai Budget\" width=\"563\" height=\"599\"></a></p>\n<p>Considering that we will have lived in Northern Thailand for 100 days tomorrow, we thought we would share the details of our Chiang Mai budget with those who want a similar life abroad. We live comfortably, but in no way has it been smooth sailing the entire time. We have gone from making $15,000 per month in the United States to $1,500 per month (or 45,000&#3647;) in Thailand. As you can imagine, the ninety percent drop in income has been quite the adjustment, but we feel that our quality of life is better and we are happier because of it. Escaping your nine-to-five tends to <a title=\"Thoughts before I quit my job\" href=\"https://www.tielandtothailand.com/thoughts-before-i-quit-my-job/\" target=\"_blank\" rel=\"noopener noreferrer\">have that effect</a>! Remember this budget is for two adults, so if you are single count on spending considerably less while achieving comparable results. Let&#8217;s get down to business!</p>\n<p><strong></strong></p>\n<h2><p id=\"Monthly_Chiang_Mai_Budget_Breakdown\"><p>Monthly Chiang Mai Budget Breakdown</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-7557\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/CM-Budget1.png?resize=563%2C509&amp;ssl=1\" alt=\"Chiang Mai Budget for Two\" width=\"563\" height=\"509\"></p>\n<h2><p id=\"Accommodations\"><p>Accommodations</p></p></h2>\n<p>Our Chiang Mai budget allows us to live less than 1 km from the Old City&#160;in a newly built two bedroom, three full bathroom <a title=\"Our $500 Townhouse in Chiang Mai\" href=\"https://www.tielandtothailand.com/townhouse-in-chiang-mai/\">townhouse</a> that we rent for 15,000 baht ($500 USD) per month. Our master bedroom and guest bedroom both have air conditioners and on-suite bathrooms with hot showers. We opted to use a fan in our downstairs living room. We have a Western style kitchen with a dual convection oven/microwave. We also have one induction burner. We pay for government rate electricity (5 baht per unit), and our household water is taken care of by our landlord. We have a reverse osmosis water filtration machine (1 baht per 1.5 L) and laundry facility (30 baht per load) conveniently located a short walk down our quiet side street.</p>\n<img class=\"size-full wp-image-9010\" title=\"Kitchen\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/539000_10151838494839008_296934906_n.jpg?resize=563%2C386&amp;ssl=1\" alt=\"Chiang Mai Budget Kitchen\" width=\"563\" height=\"386\"><h2><p id=\"Food\"><p>Food</p></p></h2>\n<p>Make no mistake, we are big foodies. Sometimes we say our main reason for escaping to Thailand is just because of the food! Angela and I are really into all the different Thai flavors. We go out for dinner pretty much every evening. We typically enjoy one of the several different 30 baht (about $1 USD) food options at Chiang Mai Gate about five days out of the week.</p>\n<img title=\"$1 Meal\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-6.jpg?resize=563%2C563&amp;ssl=1\" alt=\"Eating Street Food on a Chiang Mai Budget\" width=\"563\" height=\"563\"><p>The rest of the time we really love discovering great little hidden restaurants throughout the rest of Chiang Mai and spend anywhere from 150 to 600 baht per meal ($5 to $20 USD), including a couple of beers. I was never a regular burger eater back home, but have found myself trying a new one about once a week for about 120 baht ($4 USD). You would be surprised what you can find here living on a modest monthly Chiang Mai budget!</p>\n<img title=\"Moatside Meal\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-3.jpg?resize=563%2C563&amp;ssl=1\" alt=\"Chiang Mai Budget Meal\" width=\"563\" height=\"563\"><h2><p id=\"Adult_Beverages\"><p>Adult Beverages</p></p></h2>\n<p>We admit it, and we aren&#8217;t ashamed in the least bit about it, but we like to have a few beers or cocktails a couple of times a week. Could we live cheaper if we didn&#8217;t? Absolutely, but we don&#8217;t see the fun in that. Usually after one of our $1 feasts we like to make our way to one of the nearby bars. Loco Elvis is a Tex-Mex place just north of Thapae Gate on the inside of the moat, and is where you can usually find us. Yes, it&#8217;s a little touristy, and no, the drink prices aren&#8217;t the most competitive, but we still enjoy the lively atmosphere. Plus, our good friend that we met on our honeymoon works there, and she spends a little time teaching us Thai&#160;every time we stop by. It&#8217;s like getting beer and Thai lessons for 300 baht ($10) an hour which is very compatible with our monthly Chiang Mai budget. Can&#8217;t beat that!</p>\n<img title=\"Angela and our Friend\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-8.jpg?resize=563%2C554&amp;ssl=1\" alt=\"Chiang Mai Budget Bars\" width=\"563\" height=\"554\"><h2><p id=\"Transport\"><p>Transport</p></p></h2>\n<p>We bought a brand new <a title=\"2013 Honda Forza\" href=\"https://www.tielandtothailand.com/a-big-white-monster/\" target=\"_blank\" rel=\"noopener noreferrer\">2013 300cc Honda Forza</a> (probably the largest scooter in Thailand) soon after we moved here. We fill up its 11.6 liter tank about twice a month for 350 baht ($11.50 USD). Now that we live here, we wanted something that could easily carry our hauls from our local market and grocery store, or our bags for some possible road trips.</p>\n<img title=\"2013 Honda Forza\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-7.jpg?resize=563%2C373&amp;ssl=1\" alt=\"Chiang Mai Budget Honda Forza\" width=\"563\" height=\"373\"><p>Plus, I have some lower back issues and after renting a small 125cc motorbike I quickly realized I needed maximum surface area to distribute the weight of my big ass evenly. If you are over six feet tall and 200 plus pounds and have experienced a ride on a Honda Dream, then you know what I am talking about. More like a nightmare if you ask me. In addition to our motorbike, we spend a couple hundred baht ($6 to $8 USD) on tuk-tuks throughout the course of a month.</p>\n<img title=\"Honda Dream 125cc\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-5.jpg?resize=563%2C420&amp;ssl=1\" alt=\"Chiang Mai Budget Motorbike Rental\" width=\"563\" height=\"420\"><h2><p id=\"Groceries\"><p>Groceries</p></p></h2>\n<p>We find most of the fresh food items that we need at our local markets, which are extremely affordable. Things like bread and yogurt can be bought at your nearest 7-Eleven or Tesco Express. For example, a packet of four yogurts costs about 50 baht ($1.60 USD).</p>\n<img title=\"Grocery Shopping on a Chiang Mai Budget\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-4.jpg?resize=563%2C563&amp;ssl=1\" alt=\"Chiang Mai Budget Market\" width=\"563\" height=\"563\"><h2><p id=\"Household\"><p>Household</p></p></h2>\n<p>Nothing too crazy here. We get things like cat food, trash bags, cleaner, and detergent at our local 7-11 or Tesco Express as well. Rest assured there will be one of these small stores very close by. They&#8217;re everywhere! If you need more specific items, there are larger Tesco and Big C superstores just on the outside of the old city.</p>\n<img title=\"Tesco Louts Chiang Mai\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Tesco.jpg?resize=563%2C399&amp;ssl=1\" alt=\"Chiang Mai Budget Tesco\" width=\"563\" height=\"399\"><p><strong>TIP:</strong> Tesco takes credit card for those of you aiming to <a title=\"Earning miles with the Bluebird Card\" href=\"https://www.tielandtothailand.com/earning-miles-with-bluebird-and-vanilla-reload-cards/\">earn points</a>. Remember to use a card that <a title=\"Charles Schwab = No Foreign Transaction Fees\" href=\"https://www.tielandtothailand.com/banking-abroad-foreign-atm-fee-solution/\">doesn&#8217;t charge a foreign transaction fee</a>.</p>\n<h2><p id=\"Personal_Care\"><p>Personal Care</p></p></h2>\n<p>Always Chiang Mai budget friendly are the various spa services that scatter across the city. I get a haircut, shampoo (keeps the hair out of my motorbike helmet), and a head massage for 150 baht (about $5 USD). <a title=\"New York New York Hair Salon in Chiang Mai\" href=\"https://www.tielandtothailand.com/chiang-mai-hair-salon-new-york-new-york/\">Women&#8217;s haircuts </a>will run you anywhere from 350 to 1,000 baht. We spoil ourselves with a <a title=\"Five Dollar Foot...Massage?\" href=\"https://www.tielandtothailand.com/five-dollar-foot-massage/\" target=\"_blank\" rel=\"noopener noreferrer\">foot massage</a> a few times a month, and both a one hour Thai massage or one hour foot massage will run you about 150 to 180 baht ($5 or $6 USD).</p>\n<img title=\"Foot Massage\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2013/06/Chiang-Mai-Budget-Breakdown-1.jpg?resize=563%2C421&amp;ssl=1\" alt=\"Chiang Mai Budget Massages\" width=\"563\" height=\"421\"><h2><p id=\"Entertainment\"><p>Entertainment</p></p></h2>\n<p>What is there to do on a Chiang Mai budget? Just about anything. From whitewater rafting to go-kart racing to <a title=\"Zip lining on a Chiang Mai Budget\" href=\"https://www.tielandtothailand.com/ziplining-chiang-mai-thailand/\" target=\"_blank\" rel=\"noopener noreferrer\">ziplining</a>, Chiang Mai is perfect for the outdoorsy type. There is also the Major Cineplex at the Central Plaza Mall, which costs 150 baht (only $5) per ticket on Wednesdays and is nicer than ninety percent of movie theaters we&#8217;ve been to. They offer a decent selection of movies with English tracks, but just make sure you buy your tickets for the new releases fast as they sell out early in the day, especially during weekends. If you get there too early, you can always grab some affordable (5 baht per piece), but tasty sushi in the food court. We love it.</p>\n<h2><p id=\"Savings\"><p>Savings</p></p></h2>\n<p>As you can see from our $1,500 a month Chiang Mai budget we have allowed ourselves to save about $300 a month ($3,600 per year) for an annual month-long trip back to the United States to visit family, or as a safeguard in the case that an emergency comes up. Of course, this will vary from month to month based on our lifestyle.</p>\n<p>Not included in our Chiang Mai budget is the recent development of Angela securing a <a title=\"Teaching in Chiang Mai\" href=\"https://www.tielandtothailand.com/is-teaching-in-thailand-worth-it/\">teaching position</a> not far away from our neighborhood. Her salary will provide us with an additional $900 a month, which is an average teacher&#8217;s salary in Chiang Mai. She will work nine months out of the year, and we hope to save her entire salary for our future travels and to further cushion our nest egg.</p>\n<p>What kind of budget do you sustain while traveling or living as an expat? We would love to hear how others are living frugally abroad!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Chiang Mai Budget Breakdown"}},"pageContext":{"id":"5b95eef287be0583274900ff"}}