{"data":{"mongodbDatabaseArticles":{"id":"5b9248d587be056953db7bfc","content":"<div><p>To reduce procrastination and become faster at launching my projects, I've set the goal to launch <a href=\"/12-startups-12-months\">12 startups in 12 months</a>. A month after every launch, I do a debriefing on how it went. Last month, I launched my second project, <a href=\"http://levels.io/go-fucking-do-it\">Go Fucking Do It</a> (GFDI), which lets you set a goal and charges your card if you don't reach it.</p> <h2>Launch coverage</h2> <p>A large part of the reason I'm doing 12 startups is to learn how to launch successfully to press. Every time I'm getting a little better at it.</p> <p>Let's start with Hacker News. It's is a great place to launch something first since it has a strong <a href=\"/hacker-news-number-one/\">viral effect</a> with very influential people reading it. If you can get it to stay on the frontpage for awhile, you can expect a lot of attention from blogs and press for weeks after, without reaching out to them at all. After I <a href=\"//news.ycombinator.com/item?id=7617666\">submitted</a> it, it remained on the frontpage for a while, but HN's controversy robot detected more comments than upvotes and banned it to the third page. Too bad.</p> <a href=\"//news.ycombinator.com/item?id=7617666\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-30-at-0.05.17.png\"></a> <p>I reached out to <a href=\"http://thenextweb.com/\">TheNextWeb</a> after. Instead of directly sending it to their main email address (like I did <a href=\"/debriefing-play-my-inbox\">last time</a> unsuccessfully), I tried to find a journalist to reach out to that related to what I did a little bit (in this case someone who had tweeted about my <a href=\"/bootstrapping-startup-thailand/\">bootstrapping in Thailand</a> article). That worked and TheNextWeb <a href=\"http://thenextweb.com/shareables/2014/04/29/gofuckingdoitdotcom/\">covered it</a>! Yay, I woke up to this superhappy! This is the first time I've been featured on TNW (and hopefully not the last).</p> <a href=\"http://thenextweb.com/shareables/2014/04/29/gofuckingdoitdotcom/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-18.35.57-1024x434.png\"></a> <p><a href=\"http://lifehacker.com/go-f-king-do-it-tracks-your-goals-charges-you-real-mo-1569597336\">Lifehacker</a> quickly followed after.</p> <a href=\"http://lifehacker.com/go-f-king-do-it-tracks-your-goals-charges-you-real-mo-1569597336\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-18.36.51-1024x524.png\"></a> <p>This press coverage made it go viral and without even reaching out further it got covered by big sites like <a href=\"http://designtaxi.com/news/365384/Stake-Money-On-This-Website-To-Stop-Procrsatinating-Go-F-cking-Do-It/\">Design Taxi</a>, <a href=\"http://www.coolhunting.com/link-about-it/link-about-it-t-215.php\">Cool Hunting</a> and the very suiting <a href=\"http://fuckinghomepage.com/post/87677131599/june-3-2014\">FuckingHomepage.com</a>. Later it even hit <a href=\"http://www.wired.co.uk/news/archive/2014-06/04/make-more-mischief\">Wired</a> and featured on <a href=\"http://www.appsumo.com/15-awesome-tools/\">AppSumo</a>.</p> <p>To top it off, it reached #1 on <a href=\"http://twitter.com/rrhoover\">Ryan Hoover</a>'s awesome <a href=\"http://producthunt.com/\">ProductHunt</a> leaderboard with 50+ upvotes.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-06-03-at-2.30.05-1024x308.png\"> <h3>A press release that writes itself</h3> <p>To reach more press, I made a <a href=\"http://gofuckingdoit.com/assets/press.html\">press release</a> which purposely looked like a static .html file, but was actually a dynamic file which always showed the latest total amount of users and money pledged. See it live <a href=\"http://gofuckingdoit.com/assets/press.html\">here</a>. This worked well as many news sources started covering it as soon as it hit new milestones (like $10,000 in pledges).</p> <h3>Twitter went wild</h3> <p>Just after, Twitter started <a href=\"//twitter.com/search?q=gofuckingdoit.com&amp;src=typd\">going mental</a> with literally hundreds of tweets popping up every few minutes.</p> <p>It helped that I had built in a big share button when people finished setting their goal, making people <a href=\"//twitter.com/search?q=gofuckingdoit%20%22i%20will%22&amp;src=typd\">share their goals starting with \"I will...\"</a>:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p>I will finish this paper by Thursday May 8, 2014 or I will pay $50 at <a href=\"http://t.co/27omkQp2lm\">http://t.co/27omkQp2lm</a> (via <a href=\"//twitter.com/levelsio\">@levelsio</a>)</p> <p>&#8212; sophie (@sophaboph34) <a href=\"//twitter.com/sophaboph34/statuses/464138721005010944\">May 7, 2014</a></p></blockquote> <p></p> <p>The tweets kept going for a few weeks.<br> <a href=\"http://topsy.com/analytics?q1=gofuckingdoit.com%20OR%20gofuckingdoit\" class=\"broken_link\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screen Shot 2014-05-28 at 19.09.51\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-19.09.51-1024x318.png\" alt=\"Screen Shot 2014-05-28 at 19.09.51\"></a></p> <h3>Mainstream media ignoring me</h3> <p>Now that I'd been covered by the major tech media, mainstream was next. I made a big media list of the major mainstream press to reach out to. However, even trying multiple times, I wasn't able to get coverage in a real mainstream news source like <a href=\"http://wsj.com/\">WSJ</a> or <a href=\"http://nyt.com/\">NYT</a>. I really really tried a lot.</p> <p>They obviously get a lot of tips sent. And maybe it doesn't help that the name has the F-word in it.</p> <h3>Art critic media reviewing me</h3> <p>One fun part of this was that <a href=\"http://gofuckingdoit.com/\">Go Fucking Do It</a> received an <a href=\"http://rhizome.org/editorial/2014/may/14/go-fucking-do-it/\">extensive review</a> by art/tech blog Rhizome which from a certain perspective was quite on-point and valid:</p> <blockquote><p>\"Go Fucking Do It is not only the name of the app but also a mantra for a brogrammer ethos that disguises its own privilege in Emersonian auto-didacticism. It is here where everyone is an entrepreneur-in-waiting; free to move, self-directed, emancipated from state or institutional constraints, limited only by their own loathsome inability to self-manifest infinitely achievable personal goals.\"</p></blockquote> <p>&#8212; Mike Pepi at <a href=\"http://rhizome.org/editorial/2014/may/14/go-fucking-do-it/\">Rhizome.org</a></p> <h3>A reality TV show offer</h3> <p>One of the weirdest things that happened was being contacted by a big American TV production company who wanted to create a reality TV series out of GFDI.</p> <blockquote><p>Hi There!</p> <p>I work for an award winning TV production company in Los Angeles. We&#8217;re always looking for interesting worlds and businesses to develop tv shows around, and I came across &#8220;Go Fucking Do It!&#8221; in my research. Are you already partnered with a production company? If not, I&#8217;d love to set up a time for us to talk about you, your business, and my ideas for a potential TV series.</p> <p>Looking forward to talking!</p></blockquote> <p>We had a very fun chat:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screen Shot 2014-05-09 at 0.38.31\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-09-at-0.38.31-1024x576.jpg\" alt=\"Screen Shot 2014-05-09 at 0.38.31\"> <p>And I think they're still thinking about it or scrapping it (that's what happens with <a href=\"/email-cuts-through-bullshit/\">meetings</a>).</p> <h3>Getting acquisition offers</h3> <p>Then I was asked to <a href=\"/selling-my-startup\">sell GFDI for $45,000</a>:</p> <blockquote><p> Congrats on a great site. You must be getting a ton of interest in your 2nd startup, any thoughts of selling? I'm interested.</p> <p>Regards, </p></blockquote> <p>I thought about it, since it was only a month's work. But I felt it wouldn't cover the potential of the site (esp. not after Dutch tax touches it). It'd have to be a strong multiple of that before I consider selling GFDI.</p> <h3>Getting venture capital interest</h3> <p>A few VC funds, of which one holding $200 mln capital, send me emails to talk:</p> <blockquote><p>Just stumbled upon the site. Would love to find out more &#8211; are you available for a quick conversation?</p> <p>XXX<br> General Partner<br> XXX VC</p></blockquote> <p>I had fun conversations over Skype, and many were interested to invest or see where this was going. When they asked where in the Bay Area I was located, I had to disappoint them saying \"Amsterdam\". &#8212;\"Sorry?\". \"The Netherlands, Europe\". &#8212;\"Oh...\". It seems many VCs still like you to be located around SF/SV. I also think many VCs are actually doing these conversations to get information about your plans, which they might be able to use for their own portfolio companies. Not sure though.</p> <h3>First users</h3> <p>It took only minutes after launching before the first goal was set:<br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-18.49.34-1024x250.png\"> <p>And days after the first person failed their goal \"Run 10k A Day For 2 Days\" and was charged $25.<br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"></p><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-18.51.18-1024x400.png\"> <p>I quickly added the first few users as testimonials with their photos on the frontpage (with permission):</p> <p><a href=\"http://gofuckingdoit.com/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-07-at-12.01.571-1-1024x878.png\"></a> </p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screen Shot 2014-05-28 at 18.44.52\"></p><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-18.44.52-1024x195.png\" alt=\"Screen Shot 2014-05-28 at 18.44.52\"><br> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\" alt=\"Screen Shot 2014-05-28 at 18.45.09\"><img src=\"/wp-content/uploads/2014/05/Screen-Shot-2014-05-28-at-18.45.09.png\" alt=\"Screen Shot 2014-05-28 at 18.45.09\"><br> In the end almost 30,000 people visited <a></a><h3>The most popular goals</h3> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/05/2014-05-03-twitter-goals-1024x536.png\"> <h3>Does the business model work?</h3> <p>In the end almost 30,000 people visited <a href=\"http://gofuckingdoit.com/\">Go Fucking Do It</a> </p><p>In the end 1% of visitors set a goal and entered their credit card details. That's a pretty average conversion rate for most sites that require payment. The average price set was $78.54. Of the people that set a goal, 84% actually reached it (or their supervisor stated they did).</p> <p><strong>However, 55% of all goals were never set as reached or not to by the supervisor!</strong> That means the emails were probably not being read! So with that deducted, I was left with 1% actually being charged. That left only a few people failing and so just a few charges.</p> <blockquote><p> <strong><br> 250,000 * 0.01 * 0.01 * 78.54<br> </strong> </p></blockquote> <p>So for this model to make ~$2000 per month, it'd have to be scaled up to get 250,000 visits per month, with 2,500 people converting, and 25 people failing. That's only about 10x what it's at now. Still a challenge.</p> <p>Just making sure the email was being opened would double the revenue immediately though. I'll see how I can do that.</p> <p>Apart from the failures, there's more monetization options here. Like Marc from <a href=\"http://betali.st/\">BetaList</a> suggesting adding (promotional) rewards when people do reach their goals:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/levelsio\">@levelsio</a> or look into <a href=\"//twitter.com/kiip\">@kiip</a>. provide people with free (promotional) gift when reaching their goal. (Get <a href=\"//twitter.com/Nike\">@Nike</a> as a sponsor ;)</p> <p>&#8212; Marc K&#246;hlbrugge (@marckohlbrugge) <a href=\"//twitter.com/marckohlbrugge/statuses/469967184656359424\">May 23, 2014</a></p></blockquote> <p></p> <h3>What's next</h3> <p>I'll start adding more features in the coming months. And keep pushing it to press. I must be able to break this to mainstream press at some point. Even though the big press coverage is over, visits are not tailing off yet. Which is awesome and means there might be some consistent demand for this.</p> <h3>What went wrong/right</h3> <p>I executed on an idea I had for a long time. I shipped very fast. Launched it to press fast. It got major coverage. It went viral. And it actually did help a lot of people reach their goals, who before might have not.</p> <p>While building it, I was advised my multiple people to not call it \"Fucking\". It would halt it from being covered by press and people would be disturbed. Well, it seems timing is a factor here because people seem to not care about that anymore (at least everyone except for the mainstream media).</p> <p>The business model itself didn't get enough people in though to make it an actual business yet (e.g. running $2k+/m). But we might still get there in the coming months.</p> <p>Any feedback is super welcome!</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How Go Fucking Do It raised $30,000+ in pledges in less than a month"}},"pageContext":{"id":"5b9248d587be056953db7bfc"}}