{"data":{"mongodbDatabaseArticles":{"id":"5b96295f87be058327491188","content":"<div><p>Welcome back to This is India! I always have funny/weird stories about India to share with friends or family when I talk to them. This is just meant to be an honest portrayal about my life in India through short anecdotes. I also share here what I&#8217;ve been up to online outside Hippie in Heels.</p><h2>What I was up to other than here:</h2><ul><li>I did a little interview: &#160;<a href=\"http://blog.sunshinetienda.com/sunshine-interviews-hippie-in-heels/\" target=\"_blank\">Sunshine Interviews &#8211; Hippie in Heels</a>&#160;on Sunshine Tienda but other than that have been catching up on work, as while Ben&#8217;s brother was here I got really behind on the blog and partied far too much! So, this week was all about relaxing &#160;:D</li><li>WOW travel did a summary of the <a href=\"http://www.wowtravel.me/top-travel-bloggers-to-follow-in-2015/\" target=\"_blank\"><p>Top Bloggers to Follow in 2015</p></a> &amp; mentioned Hippie in Heels! I&#8217;m still shocked when I get on lists like this and the reason is because you guys actually read this! I can remember when I first started the blog and had about 10 people reading it only a year and a half ago.</li></ul><h1>Now your story,</h1><p>When I was in Uganda about 5 years ago was the first time I was exposed to babies not wearing diapers because the family couldn&#8217;t afford them. The kids just walked around naked, peed on people when they were held, and the moms washed them up. I got used to it, thank God, because something similar happens in India- although I don&#8217;t know if it&#8217;s because of the cost of diapers or just personal preference.</p><p>Here, I see a combination of cloth diapers, regular ones, and nothing. Since you know that for adults in India, the toilet situation is different from the west, of course it would be for babies too. Adults go to the toilet oftentimes in a squat toilet (like a hole) and they use either a sprayer to clean off or a bucket and wash with their left hand. Paper isn&#8217;t necessary.</p><p>So why would baby wipes be?</p><p>Don&#8217;t be surprised if you walk out of an INOX movie and see a couple of moms washing their babies poopy bums in the bathroom sinks. Because that&#8217;s what I saw the last time I saw a movie in Panjim!</p><p>Is that normal!?</p><p>I mean at home, okay. I understand, if it&#8217;s the culture. But in a public bathroom I would think they&#8217;d do it over the toilet. I&#8217;m sure my Indian readers can explain further in the comments!</p><h1>This is India!</h1><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on&#160;<a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>,&#160;<a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>,&#160;<a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a>&#160;&amp;&#160;<a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p>feature image: <a href=\"http://www.99traveltips.com/travel-tips/india-travel-tips-advice-guide-india/\" target=\"_blank\">source</a></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"This is India! 45"}},"pageContext":{"id":"5b96295f87be058327491188"}}