{"data":{"mongodbDatabaseArticles":{"id":"5b92397987be0583cfde680b","content":"<div><p></p><img class=\"size-full wp-image-21010\" src=\"http://nomadcapitalist.com/wp-content/uploads/2017/05/how-to-go-where-youre-treated-best.jpg\" alt=\"How to go where you're treated best\" width=\"700\" height=\"467\"><p>Dateline: Timisoara, Romania</p>\n<p>I&#8217;m a &#8220;big city&#8221; kind of guy. I spend a lot of my time in capital cities not only because that&#8217;s often where the best opportunities are in countries like Romania, but simply because I prefer the big city vibe.</p>\n<p>This year, however, I challenged myself to venture out further. As I get older, the idea of spending some time in smaller towns appeals to me, and places like Timisoara offer a lot of the benefits of larger cities with a lower price tag and slower pace of living.</p>\n<p>The reality is, most of us will never venture much of the beaten path&#8230; not even Nomads. There are certain places that seem to be the &#8220;ordained&#8221; places to go, whether that&#8217;s Bali, Budapest, Bangkok, or Barcelona.</p>\n<p>Nomad Capitalist, however, is all about my five magic words: &#8220;go where you&#8217;re treated best&#8221;. The key word there is YOU, and that&#8217;s why I&#8217;m constantly looking for new places that aren&#8217;t on anyone else&#8217;s radar.</p>\n<p>The truth is, most people never leave their comfort zone. It&#8217;s easier to pay half of their income in tax, life a stressful and high-cost lifestyle, and invest in subpar investments in their home country.</p>\n<p>In the case of some Australian friends I spoke to recently, it&#8217;s often even easier to stick to investing in your own city. Most people don&#8217;t go where they&#8217;re treated best because the idea of doing anything outside of Adelaide, or Salt Lake City, or Manchester seems frightening.</p>\n<p>The more that I thought about, the more I realized that this a pretty common scenario in the Western world.</p>\n<p>Think about it&#8230;</p>\n<p>How many people in the United States do you think ever invest outside of the good ole USA? What about Canada and Great Britain?</p>\n<p>The more you look, the more you&#8217;ll probably find that the situation and the attitude is pretty much the same wherever you go.</p>\n<p>On a different occasion, I was talking to a friend from Montreal and he told me a similar story to that of my Australian mates: &#8220;Andrew, people in Montreal want to <a href=\"http://www.montrealinternational.com/en/foreign-investments/why-invest-in-montreal/\" target=\"_blank\" rel=\"noopener\">invest in Montreal</a>. The idea of going to Calgary to invest money just doesn&#8217;t sound appealing to them.&#8221;</p>\n<p>The problem here is that people intentionally get themselves stuck in a very limited geographical sphere. If things start to go downhill in their city, then they can be sure things are going to go downhill for them, too. That&#8217;s why, today, I want to reiterate the importance of going where you&#8217;re treated best.</p>\n<p>I spent nine years based in Phoenix, Arizona in the United States. Contrary to what the tax lovers at Vice <a href=\"https://www.vice.com/en_us/article/reasons-why-phoenix-is-the-worst-place-ever\" target=\"_blank\" rel=\"noopener\">have to say</a>, Phoenix has a lot of things going for it, but it also has an unpredictable real estate market which continuously goes up and down. The yields aren&#8217;t great and, overall, it makes little sense for anyone to invest their money there in my opinion.</p>\n<p>In fact, outside of a few ultra high-yield markets in the Rust Belt, there isn&#8217;t much opportunity for anyone to <a href=\"http://nomadcapitalist.com/2015/07/08/tax-benefits-foreign-real-estate-us-investors/\">invest in US real estate</a> when you compare it to all of the options available worldwide.</p>\n<p>The United States, like many countries, merely relies on a captive market of people too scared to go anywhere else, combined with great marketing that attracts foreigners who want to live in Miami or Beverly Hills.</p>\n<p>Sometimes, I have some real estate guys from there calling me up to pitch me deals. I tell them that I can get multiple times the cash in cash returns overseas and I don&#8217;t even have to put half as much money in.</p>\n<p>The moral of the story is, if I hadn&#8217;t expanded my boundaries, I wouldn&#8217;t have achieved nearly as much success as I have now.</p>\n<p>Imagine I had stayed in Phoenix, Arizona and followed the crowd saying &#8220;real estate is the only answer.&#8221; There is no way I would be where I am today. The same goes for you, too. Sometimes you need to go further than the space you&#8217;re confined to if you want to get the results you deserve and desire.</p>\n<p>The governments bank on people like the guys in Montreal, and the guys in Sydney with no plans of leaving their comfort zone. They need you to stay and invest, even when things are going downhill.</p>\n<p>That&#8217;s why they have so many rules and restrictions on property ownership and how to rent your property out. They don&#8217;t want you to go elsewhere. They want you, and your capital, to just stay where you are.</p>\n<p>This idea of going where you&#8217;re treated better doesn&#8217;t just apply to investments. We need to start looking beyond the horizons that most people we know look to and realize that we can live and pay tax anywhere we want in the world.</p>\n<p>You can travel anywhere you want. You can invest anywhere you want. You can open bank accounts anywhere you want.</p>\n<p>All it takes is a shift in attitude.</p>\n<p>If you have the mindset that traveling to places like Africa and Asia is crazy, you might be missing out on some great deals.</p>\n<p>If you think, &#8220;Oh no, I can&#8217;t go to Africa. Why would I go there? I&#8217;m going to get killed by a spear&#8221; then you&#8217;re saying no to positive changes that can occur in your life. Not only can you improve your prosperity, you can craft your ideal lifestyle, too.</p>\n<p>These days, so many people are much more open to traveling to places that people wouldn&#8217;t have dreamed of going to 10 or 20 years ago. Now we need to become more open to investing our money in unknown places, too.</p>\n<p>People freak out about putting their money in a Singapore Bank. But the reality is that everyone in Singapore uses Singaporean Banks and, let&#8217;s be honest, none of them are going broke!</p>\n<p>Banking systems and financial systems around the world are not as different as you might think. Even in Lesotho, in the heart of Africa, in a country that is landlocked and as far removed from the rest of the world as you can get, things are strikingly similar to what you&#8217;re probably used to.</p>\n<p>The reality is that what is an emerging market to you is a normal, but great, opportunity to investors who are one or two steps ahead of you.</p>\n<p>You see, the world isn&#8217;t that different a place and people aren&#8217;t that different. The common misconception is that unknown dangers lie in unknown places. Ironically, though, many of these unknown countries do tend to be safer than our familiar old safety nets.</p>\n<p>Take Georgia for example. Georgia, a country that I spend a lot of time in and that few people consider visiting, is actually the 3rd safest country in the world by some standards. Yet, many people will never venture so far into the unknown.</p>\n<p>The benefits of opening up and realizing that the world is largely the same are endless. Go where you are treated best. Invest your money there. You&#8217;re probably not only going to save a lot of money, but you&#8217;ll make a lot more money, too.</p>\n<p>Open up your mind, and the possibilities are endless.</p>\n<p>If you want to learn more about going where you&#8217;re treated best for your specific situation, <a href=\"http://www.nomadcapitalist.com/blog/\">my best blog posts</a> are a great place to start getting inspiration.</p>\n</div>","title":"How to Go Where You’re Treated Best"}},"pageContext":{"id":"5b92397987be0583cfde680b"}}