{"data":{"mongodbDatabaseArticles":{"id":"5b937ade87be056953db7ce2","content":"<div><h3 name=\"8565\" id=\"8565\" class=\"graf graf--h3 graf--leading\">2011&#8211;21 years&#160;old</h3><p name=\"5d7d\" id=\"5d7d\" class=\"graf graf--p graf-after--h3\">With no knowledge of how to design, how to market myself or even how to setup my domain name, progress was slow but it was steady and generally tracked upwards. Eventually, when I was 21, I was offered a job to help run a mobile app studio in Vietnam.</p><p name=\"c2dc\" id=\"c2dc\" class=\"graf graf--p graf-after--p\">I said yes, and in a week, I had arrived in Ho Chi Minh City amongst the chaos of people, motorbikes and chickens. I was scared shitless. I had no idea what I was doing, but I knew I was going to do it anyway.</p><p name=\"90ed\" id=\"90ed\" class=\"graf graf--p graf-after--p\">Unsurprisingly, the job didn&#8217;t work out, but I had fallen in love with the city and I knew that I couldn&#8217;t go back to Singapore. In the exuberance of youth (or sheer ignorance), I decided to take a leap of faith and go back to freelancing&#8202;&#8212;&#8202;this time from Vietnam and despite barely knowing anyone.</p><p name=\"1f68\" id=\"1f68\" class=\"graf graf--p graf-after--p\">The days that followed were filled with Photoshop, Skype calls and emails, all from the comfort of cafes and my own home.</p><blockquote name=\"996f\" id=\"996f\" class=\"graf graf--pullquote graf-after--p\">At some point, there was an odd spark of epiphany that made me realise that since none of my clients were based where I was, neither my business nor I were bound by location.</blockquote><p name=\"caca\" id=\"caca\" class=\"graf graf--p graf-after--pullquote\">And that was when I went crazy, travelling everywhere I could go. It was a flurry of flights, packing, unpacking and learning to say &#8216;thank you&#8217; in more languages than I could count. By the time the year was up, I had taken 49 flights, seven buses and one very rocky boat.</p><p name=\"c9ca\" id=\"c9ca\" class=\"graf graf--p graf-after--p\">That journey brought me to Sydney&#8202;&#8212;&#8202;where I learnt that I loved the business side of things and how important they were to designing. It sent me to Phnom Penh&#8202;&#8212;&#8202;where I learnt to stop being so painfully shy and how to talk to strangers. It landed me in London&#8202;&#8212;&#8202;where when pitching to a room of people, I ended up with my reputation as <strong class=\"markup--strong markup--p-strong\">&#8216;thedesignnomad&#8217;</strong>.</p><p name=\"87ad\" id=\"87ad\" class=\"graf graf--p graf-after--p\">It found me in a tiny aforementioned boat at dawn, in rural Vietnam on my way to a traditional wedding with the groom and his wedding presents&#8202;&#8212;&#8202;where I was clutching my laptop (and precious Photoshop files) unable to shake the grin off my face. All I could think about was how this was so fucking awesome.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*utxS8yfbnSuuCPBc.\">The groom and his presents in Rach Gia, Vietnam&#8202;&#8212;&#8202;2011</div>","title":"How I Accidentally Became a Design Nomad – Future Leaders – Medium"}},"pageContext":{"id":"5b937ade87be056953db7ce2"}}