{"data":{"mongodbDatabaseArticles":{"id":"5b93831187be056953db7e23","content":"<div><p name=\"6020\" id=\"6020\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Current Development</strong></p><p name=\"0651\" id=\"0651\" class=\"graf graf--p graf-after--p\">This board was used by developers every day. On this board we had all the tasks that needed be done in the current sprint (we used Kanban methodology). We had these columns:</p><ul class=\"postList\"><li name=\"91a6\" id=\"91a6\" class=\"graf graf--li graf-after--p\">Sprint Backlog: Tasks that needed to be done.</li><li name=\"ef1a\" id=\"ef1a\" class=\"graf graf--li graf-after--li\">Blocked: If a developer was working on a task but he realized he needed a design asset or a modification of an API call, for example; he moved the task to this column. This column must be empty if we specified well the tasks. On the Retrospective meeting (at the end of the sprint) we talked about all the cards that went through this column.</li><li name=\"f350\" id=\"f350\" class=\"graf graf--li graf-after--li\">In Progress (8): Tasks developers were currently doing. We couldn&#8217;t have more than 8 tasks (2 for developer). If we had, someone wasn&#8217;t working correctly.</li><li name=\"1303\" id=\"1303\" class=\"graf graf--li graf-after--li\">Finished: Tasks that were completed by developers but weren&#8217;t ready to test (they hadn&#8217;t been deployed to the development server or a new test app version hadn&#8217;t been released). If we had many, it was a sign that we needed to deploy them to the development server/app.</li><li name=\"d2f4\" id=\"d2f4\" class=\"graf graf--li graf-after--li\">QA (8): Tasks that needed to be tested. Each task should have a checklist with all the tests that needed to be checked. QA is probably the most boring part; so we had to commit ourselves to test every day. If a task failed, we added the description of what happened, and we moved it to the first position of the Sprint Backlog column.</li><li name=\"d018\" id=\"d018\" class=\"graf graf--li graf-after--li\">Ready for Deploy: Tasks that had been tested and could be deployed to production.</li><li name=\"59e3\" id=\"59e3\" class=\"graf graf--li graf-after--li\">Live (15 dic&#8202;&#8212;&#8202;21 dic): Tasks that had been deployed each week. At the end of the sprint we moved this column to the Deployed board, and we created a new column with the new dates.</li></ul><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1200/1*d8Kc_CXgwNMIASYpnmwcyw.png\"><p name=\"2a4a\" id=\"2a4a\" class=\"graf graf--p graf-after--figure\">Tasks from all platforms were in the same board. Each task had one or several tags associated with each platform.</p><p name=\"8b03\" id=\"8b03\" class=\"graf graf--p graf-after--p\">That way the Android developer could filter for Android; and the product manager could see all of them at the same time.</p><p name=\"8579\" id=\"8579\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Planning</strong></p><p name=\"3257\" id=\"3257\" class=\"graf graf--p graf-after--p\">This board was used by developers the day before we had the sprint meeting, and by the product manager everyday. On this board we had all the tasks that we were planning to do on next sprints. We had these columns:</p><ul class=\"postList\"><li name=\"0bc2\" id=\"0bc2\" class=\"graf graf--li graf-after--p\">Inbox: User stories which were going to be implemented on the next 2 or 3 sprints. When the product manager decided which ones were going to be implemented on the next 2 sprints, he moved them to the Design (if needed) or Specs column.</li><li name=\"5577\" id=\"5577\" class=\"graf graf--li graf-after--li\">Design: User stories which needed to be designed (new screen, iteration of a feature). Once the designer finished one of them, he pasted the link to the design file and moved the card to the Specs column.</li><li name=\"1a4b\" id=\"1a4b\" class=\"graf graf--li graf-after--li\">Specs: Developers transformed the user stories into tasks, making sure they had all the info + design they needed, adding dependencies on other areas (database, API). They could divide one user story into 4 tasks for example. Those tasks were moved to the Ready column.</li><li name=\"f277\" id=\"f277\" class=\"graf graf--li graf-after--li\">Ready: Tasks that were ready to be added into the next sprint.</li></ul><p name=\"d727\" id=\"d727\" class=\"graf graf--p graf-after--li\"><strong class=\"markup--strong markup--p-strong\">Bugs</strong></p><p name=\"5b66\" id=\"5b66\" class=\"graf graf--p graf-after--p\">This board was used by everyone on the team to report bugs. We had these columns:</p><ul class=\"postList\"><li name=\"69bc\" id=\"69bc\" class=\"graf graf--li graf-after--p\">Inbox: When a bug was discovered, it was added to this column. If it was a priority, we added the &#8220;Priority&#8221; tag (red color) and we assigned it to the person that could be responsible. That person had to look into it as soon as possible. Once a week, developers looked into all of them to see if they needed more info.</li><li name=\"92f6\" id=\"92f6\" class=\"graf graf--li graf-after--li\">Needs input: If the developer needed more information from the person who submitted it, or he needed to review it more deeply; he would moved the bug here.</li><li name=\"64b6\" id=\"64b6\" class=\"graf graf--li graf-after--li\">Confirmed: Confirmed bugs that needed to be fixed over the next sprints.</li></ul><p name=\"f96d\" id=\"f96d\" class=\"graf graf--p graf-after--li\"><strong class=\"markup--strong markup--p-strong\">Engineering</strong></p><p name=\"eb35\" id=\"eb35\" class=\"graf graf--p graf-after--p\">This board was used by developers to add parts of the code they wanted to refactor; or internal systems they wanted to change. We had a column for each platform.</p><p name=\"80df\" id=\"80df\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Ideas</strong></p><p name=\"761a\" id=\"761a\" class=\"graf graf--p graf-after--p\">This board was used by everyone on the team to add ideas. We had these columns:</p><ul class=\"postList\"><li name=\"d286\" id=\"d286\" class=\"graf graf--li graf-after--p\">Our ideas</li><li name=\"b869\" id=\"b869\" class=\"graf graf--li graf-after--li\">Customer ideas</li><li name=\"1f81\" id=\"1f81\" class=\"graf graf--li graf-after--li\">Crazy ideas</li></ul><p name=\"ede9\" id=\"ede9\" class=\"graf graf--p graf-after--li\">This board ended up having too many ideas, so it needed to be reviewed each month to merge and discard ideas. I wasn&#8217;t happy with this board, a possible change could have been having a column for each area of the product (acquisition, activation, engagement, chat&#8230;).</p><p name=\"40f7\" id=\"40f7\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Deployed</strong></p><p name=\"7697\" id=\"7697\" class=\"graf graf--p graf-after--p\">This board didn&#8217;t need to be used. It was just an archive of all the tasks that we had deployed.</p><p name=\"0a32\" id=\"0a32\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Retrospective</strong></p><p name=\"d989\" id=\"d989\" class=\"graf graf--p graf-after--p\">This board was used by developers, designers and the product manager to add internal processes that should be improved. We had these columns:</p><ul class=\"postList\"><li name=\"a7f4\" id=\"a7f4\" class=\"graf graf--li graf-after--p\">I like: When someone is happy about something, he/she would add it here.</li><li name=\"3d32\" id=\"3d32\" class=\"graf graf--li graf-after--li\">I dislike: When anyone was uncomfortable with a process, he/she would add it here explaining his/her reasons.</li><li name=\"dc6a\" id=\"dc6a\" class=\"graf graf--li graf-after--li\">Solved problems: Once we had talked about the problem on the Retrospective meeting, we wrote the solution we planned and we moved the card to this column. After several sprints we reviewed if the solution had succeeded.</li></ul><p name=\"02cc\" id=\"02cc\" class=\"graf graf--p graf-after--li\"><strong class=\"markup--strong markup--p-strong\">Feature QA</strong></p><p name=\"e6e9\" id=\"e6e9\" class=\"graf graf--p graf-after--p\">When we were going to release a big feature, we created a special QA board with tests. Developers who had worked on that feature were responsible for creating this board and all the tests. We had these columns:</p><ul class=\"postList\"><li name=\"4c56\" id=\"4c56\" class=\"graf graf--li graf-after--p\">To test: Tests that still needed to pass.</li><li name=\"4431\" id=\"4431\" class=\"graf graf--li graf-after--li\">In Progress</li><li name=\"0ff1\" id=\"0ff1\" class=\"graf graf--li graf-after--li\">Failed: The developer must fix them and move the card back to To test column.</li><li name=\"63e0\" id=\"63e0\" class=\"graf graf--li graf-after--li\">Succeeded</li></ul><p name=\"a782\" id=\"a782\" class=\"graf graf--p graf-after--li\"><strong class=\"markup--strong markup--p-strong\">Mobile QA</strong></p><p name=\"9728\" id=\"9728\" class=\"graf graf--p graf-after--p\">It&#8217;s a good idea to have a board with all the actions that need to be tested before releasing a new version of the mobile app. Those should be just the priority actions. Some companies have three levels of QA, this would be the first one.</p><p name=\"7cd8\" id=\"7cd8\" class=\"graf graf--p graf-after--p\">&#8211;</p><p name=\"aef9\" id=\"aef9\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Product development process</strong></p><p name=\"2c9c\" id=\"2c9c\" class=\"graf graf--p graf-after--p\">Let&#8217;s see now our development process, the meetings we had and how we moved cards between boards. We had sprints of one week, from Tuesday to Monday.</p><p name=\"aed9\" id=\"aed9\" class=\"graf graf--p graf-after--p\">Why one week only? Because we wanted to respect the planning (not adding tasks in the middle of the sprint) and at the same time we wanted to iterate quickly. It felt slow to plan tasks for two weeks. Of course, it&#8217;s more work, specially for the product manager; but there are always tradeoffs. It depends on the team and the stage of the company.</p><p name=\"4829\" id=\"4829\" class=\"graf graf--p graf-after--p\">Why from Tuesday to Monday? Each company does it differently and there is no right way. We wanted to release to production after each sprint; that way we were sure we finished testing on Tuesday morning and we could deploy on the afternoon or on Wednesday. Also, the Retrospective and the Sprint meetings are almost together so they can be shorter if there is no need to summarize what happened the previous week. It&#8217;s also true than doing the Sprint meeting on a Tuesday we avoid many festivities which usually are on Mondays or Fridays.</p><ul class=\"postList\"><li name=\"caf8\" id=\"caf8\" class=\"graf graf--li graf-after--p\">Retrospective meeting: Monday at 5pm. On this 30-minutes to 1-hour meeting, we discussed what went good and wrong on the sprint. We reviewed which tasks were left to take them into account for the Sprint meeting. Every several sprints, we reviewed the cards in the Retrospective board, we talked about the problems and agreed on possible solutions.</li><li name=\"9417\" id=\"9417\" class=\"graf graf--li graf-after--li\">Sprint meeting: Tuesday at 10am. On this 30-minutes to 1-hour meeting we chose the tasks, bugs and refactors which we were going to do on that sprint. This is where prioritization took place, which is always the hardest part. There are always bugs to fix, parts that should be refactored and new features to be added or modified. The product manager chose after listening to everyone.</li><li name=\"1235\" id=\"1235\" class=\"graf graf--li graf-after--li\">Daily meeting: Everyday, except Tuesdays, at 9am. On this 15-minutes meeting we discussed the tasks on which we were blocked, and slightly what we did the day before or were going to do that day.</li><li name=\"6450\" id=\"6450\" class=\"graf graf--li graf-after--li graf--trailing\">Product Planning: As we were just a few and I was the product manager, we didn&#8217;t need a meeting for this. We talked over it during the week. From Friday to Monday morning, I moved the user stories to be done on the next sprint to the Specs columns on the Planning board, assigning them to the developer who has going to be responsible of converting them to tasks and moving them to the Ready column. Of course, if a user story needed design it should have been moved at the beginning of the week so designer had enough time to do it.</li></ul></div>","title":"How we organize our remote team using Slack, Trello and Google Drive"}},"pageContext":{"id":"5b93831187be056953db7e23"}}