{"data":{"mongodbDatabaseArticles":{"id":"5b93830c87be056953db7e1f","content":"<div><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*DESv5IYnT3irJ97E_M5LQA.jpeg\"><h1 name=\"99c5\" id=\"99c5\" class=\"graf graf--h3 graf-after--figure graf--title\">Giving Remote Control: how to build and scale a remote&#160;start-up</h1><p name=\"18d5\" id=\"18d5\" class=\"graf graf--p graf-after--h3\">From idea to 60,000 beta signups in just six months From beta to &#8364;1million annual recurring revenue (ARR) in another six ARR of &#8364;10million in less than three years</p><p name=\"e421\" id=\"e421\" class=\"graf graf--p graf-after--p\">An interview with David Darmanin, CEO and co-founder of Hotjar</p><p name=\"f69b\" id=\"f69b\" class=\"graf graf--p graf-after--p\">&#8205;</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*FkRAv9mFk8MqjjRn.jpg\"><p name=\"db3e\" id=\"db3e\" class=\"graf graf--p graf-after--figure\">Hotjar is a SaaS start-up specialising in providing all-in-one analytics and feedback, with features such as heat mapping and conversion analytics. The company&#8217;s mission is to change the way digital experiences are built by &#8216;Democratizing&#8217; User Analytics and Feedback. It is a business that has achieved remarkable results: the company went from idea to 60,000 beta signups in just six months, and from beta to &#8364;1million annual recurring revenue (ARR) in another six, and it has now achieved ARR of &#8364;10million since launching in April 2015. The incredible twist in the plot is that the entire Hotjar team of 56 is distributed around the globe. Now, as it nears its third birthday, the company is working with CultureGene to ensure that it is primed for its next stage of growth and further success.</p><p name=\"dc5b\" id=\"dc5b\" class=\"graf graf--p graf-after--p\">I sat down (or more accurately, had a Google hangout) with David Darmanin, founder and CEO of Hotjar, to find out more about how he his co-founders have created such a strong company culture that continues to go from strength to strength without a single shared office in sight.</p><p name=\"9701\" id=\"9701\" class=\"graf graf--p graf-after--p\">Key highlights:</p><p name=\"8f11\" id=\"8f11\" class=\"graf graf--p graf-after--p\">- A thorough five-stage hiring process maximises your chances of hiring the best with the right cultural fit</p><p name=\"a119\" id=\"a119\" class=\"graf graf--p graf-after--p\">- How and why David and his co-founders built the business remotely</p><p name=\"ed1f\" id=\"ed1f\" class=\"graf graf--p graf-after--p\">- The unique challenges that remote presents and how Hotjar overcomes them</p><p name=\"af48\" id=\"af48\" class=\"graf graf--p graf-after--p\">- How to make everyone feel like they&#8217;re part of the business&#8202;&#8212;&#8202;even if they&#8217;re not a permanent member of staff</p><p name=\"d87d\" id=\"d87d\" class=\"graf graf--p graf-after--p\">- How and why Hotjar focuses on transparency and trust</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*eRLrJlXz_3YQItn0.jpg\"><p name=\"5465\" id=\"5465\" class=\"graf graf--p graf-after--figure\">&#8205;</p><p name=\"542b\" id=\"542b\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">What was your thinking about building a remote team and how did you approach building it?</strong></p><p name=\"6081\" id=\"6081\" class=\"graf graf--p graf-after--p\">The main factor driving our decision to build a remote company came from the previous company that we had built in Malta, where we are based. I was a VP at the company, one of Hotjar&#8217;s four co-founders, Johan, was the owner of that business, and it grew to the point where there were 150 people all based in the office. I really enjoyed it when the company had around twenty or thirty people: it was a time in my life when I was young and wanted to have fun and party, and the culture was very social. But when it reached 130, 140, 150 people, something changed for me and I ended up really hating it. At that point, there were enough people in the business for us not to know everyone, and it didn&#8217;t feel like a family anymore. It actually felt pretty awkward coming into the office and I realised that it just wasn&#8217;t working for me.</p><p name=\"2c10\" id=\"2c10\" class=\"graf graf--p graf-after--p\">Now, I&#8217;ve always loved travelling, and it was something that in the back of my mind I had planned to do more of at some point in the future. Because of how I was feeling at work, travelling became my impetus to look for a remote role&#8202;&#8212;&#8202;and I landed one fairly quickly, as a consultant. I loved the flexibility and the freedom of being able to work how I wanted, whether from home or going out to work from a caf&#233;, but there were certain things about the way the company worked that I didn&#8217;t like. For example, because I was a consultant, I had to buy my own laptop. There were also a few people based in a shared office in the UK so there was still a feeling of them and us. I just didn&#8217;t feel like I was part of the business.</p><p name=\"7f72\" id=\"7f72\" class=\"graf graf--p graf-after--p\">When we were setting up Hotjar, we decided to build it from scratch as a remote team; I wanted to keep the lifestyle I&#8217;d had access to in my remote role as a consultant, and I thought that if I could share that opportunity with other people, it would make a lot of people happy. I also thought it could be an amazing way to generate engagement and loyalty from our people, and basically make a lot of people want to work for us forever!</p><p name=\"087f\" id=\"087f\" class=\"graf graf--p graf-after--p\">We adopted parts of my personal experience of working for someone remotely, but also adapted and improved upon them. The vision when we set out was that whether someone was an employee or a contractor, they would be treated equally, even though the agreements and contracts they signed would be different. The whole idea was to make people feel welcome by investing in them from day one. We bought people the gear they&#8217;d need to do their work, such as laptops and headsets, and we also decided early on to put trust in our people by allowing them to have budgets and allowances that they controlled, so that they didn&#8217;t need to get permission and approval from us. This freed up a lot of time that&#8217;s often spent on back and forth communication with people checking whether they can spend a bit of money, and it also gave people a lot of autonomy and showed them that they had our trust.</p><p name=\"1983\" id=\"1983\" class=\"graf graf--p graf-after--p\">&#8205;</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*X6FIdDY-mKk91Vi2.jpg\"><p name=\"350e\" id=\"350e\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">What&#8217;s been successful about building a remote team this way?</strong></p><p name=\"92b3\" id=\"92b3\" class=\"graf graf--p graf-after--p\">In the very beginning, there were just four of us&#8202;&#8212;&#8202;three Maltese and one Swede&#8202;&#8212;&#8202;and we were all based just a few kilometres away from each other in Malta. However, right from the start, we worked as if we were remote workers in the same team. We avoided meeting up&#8202;&#8212;&#8202;even socially&#8202;&#8212;&#8202;and we avoided the temptation to get together in person to make decisions. Instead, everything was done remotely, which was a counterintuitive move, but it worked. I was actually really stubborn with the team about this, insisting that we would not start working together too much. In the end, it was a very successful move because when people joined us remotely later on, they fitted in automatically and didn&#8217;t feel left out because we&#8217;d created and shaped our culture like that from its inception.</p><p name=\"48c3\" id=\"48c3\" class=\"graf graf--p graf-after--p\">&#8205;</p><p name=\"cd7b\" id=\"cd7b\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">What&#8217;s been less successful about building a remote team?</strong></p><p name=\"1b07\" id=\"1b07\" class=\"graf graf--p graf-after--p\">Well, after our first hire, we managed to get hiring completely wrong! With remote working, it&#8217;s really easy to either under-estimate or over-estimate things because there&#8217;s more of a knowledge gap about what your colleagues know or can do, and your mind can easily fill in those blanks. I somehow assumed, for example, that my co-founders had enough experience to make the right hiring choices&#8202;&#8212;&#8202;even though I knew that they didn&#8217;t have experience in hiring! Because we were working remotely, I kind of forgot that they were inexperienced in this area and just assumed things would work well. That&#8217;s the big difference between remote and working in an office together: in person, things like this are more obvious because they&#8217;re right in front of you, whereas with remote, it&#8217;s very easy to take things for granted, either negatively or positively.</p><p name=\"8955\" id=\"8955\" class=\"graf graf--p graf-after--p\">This meant in the beginning especially that we hired the wrong people. We had to let go of one person in particular really quickly&#8202;&#8212;&#8202;within days, in fact&#8202;&#8212;&#8202;and that created a huge shit storm. We learned a big lesson from that experience: hire slow. Hire painfully slowly, in fact, to ensure there are no doubts and that it&#8217;s the right fit. Once you do that, you minimise the chance of any unwanted surprises.</p><p name=\"4131\" id=\"4131\" class=\"graf graf--p graf-after--p\">We also found that even though it might seem a bit inconvenient, when you do let someone go, it&#8217;s a good idea to give them one, two or three months&#8217; payment to soften the blow and to manage what happens. You see, the reality is with remote, you risk pulling out the cords from someone who&#8217;s been connected to you virtually, which means that suddenly, they might be out there alone. Again, because you don&#8217;t have the chance to say goodbye in person, it can be a bit risky. Overall though, the key thing to remember is that you need to stay lean in your team and be able to adapt and change as quickly as you can.</p><p name=\"358a\" id=\"358a\" class=\"graf graf--p graf-after--p\">Finally, we found after a few months that we hadn&#8217;t really done any in-person networking. We had set up remotely partly because of our geography (we are based on a tiny island in the middle of the Mediterranean!) and this would have really restricted who we would have been able to hire. But one thing we didn&#8217;t do initially was expand or leverage our in-person network. Once we realised that we&#8217;d fallen into a bit of a rut in that area, we started to invite people over, attending more events and bringing on more advisors and mentors, which helped us build more of a network.</p><p name=\"daa8\" id=\"daa8\" class=\"graf graf--p graf-after--p\">&#8205;</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*6uyFnCgWVOFYT8qq.jpg\"><p name=\"3cbc\" id=\"3cbc\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">How do you tackle hiring?</strong></p><p name=\"d1f5\" id=\"d1f5\" class=\"graf graf--p graf-after--p\">We have a pretty thorough five-stage hiring process, regardless of the role we&#8217;re hiring for.</p><p name=\"0c0a\" id=\"0c0a\" class=\"graf graf--p graf-after--p\">Stage 1</p><p name=\"42c5\" id=\"42c5\" class=\"graf graf--p graf-after--p\">The first stage is a fairly simple yet carefully crafted survey. We frame and ask questions in a particular way, and at this stage, we&#8217;re much more oriented towards identifying a no as opposed to a yes. The survey is there to eliminate people, which might sound negative but which is actually much easier for the first step of a screening process than looking for everyone who might be a potential ideal hire. The survey is designed to see if we&#8217;re on the same page as the applicants, so for example, if we were hiring a VP of customer service I&#8217;d ask a simple question like, &#8216;What&#8217;s caused this churn?&#8217; Now, you&#8217;d think this is a straightforward question, even an easy one, but it tells me a lot&#8202;&#8212;&#8202;from just that one answer alone, I can probably eliminate 60&#8211;70% of people applying; because lots of people say things like, &#8216;Churn happens when people are unhappy with the support you provide them.&#8217; That is a completely incorrect answer! I wouldn&#8217;t want to be working with a VP of customer experience who thinks that way, so we immediately know that this person has self-selected out of the process.</p><p name=\"788a\" id=\"788a\" class=\"graf graf--p graf-after--p\">We design questions for quick and easy no&#8217;s, but the key is to avoid false positives, so the questions have to be bulletproof. One thing we have to be careful about is not to lead with soft questions such as whether applicants know how to use certain tools, because these questions might disqualify someone based on something which is totally learnable, and that would be stupid, quite frankly. Essentially, the survey is there to quickly evaluate our applicants&#8217; mindsets and to get a sense of their fit with the culture at Hotjar.</p><p name=\"f787\" id=\"f787\" class=\"graf graf--p graf-after--p\">Stage 2</p><p name=\"7740\" id=\"7740\" class=\"graf graf--p graf-after--p\">Stage 2 involves the applicant submitting a video of themselves, in which they record their answers to five key questions. Here, we&#8217;re basically looking at the &#8216;Meet on a Sunday&#8217; test: would we want to spend a Sunday with this person at the office, alone? There&#8217;s a little more qualitative and gut feel at work here, but we do still put some more structured questions in. So, for example, if we were looking at honesty, we might ask, &#8216;If you could do anything on a Monday morning, what would you do?&#8217; Now, if the applicant responds, &#8216;Oh, I&#8217;d check my email and plan the week,&#8217; we&#8217;d be like, &#8216;Yeah, I call bullshit on that!&#8217; It doesn&#8217;t mean we&#8217;re going to disqualify that person, but if they do move ahead, we will bring that up later on challenge them about it.</p><p name=\"b770\" id=\"b770\" class=\"graf graf--p graf-after--p\">It&#8217;s really interesting to see the way people react to certain questions. It helps us to see if they are a good fit in terms of remotely being able to be honest, candid and to explain themselves easily on the fly. It&#8217;s important to understand those things at this stage because of the nature of working remotely; at some point, they will have to do this via video call, so in a way this stage is a bit of a test drive. Secondly, and very importantly, it&#8217;s at this stage that we start to look at what they would bring to our culture. We firmly believe that culture is not static, and everyone who joins the company contributes to it. By asking questions like the Monday morning question, we can get a sense of what this person would bring to the table. The first two stages are run by the recruitment coordinator, Sarah, and a hiring manager who is assigned to each specific role.</p><p name=\"9a0a\" id=\"9a0a\" class=\"graf graf--p graf-after--p\">Stage 3</p><p name=\"0cd5\" id=\"0cd5\" class=\"graf graf--p graf-after--p\">Stage 3 is an interview. This doesn&#8217;t have to be done via video; in fact, we typically prefer it to be done via audio. In the first part of the interview, we ask a few simple questions to double-check the answers the candidate gave in the survey and in the video. Then we try to get a feel for who they are and to get to know them. We ask questions that highlight and focus on emotional awareness, such as, &#8216;How would other people describe you?&#8217; Later in the process, we might check their answers against what their references say, to see how much alignment there is. This can tell us a lot about their emotional intelligence and self-awareness.</p><p name=\"71b5\" id=\"71b5\" class=\"graf graf--p graf-after--p\">At Stage 3, we also dig a little bit more into the actual role they&#8217;ve applied for. We quiz people about specific, role-related scenarios so that we can see their style of thinking and way of approaching a challenge or opportunity. The majority of the interview is focused on emotional intelligence and awareness, with questions such as, &#8216;Tell us about a conflict you&#8217;ve experienced.&#8217; Again, we&#8217;re still identifying red flags at this point, and if there are any, this stage gives us the opportunity to see quite a few red flags by this point. To be blunt, at this stage we&#8217;re trying to weed out assholes and anyone who would be unreasonable to work with, such as potentially racist or intolerant people. This tends to emerge very quickly when you start to discuss certain topics with people. Obviously it&#8217;s difficult to nail this in an hour, but we make an effort to discover those parts of a person&#8217;s character as quickly as possible.</p><p name=\"61e0\" id=\"61e0\" class=\"graf graf--p graf-after--p\">One time we had a very strong developer, an ex-Googler, in a stage three interview. We asked him to tell us about a time when he had a conflict, and he told us about a time when he worked with just one woman in the team. He said, &#8216;Oh we should tell what&#8217;s-her-name, the girl, the girl on the team,&#8217; and his manager overheard it and said, &#8216;Listen, as much as possible don&#8217;t say, &#8220;the girl on the team,&#8221; because it&#8217;s risky, she might not like it and it can come across as insensitive.&#8217; He got really pissed off that he was corrected about this, and he said something like, &#8216;It makes no sense. If she&#8217;s a girl, she&#8217;s a girl.&#8217; This for us was such an easy red flag for us because he didn&#8217;t even understand why it was a concern.</p><p name=\"d916\" id=\"d916\" class=\"graf graf--p graf-after--p\">Stage 4</p><p name=\"957c\" id=\"957c\" class=\"graf graf--p graf-after--p\">At the end of stage 3, there&#8217;s usually one of two situations: either we have roles that are open constantly, which means we&#8217;re constantly bringing people into stage 4. Or, if we&#8217;re looking to hire one person, like a VP for a particular department, then we will wait to do enough stage 3 interviews to choose two or three people to go to stage 4 together.</p><p name=\"0d9d\" id=\"0d9d\" class=\"graf graf--p graf-after--p\">In Stage 4, candidates complete a task&#8202;&#8212;&#8202;we call this &#8216;performance recruitment.&#8217; We design a task made up of two or three parts; for every role, no matter what it is, one part of the task involves getting people to look at a current system that is in place in the business, understand it, create a diagram for it, explain how it works and suggest how it can be improved. What we&#8217;re looking for here is evidence of whether people can think in terms of systems and whether they are analytical and able to describe something clearly.</p><p name=\"f7f8\" id=\"f7f8\" class=\"graf graf--p graf-after--p\">This is probably quite an obvious process for an engineering role, which is all about systems, but we do it across the board. So for example, if we were recruiting a VP of customer service, we would get them to look at the process in place around how we deal with yearly invoices; for operations, we&#8217;d tell them to look at hiring. In both cases, we&#8217;d tell them to find bottlenecks in the system and suggest ways of improving it. Everything revolves around looking at whether they are capable of systems thinking; if you can&#8217;t or don&#8217;t think systems, it can create big problems.</p><p name=\"e021\" id=\"e021\" class=\"graf graf--p graf-after--p\">Candidates get an invite to HipChat and as much as possible, we try and move the conversation away from voice and video, even to the point where we give them the task via HipChat. As well as looking at how they complete the task, we want to understand how they make sense of being given work to do remotely, how they take remote feedback and how they process information.</p><p name=\"b563\" id=\"b563\" class=\"graf graf--p graf-after--p\">We also identify one thing they would be doing within the first three or six months working with us and ask them to do it. The most important thing about this part of the hiring process is getting candidates to tackle at least one thing that we&#8217;re actually going to use in the business; we&#8217;ve found that unless you&#8217;re inventing something for actual use, people tend not to reflect and review their work with a critical mind, because it&#8217;s impossible to be critical about something you don&#8217;t actually need! It&#8217;s like going to buy a sofa before you need it&#8202;&#8212;&#8202;you just look around at the colours and think, &#8216;Oh, that&#8217;s nice.&#8217; This isn&#8217;t practical and it doesn&#8217;t translate to reality because you don&#8217;t even think, &#8216;How big is the room?&#8217; So it helps a lot to have candidates work on something that is genuinely needed&#8202;&#8212;&#8202;and no matter how good that product or process already is, we ask them at stage 4 to change at least part of it, reworking it and improving it.</p><p name=\"12d3\" id=\"12d3\" class=\"graf graf--p graf-after--p\">When we give candidates feedback on their work, we deliberately make it a little bit harsh, to see if they can take it: can they listen, receive constructive criticism and more importantly do they understand what we said, and do they go away and fix or change what we wanted them to?</p><p name=\"1530\" id=\"1530\" class=\"graf graf--p graf-after--p\">The final part of this stage is when they present their work to the team. There&#8217;s multiple people at this stage, and candidates&#8217; work is evaluated by the hiring team which always includes the recruitment coordinator and the hiring manager. We also ask the candidate to grade their own work, which is really important&#8202;&#8212;&#8202;it tells us if they are modest and again, self-aware enough to understand where they did a good job and where they could improve next time.</p><p name=\"30ab\" id=\"30ab\" class=\"graf graf--p graf-after--p\">Everyone involved in the final hiring team makes a decision about the candidate on their own and votes using Trello; then, together, they look at what each person decided. Part of the final decision at this stage comes from looking at the quality of their work, and part from how they behaved in the various communication channels throughout the hiring process.</p><p name=\"39f1\" id=\"39f1\" class=\"graf graf--p graf-after--p\">Stage 5</p><p name=\"484f\" id=\"484f\" class=\"graf graf--p graf-after--p\">The final stage, Stage 5, is where we set up a call between the candidate, the hiring manager and myself. My focus at this point is to check the quality of the hiring team&#8217;s decision by doing what I call the desperation test. My key focus is to find out if the team was so desperate to fill this role that they lowered their guard somewhere. Typically I don&#8217;t have that anxiety, so I&#8217;m able to spot if it&#8217;s been happening. I&#8217;m also really evaluating at the highest level whether there is a culture fit with this candidate. This process is adapted a bit depending on the role we&#8217;re hiring for; for example, if we&#8217;re hiring a senior backend engineer, I&#8217;m going to dig much, much deeper here into the relevant questions for that particular role. I also shift more focus towards questions about this candidate&#8217;s future if they&#8217;re applying for a customer services hero role, considering what it might be a stepping stone to, how long they are going to be with us and what the real motivation is for wanting the role.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*_EPV-kxX8gZQ0OIH.jpg\"><p name=\"ba6b\" id=\"ba6b\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">Run me through your thinking on Learning &amp; Development, including the perks you offer at Hotjar.</strong></p><p name=\"49f3\" id=\"49f3\" class=\"graf graf--p graf-after--p\">I&#8217;ll be honest, on a high level if I had to rate ourselves, I think we&#8217;re actually quite low on the personal development side. We embrace it a lot, but we&#8217;re not taking the lead yet. Probably because our team is so driven and they&#8217;re all learning like crazy on their own.</p><p name=\"a989\" id=\"a989\" class=\"graf graf--p graf-after--p\">But here&#8217;s what we do have in place: first off, department budgets are set up in such a way that departments can decide on their own what to do for L&amp;D, such as which events to go to. We get people to initiate that and be as proactive as possible about it. We believe a lot in events, so we push a lot for people to attend them. Events are probably where I&#8217;ve learnt the most; there is a lot of value in hearing people share, live, about what they&#8217;re doing and they&#8217;re also a great opportunity for networking.</p><p name=\"1ba9\" id=\"1ba9\" class=\"graf graf--p graf-after--p\">We also give memberships to Udemy to the whole team, so that they can go and learn anything they want on the fly. Then we have the personal development budget, which is a yearly budget of five hundred Euro per person (we also recently created a 200 Euro budget per person for wellness). Everyone is given a Kindle and has an unlimited budget for any books they want to buy.</p><p name=\"aaef\" id=\"aaef\" class=\"graf graf--p graf-after--p\">Every week, we show on the demo site how people are using their personal development budget, such as whether they&#8217;re buying books or taking courses, and we share that with the rest of the team. It&#8217;s down to department leads to focus on that and there isn&#8217;t yet a centralised approach to it.</p><p name=\"05d3\" id=\"05d3\" class=\"graf graf--p graf-after--p\">The main feedback we&#8217;ve gotten from the team around L&amp;D takes the form of requests for guidance about what to learn. Generally the response I give to people is looking for someone to tell you what to learn is not an ideal place to be. I&#8217;m happy to challenge people with suggestions and ideas, but I see learning as something that you should take your own initiative on, where you create your own path, fail and learn, just like anything else.</p><p name=\"5298\" id=\"5298\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">One of your values is transparency. Describe how you live that at Hotjar.</strong></p><p name=\"9459\" id=\"9459\" class=\"graf graf--p graf-after--p\">There are two main things we do to be transparent. One is that our financials and business plans are available to the whole company and we actually present them every month, so there&#8217;s transparency around output and results as well as state of the business and plans for the future.</p><p name=\"e637\" id=\"e637\" class=\"graf graf--p graf-after--p\">The second part is the way in which decisions are taken or calls are taken; they are all open for anyone to listen in on. However, having the team join a super long call just to see how we&#8217;re deciding something isn&#8217;t the most effective way of working.</p><p name=\"1f9a\" id=\"1f9a\" class=\"graf graf--p graf-after--p\">Transparency really comes down to the way we operate on a daily basis, which is simply to be frank, open, direct and honest. The problem with this is obviously that the more you scale, the more this level of openness comes less naturally and the more it becomes something you need to design for. If there are twenty people in the company, it&#8217;s easier to be transparent and open with everyone, but once you start reaching 70&#8211;80 people, you need a system for it.</p><p name=\"8424\" id=\"8424\" class=\"graf graf--p graf-after--p\">Another thing we&#8217;ve done and always prided ourselves on is our ongoing work to eliminate politics and back-talking. For example, as soon as we thought, &#8216;Let&#8217;s speak to investors,&#8217; the first thing I did was to jump on a company meeting and tell everyone. I told people that we were going to speak to investors, and why. &#8216;We&#8217;re not saying we&#8217;re committed to this or not,&#8217; I said, &#8216;but here&#8217;s the thinking.&#8217; Even though some people panicked because they don&#8217;t want investors in the business, they appreciated the fact that we told them about it.</p><p name=\"2b0b\" id=\"2b0b\" class=\"graf graf--p graf-after--p\">The purpose of transparency is to build trust. It&#8217;s laying your cards on the table. It&#8217;s not about tricking people, but it is about showing your intent and putting action behind it. That&#8217;s what makes you transparent at the end of the day.</p><p name=\"459a\" id=\"459a\" class=\"graf graf--p graf-after--p\">&#8205;</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*aulv9Fh4GyK3kkeO.jpg\"><p name=\"8393\" id=\"8393\" class=\"graf graf--p graf-after--figure\"><strong class=\"markup--strong markup--p-strong\">You had the CEO of Radical Candor come and speak to you&#8202;&#8212;&#8202;take me through your thinking there.</strong></p><p name=\"0d72\" id=\"0d72\" class=\"graf graf--p graf-after--p\">What I realised is that while I&#8217;m very good at giving feedback and being quite candid, maybe not everyone understands where I&#8217;m coming from. One of our team members read Radical Candor and said, &#8216;Holy shit! I read this book and it sounds like I&#8217;m reading David&#8217;s manual of how to manage people.&#8217; When I read it I thought it was fantastic resource, because if there&#8217;s one thing I&#8217;m weak at, it&#8217;s teaching people. I love to find books with good frameworks and bringing in people to teach the team, so this was a big win.</p><p name=\"63a0\" id=\"63a0\" class=\"graf graf--p graf-after--p\">It&#8217;s on my bucket list to eventually become better at teaching. Someone on the team was an ex-teacher and he gave me this really simple tip: teaching, he said, is about asking questions&#8202;&#8212;&#8202;not telling others what they should know! That stuck with me because I realised that I don&#8217;t ask enough questions: I tell people things. So now I&#8217;m testing this new approach on my four-year-old! (It&#8217;s working nicely.)</p><p name=\"421c\" id=\"421c\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">What are your observations about the role of discretionary energy at Hotjar&#8202;&#8212;&#8202;the extra 20 percent that people willingly give over and above their time at work, because they are fully engaged and inspired?</strong></p><p name=\"79f3\" id=\"79f3\" class=\"graf graf--p graf-after--p\">Generally, I don&#8217;t think we have massive engagement with discretionary energy. It can obviously be a huge positive for a business, but on occasion it can also be linked to stress. Where I do notice people taking an extra burden is in certain key leadership roles. We encourage people to take enough vacation by displaying names on a &#8216;wall of shame&#8217; of the people who haven&#8217;t taken enough time off. In general, I think our people tend to be very good at switching off&#8202;&#8212;&#8202;but then again, this is an assumption and it&#8217;s something for us to look at further.</p><p name=\"1ebc\" id=\"1ebc\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">You mentioned earlier that you had fired somebody in a matter of days. How do you work out if somebody is not a good fit at Hotjar, and what&#8217;s the process for letting them go?</strong></p><p name=\"2ee2\" id=\"2ee2\" class=\"graf graf--p graf-after--p\">In the specific case I mentioned earlier, there were clear indicators that the person wasn&#8217;t right for the culture and the team. It was pretty horrible, actually: someone was given the wrong task, it was around our third hire, and they didn&#8217;t even know the coding language we wanted them to know. More importantly though, they had an attitude problem and didn&#8217;t communicate well, so we knew instantly it was a poor fit.</p><p name=\"e48d\" id=\"e48d\" class=\"graf graf--p graf-after--p\">In other cases, because we are self-funded, fast moving and scrappy, one of the most obvious tell-tale signs that someone isn&#8217;t a good fit is if they are simply not executing. It will seem like there&#8217;s a project black hole&#8202;&#8212;&#8202;projects go there and nothing comes back! Typically that&#8217;s where the process of letting someone go starts. Sometimes, as in the example I just gave you, we see an attitude problem. I think bad attitude cases are actually faster and easier to pinpoint because we are so tuned culture-wise that we can spot it really quickly.</p><p name=\"a786\" id=\"a786\" class=\"graf graf--p graf-after--p\">In cases where people aren&#8217;t executing, that&#8217;s where we&#8217;ve been a little bit too slow to act, but we&#8217;re getting better at detecting when that happens and acting on it earlier. Typically it&#8217;s not that the person isn&#8217;t working enough; typically it&#8217;s that their approach and mindset are ineffective. So for example, they might be doing projects that are way too big, or they might be overcomplicating things. Very rarely, you can tell that they&#8217;re just a little bit lazy and not moving fast enough. Recently we let a product designer go because they were just not getting anything done, it was moving too slow and the ideas weren&#8217;t good enough and ironically, we had found that he had launched his own tool on the side and that actually coincided exactly with when he had received the first warning. It was interesting that we picked up on that quite quickly.</p><p name=\"8577\" id=\"8577\" class=\"graf graf--p graf-after--p\">In terms of timing, I think in the last two examples it took us about a year to act on it, which was too long. We extended our probation period to nine months&#8202;&#8212;&#8202;not for financial or legal purposes, but more so that everyone has the right mindset around how they approach their work&#8202;&#8212;&#8202;and now we&#8217;re aiming to at least have any mis-hires sorted by nine months. For us, six months at this point would be impossible. It takes three to six months to realise there&#8217;s an issue, and we&#8217;ve been a little bit too slow and too nice to act on it. This has been one of my main pieces of feedback to managers and team leads. I think it&#8217;s probably one of the specific issues with remote working. You think, &#8216;Well there was a misunderstanding,&#8217; or &#8216;Things will get better,&#8217; but because you&#8217;re not there face-to-face to see how someone is working, it&#8217;s easy to make assumptions and to over-estimate them.</p><p name=\"88da\" id=\"88da\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">It&#8217;s probably one of the things where over time a really optimal remote environment cuts that out quickly and builds systems around it.</strong></p><p name=\"3c84\" id=\"3c84\" class=\"graf graf--p graf-after--p\">You&#8217;re right, it&#8217;s about building a system. We did use to do a review, based on our five key values, highlighting each one and we rating each person by questioning them. So for example, we&#8217;d ask, are you learning and actively trying to learn? Are you executing at a good pace and getting stuff done? We gave a rating to each answer and calculated an overall average score. But at a certain point we stopped doing it, and I think we need to reintroduce it.</p><p name=\"245f\" id=\"245f\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Describe your onboarding process at Hotjar.</strong></p><p name=\"29fc\" id=\"29fc\" class=\"graf graf--p graf-after--p\">Even before someone joins, they receive a welcome pack with their Kindle, headsets, the Strengths Finder book and their company credit card.</p><p name=\"4b24\" id=\"4b24\" class=\"graf graf--p graf-after--p\">Then, when they join, all of the core stuff that&#8217;s the same across every role&#8202;&#8212;&#8202;assigning hardware, equipment and getting to know people&#8202;&#8212;&#8202;is centralised with operations, so that it&#8217;s equal for everyone. New joiners get to know people and sign up with a Trello board. The role-specific part of onboarding is left in the hands of the person running the department, and their processes around this have been improved iteratively over time. So people in the support team, for example, follow one program, and developers follow another, and we&#8217;re getting the different leads to speak to each other so they can learn from each other.</p><p name=\"94e4\" id=\"94e4\" class=\"graf graf--p graf-after--p\">We build connection and trust in a couple of ways. When we hire someone in Product, in most cases we fly them over to Malta so we can meet them, and everyone else who joins typically takes a call with me.</p><p name=\"3631\" id=\"3631\" class=\"graf graf--p graf-after--p\">The company is also divided into tribes, which are independent of teams. When someone joins, they are automatically assigned a tribe based on their strengths and role. We mix people up into different groups so that tribes have diversity. At the moment, when someone joins, they have to publish an article sharing ten fun facts about themselves, which is a great way for people to get to know someone new, but not for them to get to know us. We are thinking about introducing welcome parties to tribes, to help establish the new relationships&#8202;&#8212;&#8202;and again, this would all be done remotely. You put it in a very eloquent way: It&#8217;s about trust. That&#8217;s really what we should be focusing on.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*fHuEZiNdkTCGxggq.jpg\"><p name=\"2677\" id=\"2677\" class=\"graf graf--p graf-after--figure\">&#8205;</p><h3 name=\"b8de\" id=\"b8de\" class=\"graf graf--h3 graf-after--p\"><a href=\"https://www.culturegene.ai/books\" class=\"markup--anchor markup--h3-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Culture Decks Decoded</a> will be published in Q4 2018, sign up now to receive a sneak preview of the first chapters and be notified when the book is published.</h3><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*AnY_J26yupYlx2cPSqJ0IQ.jpeg\"><p name=\"06d3\" id=\"06d3\" class=\"graf graf--p graf-after--figure\">Learn more about CultureGene at <a href=\"http://www.culturegene.ai\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">www.culturegene.ai</a></p><h4 name=\"48f8\" id=\"48f8\" class=\"graf graf--h4 graf-after--figure\">This story is published in <a href=\"https://medium.com/swlh\" class=\"markup--anchor markup--h4-anchor\" target=\"_blank\">The Startup</a>, Medium&#8217;s largest entrepreneurship publication followed by 335,210+&#160;people.</h4><h4 name=\"24b8\" id=\"24b8\" class=\"graf graf--h4 graf-after--h4\">Subscribe to receive <a href=\"http://growthsupply.com/the-startup-newsletter/\" class=\"markup--anchor markup--h4-anchor\" rel=\"nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow nofollow nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow nofollow noopener nofollow noopener nofollow noopener nofollow nofollow noopener nofollow nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener noopener noopener nofollow noopener nofollow noopener nofollow noopener noopener nofollow noopener nofollow noopener nofollow noopener noopener nofollow noopener nofollow noopener noopener nofollow noopener noopener nofollow noopener nofollow noopener nofollow noopener noopener noopener noopener noopener noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener nofollow noopener noopener nofollow noopener nofollow noopener noopener nofollow noopener noopener nofollow noopener noopener nofollow noopener nofollow noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener noopener nofollow noopener nofollow noopener noopener nofollow noopener\" target=\"_blank\">our top stories&#160;here</a>.</h4></div>","title":"Giving Remote Control: how to build and scale a remote start-up"}},"pageContext":{"id":"5b93830c87be056953db7e1f"}}