{"data":{"mongodbDatabaseArticles":{"id":"5b9248c587be056953db7beb","content":"<div><p>To reduce procrastination and become faster at launching my projects, I've set the goal to launch <a href=\"/12-startups-12-months\">12 startups in 12 months</a>. A month after every launch, I do a debriefing on how it went. Last month, I launched the first project, <a href=\"http://levels.io/play-my-inbox\">Play My Inbox</a>, which plays music from your inbox. <strong>Here's what happened</strong>:</p> <p>As usual, I first launched it to <a href=\"http://news.ycombinator.com/\">Hacker News</a>. They were highly unimpressed though and my submission didn't go anywhere. I tried deleting and re-submitting it a few times with different titles which, I later found out, got me hellbanned by an HN robot. Oh fu! (Luckily, HN admin <strong>dang</strong> later unbanned me after I apologized.)</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/Screenshot-2014-04-23-01.08.59-1024x61.png\"> <p>I then sent it to a few major tech blogs. These were <a href=\"http://lifehacker.com/\">Lifehacker</a>, <a href=\"http://thenextweb.com/\">TheNextWeb</a>, <a href=\"http://fastcompany.com/\">Fast Company</a>, <a href=\"http://techcrunch.com/\">TechCrunch</a> and music tech blog <a href=\"http://evolver.fm/\">Evolver.FM</a>. After a few days, Lifehacker finally <a href=\"http://lifehacker.com/split-payments-air-conditioning-and-pocket-tags-1540847975\">wrote about it</a> making me ecstatic! Then Evolver.FM also <a href=\"http://evolver.fm/2014/03/25/play-my-inbox-turns-gmail-into-music-playlist-if-you-dare/\">covered it</a>. TheNextWeb wanted to write about it, but never followed up with an article. So that's 2 out of 5 blogs I approached which covered it, a 40% success rate. Pretty high.</p> <h2>The first flock of users arrived</h2> <p>With Lifehacker writing about it, a lot of people started using it and one of those was a <a href=\"//twitter.com/JessicaSuarez\">music journalist</a> formerly working for MTV, who sent me this enthusiastic message:</p> <blockquote><p>Hey! I just wanted to write you and say you've really made an amazing app. I do a bit of writing about music, and so I get a lot of links to videos and tracks from publicists and I couldn't find a quick way to listen to them. This is a lifesaver. I can't wait to send it over to my music writer friends. I cannot believe you built this in one day. </p> <p>Jessica</p></blockquote> <p>She forwarded it to all her colleagues and from there it hit one of MTV's Twitter accounts:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p>.<a href=\"//twitter.com/levelsio\">@levelsio</a> created an app that collects YouTube &amp; SoundCloud music from your inbox and plays it for you! <a href=\"http://t.co/rKqF5lGxWy\">http://t.co/rKqF5lGxWy</a></p> <p>&#8212; MTV Artists (@MTVartists) <a href=\"//twitter.com/MTVartists/statuses/444164328321978368\">March 13, 2014</a></p></blockquote> <p></p> <p>That resulted in even more users. Like these in Japan:</p>   <p></p> <p>I also posted it to <a href=\"http://www.reddit.com/r/startups/comments/1zzyl1/i_built_a_site_that_playlists_your_inboxs_music/\">Reddit's /r/startups</a>. Obviously, the startup people didn't like to give access to their inbox:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/Screenshot-2014-04-23-01.12.22-1024x537.png\"> <p>Then a big music blog called <a href=\"http://animalnewyork.com/2014/turn-gmail-inbox-playlist/\">Animal New York</a> covered it.</p> <p>While it was going around, I saw many people arriving at the landing page, but only a share of those actually went on to use the app. As they'd have to authorize access to their inbox. So to still let users see the app, I added the feature to play the music from recent user's inboxes.</p> <a href=\"http://playmyinbox.com/\"><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/Screenshot-2014-04-27-18.52.081-1024x547.png\"></a> <p>In the end, over 2,000 people used it in a month.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/04/Screenshot-2014-04-27-02.28.04-1024x550.png\"> <h2>Lessons learnt</h2> <h3>Promote more focused</h3> <p>I should have sent it to more blogs but this was my first project and this 'marketing your launch'-thing was exactly what I never had the guts to do. So this was my first step into getting it right. To be fair, this was the most non-focused send-out ever. Like if you're building a music app, maybe you should send it to music blogs and not TechCrunch, dude. Yep. Agreed. Wholeheartedly. :D For next time, I'm now building a targeted media list to approach with individual journalists to contact that write about a topic related to my project. That will probably work better than just sending it to the 5 biggest tech blogs.</p> <h3>Privacy is a big deal</h3> <p>A lot of people had big privacy issues with this project. Since you need to authorize and share your Gmail account with the site. And I knew that'd be a problem from the start. It might help to add an FAQ on the landing page to minimize people's worries about what I do with their data. Since really I only filter out the music from their inbox. The privacy thing probably stopped it from going really viral.</p> <h3>You don't know who will use it until you launch it</h3> <p>I never thought the biggest user base here would be music journalists who receive music demos in their inbox. That feedback shows there might be demand to build some SAAS solution to make their job easier.</p> <h2>Conclusion</h2> <p>In the end I got a lot of attention with only 2 blogs writing about it. That shows if people like whatever you made, it doesn't need a huge push to go somewhere. Although I'll keep doing some more press in the next few weeks to see where else it can go :)</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Over 2,000 people played their inbox with Play My Inbox"}},"pageContext":{"id":"5b9248c587be056953db7beb"}}