{"data":{"mongodbDatabaseArticles":{"id":"5b9248a687be056953db7bce","content":"<div><p>Today, Hacker News saw an anonymous post rise to the top titled <a href=\"//news.ycombinator.com/item?id=8177259\">\"I'm 25 years old and I am lost\"</a>.</p> <blockquote><p>What do you do when you believe that you can do great things but something that you have no control over is holding you back? You believe that you are good at what you do and are meant for great things but you have to do your job even though it doesn't do justice to your capabilities. How do you cope with that? Seeing your future as an underachiever pains you. What do you do?</p> <p>In the course of trying to figure it out, I spoke to my friends about this, I realized that most of them are going through the same thing. But they haven't figured out how to deal with it. I don't know if this is what they call a quarter-life crisis.</p> <p>Thus, this is as much a distress call as it is a rant. And not having anyone else to turn to, I am posting it here at HN assuming that this is not just a problem for a handful of people but a general problem for people who believe in their ability to do great things (whether it is true or not is irrelevant to them).</p></blockquote> <h2>Feeling lost</h2> <p>In the last year, I can't tell you how many people I've met my age that tell me they \"feel lost\". It's an epidemic of this generation. And they're everywhere where there's privileged people. My friends in the Netherlands feel it now that they've graduated university. The digital nomads I met in Bali, especially in Ubud, feel it overwhelmingly, that's probably <a href=\"http://www.imdb.com/title/tt0879870/\">why they're there in the first place</a>. And even now that I'm in the Philippines, when I meet young people, the upper-class privileged ones have this feeling.</p> <p>And I have it as well. I know how it feels. I started getting this feeling this year too. It started after I realized that I'd been working so hard on my projects for the last decade, and was reaching close to 30 (I turned 28 this year) and started wondering why I actually did all this. What was the point? That was a very very scary moment. It probably <a href=\"http://levels.io/reset-your-life\">started earlier</a> for me actually. And probably the reason I'm flying around the world and not settling somewhere, is cause I have no idea how to deal with this life either!</p> <p>So what does \"feeling lost\" actually feel like? Well it's a nagging feeling of \"Is this it?\", \"What's the meaning of my work/life?\" and \"Why am I so dissatisfied with all this good stuff?\". It roots from our upbringing of exceptionalism, that we were all unique snowflakes destined for great achievement. Our entire youth, we've been raised by the media to idolize successful people. And if we just followed the right steps, we'd be world famous and hugely successful too. All to exemplify our uniqueness. But that was a myth. Propagated by the media, and pushed to us by our parents too.</p> <p>It's weird though how it seems like this year it's all coming out. It makes me thing somebody put something in our food or air that makes us feel this way? If I'd be crazy, I'd say it'd be some American CIA through-control experiment. Probably not though:</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/levelsio\">@levelsio</a> so this is fascinating. The Gen-Y culture of &#8220;everyone&#8221; is destined for greatness is coming out.</p> <p>&#8212; Adam Evers (@adamevers) <a href=\"//twitter.com/adamevers/statuses/499968273857794049\">August 14, 2014</a></p></blockquote> <p></p> <p>And now that Generation Y is closing in to 30, we're doing a balance check for ourselves. Where are we? Most of us are not world famous or exceptionally successful. And even if we were, it would probably not have been enough for us. Because we'll never be unique snowflakes. We'll always be part of a community. And that's what we have a hard time grasping. We feel we're so unique and hence so individualist and, well, lonely, that we shy away from community. That's why Gen-Y is not starting families, or delaying it until infinity. That's why we're all doing startups, where the odds are low to actually succeed. Because we think we're different. We can succeed even if no one else does. If we just work harder, to achieve more, we'll get to an epic dream world where everything will sort it self out. But it won't. Life never worked this way.</p> <p>It's part of a growing trend lately. Two months ago, also on Hacker News, there was a thread about Founder Depression and people feeling <a href=\"/achiever-crisis/\">dissatisfied after achieving success</a>.</p> <p>I spoke with my dad about this and he said it comes down to us just having too much freedom, too much choices. Unlike previous generations, there's no real pressure on us to do a certain thing. We can fly anywhere and do anything we want. We despise jobs because we want to start \"our own thing\". Which is all admirable. But all that freedom is also debilitating. How do you know you make right choice? Constraints may have helped us a bit. And then now that we're doing all that stuff, we figure out, all this stuff isn't actually making us happy.</p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/levelsio\">@levelsio</a> it&#8217;s fractionating. We&#8217;re the most privileged generation in the world. Yet we&#8217;re still not satisfied.</p> <p>&#8212; Adam Evers (@adamevers) <a href=\"//twitter.com/adamevers/statuses/499971764714086400\">August 14, 2014</a></p></blockquote> <p></p> <p>So what's the answer? Well, the obvious one is to live in the moment and enjoy every second of this life. To be happy with what we have. Which is way more than most. But how do you teach us this? That's exactly the opposite of how we were brought up. We were supposed to look ahead, set goals, reach them, set more goals, reach them...and eh...then? Oh yeah nobody did tell us what was after that. </p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/adamevers\">@adamevers</a> <a href=\"//twitter.com/levelsio\">@levelsio</a> so it seems the solution isn't something out there, but is \"in here\". Changing how our mind relates to the world.</p> <p>&#8212; Jaemin Yi (@Jaemin_Yi) <a href=\"//twitter.com/Jaemin_Yi/statuses/500140917748011008\">August 15, 2014</a></p></blockquote> <p></p> <blockquote class=\"twitter-tweet\" lang=\"en\"> <p><a href=\"//twitter.com/levelsio\">@levelsio</a> connection to food, nature, community has the most drastic impact in my experience. And food can be the catalyst to all 3.</p> <p>&#8212; Adrian Unger (@staydecent) <a href=\"//twitter.com/staydecent/statuses/499978739003166720\">August 14, 2014</a></p></blockquote> <p></p> <p>This generation is having a massive spiritual crisis. And it scares me. My personal experience of this crisis scares me, but it also scares me that an entire generation can be so unhappy, even after having so much and achieving so much. Will we all die unhappy? I believe if we'd talk about this stuff more, we'd figure out a way to stop finding happiness so much in achievement and feeling exceptional and more in community, love, friendship and family. Because I'm starting to see more and more that that might be the only thing where real happiness in life can be found. And that's not what this generation is good at.</p> <p>But to show you in what a bad state we are: Even writing that, it seems logical and all, but it's hard for my mind to believe that's where happiness lies. But it probably is.</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Why does Generation Y feel so lost? And what’s the cure?"}},"pageContext":{"id":"5b9248a687be056953db7bce"}}