{"data":{"mongodbDatabaseArticles":{"id":"5b93835a87be056953db7e54","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"10a3\" id=\"10a3\" class=\"graf graf--h3 graf--leading graf--title\">Why I Chose to Build a Fully Remote Company Before it Was&#160;Cool</h1></p><p name=\"7a63\" id=\"7a63\" class=\"graf graf--p graf-after--figure\">Ok, I admit that I didn&#8217;t choose to build a fully remote company. Not at first. I founded <a href=\"http://articulate.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Articulate</a> in 2002 as a remote company because I had to. I&#8217;d scraped together just enough money to bootstrap the company, but not enough to secure office space in high-rent New York. Plus, it just so happened that the technical experts I needed to hire to create our first product lived in Mumbai and Missouri, not the Big Apple.</p><p name=\"223c\" id=\"223c\" class=\"graf graf--p graf-after--p\">When new acquaintances asked me at cocktail parties where my fledgling company was located, I responded with a simple, &#8220;here in the city.&#8221; I prayed they wouldn&#8217;t press for detail because the truth was that I was operating out of my one-bedroom apartment. In those days, that was hardly legitimate, somewhat embarrassing, and definitely not cool.</p><p name=\"d991\" id=\"d991\" class=\"graf graf--p graf-after--p\">Within a year, Articulate was healthily in the black. Several more people joined, taking a leap of faith that the company was real, even though they couldn&#8217;t visit it or even meet me in person. I conducted interviews, engineering meetings, and sales calls from my living room.</p><p name=\"60c1\" id=\"60c1\" class=\"graf graf--p graf-after--p\">But by the time we had enough money to get an office, I was pretty sure I didn&#8217;t want one. Turns out, the benefits of being remote outweighed the legitimacy of having an office.</p><h4 name=\"fbc3\" id=\"fbc3\" class=\"graf graf--h4 graf-after--p\">1. We were highly productive</h4><p name=\"1bae\" id=\"1bae\" class=\"graf graf--p graf-after--h4\">It didn&#8217;t take long for me to realize that working remotely actually fostered a culture of productivity. After all, the only way I knew people were working was when they delivered tangible work product. I couldn&#8217;t peek around the office to see which employees were planted at their desks, and which ones weren&#8217;t. People didn&#8217;t punch in and out. They proved they were working by producing deliverables! And if they didn&#8217;t produce deliverables, they didn&#8217;t last long.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*n5aJOnLWKKrCNa6Ibp1F1w.png\"><h4 name=\"2199\" id=\"2199\" class=\"graf graf--h4 graf-after--figure\"><strong class=\"markup--strong markup--h4-strong\">2.</strong> <strong class=\"markup--strong markup--h4-strong\">Talent trumped geography</strong></h4><p name=\"0692\" id=\"0692\" class=\"graf graf--p graf-after--h4\">Finding great people who fit into your culture is a real challenge for any company. It&#8217;s all the more difficult when you&#8217;re limited to the cities where you have offices! I could pick and choose the best talent from anywhere around the globe, and I did. I couldn&#8217;t imagine limiting us to even a large market like New York.</p><h4 name=\"dc46\" id=\"dc46\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">3. We collaborated and communicated insanely&#160;well</strong></h4><p name=\"71dc\" id=\"71dc\" class=\"graf graf--p graf-after--h4\">We had to be very intentional about how we communicated, and we experimented with it constantly. In the early days, we found that talking things through live via Skype worked better than simply emailing questions or deliverables. We&#8217;d sometimes augment communication between calls with screen recordings, and even developed our own screencasting tool to make it easier. For quick questions, we used Skype instant messaging. The communication flowed constantly, easily, and deliberately. It had to for people to stay unblocked and productive. Today, we&#8217;re heavy users of Slack messaging, Zoom video conferencing, and our own screencasting (Peek) and feedback (Articulate Review) apps.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*nLhSPIhX1rurwJpHAYNApg.png\"><h4 name=\"d141\" id=\"d141\" class=\"graf graf--h4 graf-after--figure\"><strong class=\"markup--strong markup--h4-strong\">4. We freed people to do their best&#160;work</strong></h4><p name=\"f0ba\" id=\"f0ba\" class=\"graf graf--p graf-after--h4\">I never cared what hours people worked. I didn&#8217;t care whether they worked from a home office, a patio, a coffee shop, or a campsite. I cared about deliverables and whether employees helped others with their deliverables. If people had an internet connection and could communicate with teammates at some point in the day, then they could work wherever and whenever they wanted. People who want this type of autonomy are great employees. They feel a sense of ownership over their lives and their work. They are responsible and self-motivated. And they tend to have a creative, problem-solving orientation. They&#8217;re people who do their best work when they&#8217;re free to do it the way that they want.</p><h4 name=\"cd4d\" id=\"cd4d\" class=\"graf graf--h4 graf-after--p\"><strong class=\"markup--strong markup--h4-strong\">5. We invested in connection, not&#160;overhead</strong></h4><p name=\"601a\" id=\"601a\" class=\"graf graf--p graf-after--h4\">One benefit of having an office is that it provides a space for people to build more personal connections with each other. No matter how good your video conferencing tool, there&#8217;s really no substitute for face-to-face interactions if you want to forge real relationships. So, we use the money we&#8217;d have spent for a chic New York office on annual company-wide retreats and in-person team workweeks instead. Our retreats are 95% socializing, 5% company meeting. And while our in-person workweeks are typically sprints toward a tough deliverable, we create strong bonds eating meals together and unwinding at the end of the day.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*pb2PEnHRZEmzsyDw6H7giQ.png\"><p name=\"2ebe\" id=\"2ebe\" class=\"graf graf--p graf-after--figure\">With more and more companies recognizing these benefits, Articulate is no longer an outlier. While IBM calling remote workers back to the office might seem like a setback for the remote model, many <a href=\"https://www.fastcompany.com/40423083/ibms-remote-work-reversal-is-a-losing-battle-against-the-new-normal\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">predict the move will backfire, noting that remote work is the new normal.</a> Even so, I did bring my son to our company meeting at a recent retreat to prove that dad does, indeed, have a real job.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*9rjlxNrO2IHXtJQkhWskgg.jpeg\">Many of the Articulate team at our recent retreat in Jackson Hole,&#160;Wyoming.<h4 name=\"5293\" id=\"5293\" class=\"graf graf--h4 graf-after--figure\">Check out my other articles on remote&#160;work:</h4></div>","title":"Why I Chose to Build a Fully Remote Company Before it Was Cool"}},"pageContext":{"id":"5b93835a87be056953db7e54"}}