{"data":{"mongodbDatabaseArticles":{"id":"5b92488b87be056953db7bb4","content":"<div><p>Developers these days have to do everything. We used to just develop, now some of us (me) design have become designers and we operate our own servers.</p> <p>That's all good. And with automation it becomes remarkably do-able too. If we do it well, we can actually enjoy our lives and let the robots do all the work in the background.</p> <p>But robots make mistakes. Or well, our code usually makes mistakes. How do we figure out when things go wrong? Let the robots tell us.</p> <h2>Pushover</h2> <p>Pushover lets you send push messages from inside your apps, shell or scripts to your iPhone, Android or any web device. Simply with one HTTP POST request. This means opening this URL:</p> <blockquote><p>https://api.pushover.net/1/messages.json</p></blockquote> <p>...with this POST data:</p> <blockquote><p> token=wMpQqm7iYCKGvhoTu4YjaPKDn21ZfE<br> message=Hello World </p></blockquote> <p>Becomes a push message on ALL my devices saying \"Hello World\".</p> <img src=\"/wp-content/uploads/2016/10/photo44036811243249573.jpg\" alt=\"photo44036811243249573\" width=\"720\" height=\"1280\" class=\"alignnone size-full wp-image-7252 responsively-lazy\"> <h2>What do I use it for</h2> <p>Every day Nomad List gets data from lots of sources, including APIs but also regular websites it scrapes. This goes fine, but when it detects it doesn't understand the data it gets, I've programmed it to message me through Pushover.</p> <p>In shell scripts I do this:</p> <blockquote><p> curl -s --form-string \"token=aS8whNNHSXS4niSJ\" --form-string \"user=udjCGMmQ5qCzW\" --form-string \"message=Something went totally wrong with getting the weather data, please check LOL\" https://api.pushover.net/1/messages.json </p></blockquote> <p>In PHP, I run a shell_exec (I know not so safe, watch out and don't put user data in this for obvious reasons, they'll hack your shell):</p> <blockquote><p> shell_exec('curl -s --form-string \"token=aS8whNNHSXS4niSJ\" --form-string \"user=udjCGMmQ5qCzW\" --form-string \"message=Something went totally wrong with getting the weather data, please check LOL\" https://api.pushover.net/1/messages.json'); </p></blockquote> <p>You can even monitor server error logs. I do it through PHP but you can probably script something yourself:</p> <blockquote><p> $result=shell_exec('tail /var/log/nginx/error.log');<br> $hash=file_get_contents(__DIR__.'/tailLogToPushover.md5');<br> // don't update, if log hasn't changed since last push<br> if($hash==md5($result)) exit;<br> $lines=explode(\"\\n\",$result);<br> foreach($lines as $line) {<br> shell_exec('curl -s --form-string \"token=aS8whNNHSXS4niSJ\" --form-string \"user=udjCGMmQ5qCzW\" --form-string \"message='. escapeshellarg($line).'\" https://api.pushover.net/1/messages.json');<br> echo $line;<br> echo \"\\n\";<br> } </p></blockquote> <p>This tails the last few log entries. Then uses a hash to check if they haven't been sent before to Pushover. Then it sends them to your phone. That means you get server errors on your phone (in this case from NGINX).</p> <p>Watch out: this is slightly risky as you put the error in a shell command. Hopefully escapeshellarg cleans it up (I think it does).</p> <h2>Zapier</h2> <p>Now to go next level, you can also push notices from other services using API-connector tool <a href=\"http://zapier.com/\">Zapier</a>:</p> <img src=\"/wp-content/uploads/2016/10/Screen-Shot-2016-10-19-at-5.13.24-PM.png\" alt=\"screen-shot-2016-10-19-at-5-13-24-pm\" width=\"2208\" height=\"1410\" class=\"alignnone size-full wp-image-7255 responsively-lazy\"> <p>I've connected my PayPal and Stripe to tell me when I get new transactions. These push notices work BETTER than PayPal and Stripe's own actually, that sometimes somehow don't even show up.</p> <p>I've also connected MailChimp to Pushover. That means I can see when scheduled campaigns are sent out.</p> <p>To give you an idea of what my phone looks like every day:</p> <img src=\"/wp-content/uploads/2016/10/2photo44036811243249574.png\" alt=\"2photo44036811243249574\" width=\"1440\" height=\"1280\" class=\"alignnone size-full wp-image-7262 responsively-lazy\"> <h2>Conclusion</h2> <p>I know there's WAY more advanced ways of logging errors etc. But this simple approach works for me. I can fill my scripts with notices any time anything goes wrong.</p> <p>Where before I felt kinda blind knowing my robot scripts would be working and had to constantly check if they actually did things properly. Now I know they do! And I can sleep relaxed.</p> <p>This is all fund and games until your robot takes over though.</p> <img src=\"/wp-content/uploads/2016/10/2Untitled-2.png\" alt=\"2untitled-2\" width=\"1024\" height=\"512\" class=\"alignnone size-full wp-image-7272 responsively-lazy\"> <p>Eeeeekkkkkkkkk!</p>  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Robots make mistakes too: How to log your server with push notifications straight to your phone"}},"pageContext":{"id":"5b92488b87be056953db7bb4"}}