{"data":{"mongodbDatabaseArticles":{"id":"5b96245b87be058327490e43","content":"<div><p><img src=\"https://foxnomad.com/wp-content/uploads/2008/10/couch-change2.jpg\" alt=\"couch change\" width=\"286\" height=\"190\">Yesterday I asked you has the global economic crisis is <a href=\"http://www.foxnomad.com/2008/10/07/has-the-global-economic-crisis-affected-your-travel-plans-poll/\">affecting your travel plans</a>, and for the most part it hasn&#8217;t &#8211; although as <a href=\"http://priyank.com/\">Priyank</a> mentions, it does have him <a href=\"http://www.foxnomad.com/2008/10/07/has-the-global-economic-crisis-affected-your-travel-plans-poll/#comment-22532\">a little worried</a>. Before you cut your own plans however, consider the following unconventional ways to fund your travels.</p>\n<ul>\n<li><strong>Sell Your Old Books and CDs </strong>&#8211; Unless they&#8217;re for reference, most books are dead weight once you read them. Lighten the load and sell back your books as soon as they&#8217;re read to get the most value back. I prefer <a href=\"http://www.half.com/\">Half.com</a>, which makes it easy to sell books, CDs, and DVDs and reimburses you for most shipping costs. <ul> <li>Take the books you can&#8217;t sell after 60 days and take them to a public library, they&#8217;ll buy them for much less but at least you&#8217;ll have more than nothing and be 1 book less at that.</li>\n<li>Download <a href=\"https://text2go.wordpress.com/2008/01/04/the-top-13-drm-free-ebook-sites/\">free eBooks</a> instead and <a href=\"http://www.foxnomad.com/2008/02/14/how-to-keep-to-a-single-carry-on/\">stick to a single carry on</a>.</li>\n</ul>\n</li>\n<li><strong>Grab Extra <a href=\"http://www.foxnomad.com/2007/02/15/get-your-change-bac-from-toll-booths/\">Change From Toll Booths</a> </strong>&#8211; Chances are you are missing the &#8216;rejects&#8217; coin return below most toll booths. Drive through the toll booths that are unmanned or exact change only and stick your hand in the coin return &#8211; many times you will find part, all, or twice as much change as it cost you to get through the booth. <ul> <li>You probably won&#8217;t make a net gain, but could save a few dollars a month. Or save all of the change you find and put it aside for some <a href=\"http://www.foxnomad.com/2007/09/06/small-travel-essentials/\">small travel essentials</a>.</li>\n</ul>\n</li>\n<li><strong>Tutor A Language </strong>&#8211; There are plenty of high school and college students who are struggling with their language classes. For a few dollars an hour you can provide them with some homework help. Check for signs on college campuses, church, or <a href=\"https://www.craigslist.org/about/sites\">Craigslist</a>. <ul> <li>Only know English? For longer trips find a job teaching it at your destination in exchange for lessons. (Either way, you should know a few words before you go, here are the <a href=\"http://www.foxnomad.com/2007/09/04/the-best-ways-to-learn-a-new-language/\">12 best ways</a>.)</li>\n</ul>\n</li>\n</ul>\n<p></p>\n<ul>\n<li><img src=\"https://foxnomad.com/wp-content/uploads/2008/10/toll-booth21.jpg\" alt=\"toll booth\" width=\"272\" height=\"203\"><strong>Medical Research and Focus Groups </strong>&#8211; When I was in school I participated in a number of medical tests and surveys for extra money. The medical exams usually consist of sitting in front of a computer (to test reactions), getting an MRI, or giving blood. It sounds creepy but you&#8217;ll be helping a Master&#8217;s or Ph.D student complete their thesis and add to the general body of medical knowledge. Not to mention around $50-150 in cash for an hour. <ul> <li><strong>Focus Groups </strong>&#8211; Are generally surveys or interviews about a movie, music, a company for marketing purposes. You&#8217;ll be paid a small amount of (again) cash for your time. The <a href=\"http://www.gilmore-research.com/\">Gilmore Research Group</a> is a good place to begin.</li>\n<li>Beware of Google and Craigslist scams.</li>\n</ul>\n</li>\n<li><strong>Use Your Travel Blog </strong>&#8211; Earlier in the week I listed <a href=\"http://www.foxnomad.com/2008/09/29/how-to-make-money-with-your-travel-blog/\">6 ways to make money with your travel blog</a>.</li>\n</ul>\n<p>None of these methods are designed to make you rich &#8211; and that&#8217;s not the point. Using <a href=\"http://www.foxnomad.com/2008/06/09/use-airline-recession-tactics-to-reduce-your-trave-costs/\">airline recession tactics</a> and being proactive in generating extra money can expand your <a href=\"http://www.foxnomad.com/2008/01/24/how-to-create-a-simple-vacation-budget/\">simple travel budget</a>. Saving all of your money from a second temporary job, for your travels for example, is an exchange of time for money &#8211; better than using credit. Using your time, knowledge, and possessions you can finance even the biggest travel plans.</p>\n<p>Don&#8217;t think it can be done? Be inspired by <a href=\"http://one-giant-step.com/\">One Giant Step</a> and <a href=\"http://clearlyenlight.net/\">Clearly Enlight</a>.</p>\n<p>[(top only) photo by: <a href=\"https://www.flickr.com/photos/daveaustria/\">Dave Austria</a>]</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Unconventional Ways To Raise Funds For Your Travels"}},"pageContext":{"id":"5b96245b87be058327490e43"}}