{"data":{"mongodbDatabaseArticles":{"id":"5b937b0287be056953db7d03","content":"<div><h1 name=\"71bc\" id=\"71bc\" class=\"graf graf--h3 graf--leading graf--title\">I quit, I&#8217;m going&#160;nomad</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*RKaBN2iVkveXxwaVj2qbJg.jpeg\">Hacker Paradise&#160;Group<p name=\"a879\" id=\"a879\" class=\"graf graf--p graf-after--figure\">Last Monday, I got early at the office, called my boss and just told him &#8220;I quit, here&#8217;s my resignation letter, please accept it.&#8221;.</p><p name=\"c963\" id=\"c963\" class=\"graf graf--p graf-after--p\">Ok, let&#8217;s rewind a little.</p><p name=\"eba8\" id=\"eba8\" class=\"graf graf--p graf-after--p\">Most of you don&#8217;t know me, but I&#8217;ve been a developer for more than half of my life. I&#8217;m about to turn 35 in a couple days, and for the most part of my career if not all, I&#8217;ve been working inside a cube. Now, this cube is awesome, inside of it I learned so much that allowed me to be financially independent and allowed me to do what I love. The cube is good, but can turn into a trap.</p><p name=\"da5a\" id=\"da5a\" class=\"graf graf--p graf-after--p\">I&#8217;ve worked for local companies in small offices, big offices, met smart people, not so smart people, good bosses, jerk bosses. Got tired of working for local companies, decided to switched to remote, but still, I was inside that fucking cube.</p><p name=\"3b0b\" id=\"3b0b\" class=\"graf graf--p graf-after--p\">I truly love what I do, but over the time I felt trapped, I felt like a mouse on a spinning wheel, going nowhere. And by nowhere I don&#8217;t mean just physically, but more on this later.</p><p name=\"2203\" id=\"2203\" class=\"graf graf--p graf-after--p\">Yes, I had the money, yes I had the toys and I got to work with amazing people from all over the world. But still, I felt trapped in a way I couldn&#8217;t explain or understand at the time. There was just this anxiety of not understanding why I felt this way.</p><p name=\"9783\" id=\"9783\" class=\"graf graf--p graf-after--p\">I remember writing on a paper when I was 28 some of the goals that I should&#8217;ve achieved when I turn 35. Some of the things were superficial crap like: &#8220;Make my first million dollars&#8221;, I should&#8217;ve &#8220;that&#8221; car, and living in &#8220;that&#8221; place and so on. Looking back at that now, it&#8217;s was so shallow.</p><p name=\"c85b\" id=\"c85b\" class=\"graf graf--p graf-after--p\">I won&#8217;t lie, having the money that could allow me to have those things is pretty cool. But the thing with materialistic things is, the excitement you got once you have it, quickly fades away, and boredom comes back in asking you to buy more stuff, and the cycle repeats.</p><p name=\"293e\" id=\"293e\" class=\"graf graf--p graf-after--p\">Funny thing is, I never got any of that, and I don&#8217;t feel bad, I truly don&#8217;t. I think inside of me I already knew that weren&#8217;t my true goals. I have the small business on the side, but nothing that can turn into a million dollar idea (for now that is).</p><p name=\"80d6\" id=\"80d6\" class=\"graf graf--p graf-after--p\">But, what changed? What&#8217;s this has anything to do with that fact that I just quit my job?</p><p name=\"af05\" id=\"af05\" class=\"graf graf--p graf-after--p\">Well, last February, I joined this amazing startup called Uniplaces here in Lisbon, Portugal. After 8 years of remote work, I decided to try to move again into a on site job, I thought a change would be good.</p><p name=\"7327\" id=\"7327\" class=\"graf graf--p graf-after--p\">And for the most part I loved working there, I met so many great and talented people. But I just replaced a cube by another cube.</p><p name=\"dcd7\" id=\"dcd7\" class=\"graf graf--p graf-after--p\">One day, while I was going to work it hit me. I&#8217;m doing it all wrong. Here am I, 35, on the subway, surrounded with grey sad faces around me. They all look like they gave up on their dreams long time ago, they just put the auto-pilot on in order to make it through the day, I don&#8217;t judge them, just observe it while I skip my next track on my iPhone. Here I am, on my way to work, again, this routine, the subway tickets on my pocket, the sweaty shirt on the back, the coffee machine, the office lights, the desk, the meetings, the lunch break, my eyes looking at artificial lights for 8 hours straight. This, every, single, day. What the hell is wrong with me?</p><p name=\"d4c0\" id=\"d4c0\" class=\"graf graf--p graf-after--p\">As a society we invented this spaces, some of them horrible, other amazing pieces or architecture, where we gather people to work on stuff, we pay them, and give them perks to pretend this isn&#8217;t a cube, but it&#8217;s still a cube. From 9&#8211;5 you must be productive, that&#8217;s what they tell you, It doesn&#8217;t matter what you want, it is what it is, suck it up. You might say, well, remote allows you to work more freely. But most of remote devs I know, still fall into the same trap, they create routines. I don&#8217;t blame them, that&#8217;s what we learned and expect from work.</p><p name=\"fd06\" id=\"fd06\" class=\"graf graf--p graf-after--p\">We expect stability, we crave routines. They are easy to manage, they are predictable. There&#8217;s nothing wrong with that.</p><p name=\"708c\" id=\"708c\" class=\"graf graf--p graf-after--p\">That&#8217;s what our parents did right?</p><p name=\"5fa8\" id=\"5fa8\" class=\"graf graf--p graf-after--p\">What could go wrong with having a routine home-work/work-home every day of your life for the next 30&#8211;40 years?</p><p name=\"b806\" id=\"b806\" class=\"graf graf--p graf-after--p\">What&#8217;s wrong with wasting your time in the same places doing the same routine, everyday until you are old?</p><p name=\"eb72\" id=\"eb72\" class=\"graf graf--p graf-after--p\">Buy a house, get a nice car, marry, work straight hours to get that promotion. Go home, sleep, wake up, repeat.</p><p name=\"11ae\" id=\"11ae\" class=\"graf graf--p graf-after--p\">And then, when you are no longer valuable they tell you, you are free of any obligations to work, you are now retired. Yes, you are now old, no, you don&#8217;t have the energy you once had, but you are now free, well, sort of.</p><p name=\"c01e\" id=\"c01e\" class=\"graf graf--p graf-after--p\">This thought scares me, more than anything in life.</p><p name=\"b5f3\" id=\"b5f3\" class=\"graf graf--p graf-after--p\">I&#8217;m not afraid of getting old, instead, I&#8217;m afraid of not living the life I wished I could&#8217;ve lived. I&#8217;m afraid of not having the energy to do what I what when I wanted.</p><p name=\"b698\" id=\"b698\" class=\"graf graf--p graf-after--p\">And so I had this epiphany, on that day, on the subway. I&#8217;m a developer, I&#8217;ve the luckiest job on earth, I can create things from anywhere, my work is everywhere. Why can&#8217;t I be anywhere too?</p><p name=\"6656\" id=\"6656\" class=\"graf graf--p graf-after--p\">Why am I here, when I could be in Bali? Working, not with artificial lights, but with the sun, on a coffee shop with the view of a beautiful sea. Tired of Bali? No problem, I can put myself on a plane and go to Thailand, New York, Berlin.</p><p name=\"534f\" id=\"534f\" class=\"graf graf--p graf-after--p\">Meet locals, and other digital nomads. Gather experiences, and travel the world doing what I enjoy doing the most. There&#8217;s no trade-off, just freedom.</p><p name=\"bcbb\" id=\"bcbb\" class=\"graf graf--p graf-after--p\">And that&#8217;s when it hit me, it&#8217;s not about the money, the money is just a highway to quickly allow you to do what you want. I come to the conclusion that happiness is freedom.</p><p name=\"a0fe\" id=\"a0fe\" class=\"graf graf--p graf-after--p\">I want to free myself from the cube. I want to make the world my office, I want to pick a different desk every month. I want to be able to enjoy life while I work, I want to see elephants in Thailand, and see the Northern Lights in the next month in Iceland.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*O2ZYPp7mrHLDnAKMcD0W8w.jpeg\"><p name=\"7b8a\" id=\"7b8a\" class=\"graf graf--p graf-after--figure\">What can stop me to do that? No one.</p><p name=\"dcc9\" id=\"dcc9\" class=\"graf graf--p graf-after--p\">And so, I quit my on-site job, I&#8217;m going back to remote, but this time, I&#8217;m going to be free. Free of that fucking cube.</p><p name=\"41db\" id=\"41db\" class=\"graf graf--p graf-after--p\">There&#8217;s a whole world out there, waiting for me and my laptop.</p><p name=\"bd27\" id=\"bd27\" class=\"graf graf--p graf-after--p\">I&#8217;m not sure, where and when I should start, there&#8217;s so many questions at the moment. But this is what I want to do. I want to one day, look back, and remember all the places I went, the smells, the people, but mostly the freedom that is to live your life the way you want anywhere you want and still be productive.</p><p name=\"75f8\" id=\"75f8\" class=\"graf graf--p graf-after--p\">People have weekends, and specific holidays every year. They tell you, this is your quota of freedom to go where you want, they made you sign a contract agreeing with this. But don&#8217;t forget, you have to come back once it&#8217;s over.</p><p name=\"dce6\" id=\"dce6\" class=\"graf graf--p graf-after--p\">But, what if you don&#8217;t?</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*T1lr3TdEH9we9Etb3jwFuA.jpeg\">Hacker Paradise</div>","title":"I quit, I’m going nomad – The Future of Work – Medium"}},"pageContext":{"id":"5b937b0287be056953db7d03"}}