{"data":{"mongodbDatabaseArticles":{"id":"5b93833287be056953db7e38","content":"<div><p class=\"section-inner sectionLayout--insetColumn\"><h1 name=\"8564\" id=\"8564\" class=\"graf graf--h3 graf--leading graf--title\">How Doist Makes Remote Work&#160;Happen</h1><h2 name=\"5c6c\" id=\"5c6c\" class=\"graf graf--h4 graf-after--h3 graf--subtitle\">51 people in 20 countries building a product used by millions. We believe that one day soon this way of working will be the&#160;norm.</h2></p><p name=\"55ac\" id=\"55ac\" class=\"graf graf--p graf--hasDropCapModel graf--hasDropCap graf-after--figure\">When I first started at Doist, we were 3 people working from 2 countries. Today, we&#8217;re 51 people working from 20 countries and counting. The idea of building a remote company wasn&#8217;t something we explicitly discussed at the start&#8202;&#8212;&#8202;it simply grew out of necessity.</p><p name=\"f750\" id=\"f750\" class=\"graf graf--p graf-after--p\">One of the challenges when you start out as a bootstrapped company with an unknown brand and little cash on hand is access to talent. <a href=\"https://twitter.com/amix3k\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer noopener\" target=\"_blank\">Amir</a> and I were working from Santiago, Chile, and at that time we hadn&#8217;t come to understand the ins and outs of the country well enough to find the right people locally. When Amir decided it was finally time to hire someone to help answer support tickets, he struck gold with Doist&#8217;s first employee, David, on the global freelance platform Elance (now Upwork).</p><p name=\"3493\" id=\"3493\" class=\"graf graf--p graf-after--p\">That first hire set us down the remote-first path. David was providing support out of Poland, and Roman was coding from Belarus. When <a href=\"https://twitter.com/brennakL\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer noopener\" target=\"_blank\">Brenna</a>, a contact of Amir&#8217;s from Start-Up Chile, was hired as Head of Marketing she never came to work from the office in Santiago even though she lived just 15 minutes away!</p><p name=\"ede9\" id=\"ede9\" class=\"graf graf--p graf-after--p\">How do you build a high-functioning, united team without face-to-face interactions? This post is a reflection on our journey and the key things we&#8217;ve done that have been fundamental to thriving as a remote team. They&#8217;re issues all companies face, but ones that present unique challenges when you don&#8217;t see each other face-to-face every day. We&#8217;ve adapted with ways of working that we think any company could benefit from, but are especially pertinent for people looking to grow their own remote teams.</p><p name=\"730c\" id=\"730c\" class=\"graf graf--p graf-after--p\">For us, it starts with a laser sharp focus on hiring the right people.</p><h3 name=\"670f\" id=\"670f\" class=\"graf graf--h3 graf-after--p\">Hiring calmly &amp; carefully</h3><p name=\"37d0\" id=\"37d0\" class=\"graf graf--p graf-after--h3\">As a bootstrapped company, we&#8217;ve always had a conservative approach to scaling the team. We know that more people doesn&#8217;t necessarily equal greater output, and we don&#8217;t hire faster than the culture can absorb new team members. Employee headcount is something we consider a vanity number&#8202;&#8212;&#8202;it says little about how well the company is actually doing.</p><h4 name=\"72b3\" id=\"72b3\" class=\"graf graf--h4 graf-after--p\">Screening for&#160;values</h4><p name=\"838a\" id=\"838a\" class=\"graf graf--p graf-after--h4\">When we hire, we look specifically for people who share the same fundamental values as us. That&#8217;s not to say we hire cookie cutters replicas of ourselves&#8202;&#8212;&#8202;our diverse perspectives 100% lead to better decisions, a better product, and a better team culture&#8202;&#8212;&#8202;but everyone needs to be on the same page in terms of how we communicate and work.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*K3GfcXTolSRJ8x2E.png\">Doist&#8217;s values<p name=\"ad04\" id=\"ad04\" class=\"graf graf--p graf-after--figure\">Micromanaging is inefficient at any company, but at a remote company it&#8217;s simply not an option. You need to hire people you can trust from day one.</p><p name=\"1d1a\" id=\"1d1a\" class=\"graf graf--p graf-after--p\">As in any growing company, we&#8217;ve made hiring mistakes, but we&#8217;ve worked hard to learn from them. One thing we&#8217;ve realized is that technical skills alone aren&#8217;t enough. If your teammates don&#8217;t truly believe in what you&#8217;re trying to accomplish as a company, it&#8217;s difficult to keep everyone on a remote team rowing in the same direction.</p><p name=\"0fd3\" id=\"0fd3\" class=\"graf graf--p graf-after--p\">That&#8217;s why applications without a cover letter are an outright deal breaker for us. We reject it without even looking at the person&#8217;s resume. We&#8217;re often criticized for this and, yes, we miss out on candidates with great experience and technical skills. But we&#8217;re okay with it. Clear communication, passion, and craftsmanship are some of our core values, and a personal cover letter aids us in screening for these. A well-written cover letter gives a clear indication of whether the candidate is just interested in the prospect of a remote job, or if they&#8217;re excited about being part of the solution to the specific problems we&#8217;re working on.</p><p name=\"548a\" id=\"548a\" class=\"graf graf--p graf-after--p\">After that initial application screening, we don&#8217;t make a job offer unless the person has undergone at least one test task and at least three interviews with three different Doisters. Interview questions are often directly related to our values. There aren&#8217;t necessarily right or wrong answers to these, but they are very helpful to raise red flags that might indicate a potential value mismatch.</p><h4 name=\"c210\" id=\"c210\" class=\"graf graf--h4 graf-after--p\">Looking for &#8220;Jack &amp; Jills of all&#160;trades&#8221;</h4><p name=\"5127\" id=\"5127\" class=\"graf graf--p graf-after--h4\">When everyone on the team is remote, it&#8217;s vital to hire proactive, curious people who won&#8217;t wait for a specific set of instructions. That&#8217;s why one of the most important things we look for in interviews are &#8220;Jacks &amp; Jills of all trades&#8221;&#8202;&#8212;&#8202;people who take ownership over learning new skills.</p><p name=\"2f8b\" id=\"2f8b\" class=\"graf graf--p graf-after--p\">We ask questions to see not only if this person has the role-related knowledge necessary for the job, but will they be able to take on new responsibilities if needed? Do they have a general interest in expanding beyond their own field? Are they curious about things outside of what they&#8217;re already competent in? Some of our favorite interview questions are:</p><ul class=\"postList\"><li name=\"b361\" id=\"b361\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--p\">&#8220;Tell us about something new you recently taught yourself.&#8221;</li><li name=\"1dea\" id=\"1dea\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;What&#8217;s something you want to get better at professionally?&#8221;</li><li name=\"be0c\" id=\"be0c\" class=\"graf graf--li graf--startsWithDoubleQuote graf-after--li\">&#8220;What&#8217;s something you&#8217;ve totally geeked out about recently (doesn&#8217;t have to be about work)?&#8221;</li></ul><h4 name=\"6a8f\" id=\"6a8f\" class=\"graf graf--h4 graf-after--li\">If it&#8217;s not a &#8220;Hell Yeah!&#8221;, it&#8217;s a&#160;no</h4><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*cZjv8mQgiXj1bFi2.png\">In every decision we make, but especially when&#160;hiring.<p name=\"7d04\" id=\"7d04\" class=\"graf graf--p graf-after--figure\">In the end, all interviewers must vouch strongly for the candidate as a great fit. We refer back to Derek Sivers&#8217; <a href=\"https://sivers.org/hellyeah\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer noopener\" target=\"_blank\">No &#8220;yes.&#8221; Either &#8220;HELL YEAH&#8221; or &#8220;no&#8221;</a> mentality in making all hiring decisions. <a href=\"https://tentimezones.com/why-we-don-t-have-an-exit-strategy-d3256107d958\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer noopener\" target=\"_blank\">We don&#8217;t have an exit plan</a>&#8202;&#8212;&#8202;we want to build a company that outlives us. This is an ambitious goal, and we only stand a chance to realize it if we manage to hire people who truly believe in what we&#8217;re doing.</p><h3 name=\"b428\" id=\"b428\" class=\"graf graf--h3 graf-after--p\">An employee-centric, sustainable vision</h3><p name=\"f5e1\" id=\"f5e1\" class=\"graf graf--p graf-after--h3\">One of the biggest challenges in adapting to remote work&#173;&#8202;&#8212;&#8202;particularly once you&#8217;ve been successful hiring smart, proactive people who are excited about the job they&#8217;re doing&#8202;&#8212;&#8202;is knowing where to draw the line between work and life. When you&#8217;re in complete control of how you spend your time, it&#8217;s hard to ever feel like you&#8217;ve done enough. However, we believe strongly that to be a sustainable business, employees need to be able to have rich lives outside of work too.</p><p name=\"e5c1\" id=\"e5c1\" class=\"graf graf--p graf-after--p\">We set the expectation from the get-go that no one should be working long hours or during the weekends. (Support is the exception to the rule, but they get equivalent time off after a weekend shift.) Eight hours of effective work five days a week is more than enough to get everything done (we are in the productivity business, after all). We enforce this rule strictly! It&#8217;s never acceptable to post an out of office notice to the team that includes any type of phrasing like &#8220;I&#8217;ll be mostly offline, but if needed you can reach me at xxx.&#8221; We have some pretty creative writers on the team who never fail to rephrase offending posts with a funny touch.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*kmITxb6OfpMd4unK.png\">We have a strict offline while on vacation&#160;policy.<p name=\"1e56\" id=\"1e56\" class=\"graf graf--p graf-after--figure\">We&#8217;re all role models and things like this can easily creep into the culture even if only a few people start breaking the rules. This means that if a team member responds to a message while they&#8217;re supposed to be off, the person is gently but firmly suggested to log the heck off!</p><p name=\"87b3\" id=\"87b3\" class=\"graf graf--p graf-after--p\">To help hold ourselves accountable, we implemented a new vacation mode feature in <a href=\"https://twistapp.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer noopener\" target=\"_blank\">Twist</a>, our team communication tool, so that we can set ourselves as &#8220;away&#8221; ahead of time. While in vacation mode, all notifications are turned off and a special vacation avatar automatically replaces our normal one. It serves as a reminder for everyone to be mindful of their teammates&#8217; time off and know that, if they do send a message, they shouldn&#8217;t expect a response until that person is back at work.</p><p name=\"dcb5\" id=\"dcb5\" class=\"graf graf--p graf-after--p\">We&#8217;ve also tried to reflect a commitment to work-life balance in our employee perks. We need our team members to thrive for many years to come and it&#8217;s important we all stay mentally and physically healthy. Some of the perks we offer to support this philosophy are:</p><ul class=\"postList\"><li name=\"4f17\" id=\"4f17\" class=\"graf graf--li graf-after--p\">Mandatory five weeks of paid vacation per year in addition to national holidays in your country of residence.</li><li name=\"a6f1\" id=\"a6f1\" class=\"graf graf--li graf-after--li\">Mandatory eighteen weeks of paid maternity leave and five weeks of paid paternity/adoption leave.</li><li name=\"6b77\" id=\"6b77\" class=\"graf graf--li graf-after--li\">Flexible work schedule with no requirement to be online at any certain time</li><li name=\"f772\" id=\"f772\" class=\"graf graf--li graf-after--li\">Work from the global location of your choice as long as there is access to a stable Internet connection</li><li name=\"8438\" id=\"8438\" class=\"graf graf--li graf-after--li\">A co-working office of your choice for anyone who needs to get out of the house and be around people</li><li name=\"5416\" id=\"5416\" class=\"graf graf--li graf-after--li\">Monthly reimbursement of exercise activities</li><li name=\"8921\" id=\"8921\" class=\"graf graf--li graf-after--li\">Healthy snack stipend</li><li name=\"b026\" id=\"b026\" class=\"graf graf--li graf-after--li\">Education stipend</li><li name=\"7783\" id=\"7783\" class=\"graf graf--li graf-after--li\">And more.</li></ul><h3 name=\"ba17\" id=\"ba17\" class=\"graf graf--h3 graf-after--li\">Making sure the way we communicate aligns with our&#160;values</h3><p name=\"3665\" id=\"3665\" class=\"graf graf--p graf-after--h3\">Perks are great, but they only go so far in building a unified, productive remote team. The true cornerstone of our company and culture&#8202;&#8212;&#8202;the reason we&#8217;ve been able to become a leader in an incredibly crowded market&#8202;&#8212;&#8202;is the way we communicate.</p><p name=\"bfb7\" id=\"bfb7\" class=\"graf graf--p graf-after--p\">Meetings are a rarity at Doist. We have very few regular meetings and generally only schedule ad hoc ones when we feel that &#8220;face-to-face&#8221; communication is necessary to move a project forward.</p><p name=\"3c11\" id=\"3c11\" class=\"graf graf--p graf-after--p\">Nowadays, the only time we use internal email is when a new team member is onboarded.</p><p name=\"7362\" id=\"7362\" class=\"graf graf--p graf-after--p\">95% of our team communication is asynchronous (as opposed to real-time like meetings or group chat) as well as transparent and searchable (unlike email). Keeping communication fully accessible to the whole team supports one of Doist&#8217;s core beliefs: the best argument always wins&#8202;&#8212;&#8202;regardless of who you are, your title, or your seniority. It&#8217;s impossible to live by such a rule in a remote structure unless you have a centralized place with full transparency around what&#8217;s going on, including decision-making.</p><h4 name=\"c034\" id=\"c034\" class=\"graf graf--h4 graf-after--p\">Learning from&#160;Slack</h4><p name=\"2ef4\" id=\"2ef4\" class=\"graf graf--p graf-after--h4\">Before we built Twist, we actually used Slack. It was a great tool&#8202;&#8212;&#8202;fun and easy-to-use (who doesn&#8217;t love a good GIF?). And it certainly helped us feel more like a team than disconnected individuals. But it had other negative side effects. Keeping up with Slack conversations started consuming more and more time. People felt they had to be online constantly to not miss out on something important. This quickly became a glaring problem.</p><p name=\"c13d\" id=\"c13d\" class=\"graf graf--p graf-after--p\">Individuals in outlying timezones, or those who went offline for extended periods during the day to do deep work, were excluded from conversations. The work-life balance we cared so deeply about was under immense pressure. We realized that the kind of communication Slack was set up for didn&#8217;t support our values of clear communication, craftsmanship, balance, focus, and impact. We could see it was taking a toll on people, but when we looked for alternatives, it seemed that the whole market was following a similar real-time, group chat model.</p><p name=\"60cd\" id=\"60cd\" class=\"graf graf--p graf-after--p\">It was then that we decided to double down on the product development of Twist. After just 4&#8211;5 months, we moved the entire team&#8202;&#8212;&#8202;and all of our company&#8217;s communication&#8202;&#8212;&#8202;from Slack to Twist in one go. It was rough. I recall having calls with colleagues about how we felt Twist just didn&#8217;t do it for us, we were missing Slack and all its bells and whistles.</p><p name=\"cfc6\" id=\"cfc6\" class=\"graf graf--p graf-after--p\">Today the product has matured a lot, and I can honestly say that Twist has become the heartbeat of Doist. Threaded communication keeps all our conversations organized by topic so a designer in Taiwan can catch up and contribute to a discussion that happened 10 hours ago during US work hours. Work rarely happens outside of Twist, even in the small office we have for the contingent of six working from Porto, Portugal. Whenever issues are discussed offline or on calls, the outcome of these discussions is always shared with the relevant teammates on Twist.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*p61j9juwUFpvH2li.png\">Threaded conversations help us communicate asynchronously so it doesn&#8217;t matter which time zone you&#8217;re&#160;in.<h4 name=\"12ce\" id=\"12ce\" class=\"graf graf--h4 graf-after--figure\">Remote first = Async&#160;first</h4><p name=\"ed9a\" id=\"ed9a\" class=\"graf graf--p graf-after--h4\">Everyone at Doist knows that asynchronous communication is the default, and no one should expect an immediate response from their teammates. Not only does this make working with people in other time zones possible, but it also gives people the freedom to disconnect to focus completely on their work and come back to respond later.</p><p name=\"6d7a\" id=\"6d7a\" class=\"graf graf--p graf-after--p\">In Twist, threads keep everything separated by topic so people don&#8217;t get left out of entire conversations because the group chat moved on to other things. It&#8217;s how we&#8217;re able to strike a balance between meaningful productivity and productive communication.</p><h4 name=\"102d\" id=\"102d\" class=\"graf graf--h4 graf-after--p\">Transparent and accessible</h4><p name=\"cf44\" id=\"cf44\" class=\"graf graf--p graf-after--h4\">The vast majority of our Twist channels are public, so even teammates who weren&#8217;t directly notified about a discussion can browse or search for the whole conversation. Because everything&#8217;s organized by topic, it makes it easy for someone to search for the information they need and get all of the context of the original conversation without having to wait on someone else who might be asleep halfway across the world.</p><p name=\"d936\" id=\"d936\" class=\"graf graf--p graf-after--p\">This accessibility of information has also had an unintended benefit of making new employee onboarding incredibly easy. We just add new teammates to relevant Twist channels and they can browse at their leisure to learn more about specific topics. They get to see exactly how we work together to get feedback, troubleshoot issues, and make decisions from start to finish. It&#8217;s been an awesome way to immerse new employees in how our company operates and for them to get up to speed on what&#8217;s currently going on without any added work on our end.</p><p name=\"1470\" id=\"1470\" class=\"graf graf--p graf-after--p\">Of course, when anything in the conversation becomes actionable we add a task or create a new project in Todoist with a link back to the original Twist thread for reference.</p><h3 name=\"aaf1\" id=\"aaf1\" class=\"graf graf--h3 graf-after--p\">Other tools in Doist&#8217;s remote work&#160;toolbox</h3><p name=\"017b\" id=\"017b\" class=\"graf graf--p graf-after--h3\">We&#8217;re proud &#8220;dog-fooders&#8221; of our own products, but in a diverse and fully distributed team we can&#8217;t make do with just Todoist and Twist.</p><p name=\"438e\" id=\"438e\" class=\"graf graf--p graf-after--p\">The design team consists of eight people located in six countries: Portugal, England, Germany, Spain, Greece and Taiwan. They use Sketch, Adobe Creative Suite, Dropbox, Dropbox Paper, Marvel &amp; Zeplin for collaborating on everything from new feature UX/UI design to landing pages to blog post illustrations.</p><p name=\"f9dd\" id=\"f9dd\" class=\"graf graf--p graf-after--p\">Our support team consists of people in Brazil, Canada, Jamaica, Poland, Spain, United Kingdom and the Philippines, and they collaborate to support our customers in Zendesk.</p><p name=\"d7fb\" id=\"d7fb\" class=\"graf graf--p graf-after--p\">Of course, our developers use Github.</p><h3 name=\"df9c\" id=\"df9c\" class=\"graf graf--h3 graf-after--p\">Team retreats</h3><p name=\"c0cf\" id=\"c0cf\" class=\"graf graf--p graf-after--h3\">Since we don&#8217;t have what we consider a physical headquarters, we looked at what other companies did to bring people together. The outcome was to allocate money for a yearly retreat to bring everybody together in one place to get to know each other better, bond, and have face-to-face discussions.</p><p name=\"6420\" id=\"6420\" class=\"graf graf--p graf-after--p\">In 2015 we went to Menorca in Spain, last year we flew everybody to Iceland, and just recently we met 50+ people in Athens and had a whale of time together. We spend a relatively small amount of time in formal work sessions, and the rest of the time exploring the beautiful places we&#8217;re in and having impromptu conversations with people across teams.</p><p class=\"aspectRatioPlaceholder-fill\"></p><p class=\"iframeContainer\"></p><p name=\"6fee\" id=\"6fee\" class=\"graf graf--p graf-after--figure\">Those retreats undoubtedly help bond the team together and reignite energy in what we&#8217;re working toward, but the fact is that it&#8217;s just one week a year. Everything else we do throughout the year to live up to our professed values is much more important.</p><h3 name=\"db88\" id=\"db88\" class=\"graf graf--h3 graf-after--p\">Current challenges and experimentation (a.k.a. growing&#160;pains)</h3><p name=\"d1c2\" id=\"d1c2\" class=\"graf graf--p graf-after--h3\">As our team grew to 30&#8211;40 people last year, we started to feel the need for a system to keep everybody on the same page to maintain a high level of productivity. It got harder to follow what was going on and who was in charge of what. Deadlines weren&#8217;t getting met (or even set in some cases). We had to ask ourselves how we could stay productive and grow the team at the same time.</p><p name=\"eb4d\" id=\"eb4d\" class=\"graf graf--p graf-after--p\">Initially we tried to implement an <a href=\"https://medium.com/startup-tools/okrs-5afdc298bc28\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer\" target=\"_blank\">Objectives and Key Results (OKR) system</a> similar to what Intel and Google use&#8202;&#8212;&#8202;it didn&#8217;t go well. OKRs helped promote transparency, but they didn&#8217;t help us define exactly what projects would ship across which teams and when. There was still no accountability to deadlines, tracking and updating the system added a lot of overhead, and it didn&#8217;t provide a clear framework for people to align their individual work priorities when there were dependencies in projects across teams.</p><p name=\"1d06\" id=\"1d06\" class=\"graf graf--p graf-after--p\">To try and solve that last problem, we attempted to adopt Spotify&#8217;s Engineering Culture <a href=\"https://labs.spotify.com/2014/03/27/spotify-engineering-culture-part-1/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer noopener\" target=\"_blank\">System</a> which uses the concept of having Squads that consist of small, autonomous, cross-functional teams. That didn&#8217;t work super well &#8220;out of the package&#8221; either. Their system was optimized for teams located in the same office and for a large enough company where dedicated, multidisciplinary resources are available for each squad.</p><h3 name=\"7df8\" id=\"7df8\" class=\"graf graf--h3 graf-after--p\">The DO&#160;system</h3><p name=\"20e3\" id=\"20e3\" class=\"graf graf--p graf-after--h3\">Ultimately, we created our own hybrid of the two systems&#8202;&#8212;&#8202;goals and squads&#8202;&#8212;&#8202;in what we call the DO (Doist Objective) System. The system is output-focused rather than outcome-focused. That is, our quarterly goals consist of things we have full control over shipping. For example, one Quarter 2 goal is &#8220;ship version one of the Todoist Help Center redesign&#8221;.</p><p name=\"c162\" id=\"c162\" class=\"graf graf--p graf-after--p\">A short-term, cross-functional squad is created for each DO&#8202;&#8212;&#8202;in the example above, a product marketer/copywriter, a designer, and a front-end developer. A squad leader is tasked with setting timelines and coordinating the project from start to finish. Each squad has a dedicated Todoist project to track tasks and deadlines and a Twist channel for high-level communication so there&#8217;s never a question of where to find the relevant information.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/0*Z0jqxljOCMf7QBFL.png\">We operate in project-based squads with specific objectives for each quarter. Each squad gets its own&#160;channel.<p name=\"f382\" id=\"f382\" class=\"graf graf--p graf-after--figure\">It&#8217;s still very early on in our implementation of DOs and we&#8217;re bound to run into new issues that we&#8217;ll have to adapt to (the way we work is always an iterative process after all). But we feel like the DO system is a better fit for how we work&#8202;&#8212;&#8202;light on process with a focus on shipping concrete things quickly&#8202;&#8212;&#8202;and addresses the big issues we face in coordinating a larger team. The whole company now knows which projects should receive the highest priority. Temporary squads are created as needed and are kept small to minimize communication overhead. And there&#8217;s a single person responsible for setting and enforcing deadlines.</p><p name=\"5573\" id=\"5573\" class=\"graf graf--p graf-after--p\">We&#8217;re still learning, but we hope to evolve the DO system into a tested methodology that other remote teams can adopt and improve upon.</p><h3 name=\"6a4c\" id=\"6a4c\" class=\"graf graf--h3 graf-after--p\">The future of&#160;work</h3><p name=\"42d7\" id=\"42d7\" class=\"graf graf--p graf-after--h3\">We feel that we&#8217;ve managed to create a remote environment in which people can thrive, grow and strike a healthy work-life balance. In the six years Doist has existed as a commercial product, only three people have voluntarily left the company. All three of them went to start their own projects.</p><p name=\"f623\" id=\"f623\" class=\"graf graf--p graf-after--p\">We believe that remote work is the future, but companies (Doist included) have a long way to go to develop all of the best practices and processes to support it. We&#8217;re excited to be a part of solving these problems and building the future we want to work in.</p><p name=\"7ca5\" id=\"7ca5\" class=\"graf graf--p graf-after--p graf--trailing\">Have questions about the way we work? Ask away. We&#8217;re happy to share and learn from you too.</p></div>","title":"How Doist Makes Remote Work Happen – Ambition & Balance"}},"pageContext":{"id":"5b93833287be056953db7e38"}}