{"data":{"mongodbDatabaseArticles":{"id":"5b9248c687be056953db7bef","content":"<blockquote><p><strong>Paul:</strong> People tend to go <strong>\"if I had this, I would be happy\"</strong>. The great thing about \"having that\" is finding out or not if you truly are happy. In my case I was still pretty miserable. (..)</p> <p>I thought that <strong>success was going to be the key to contentment and happiness</strong>. And like a lot of other people I thankfully became successful only to find out that it didn't change anything. And then the struggle becomes <strong>\"okay, what's it gonna take to be happy\"</strong>.</p> <p><strong>Joe:</strong> Isn't it fascinating that a lot of people that become really successful, become really successful because of a hole?</p> <p><strong>Paul:</strong> Absolutely, look, it takes a person with a plethora of insecurity to be comfortable in front of a crowd. The fact that you want to get up in front of a crowd and get approval from a massive people <strong>speaks volumes about your lack of self-confidence</strong>. So just the fact that you want to be an entertainer, comedian, whatever it is to be in the limelight means that you're seeking approval that you innately don't have.</p> <p><strong>Joe:</strong> A disproportionate amount of need when it comes to attention, love, usually corresponds to a lack of that in childhood.</p> <p><strong>Paul:</strong> Or in adulthood you're satiating that need as an adult, that probably was born out of your childhood. But at that point you can say, I can get this fixed every night by going in front of an audience. Which is only temporary. <strong>Or let's do some digging and figure out what's really wrong here.</strong> And that will only enhance the performance and everything else. It won't take the place of it. It will embellish it.</p> <p><strong>Joe:</strong> So you changed your motivation, your motivation became, instead of just get love, get all this fame and then I'll feel happy. Then it becomes what?</p> <p><strong>Paul:</strong> The fact that there's all these people who drop like flies from all kinds of addictions is just proof that people can be famous and miserable. And it doesn't really satiate what's wrong inside you. (..)</p> <p>I don't want anyone to feel sorry for me, (..) I've had more great times than anybody could ever imagine. They were transitory, but they were spectacular.</p> <p><strong>But happiness ultimately comes from the most simple things: interaction with people, great friends, family and inner contentment.</strong></p></blockquote> ","title":"“If I had this, I would be happy”"}},"pageContext":{"id":"5b9248c687be056953db7bef"}}