{"data":{"mongodbDatabaseArticles":{"id":"5b9248a887be056953db7bd0","content":"<div><p>A few months ago, I set a goal to launch <a href=\"/12-startups-12-months\">12 startups in 12 months</a>. They're all minimum viable products, built to test a hypothesis and see if they can get a market fit in a month.</p> <p>They've all been doing relatively well. 1) <a href=\"http://playmyinbox.com/\">PlayMyInbox</a> got covered by <a href=\"http://twitter.com/MTVartists/status/444164328321978368\">MTV</a> and <a href=\"http://lifehacker.com/split-payments-air-conditioning-and-pocket-tags-1540847975\">Lifehacker</a>, 2) <a href=\"http://tubelytics.com/\">Tubelytics</a> was quickly adopted by some big media brands, 3) <a href=\"http://gofuckingdoit.com/\">GoFuckingDoIt</a> went completely viral and was featured all over the media including <a href=\"http://thenextweb.com/shareables/2014/04/29/gofuckingdoitdotcom/\">TheNextWeb</a>, <a href=\"http://www.appsumo.com/15-awesome-tools/\">AppSumo</a> and <a href=\"http://www.wired.co.uk/news/archive/2014-06/04/make-more-mischief\">WIRED</a> and 4) <a>Nomad List</a> surpassed all of the previous hitting <a href=\"/product-hunt-hacker-news-number-one/\">#1 on Product Hunt and Hacker News</a> and getting covered by <a href=\"http://www.businessinsider.com/nomadlist-remote-work-list-2014-7\">Business Insider</a>, <a href=\"http://inc.com/jessica-stillman/the-best-cities-in-the-world-for-digital-nomads.html\">Inc.com</a>.</p> <h2>Problem</h2> <p>There's something in the air. The attention <a href=\"http://nomadlist.io/\">Nomad List</a> got was <a href=\"/product-hunt-hacker-news-number-one\">insane</a> and to me shows that we're in the middle of an gigantic social trend towards remote working internationally.</p> <p>I love seeing this movement unfold and I want to solve the problems in it. It's fun in two ways, if you can solve problems here, it can be a catalyst to the evolution of this movement. And if you do it well, it'll make you money too.</p> <p>The first problem I solved was with Nomad List, answering the question where you should relocate to. The second problem I want to solve is how to actually make people be able to go remote. If they still have a job tied to an office that won't happen.</p> <h2>Solution</h2> <p>That means we need a job board for digital nomads. Since Nomad List already received so much exposure to its brand, I wanted to re-use its logo to build <a href=\"http://nomadjobs.io/\">Nomad Jobs</a>.</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-29-23.44.37.png\"> <p>I used the same simple list-based layout for the jobs page with each item featuring the company's logo, name, position and tech stack:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/sitePic-jobs-1.png\"> <p>The yellow color is there for highlighted ads where companies pay $50 extra. I got that trick from other job boards.</p> <p>I also added the expand functionality. When you click a job, you can quickly read its details:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-30-01.35.16-1024x436.png\"> <h2>Submitting jobs</h2> <p>I first simply added a big button for people to post a job which was actually just a mailto: link to send a message to my email:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-29-23.06.36-1024x83.png\"> <h2>Seeding</h2> <p>To make sure I didn't launch with an empty list, I pre-seeded it with jobs from remote startups where I knew people already. I contacted <a href=\"http://buffer.com/\">Buffer</a>, <a href=\"http://sqwiggle.com/\">Sqwiggle</a>, <a href=\"http://zapier.com/\">Zapier</a> and <a href=\"http://baremetrics.com/\">Baremetrics</a> to ask if I could post their jobs. They all obliged and were happy to participate:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-29-23.40.26-1024x516.png\"> <h2>Promotion</h2> <p>I had an unfair advantage that I already had an audience I could push this to. So I automatically cross posted a random ad on each page load on the front page of Nomad List, between the city listings:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-29-23.07.53-1024x389.png\"> <p>I also tweeted them out with an image like this:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/tweet-job-uberpong-1024x512.png\"> <p>And after a few weeks I managed to reach page 2 of Google already, not good enough but getting there:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-29-23.39.28-1024x514.png\"> <h2>First submissions</h2> <p>Then I started getting the first job submissions by email:</p> <img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_250x250.gif\"><img src=\"/wp-content/uploads/2014/08/Screenshot-2015-01-29-23.15.40-1024x901.png\"> <p>After a few weeks, adding jobs manually became an ordeal, so I made the job submission process automated using a <a href=\"//ioio.typeform.com/to/BwmS5z\">Typeform</a> with payment. The jobs page then pulls the new jobs straight from the Typeform's API and adds them to the website. Payment is $200/m with discounts for longer terms.</p> <h2>Conclusion</h2> <p>Technically this was super trivial, but the real challenge here lies in growing an audience to make a job board work. And then connecting that to companies who need people. I'll see if I can make that happen in the coming months.</p> <p>Getting people access to jobs they can do anywhere is part of my \"propel the nomadic revolution\" master plan, and it's an essential one. Besides that, jobs are always a great source of revenue. The recruitment market is huge. Helping companies get the right people to do their work will always be a valuable offering. And doing that for remote work seems like a pretty obvious market need to me.</p> <p>Let's see how this goes! Try it yourself at <a href=\"http://nomadjobs.io/\">http://nomadjobs.io</a></p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"How I built Nomad Jobs, a remote job board for 100% distributed startups"}},"pageContext":{"id":"5b9248a887be056953db7bd0"}}