{"data":{"mongodbDatabaseArticles":{"id":"5b95ea1d87be05832748ff80","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/greecefestival1.jpg\" alt=\"a festival in greece\">Posted: 07/05/2011 | July 5th, 2011</p><p>&#8220;Eat, it&#8217;s like deer,&#8221; Francesco said to me.</p><p>I was surrounded by little Greek ladies in black shawls with wooden canes, people doing traditional dances, kids running around, lots of wine, and cooked wild goat being shoved in my face.</p><p>Francesco, <a href=\"https://www.nomadicmatt.com/travel-blogs/favorite-hostels-europe/\" rel=\"noopener\" target=\"_blank\">the owner of my hostel</a>, had invited me to this festival of all things Greek. Francesco&#8217;s hostel is an institution on Ios. Everyone knows it. He and his wife remembered me from <a href=\"https://nomadicmatt.com/travel-blogs/the-island-of-ios/\" target=\"_blank\" rel=\"noopener\">last year</a>, and over the weeks, I&#8217;d become more and more integrated into the hostel family. It was like I worked there but didn&#8217;t have to do anything.</p><p>One night as I was turning up at the bar, Francesco asked me if I had any plans.</p><p>&#8220;You have any meetings now? What are you doing?&#8221; (It was 10 at night.)</p><p>&#8220;None, I&#8217;m just going to talk to people on the patio.&#8221;</p><p>&#8220;OK, I&#8217;m going to take you to the festival of St. John at the monastery in the mountains.&#8221;</p><p>&#8220;Uhh, sure.&#8221;</p><p>If there&#8217;s one thing people learn quickly on <a href=\"https://nomadicmatt.com/travel-guides/greece-travel-tips/ios/\" target=\"_blank\" rel=\"noopener\">Ios</a>, it&#8217;s that you never say no to Francesco. He has an imposing personality and is quite a big figure in the community. It may sound like he is asking, but he isn&#8217;t. Francesco has the great ability to phrase a command as a question.</p><p>Not that I would ever say no anyway. How could I skip an opportunity to have a truly Greek evening just to hang out with more tourists? I can do that any day. But the chance to be shown something like this? Wouldn&#8217;t dream of skipping it. This is the kind of stuff I travel for.</p><p>We headed up the mountain, me keeping my eyes shut as we veered along the tiny, winding mountain track in the dark. Francesco assured me we were fine, but I winced at every bump in the road. I don&#8217;t like heights, and I&#8217;m always afraid I&#8217;m going to tumble off the edge.</p><p>&#8220;You a city boy, huh? Don&#8217;t worry. I&#8217;ve been on these roads all my life!&#8221; he assured me.</p><p>Arriving at the festival at last, Francesco ushered me past the dancers and into the back garden of the tiny monastery. In front of me were Greek women cleaning large food bowls, as well as huge cooking pots heating soup and goat meat. Francesco grabbed me a bowl, poured some soup into it, and threw in some chunks of goat. I was merely a passive observer in this whole scene, following orders and doing what I was told.</p><p><img src=\"https://media.nomadicmatt.com/greecefestival2.jpg\" alt=\"a festival in greece\"></p><p>I sat down at a table full of Greek men who looked at me inquisitively. Francesco said a few things in Greek, and the men smiled, making an eating gesture. They stared as I ate as I ate every bit of food, looking at me like I was an alien. Here I was, a stranger in their world, and these old, cigarette-smoking Greek men were enjoying it as much as I was.</p><p>I&#8217;d never had wild goat before. In fact, I don&#8217;t think I&#8217;d ever had any kind of goat before. It was delicious. Tender, falling off the bone, it tasted a lot like lamb. I don&#8217;t know what the soup was made of, but that too was good. It had a thick, rice-porridge consistency. The bread was thick and obviously homemade, soaking up the hot soup well.</p><p>After the soup came wine and bread, and then different cheeses &#8212; &#8220;from Ios.&#8221; The soft goat cheese I was given by an old Greek man was some of the milkiest and smoothest goat cheese I&#8217;ve ever had. I cleaned the whole plate as a small Greek grandmother with a wooden cane and black shawl stopped and watched.</p><p><img src=\"https://media.nomadicmatt.com/greecefestival3.jpg\" alt=\"a city in greece\"></p><p>I&#8217;d come to watch their festival, but in some ways, their festival was watching me. They didn&#8217;t speak much English and I speak no Greek, but I think they got the idea that I liked it.</p><p>After the meal and another glass of wine, I left the old patriarchs to go watch the dancing. Sadly, it was mostly over by the time I got there, but I did manage to watch a few traditional dances, as well as a few drunk Greeks making up some moves on the dance floor. I simply sat there watching it and enjoying the music. I noticed a few Greeks looking at me, unable to decide if I was a local (when tan, I look very Greek) or a foreigner.</p><p>As the band played on and the night got later, the crowd began to thin out. In the old days, they would have taken donkeys up to the monastery to stay the night. Now people stay until around midnight before driving back into town.</p><p>Francesco came and got me a little while later. It was time to go. &#8220;It&#8217;s good. You like it?&#8221;</p><p>&#8220;Yeah, it was the most cultural Greek thing I&#8217;ve done in my three trips to Greece.&#8221;</p><p>&#8220;Good. Write about it. It will make a better story than about you getting drunk with other backpackers. This is real Greece. Not that other bullshit.&#8221;</p><p>And you know what? He was right.</p><p>So I did.</p><h4>Book Your Trip to Greece: Logistical Tips and Tricks</h4><p><strong>Book Your Flight</strong><br> Find a cheap flight to Greece by using <a href=\"http://www.anrdoezrs.net/click-3032045-12837948\" target=\"_blank\" rel=\"noopener\">Skyscanner</a> or <a href=\"http://track.webgains.com/click.html?wglinkid=701003&amp;wgcampaignid=176915\" target=\"_blank\" rel=\"noopener\">Momondo</a>. They are my two favorite search engines. Start with Momondo.</p><p><strong>Book Your Accommodation</strong><br> You can book your hostel in Greece with <a href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener\">Hostelworld</a>. If you want to stay elsewhere, use <a href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener\">Booking.com</a> as they consistently return the cheapest rates. (<a href=\"https://nomadicmatt.com/travel-blogs/find-cheap-hotel-room/\" target=\"_blank\" rel=\"noopener\">Here&#8217;s the proof</a>.)</p><p><strong>Don&#8217;t Forget Travel Insurance</strong><br> Travel insurance will protect you against illness, injury, theft, and cancellations. I never ever go on a trip without it. I&#8217;ve been using <a href=\"https://www.worldnomads.com/lovedby/nomadic-matt?affiliate=nmts&amp;subId=brandlink&amp;affiliateTrackingId=0fe898ceef264503a88f74f4bbc7bb5b&amp;utm_source=nmts&amp;utm_medium=affiliate&amp;utm_campaign=Affiliate&amp;utm_content=brandlink\" target=\"_blank\" rel=\"noopener\">World Nomads</a> for ten years. You should too.</p><p><strong>Need Some Gear? </strong><br> Check out our <a href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener\">resource page</a> for the best companies to use!</p><p><strong>Want More Information on Greece?</strong><br> Be sure to visit our robust<a href=\"https://www.nomadicmatt.com/travel-guides/greece-travel-tips/\" target=\"_blank\" rel=\"noopener\"> destination tips on Greece&#160;</a>for even more planning tips!</p></div>","title":"My Big Fat Greek Festival: The St. John's Festival on Ios"}},"pageContext":{"id":"5b95ea1d87be05832748ff80"}}