{"data":{"mongodbDatabaseArticles":{"id":"5b95eabb87be05832748ffcb","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/changeyourmindset3.jpg\" alt=\"changing your mindset and believing your can travel\"><br> Updated: 7/1/2018 | July 1st, 2018</p><p>&#8220;Your advice is great if you are middle-class, your parents are giving you money, or you&#8217;re from the West. Your website can never work for me. I&#8217;m too poor to travel. This advice is only for privileged people.&#8221;</p><p>I encounter this line of thought frequently, and after two recently published articles on <a href=\"http://www.thrillist.com/travel/nation/traveling-the-world-when-it-matters-the-most-quit-your-job-and-travel-in-your-20s\" target=\"_blank\" rel=\"noopener\">Thrillist</a> and <a href=\"http://thoughtcatalog.com/matthew-kepnes/2014/10/everyone-complains-about-being-unemployed-heres-a-solution/\" target=\"_blank\" rel=\"noopener\">Thought Catalog</a>, I&#8217;ve heard it even more so the past few weeks.</p><p>Every travel naysayer believes their situation is special, that they can&#8217;t manage what someone else did for reason X, Y, or Z.</p><p>And it&#8217;s not just travel.</p><p>We all make excuses as to why we can&#8217;t do something we desire. &#8220;The gym is too far away.&#8221; &#8220;Just one more cookie won&#8217;t hurt.&#8221; &#8220;I&#8217;m not tall enough to play basketball.&#8221; We believe we&#8217;ll never accomplish that great thing we aspire to because we lack the one secret ingredient to make it happen.</p><p>When it comes to travel, people think what&#8217;s holding them back is money. They imagine they can&#8217;t travel because, unlike me, they can&#8217;t tap the Bank of Mom and Dad, are burdened by their debt, and simply assume I&#8217;m just lucky and special.</p><p>People with this mindset remind me of <a href=\"https://nomadicmatt.com/travel-blogs/why-cynics-like-bob-will-always-be-haters-and-how-you-can-prove-them-wrong/\" target=\"_blank\" rel=\"noopener\">Bob</a>, who dismissed this website a few years ago because he didn&#8217;t believe I could travel the world without parental help. People like Bob shoot the messenger because it allows them to ignore the message and keep their worldview unchallenged.</p><p>By believing that everyone else is special, unique, or rich, they put up a psychological barrier that lets them ignore all the reasons why travel is possible.</p><p>Nothing about their circumstance prevents them from traveling except their own mindset.</p><p>Millions of people from all walks of life, circumstances, and age groups find a way to travel. When I started traveling at the age of 25, I believed I was doing something challenging and unique. Then, when I got on the road and saw 18-year-old English kids embarking on similar adventures, I realized I wasn&#8217;t as special as I thought. That realization made travel actually seem a lot easier and more attainable because if they could make it happen, someone older and with more experience could manage it too.</p><p>I understand there is some monetary requirement to travel. There&#8217;s a limit to how cheap it can be and <a href=\"https://nomadicmatt.com/guide-to-travel-hacking/\" target=\"_blank\" rel=\"noopener\">how many free flights you can earn</a>. There are always circumstances such as health, visa issues, debts, or family that will keep someone from the road. Not everyone can (or wants) to travel the world.</p><p>But, in my experience, what keeps the vast majority of people home is not money but mindset. It is the false belief that their circumstances are different and everyone else who travels has money or privilege they don&#8217;t. They have bought into the belief that traveling is a luxury for those with means and unless you&#8217;re on the inside, you&#8217;ll never be able to make it happen. Everyone and everything else that tells them otherwise is dismissed as &#8220;too easy&#8221; or &#8220;too good to be true.&#8221;</p><p>But let me tell everyone who believes the &#8220;I&#8217;m too poor/unspecial,&#160;etc. to travel&#8221; mindset: You&#8217;re not.</p><p>If you truly desire to travel, you will find a way. For some, it will take more effort and time (maybe years), but you can do it.</p><p>If you wake up today and tell yourself, &#8220;I&#8217;m too poor to travel&#8221; or &#8220;I&#160;can&#8217;t because of reason X,&#8221; you&#8217;ll never look for ways to start traveling. You will only see roadblocks. You see only the reasons why you can&#8217;t travel &#8212;&#160;bills, flights, car payments, debt, family, or more. You&#8217;ll never peer beyond those roadblocks and ask yourself &#8220;How do I overcome these obstacles like those other people?&#8221; The only difference between those on the road and those not on&#160;it is that those on it kept saying &#8220;yes&#8221; to travel instead of &#8220;I can&#8217;t.&#8221;</p><p>Wake up today and say &#8220;Yes, I can travel too&#8221; and start looking for what you can do right now to make that happen. Start small. Each yes builds on itself and on the one before it. <a href=\"https://nomadicmatt.com/travel-blogs/cut-your-expenses/\" target=\"_blank\" rel=\"noopener\">Look at your day-to-day spending</a>. How much would you save if you bought a Brita instead of a daily bottle of water, gave up Starbucks, cooked more of your own food, or drank less? What if you gave up cable? Downgraded your phone plan? Walked to work? Sold off your unneeded stuff on eBay?</p><p>Find ways to supplement your income by becoming a local tour guide or Uber driver, or <a href=\"https://nomadicmatt.com/travel-blogs/guide-renting-apartments/\" target=\"_blank\" rel=\"noopener\">renting your spare room or couch on Airbnb</a>. <a href=\"https://nomadicmatt.com/travel-blogs/house-sitting/\" target=\"_blank\" rel=\"noopener\">Become a house sitter</a>. <a href=\"https://nomadicmatt.com/guide-to-travel-hacking/\" target=\"_blank\" rel=\"noopener\">Start collecting frequent flier miles</a>. <a href=\"https://nomadicmatt.com/travel-tips/teach-english-around-the-world/\" target=\"_blank\" rel=\"noopener\">Look for work overseas</a> (it&#8217;s easy).</p><p>Starting small gives you small victories that help you to slowly realize you can do it. The more wins you have, the more you keep going.</p><p>When I was planning my first trip, I first cooked more and drank less. Then I gave up going to movies. Then I sold my stuff and found a roommate. Then I found ways to car-share to save on gas.</p><p>Each step built on top of the last, and I got more confident in my ability.&#160;I woke up each morning I said to myself, &#8220;I can do this.&#8221;</p><p><img src=\"https://media.nomadicmatt.com/changeyourmindset2.jpg\" alt=\"changing your mindset and believing you can travel around the world even if you're broke\">Once I started saying yes, I created a habit and continuous cycle that keeps travel my focus and always within my reach. After years of doing this, I only see opportunity. I recently read <a href=\"http://www.amazon.com/gp/product/081298160X/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=081298160X&amp;linkCode=as2&amp;tag=nommatstrasit-20&amp;linkId=V5DNYVDEA6BMVCQJ\" rel=\"nofollow\" target=\"_blank\">The Power of Habit</a>, on the power of belief in changing habits. People who didn&#8217;t believe something was possible never changed their habits. They would diet, try to get sober, or exercise more, but it would never work. However, once they believed they could change, once they found themselves part of a community that supported them, that&#8217;s when the mental change occurred and the new mindset took over.</p><p>I&#8217;ve met people on the road who traveled after earning minimum wage. They accomplished it because they woke up every day and asked themselves &#8220;What can I do today that gets me one step closer to being on the road?&#8221; It&#8217;s easy to say &#8220;Well, I make $9.75 an hour and have a kid,&#8221; but <a href=\"https://nomadicmatt.com/travel-blogs/michael-success-story/\" target=\"_blank\" rel=\"noopener\">Michael worked on minimum wage and found a way</a>. The lower your income, the longer it will take to save enough to travel, but longer does not mean never.</p><p>If you don&#8217;t believe you can travel, you never will.</p><p>You just need to change the mindset that keeps you from your goals and start looking for ways, no matter how small, to begin living your travel dreams.</p><p>&#8220;I&#8217;m too poor to travel&#8221; is a belief that causes many to lack the confidence to believe travel is possible. They buy into the media hype that it&#8217;s all too good to be true. It&#8217;s easy to think we travelers are special and that my advice doesn&#8217;t apply to you. But I pay my own way: I worked overseas to keep my trip going, my parents have never helped me, and I still have student loan debt. I didn&#8217;t know anything when I started to travel. I had to figure it out along the way.</p><p><a href=\"https://nomadicmatt.com/travel-blogs/tag/reader-stories/\" target=\"_blank\" rel=\"noopener\">So did the dozens of readers from this site that also found a way despite many obstacles.</a></p><p>Not everyone is going to be able to travel, and I understand that. I&#8217;m not talking about those with circumstances like poor health, those with sick parents, or massive credit card debt. I&#8217;m talking about the middle majority. I&#8217;ve met people from all walks of life on the road and know that travel is not just for the rich, it&#8217;s for everyone.</p><p>If you want to travel more, believe you can. I know you can. I know it doesn&#8217;t have to be expensive. I believe in you. So stop saying no and begin to find all the ways to say yes and make your travel dreams come true.</p><p><strong>Editor&#8217;s Note: </strong> I&#8217;ve received some feedback that I want to address. I&#8217;m not saying if you close your eyes and say &#8220;I believe&#8221; you will magically find yourself in some far-off land. It doesn&#8217;t work that way. There are many valid reasons why people can never go traveling, no matter how much they &#8220;believe.&#8221; This article is about trying to get people to change a mindset that keeps many from even trying to find a way to travel. Many people, even if they can go travel, don&#8217;t even try, and this article was meant to push people to at least try.</p><h3>How to Travel the World on $50 a Day</h3><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\"><img class=\"\" src=\"https://media.nomadicmatt.com/bookimages/howtotraveltheworld_v3cover.jpg\" alt=\"how to travel the world on $50 a day\" width=\"200\" height=\"273\"></a>My New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences. <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"How to Change the \"I'm Too Poor to Travel\" Mindset"}},"pageContext":{"id":"5b95eabb87be05832748ffcb"}}