{"data":{"mongodbDatabaseArticles":{"id":"5b95eaef87be05832748ffe4","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/journeyend.jpg\" alt=\"Man walking down a path\"><br> They say everything comes in threes, and I guess my journey has had three big moments.</p><p>The first is when I fell in love with travel. It was 2004, and I was on my first international trip. I had originally intended to visit Australia, but somehow I ended up in Costa Rica. I don&#8217;t even remember how anymore; it&#8217;s just been too long. But I do clearly remember that somewhere between eating the best bruschetta of my life, creeping through jungles, hanging out with a troop of capuchin monkeys, and watching land crabs fight over territory, I became hooked. I had the travel bug. And as everyone with the bug quickly learns, this ailment has no cure. And every trip you take just makes it worse.</p><p>The second big moment occurred the following year. After <a href=\"https://www.nomadicmatt.com/travel-blogs/the-people-who-shaped-my-life/\">meeting some backpackers on a trip to Thailand</a> and talking with them, I knew the only way to treat my disease was to travel more. A few days later on the Thai island of Koh Samui, I turned to my friend Scott and told him that when we got home from Thailand, I was going to quit my job and travel the world. I was too consumed by my desire to travel to go back to life in the cubicle. Thailand had sealed my fate &#8212; and I had never been so sure and excited about anything in my life as I was at that moment.</p><p>Saying goodbye to my parents, I left in July 2006 for what was supposed to be a year traveling the world. A year became 18 months, which became 24, which soon became 68. My journey has taken me to fascinating places: I&#8217;ve lived in multiple countries, seen incredible beauty, had many amazing adventures, and met some of my closest friends.</p><p>But all things come to an end sometime, which brings me to today &#8212; my third big moment.</p><p>For you see, today is where my journey ends.</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/the-beginning-of-the-end/\">It&#8217;s been a long time coming.</a> Over the last year, there&#8217;s been a recurring theme on this blog: the creeping, impending doom of finality. I&#8217;ve struggled with it. Part of me looks out at the bar full of fresh-eyed twenty-something backpackers &#8212; dancing, socializing, and drinking care-free, with only a hangover to worry about tomorrow &#8212; and thinks, &#8220;I wish I could be that way.&#8221; I want to go chasing ghosts. &#8220;Maybe just a little longer,&#8221; I say to myself. I keep grasping at sand, hoping it won&#8217;t seep through my hands and I&#8217;ll be able to hold on a little longer. Just one more day as Peter Pan couldn&#8217;t hurt.</p><p>But <a href=\"https://www.nomadicmatt.com/travel-blogs/how-a-harsh-reality-destroyed-my-dreams-and-why-im-ok-with-that/\">as I got stuck in Sihanoukville writing my book</a>, my mind realized what my heart knew long ago: the end had come. My life and desires have changed. Whereas those travelers in Sihanoukville wake up to nothing but a day at the beach, I wake up to conference calls, blogs, and work. After 68 months, I desire a kitchen, a gym, and a set life &#8212; not more movement.</p><p>I once wondered <a href=\"https://www.nomadicmatt.com/travel-blogs/can-you-travel-for-too-long/\">if it was possible to travel for too long</a>. Could one spend too much time traveling alone? Could one live without roots for so long that they became rudderless? I thought so then, and I still think so now.</p><p><a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-overcome-being-alone/\">Traveling alone doesn&#8217;t mean you get lonely</a>. You learn that there&#8217;s nothing wrong with eating dinner, seeing a movie, or going out for a drink by yourself.</p><p>But being alone isn&#8217;t driving me home. I&#8217;m simply tired. Many of the people I know who travel like I do slow down after their third year. They stay in destinations longer, they have a home base, or they revisit places. Many have a partner with them who helps keep them anchored. But not me. I pushed past that and kept on going, even when I knew it wasn&#8217;t what I fully wanted.</p><p>But the heart wants what it wants, and my heart no longer wants to be a nomad.</p><p>My days as &#8220;Nomadic Matt&#8221; are no more.</p><p>I don&#8217;t know what the future holds. I don&#8217;t even know if I&#8217;m fully ready for the next step of my life. Will I be able to adjust? Months down the line, will I simply run off with my backpack and travel through Europe, unable to cope with being settled? Will this be like 2008 all over again, when I came home to end my trip, only to leave again a couple of months later? I don&#8217;t know.</p><p>I just know that sometime between that day in July 2006 and now, I grew up. I tried to stop it, but it happened anyway. For a while now, I&#8217;ve been trying to hold onto this lifestyle &#8212; but not anymore. I can&#8217;t linger at the end of this chapter any longer. It&#8217;s time to turn the page and see what happens next.</p><p>I still love travel and have no plans to stop. It&#8217;s too much a part of me, too much of who I am. And this blog will continue. I have enough articles today to fuel this site for months, and there are still plenty of trips in my future. So there will be plenty of new stories, photos, and tips.</p><p>But it&#8217;s time for me to put down roots and have a home. It&#8217;s time to become semi-nomadic. Instead of six months traveling around Europe, it might be two weeks in South Africa. The man without a home will finally have one to return to.</p><p>In a few hours, I will board my flight home to America and start to <a href=\"https://www.nomadicmatt.com/travel-blogs/moving-to-sweden/\">get ready to move to Sweden</a>. It&#8217;s a new day, and I don&#8217;t know what it will bring.</p><p>But whatever happens, the future is now as amazingly uncertain and filled with promise as it was that warm summer&#8217;s morning in 2006.</p></div>","title":"This is Where This Journey Ends"}},"pageContext":{"id":"5b95eaef87be05832748ffe4"}}