{"data":{"mongodbDatabaseArticles":{"id":"5b93832787be056953db7e31","content":"<div><h3 name=\"d19f\" id=\"d19f\" class=\"graf graf--h3 graf--leading\">Communicating With Our Users (And Providing Support)</h3><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*56WxEF6C2vhE31QHLjqW7w.png\"><p name=\"8334\" id=\"8334\" class=\"graf graf--p graf-after--figure\">Intercom is the main tool we use to communicate with our users (both free trial and paid customers). It&#8217;s used for support, on-boarding messaging, feature announcements and one-on-one communications for customer success.</p><p name=\"0347\" id=\"0347\" class=\"graf graf--p graf-after--p\">The main reason we&#8217;ve switched to Intercom is to centralize all customer communications in one place. Prior to Intercom, we used to do support using <a href=\"https://www.helpscout.net/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Helpscout</a> and on-boarding messaging using <a href=\"https://customer.io/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">customer.io</a> and switching to one tool to another was a bit cumbersome.</p><p name=\"9fae\" id=\"9fae\" class=\"graf graf--p graf-after--p\">But keep in mind that like with every all-in-one tool, it&#8217;s not the best tool at everything. For example, it&#8217;s lacking key support features that Helpscout offers, like feedback on support messages or decent statistics about your team workload (and response time).</p><p name=\"50d8\" id=\"50d8\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why is Intercom a must have for remote teams? </strong>When you want to have all your conversations with your users in one place and collaborate with your remote team when handling them, Intercom can be very useful.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*nsFZNOY0mMwxGsLNJ5Rt_w.png\"><p name=\"3804\" id=\"3804\" class=\"graf graf--p graf-after--figure\">As stated above, we&#8217;ve decided to work with Intercom for all user related communications. But when it comes to nurturing leads, Intercom is really not the right tool. We simply could not capture email addresses and nurture those leads with Intercom. So we had to pick a specific tool to take our lead nurturing to the next step. After a long evaluation process, we chose ActiveCampaign, mostly because it was bundled with API connections with most of the other tools we already use.</p><p name=\"7701\" id=\"7701\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why is ActiveCampaign a must have for remote teams? </strong>ActiveCampaign is not specifically designed for remote teams, it&#8217;s valuable for all teams, remote or not.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*h1HwmqEQwJoiinAwjyFPmw.png\"><p name=\"d98a\" id=\"d98a\" class=\"graf graf--p graf-after--figure\">As a self service software priced for low to no touch, we invest a lot on the on-boarding experience of our free trials. We&#8217;ve tried every self-serve education approach, including the creation of our own homemade on-boarding guides. Appcues seems to be the best tool to guide new users and show them the key features of your app they need to be aware of.</p><p name=\"31a3\" id=\"31a3\" class=\"graf graf--p graf-after--p\">It offers a lot of look &amp; feel options, A/B testing capabilities and stats than can help you test your on-boarding assumptions.</p><p name=\"66a6\" id=\"66a6\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why is AppCues a must have for remote teams? </strong>AppCues is not specifically designed for remote teams. It&#8217;s valuable for all teams, remote or not.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*5vgYsaPpcjTo2sgKt2f82g.png\"><p name=\"0343\" id=\"0343\" class=\"graf graf--p graf-after--figure\">Since we started to seriously invest in customer success, we&#8217;ve been looking for a tool to help us with this important endeavor.</p><p name=\"ff5d\" id=\"ff5d\" class=\"graf graf--p graf-after--p\">Salesmachine is the only tool we&#8217;ve found to help us with our customer success needs that doesn&#8217;t cost several thousands of dollars per month. When we got started, we couldn&#8217;t afford the Totangos and Gainsights of the world.</p><p name=\"934a\" id=\"934a\" class=\"graf graf--p graf-after--p\">Salesmachine provides useful statistics about your users&#8217; health as well as the ability to identify red flags based on user behaviors and a trigger-automated workflow for your customer success team to work with.</p><p name=\"f1c7\" id=\"f1c7\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why is Salesmachine a must have for remote teams? </strong>If your customer success team is remote, Salesmachine provides great tools to work collaboratively on your customer success goals without stepping on each other&#8217;s toes.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*R7KPWX6iuFnqvt-DjDlxyw.png\"><p name=\"2457\" id=\"2457\" class=\"graf graf--p graf-after--figure\">Providing great support starts with providing great self help support. The vast majority of users don&#8217;t want to chat with a support agent&#8202;&#8212;&#8202;they want to figure things out by themselves. According to Zendesk, <a href=\"https://www.zendesk.com/resources/searching-for-self-service\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">67% of users prefer self help support than sending an email</a>.</p><p name=\"e2ef\" id=\"e2ef\" class=\"graf graf--p graf-after--p\">The unique value proposition of Support Hero is that it allows us to embed our self help support content in a widget right within our app. This is the best possible experience for our users who don&#8217;t have to click on a link and exit our app to get the support they need. It also provides a LOT of stats about the performance of our self help support articles. Super helpful.</p><p name=\"6ebe\" id=\"6ebe\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why is Support Hero a must have for remote teams? </strong>With a remote support team, it is key to have a shared knowledge base every team member can access and edit. We use Support Hero with the entire support team (everyone can contribute) and we even have a &#8220;private&#8221; knowledge base for all the content that&#8217;s only useful for team members (not for our users).</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*VuGKZLkIKDZYXs8EGiloBg.png\"><p name=\"3c52\" id=\"3c52\" class=\"graf graf--p graf-after--figure\">If you&#8217;re serious about providing top notch support and user experience, FullStory is a must have. It&#8217;s this kind of tool you don&#8217;t know you need until you experience it for the first time and think &#8220;Oh shit! I had no idea we had that problem!&#8221;</p><p name=\"037c\" id=\"037c\" class=\"graf graf--p graf-after--p\">Putting it simply, FullStory records all the sessions of your users. It&#8217;s like standing behind their shoulders when they use your product and witnessing how they do it (and struggle with it sometimes). You have very powerful filtering options allowing you to watch sessions of users using a specific feature or new users only. For support, it can show you what users were doing right before they sent you a support ticket. A total time saver.</p><p name=\"d56d\" id=\"d56d\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Why is FullStory a must have for remote teams? </strong>It&#8217;s not a tool designed specifically for remote teams. But it&#8217;s useful for all teams, remote or not.</p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*kzVNjoL-Bbh5CRixOWnSaw.png\"><p name=\"83bc\" id=\"83bc\" class=\"graf graf--p graf-after--figure\">Before using Receptive, we had no process to capture user feedback. This was frustrating for us as we had no data backed process to gauge what feature we should add (or fix) next. Our users would make feature suggestions but would never know if we ended up implementing them.</p><p name=\"6316\" id=\"6316\" class=\"graf graf--p graf-after--p\">We looked at all solutions on the market to manage customer feedback. When we stumbled upon Receptive, it really was one of those &#8220;aha&#8221; moments!</p><p name=\"3467\" id=\"3467\" class=\"graf graf--p graf-after--p\">Receptive allows us to:</p><ul class=\"postList\"><li name=\"79c9\" id=\"79c9\" class=\"graf graf--li graf-after--p\">Gather feedback in a transparent and seamless way</li><li name=\"5d78\" id=\"5d78\" class=\"graf graf--li graf-after--li\">Make sure that our users know when we implement the features they are interested in</li><li name=\"7a22\" id=\"7a22\" class=\"graf graf--li graf-after--li\">Filter feature requests by meaningful data points (feature requests from free trials, from customers, from high value customers or by number of votes).</li></ul><p name=\"a824\" id=\"a824\" class=\"graf graf--p graf-after--li graf--trailing\"><strong class=\"markup--strong markup--p-strong\">Why is Receptive a must have for remote teams? </strong>While Receptive is not specifically designed for remote teams and can be used by any SaaS company, it&#8217;s very helpful to provide your remote support or customer success team with one place to gather all the feedback they get from users. It&#8217;s also useful for our product team to review that data without having to discuss with the customer facing team members who are not in the same time zone as they are.</p></div>","title":"The 31 tools we use to make our “semi remote” SaaS team work efficiently"}},"pageContext":{"id":"5b93832787be056953db7e31"}}