{"data":{"mongodbDatabaseArticles":{"id":"5b921d2087be0571ac1b04fd","content":"<div><h2>How to Get a Second Passport #2 &#8211; Naturalization</h2>\n<p>This is where you spend time on the ground, build up residence in another country, and eventually apply for citizenship as the &#8220;payoff&#8221;. The same way you&#8217;ve seen immigrants attending ceremonies to become naturalized as American/British/Canadian/etc. citizens, you can become a naturalized citizen in another country if you&#8217;re willing to be patient.</p>\n<p>Of course, each country has its own time table for offering naturalization, and choosing the right country to become naturalized in is a difficult decision. Many countries have increased the time from which you immigrate to when you apply for citizenship. In some wealthy countries European like Andorra, the wait can be up to twenty years. Tina Turner had to live in Switzerland for at least twelve years before being eligible for citizenship. Other countries might offer citizenship more quickly. For instance, countries like Paraguay allow for naturalization after three years of permanent residence.</p>\n<p>A number of countries don&#8217;t allow dual citizenship and will require you to relinquish your current citizenship. While I talk extensively about why some US citizens may want to <a href=\"http://www.nomadcapitalist.com/expatriation\">expatriate</a>, giving up one citizenship for the next doesn&#8217;t exactly meet the standards of a &#8220;second citizenship&#8221;. There are, however, places where you can obtain citizenship rather quickly. Some of these countries, like Canada, have strict requirements for physical presence in the country. For others, you may only need to set foot in the country once or twice a year. It&#8217;s possible to get a second passport from one of these countries in as little as three to four years if you have the right contacts.</p>\n<p>First, you need to get second residency in the country. You will never qualify for a second citizenship if you&#8217;re not a legal resident; that means simply staying in a country on tourist visas won&#8217;t help you. Getting second residency in a country can be as easy as depositing a few thousand dollars in a local bank account, or as hard as investing millions of dollars into local projects.</p>\n<h3>Fastest countries to become a naturalized citizen</h3>\n<p>There are some countries that, no matter how long you live there, won&#8217;t make you a citizen. Other countries require you to obtain temporary residence privileges, before becoming a permanent resident, before applying for citizenship. Here are the some of the easiest places to become a citizen through &#8220;boots on the ground&#8221; second residency. In general, it is easier to get residence &#8211; and an eventual citizenship &#8211; in countries within the Americas, namely in Central and South America. Some European countries offer easy residency to wealthier investors.</p>\n<p><strong>Uruguay</strong> Nestled next to Argentina, Uruguay is one of the most developed countries in South America, with a high standard of living. Uruguay is easy to get second residency in, and you can apply for citizenship in as little as three&#160;years if you&#8217;re married (singles can apply after five years). However, you should actually live in Uruguay for the first year or so after applying for residency in order to show that you are serious and make sure your future citizenship is attainable.</p>\n<p><strong>Brazil</strong> Brazil offers one of the best travel documents in South America, and the country itself offers every type of landscape and lifestyle you can imagine. Anyone can be Brazilian, no matter what color they are. While Brazil is part of the embattled BRICs, you can become a Brazilian citizen in as little as four years if you&#8217;re willing to start a business there or make an investment of roughly US$75,000 or more. There are a number of companies offering investments that qualify for residency and eventual citizenship. Brazil is also unique in that it does not extradite its citizens from Brazilian soil.</p>\n<p><strong>Paraguay</strong> This emerging South American country offers a straightforward permanent residency program that allows you to apply for citizenship after as little as three years, provided you make some form of economic investment in the country. This can be as simple as opening and funding an <a href=\"http://www.nomadcapitalist.com/offshore-banking/\">bank account</a> with as little as $5,000. You can also start a small business and pay yourself a taxable salary, or invest several thousand dollars in Paraguayan stocks. Paraguay is an open place where everyone is welcome, and it is one of the freest countries on earth.</p>\n<p><strong>Panama</strong> Panama&#8217;s Friendly Nations visa program makes it extremely easy for citizens of over forty countries to get residency there with a $5,000 bank deposit and one other &#8220;economic tie&#8221;, such as ownership in a Panamanian corporation. Once you are legally resident in Panama, you can get citizenship in as little as five years.</p>\n<p><strong>Canada</strong> Believe it or not, Canada offers a fast timeline to naturalization. The country recently abolished its Immigrant Investor Program, which means you&#8217;ll likely have to have a job in order to move there. However, once you have official residence, you can apply for citizenship after just four years. You are required to spend all but a few months of that time in Canada, a rule immigration officials will strictly enforce.</p>\n<h3>Countries that used to offer fast naturalization</h3>\n<p>You can still find websites that tout countries that no longer offer fast naturalization timelines as attractive second passport options. The reality is, policies in each country change all the time, so it&#8217;s important to take action when you find an option you like or qualify for.</p>\n<p>Belgium used to offer citizenship after just three years of living there and having some economic activity in the country. However, getting naturalized under that system was far from guaranteed, and the Belgian government changed the law on citizenship over a year ago to make residents wait at least five years to be naturalized. Some websites will claim you can apply to become a citizen of Singapore after just two years of residence, but this too is untrue. Not only is Singapore making it dramatically harder for entrepreneurs and other &#8220;global talent&#8221; to get residency in the country, but it now takes seven years of living in Singapore to qualify for a passport. Countries like Singapore and Israel also share the likely unenviable position of requiring military service for all citizens. This requirement would also pass on to any children you pass your citizenship to.</p>\n</div>","title":"Second Passport: How to get dual citizenship"}},"pageContext":{"id":"5b921d2087be0571ac1b04fd"}}