{"data":{"mongodbDatabaseArticles":{"id":"5b92396f87be0583cfde6800","content":"<div><p></p><img class=\"size-full wp-image-17513\" src=\"http://nomadcapitalist.com/wp-content/uploads/2016/07/best-offshore-service-providers.jpg\" alt=\"How to find the best offshore service providers\" width=\"700\" height=\"467\"><p>Dateline: Tivat, Montenegro</p>\n<p>There&#8217;s something special about Montenegro. Ever since the newly independent country was featured in the remake of Bond film Casino Royale, I knew I wanted to come here. And each time I come, I&#8217;m reminded that there is something magical here.</p>\n<p>In the five days I&#8217;m here on this visit, I&#8217;m being interviewed by the country&#8217;s most watched television station, speaking to a group of university students about entrepreneurship, discussing the potential <a href=\"http://nomadcapitalist.com/2016/06/20/best-citizenship-by-investment-programs/\">economic citizenship program</a> with a top lawyer, and meeting with the country&#8217;s investment agency to discuss the latest wave of privatization.</p>\n<p>It&#8217;s all a result of having put in the effort to make connections here, including colleagues and people who work for me.</p>\n<p>However, it&#8217;s also a result of hiring the right professionals. I&#8217;ve made no secret of the fact that hiring the right lawyers is a crucial element to success offshore.</p>\n<p>For example, I recently saved nearly 30% on a property in Georgia by not only having one of my assistants call and negotiate in Georgian, but also by having my lawyer call and make a much more serious presentation. The deal was so easy, and I saved a five-figure sum as a result.</p>\n<p>I&#8217;ve always found it a bit funny that <a href=\"http://www.nomadcapitalist.com/flag-theory/\">going offshore</a> scares a lot of people&#8230; who in turn finally get around to doing it, but then decide to be cheap and go it alone.</p>\n<p>Having tried both ways &#8212; not just in the offshore world, but in businesses overall &#8212; I can tell you that having the right professionals to help you is crucial. Even though I feel at home in a couple dozen cities and own properties in various countries, I still get a little anxious when doing a deal in a new place. Having the right people makes all the difference.</p>\n<p>My role here at Nomad Capitalist is to help readers like you put the puzzle pieces together and create an offshore plan that works in its entirety, rather than just pieces and parts that don&#8217;t serve each other.</p>\n<p>I&#8217;m able to do that largely out of experience, but also because I&#8217;ve developed a network that I can depend on when I don&#8217;t know something, like how many days a Bulgarian must live overseas to declare tax non-residency.</p>\n<p>What criteria should you use to find the best offshore service providers? Here are my suggestions:</p>\n<h1>Have a clear strategy going in</h1>\n<p>I always advise people going offshore to focus on their desired result, rather than a particular strategy. After all, no one really wants a <a href=\"http://nomadcapitalist.com/second-passport/paraguay/\">Paraguay passport</a>&#8230; they want what a Paraguay passport offers them. That benefit is specific to each person, so it&#8217;s important to get clear.</p>\n<p>For example, if you have no clue WHY you need an offshore company, maybe you don&#8217;t.</p>\n<p>If YOU aren&#8217;t clear on your desired outcome, the person you call surely won&#8217;t be. A lack of clarity will result in you either not taking action, or taking the wrong action. If you&#8217;re speaking to a <a href=\"http://nomadcapitalist.com/offshore-trust/\">trust lawyer</a>, you can bet the cure for whatever ails you will be &#8212; wait for it &#8212; a trust. Knowing where you want to be at the end of the process will allow you to make better decisions.</p>\n<h1>Find a guinea pig</h1>\n<p>If you&#8217;re reading this blog, you&#8217;ve already found one. It&#8217;s not that I need another second residency or offshore company&#8230; but I enjoy it. More importantly, by doing new things, I get to try out new programs and new offshore service providers.</p>\n<p>For example, this month I agreed to set up a company in order to get residency in another European country. The residency may help me establish a better presence in a country I want to do some business in, but it&#8217;s also a great way for me to see how the program works and make sure my referral knows what he&#8217;s doing.</p>\n<p>Having a guinea pig is valuable because you want to learn from someone in the same boat as you are. A Panama lawyer may know a lot about <a href=\"http://nomadcapitalist.com/2013/02/07/panama-residence-program-means-you-have-no-excuses-anymore/\">Panama residency</a> (although many know far less than you&#8217;d hope), but he doesn&#8217;t understand why YOU want residency, nor does he understand anything about your situation outside of Panama.</p>\n<p>Knowing that the professionals you choose have passed the sniff test is important and can save you a lot of time and money, not to mention the opportunity cost. You don&#8217;t want to be one of those guys that sets up a strategy to save on tax, only to find out you not only wasted your time and money, but you now have to pay tax for the time you had the bad strategy.</p>\n</div>","title":"How to choose the best offshore service providers"}},"pageContext":{"id":"5b92396f87be0583cfde6800"}}