{"data":{"mongodbDatabaseArticles":{"id":"5b95ef4287be05832749010e","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">5 Years Later, Why We&#8217;re Still Sold on Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-19140\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/12/Why-Were-Still-Sold-on-Thailand.png?resize=1000%2C550&amp;ssl=1\" alt=\"Why We're Still Sold on Thailand\" width=\"1000\" height=\"550\"><br>\nA little more than a week ago we returned from a month and a half long trip home to the USA. We saw friends and family across six states, drank countless glasses of fine wine and craft beer, and came to truly appreciate central AC and heat, clean public restrooms, and environmentally friendly to-go containers.</p>\n<p>After a grueling 30+ hour transit back to Thailand, we slept in our familiar bed, our cat accepted us back as his slaves&#160;caretakers, and we&#8217;re already thinking about what&#8217;s in store for us in Thailand in the upcoming months.</p>\n<p>But as much as we pride ourselves on being able to switch from &#8220;Thai life&#8221; to &#8220;American life&#8221; and back again after our yearly trips home, there are always feelings of nostalgia when we return to Chiang Mai.</p>\n<p>Are we doing the right thing, living here halfway across the world in Thailand? Don&#8217;t we miss our old life back in the US?</p>\n<p>We&#8217;re not the only ones questioning our decision to live in Thailand.</p>\n<p><strong>PIN IT FOR LATER!</strong></p>\n<p><img class=\"pinit aligncenter wp-image-19142 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/12/Why-Were-Still-Sold-on-Thailand-Pinterest.png?resize=400%2C609&amp;ssl=1\" alt=\"Even after 5 years of living in this crazy, beautiful country, we're still sold on Thailand. Here's a reflection of our time there. | Tieland to Thailand\" width=\"400\" height=\"609\"></p>\n<h2><p id=\"8220The_Talk8221\"><p>&#8220;The Talk&#8221;</p></p></h2>\n<p>It&#8217;s inevitable. Each time we visit the US, friends and family ask, &#8220;So, when are you coming back?&#8221;</p>\n<p>This time that question felt persistent, heavy. We&#8217;re nearing the five-year mark living in Thailand (even longer if you count the time it took preparing for our move) and we&#8217;ve asked ourselves the same thing: Should we stay here in Chiang Mai? Move to another place in Thailand where there are more opportunities for us, such as Bangkok? Consider somewhere else, such as Lake Atitl&#225;n, Guatemala or Barcelona, Spain?</p>\n<p>But what people really mean to ask is, &#8220;No, when are you REALLY coming back home?&#8221;</p>\n<p>In particular, Angela&#8217;s mom and sister pressed the question, followed by, &#8220;We feel like we&#8217;ve lost a daughter and a sister.&#8221;</p>\n<h2><p id=\"We_miss_the_creature_comforts\"><p>We miss the creature comforts</p></p></h2>\n<p>Outrageous traffic and freezing weather aside, there are things we miss about the States.</p>\n<p>Large, plush couches we can sink into while watching our favorite Netflix series.</p>\n<p>Good, solid restaurant service. With bathrooms that are properly stocked with toilet paper and hand soap.</p>\n<p>High quality, authentic, clean everything.</p>\n<p>Ovens, dishwashers, washing machines &#8211; oh my! These items came standard in every house we visited.</p>\n<p>We could go on, but you get the idea.</p>\n<h2><p id=\"_and_the_security_of_a_9_to_5\"><p>&#8230; and the security of a 9 to 5.</p></p></h2>\n<p>We admit, there&#8217;s a small voice in our head asking a very common yet practical question: &#8220;How will you explain that 5-year gap on your resume?&#8221;</p>\n<p>We are not exempt from traditional adult responsibilities in life. In fact, it feels strange not having any conventional long-term plans. We feel lost at times, wondering if we made the right decision after all.</p>\n<h2><p id=\"What_no_one_tells_you_about_being_an_expat\"><p>What no one tells you about being an expat</p></p></h2>\n<p>A few issues that seem to have appeared since moving to Thailand:</p>\n<h3><p id=\"Problems_are_magnified\">Problems are magnified</p></h3>\n<p>Had your credit card gobbled up by the ATM? Need to find a pet sitter while you&#8217;re gone for a few days? Locked out of your apartment? What would&#8217;ve been a headache back at home oftentimes turns into a&#160;head-splitting&#160;conundrum.&#160;Cultural differences combined with different laws and language barriers can take an issue and blow it up tenfold, even for the most of minor things.</p>\n<p>And what if you forget to extend your visa but the immigration office is closed on an unexpected holiday? That&#8217;s something you&#8217;d never deal with as a citizen in your home country.</p>\n<h3><p id=\"You8217ll_lose_your_sense_of_identity\">You&#8217;ll lose your sense of identity</p></h3>\n<p>We once were able to respond with a clear-cut answer to the age-old question, &#8220;Well what do you do?&#8221; It used to be that we were an operations manager and an underwater acoustic analyst. Now we wear many hats and is not so defined: blogger-writer-consultant-social media manager-investor&#8230;</p>\n<h3><p id=\"Establishing_meaningful_relationships_is_challenging\">Establishing meaningful relationships is challenging</p></h3>\n<p>Can you meet people? Certainly. But developing deep, meaningful relationships and meeting others who have the same life goals as us have been more difficult than we thought. Between the constant influx of travelers passing through, it&#8217;s difficult to know who&#8217;s here to stay for good. This goes for dating, too, as far as all our single friends have said!</p>\n<h2><p id=\"Is_the_grass_greener_on_the_other_side\"><p>Is the grass greener on the other side?</p></p></h2>\n<p>We start yearning to live in the&#160;USA. To go back to working the 9 to 5 because we&#8217;ve been told that that&#8217;s normal. We are not immune to asking ourselves &#8220;What if we just went back&#8230;&#8221;</p>\n<p>We might have a bigger house. A fancier car. All thanks to the&#160;<a href=\"http://happierhuman.com/hedonic-treadmill/\" target=\"_blank\" rel=\"noopener\">Hedonic Treadmill effect</a>.</p>\n<p>But on the flip side, we&#8217;d have debt and only two weeks of vacation.&#160;And it scares us to think that we may be sitting in the same office in 20 years!</p>\n<p>Do we want to look back on our life when we&#8217;re 80, 90, 100 years old and say we&#8217;re happy that we moved abroad and did things we enjoyed &#8211; traveling, spending time with like-minded people, and taking care of our physical and mental wellbeing &#8211; with a fraction of the money but with far greater time than we had in the US?</p>\n<p>Or will we be proud to look back at earning college degrees, certain titles at our jobs, and earning a cushy paycheck?</p>\n<h2><p id=\"Ask_yourself_What_makes_you_happy\"><p>Ask yourself: What makes you happy?</p></p></h2>\n<p>What makes you happier: Having ample free time? And the flexibility to make your own schedule? To set your own priorities?</p>\n<p>Or does routine make you happy? A guaranteed paycheck? Planning and long-term goals? Social status and material things?</p>\n<p>We&#8217;re a mix and that&#8217;s why we feel the pull in both directions. That&#8217;s because there are great things in America and there are great things in Thailand, too.</p>\n<p>Our friends and family tell us how much they want to do what we are doing. Or at the very least, how cool it is.&#160;We&#8217;re extremely lucky to be able to wake up every day and enjoy life, like&#160;<a href=\"https://bemorewithless.com/the-story-of-the-mexican-fisherman/\">the Mexican Fisherman</a>. Thailand allows us that.</p>\n<p>We love that we have remained debt free for the past five years. There&#8217;s no car payments that tie us down, or a mortgage or outrageous utility bills. We have taken a huge step back from consumerism, too, which we find to be way more challenging to do while in the USA.</p>\n<p>We love that we can travel whenever we want to at the drop of a hat. This includes a yearly trip back to the USA to get our fill of favorite foods and to catch up with friends and family, who we sometimes see just as much, if not more, now! that we live in Thailand! Or the long weekend trip to Bangkok, the islands, or up in the hills of Northern Thailand. It&#8217;s an incredible feeling knowing that we can live our lives according to our own schedule. And the truth is, we experience more freedom living in Thailand than we ever did living in the United States.</p>\n<p>Only time will tell if we&#8217;ve made the right choices. But for now, it&#8217;s hard to imagine&#160;going back to what we worked so hard to leave behind nearly five years ago.</p>\n<p><strong>Are you still sold on Thailand? Let us know why (or why not) in the comments below.</strong></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"5 Years Later, Why We’re Still Sold on Thailand"}},"pageContext":{"id":"5b95ef4287be05832749010e"}}