{"data":{"mongodbDatabaseArticles":{"id":"5b95eac687be05832748ffd0","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/losingwonder001.jpg\" alt=\"man gazing out on city\">Posted: 06/13/2010 | June 13th, 2010</p><p>Last month, I was traveling Greece with a friend. My friend is sort of a travel newbie. While not her first time in Europe, it was her first time traveling without the comfort of her family or a group of friends. It was her first backpacking adventure and everything we did, everywhere we went, everything we saw was exciting, breathtaking, and wondrous to her. There was always a sense of awe on her face.</p><p>One day in Athens, noticing I lacked that awe, she asked me &#8220;Do you still ever get excited about a place? You seem so unexcited.&#8221;</p><p>&#8220;Of course! When I go to a new place, I love to explore!&#8221; I replied, &#8220;It&#8217;s just that I&#8217;ve been to Athens already.&#8221;</p><p>But the implications of her question got me thinking and I realized I envied her and all the other new travelers I meet on the road. For them, travel is new. It&#8217;s a wondrous moment that brings some awe-inspiring moment and new experience around every corner.</p><p>But, for me, travel is not new. Travel is a lifestyle, an endless journey that I live every day. Some people get up and go to work. I get up and go to a new city. My travels aren&#8217;t a defined around the world trip with a start and finish date. It&#8217;s continuous. My friend&#8217;s question got me thinking though.</p><p>At some point, do we, the endless nomads, lose that sense of wonder and awe? Have I lost that sense of wonder?</p><p>I don&#8217;t mean that those who spend years on the road lose their desire and love of travel. The more I travel, the more I realize travel is the only thing I want to do and I would never trade my lifestyle for a cubicle. But eventually, it does become repetitive- more trains, more waterfalls, more beaches, more, more, more. I&#8217;ve been lost, I&#8217;ve done the hostel thing, I&#8217;ve ridden the trains, explored jungles, seen bridges, and got drunk with people from around the world. I&#8217;ve partied, I&#8217;ve slept, I&#8217;ve met thousands of faces I&#8217;ll never see again, taken day trips, explored ruins- in short, I&#8217;ve done all the activities, over and over again.</p><p>And that repetition can sometimes take the glitz out of travel. It even happens on those defined round the world trips. I remember watching <a href=\"https://nomadicmatt.com/travel-blogs/the-life-of-a-traveler/\" rel=\"noopener\" target=\"_blank\">A Map for Saturday</a> (a great movie about round the world trips) and even the characters talk about how late in their trips they suffered from that feeling of &#8220;things just being another&#8221;.</p><p>And so I think- have I lost the wonder of travel? Has that awe gone out of me? And, sadly, the answer is yes. It has. The wonder is gone. My love for travel hasn&#8217;t gone anywhere. And that&#8217;s not to say that there aren&#8217;t places in the world that awe and inspire me. I still get awed by moments in life. I was blown away scuba diving in Fiji. I was awed by the rice terraces in Bali. Hiking the Tongariro in New Zealand is one of the best things I&#8217;ve done. And 4 yrs later I am still in love with the Cinque Terre.</p><p>But while places still blow me away, the act of traveling &#8211; that adventurous feeling of the first time on the road &#8211; has left me. When travel became a lifestyle, it didn&#8217;t become a permanent adventure, it just became my life. Travel is what I do. A few days ago, I told some people in a hostel about my blog. &#8220;You have the coolest job ever!&#8221; they replied. But I just think of it as life. The sense of wonder I had stepping into new cities, trying to figure out guidebook maps, meeting people in hostels- it&#8217;s gone. Not fully but just a little bit. Sometimes I just don&#8217;t want to see a new city or go exploring. Sometimes I just want to watch True Blood.</p><p>But, as they say, such is life. When you do something long enough, maybe that is what happens. Whether travel, playing tennis, teaching- do something enough and it becomes a routine. And once it&#8217;s routine, it loses its wonder. And even though I&#8217;ve lost those initial feelings you get when you start your trip, seeing it on the faces of others reminds me how life changing travel can be sometimes and, why even without that feeling of awe, I wouldn&#8217;t change a thing about this life I&#8217;ve chosen.</p><p>Sometimes it is good to simply take a break, relax, breathe, sleep, and get your energy back. To sit around and just be.</p><p>And, I know in two weeks later, I&#8217;ll be itching to get back on the road and wondering what the hell I was bored about in the first place.</p><p>&#160;</p><h3>How to Travel the World on $50 a Day</h3><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\"><img class=\"\" src=\"https://media.nomadicmatt.com/bookimages/howtotraveltheworld_v3cover.jpg\" alt=\"conquering mountains: solo female travel by kristin addis\" width=\"200\" height=\"273\"></a>My New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences. <a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"Losing the Wonder of Travel"}},"pageContext":{"id":"5b95eac687be05832748ffd0"}}