{"data":{"mongodbDatabaseArticles":{"id":"5b95eaf987be05832748ffe9","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/travelmistakes.jpg\" alt=\"lost from mistakes made while traveling\">Posted: 01/06/2014 | January 6th, 2014</p><p>I make a lot of mistakes. Despite years of constant travel to over 70&#160;countries, I can&#8217;t believe how often I still make rookie mistakes when I should know better. For example, in the last couple of months alone, I have:</p><ul><li>almost gone to the wrong airport &#8211; twice</li><li>mistakenly booked two plane tickets for the wrong day (yay, cancelation fees!)</li><li>overpaid for a taxi when I knew I was being ripped off</li><li>forgot to haggle for market goods (thus overpaying)</li><li>forgot to <a href=\"https://nomadicmatt.com/travel-blogs/travel-insurance/\" target=\"_blank\" rel=\"noopener\">buy travel insurance</a> until three days into my trip</li><li>didn&#8217;t pack shorts on a trip to a tropical destination</li><li>forgot to <a href=\"https://www.nomadicmatt.com/accommodation/\" target=\"_blank\" rel=\"noopener\">pre-book accommodation</a> during Christmas</li><li>didn&#8217;t rent a car in Cura&#231;ao (despite knowing I should) because I am cheap, and I ended up missing a lot of the island because the bus didn&#8217;t go there</li></ul><p>Those are just the ones I remember off the top of my head in the last few months. There are countless other instances in which I break my <a href=\"https://nomadicmatt.com/travel-blogs/travel-rules/\" target=\"_blank\" rel=\"noopener\">27 cardinal travel rules</a> (hence why rule #27 is the most important).</p><p>After all these years on the road, I still mess up.</p><p>A lot.</p><p>Every day, I receive a lot of emails from <a href=\"https://nomadicmatt.com/travel-blogs/how-to-overcome-your-fears/\" target=\"_blank\" rel=\"noopener\">new travelers that are filled with worry, fear, and concern</a>. Just a few days ago, a girl who was preparing to study abroad told me she thought she was making the biggest mistake of her young adult life. Looking at her two suitcases filled her with dread. Another guy worried that he wouldn&#8217;t ever really be &#8220;ready&#8221; to travel. And another reader was concerned about her lack of worldliness would only lead her to screwing up.</p><p>And like many, many other people, they emailed me asking for help. How can they avoid mistakes? How can they ensure that everything is going to go smoothly?</p><p>It&#8217;s easy to look around and see travel writers as &#8220;experts&#8221; and &#8220;gurus&#8221; who seem to travel through the world with seamless effort. We glide through airports, make instant friends with locals, and blend seamlessly into new and unknown cultures. We&#8217;re like ninjas.</p><p>But I don&#8217;t know anyone like that. All my &#8220;expert&#8221; friends make plenty of mistakes. I&#8217;ve witnessed many first-hand, obvious mistakes from people who should have known better.</p><p>But we are all human and humans make mistakes.&#160;<a href=\"https://www.nomadicmatt.com/travel-blogs/my-current-list-of-favorite-blogs/\" target=\"_blank\" rel=\"noopener\">Even the &#8220;superhuman travel experts.&#8221;</a></p><p>It&#8217;s natural to worry about problems that might happen on the road. It&#8217;s easy to let that worry and fear cripple you and cause panic. Before I went traveling, the worst case &#8220;what if&#8221; sceneries consumed my thoughts. How would I deal with this or that situation? What if I got on the wrong train, booked the wrong flight, or <a href=\"https://www.nomadicmatt.com/travel-blogs/how-to-pick-a-good-hostel/\" target=\"_blank\" rel=\"noopener\">made the wrong hostel choice?</a></p><p>I have done all three of those things (and more). It&#8217;s easy to beat yourself up over the silly mistakes. Hell, <a href=\"https://nomadicmatt.com/travel-blogs/that-time-i-lost-my-passport/\" target=\"_blank\" rel=\"noopener\">how could I have been so stupid as to leave my passport on a plane</a>?!</p><p>But you can&#8217;t let them get to you.</p><p>All you can do is move on past them.</p><p>I long ago stopped beating myself up over my travel mistakes. Now, I live with them because I know I&#8217;ll always keep making them. I can only move on, learn from them, and hope I don&#8217;t make them again (but I probably will).</p><p>So the next time you book the wrong flight, catch the wrong bus, or screw something up, know that you are not alone and that others, even the experts, have made far worse mistakes&#8230;and we survived and continued on.</p><p>Just take a deep breath and move on.</p><p>Because you are going to make a lot of mistakes on the road.</p><p>But that&#8217;s OK &#8212;&#160;no one is a perfect traveler.</p><p>And you&#8217;re only going to stress yourself out if you try to be one.</p><h3>How to Travel the World on $50 a Day</h3><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\"><img class=\"\" src=\"https://media.nomadicmatt.com/bookimages/howtotraveltheworld_v3cover.jpg\" alt=\"conquering mountains: solo female travel by kristin addis\" width=\"200\" height=\"273\"></a>My New York Times best-selling paperback guide to world travel will teach you how to master the art of travel save money, get off the beaten path, and have a more local, richer travel experiences.</p><p><a href=\"https://www.nomadicmatt.com/travel-tips/how-to-travel-the-world-on-50-usd/\" target=\"_blank\" rel=\"noopener\">Click here to learn more about the book, how it can help you, and you can start reading it today!</a></p></div>","title":"How to Cope with Travel Mistakes"}},"pageContext":{"id":"5b95eaf987be05832748ffe9"}}