{"data":{"mongodbDatabaseArticles":{"id":"5b95ea3887be05832748ff8e","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/kohchang.jpg\" alt=\"Ko Chang\"><br> Located near the Cambodian border, I first heard of Ko Chang during my first visit to <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\">Thailand</a> back in 2005. I was in Chang Mai and two backpackers were arguing over whether I should go to Ko Chang or Ko Samet. Back then, Ko Chang was a backpacker&#8217;s paradise. If Thailand had something close to &#8220;<a href=\"https://www.nomadicmatt.com/travel-blogs/the-best-travel-books/\">The Beach</a>,&#8221; this would have been it. There were few tourists on it, no resorts, no organized tours, a dirt road, and only a handful of guesthouses. Since it&#8217;s over six hours from <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/bangkok/\">Bangkok</a>, most people never visit. They go to closer, more developed locations.</p><p>I never made it there in 2005. Or in 2006. Or 2007. But I did make it there at the end of 2008. I had heard rumors and stories about the island since 2005 about how tourism had exploded on Ko Chang and its neighboring islands. Now, there were resorts, package tours, paved roads, and overpriced taxis.&#160; However, Ko Chang was not nearly as overdeveloped as the <a href=\"https://www.nomadicmatt.com/travel-blogs/ko-phi-phi/\">island of Ko Phi Phi</a>, Phuket, or Samui. And despite the recent surge in tourists during the high season, it was still relaxing.</p><p>Ko Chang is the second largest island in <a href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\">Thailand</a> so there is a lot of space to move around and get away from the crowds. The island has definitely seen a rise in tourism over the last few years and while it is a still a relative &#8220;secret&#8221; to most tourists, the word is out in the backpacking/budget travel scene. Prices on the island are much cheaper when compared to other islands and its relative size and location means that even when the island is busy, it&#8217;s still not that busy. However, there has been a big push lately to develop and promote the island and I suspect this peace will end shortly.</p><p><img src=\"https://media.nomadicmatt.com/kohchang2.jpg\" alt=\"homes in Ko Chang\"></p><p>Ko Chang is part of a marine park with the same name and there is a lot to do in the area. Since Ko Chang is so big, it&#8217;s heavily forested and contains quite a few mountains. The island itself is said to have broken off from the mainland many centuries ago, which would account for this type of terrain. There are a number of good waterfalls and vistas on the island. There are a few official hiking trails where you can go on your own and a few unofficial ones if you just want to explore, though I recommend getting a local to go with you. For divers, this marine park is excellent. There are a lot of reefs around and because Ko Chang is still &#8220;off the grid&#8221;, you&#8217;ll find most of these reefs still in tact and not overfished.</p><p>Most of the accommodation is on the left side of the island. The package/high end tourists end up at Hat Sai Khao beach (White Sands) on the top of the island closest to the mainland. This beach, along with the two below it, are were you&#8217;ll find most of the big resorts, expensive restaurants, and tourist centers. However, there are luxury resorts up and down the island.</p><p>Most backpackers end up in one of two places: Lonely Beach, where most of the guesthouses, bars, clubs, and loud music are. Here&#8217;s you&#8217;ll <a href=\"https://www.nomadicmatt.com/travel-tips/finding-cheap-accommodation/\">find cheap accommodation</a>, decent shops, and a relatively nice beach. Or there is the infamous Treehouse Guesthouse located on the southern right tip of the island at Hat Yao. It&#8217;s the only place there and it&#8217;s very quiet. You won&#8217;t find any loud music or bars here. It&#8217;s just the Treehouse. The Treehouse is sort of an institution on Ko Chang and, thus, is always full. The beach is alright during low tide, though it can be a bit rocky. But it is a great place to relax. And if they are booked out, you can always stay at their second location on Lonely Beach.</p><p><img src=\"https://media.nomadicmatt.com/kohchang3.jpg\" alt=\"beaches in Ko Chang\"></p><p>If Ko Chang is too touristy for you, you can head to the other islands of Ko Kood, Ko Maak, Ko Khlum, or Ko Rang. Luckily, most of these islands are undeveloped. Many are privately owned and can be rented out cheaply. The smaller ones have only a bungalow or two and if you looking to really get away from everything &#8211; skip Ko Chang and head to these little villages. Sadly though, the larger islands have not escaped development. One island that has become really overdeveloped is Ko Maak. I had heard this was a bit of paradise but was saddened to see that the island is ringed with expensive resorts and expensive prices. Ko Kood is slowly becoming that way too.</p><p>Yet despite its recent increase in tourism, Ko Chang still offers a lot of peace and quiet. How long that will last is not clear. I suspect pretty soon it will become a major destination for people- maybe as a half way point between Bangkok and <a href=\"https://www.nomadicmatt.com/travel-guides/cambodia-travel-tips/siem-reap/\">Siem Reap</a>. But eventually, the tourism that affected Ko Samui and Phuket will makes it way here. Take in Ko Chang now because, even at its current level of tourist development, it&#8217;s still a great place to go relax. But that might not last much longer.</p><h3>Get the In-Depth Budget Guide to Thailand!</h3><p><a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\"><img src=\"https://www.nomadicmatt.com/wp-content/uploads/2016/09/cover_thailand_2016-2.png\" alt=\"Thailand travel guide\" width=\"180\" height=\"240\"></a>My detailed, 170+ page guidebook is made for budget travelers like you! It cuts out the fluff found in other guidebooks and gets straight to the practical information you need to travel and save money while in Thailand, a country I used to call home (so I know it really well!). You&#8217;ll find suggested itineraries, budgets, ways to save money, on and off the beaten path things to see and do, non-touristy restaurants, markets, and bars, and much more!! <a href=\"https://www.nomadicmatt.com/books/thailand-travel-guide/\">Click here to learn more and get started.</a></p></div>","title":"Ko Chang, Thailand"}},"pageContext":{"id":"5b95ea3887be05832748ff8e"}}