{"data":{"mongodbDatabaseArticles":{"id":"5b921d1187be0571ac1b04ed","content":"<div><p>Let&#8217;s start with an overview. Singapore and Hong Kong are Asia&#8217;s two economic powerhouses and occupy the top two spots on the Economic Freedom Index. They&#8217;re both fantastic places. But I&#8217;ve always been drawn more to Hong Kong, not only for the way the city feels, but as a place to base your business.</p>\n<h2>Singapore corporation vs. Hong Kong corporation on paying no tax</h2>\n<p>Hong Kong has done something few developed countries can claim: make it easy for Hong Kong corporations to pay zero income tax.</p>\n<p>Situated at the tip of Mainland China, Hong Kong is no stranger to being a transit point for goods. Chinese factories pump up gazillions of dollars in exports every year, much of it channeled through Hong Kong. If you&#8217;ve ever been to areas like Tsing Yi on Rambler Channel in Hong Kong, you&#8217;ve seen the amazing volume of container ships being loaded up with goods headed all over the world.</p>\n<p>In line with that kind of business, Hong Kong uses its territorial status to allow &#8220;trading companies&#8221; to operate and pay no tax. To accomplish that, you must simply use Hong Kong as your trading hub between two other countries. For instance, purchasing goods from China and selling them to Europe. Set up your invoices the right way and Hong Kong is essentially cancelled out.</p>\n<p>While a Singapore corporation does offer a similar option, it&#8217;s a bit more tricky. Unlike in Hong Kong, you aren&#8217;t allowed to bank in Singapore under such a setup. While the country also uses a <a title=\"Tax freedom starts with a territorial tax system\" href=\"http://nomadcapitalist.com/2013/05/10/tax-freedom-starts-with-a-territorial-tax-system/\">territorial tax system</a>, Singapore views money earned in or remitted to Singapore by a Singapore corporation as local income, and subject to tax.</p>\n<h2>What are corporate taxes in Singapore?</h2>\n<p>One issue with Singapore is the government&#8217;s strenuous opposition to being labeled a tax haven. I understand that the government wants to play ball with the international community &#8211; or at least appear that way. Promoters suggest that this appearance makes it easier and more credible for those who do business there. After all, a country that has some level of corporate tax looks a lot better to the IRS or your local tax authorities than a country with zero income tax and thin maintenance requirements.</p>\n<p>But if your goal for starting an offshore company is to legally reduce your tax rates as much as possible, why not go all the way to zero?</p>\n<p>Singapore&#8217;s corporate tax rates are currently 17%; just a few basis points above Hong Kong&#8217;s 16.5% flat rate.</p>\n<p>However, your first S$100,000 (roughly US$75,000) in profits are tax-exempt for the first three years your Singapore corporation is open for business. In that same period, everything between S$100,000 and S$300,000 is taxed at half the normal flat tax rate. Everything after that is taxed as normal.</p>\n<p>That means you can earn nearly a quarter-million US dollars and pay barely 5% in tax for the first three years of your business.</p>\n<p>After that, things get tricky. While not nearly as complicated as the tax code in The Land of the Free, Singapore makes things overly complicated in my opinion. Starting in year four, you get a 75% tax rate reduction on your first $10,000 in earnings (so 4.25%), and a 50% rate reduction on the next $290,000 (making it 8.5%).</p>\n<p>As you can see, the magic number for Singapore is S$300,000. They offer incentives up to that amount. If you earn more, you simply start paying the normal tax rate.</p>\n<p>Where Singapore shines &#8211; but creates more confusion &#8211; is in its tax deduction opportunities. Most equipment can be completely written off in one year, rather than amortized, and the maximum period most businesses will use is three years. No waiting for fifteen years here.</p>\n<p>Through 2015, you can buy equipment and deduct 400% of the value. You read that right; buy a $1,000 computer this year and you&#8217;ll be eligible for a $4,000 tax deduction. It seems the government throws in these little kickers every once in awhile to encourage trade.</p>\n<p>Singapore differs from Hong Kong in that Singapore seems to encourage more of an on-the-ground presence. Yes, the government is well aware that many Singapore corporations are used for global commerce, and that the company has no presence there.</p>\n<p>But unlike Hong Kong which actually seems to <a title=\"How to legally avoid taxes with an IBC trading company\" href=\"http://nomadcapitalist.com/2014/01/03/legally-avoid-taxes-ibc-trading-company/\">encourage this type of activity</a>, Singapore treats its businesses more like they are operating close to home. That&#8217;s evidenced by the fact that they set it up so almost all Singapore companies pay tax of some form.</p>\n<p>Once the company pays tax, however, you can declare a dividend payable to directors. Dividend income is not taxed in Singapore.</p>\n<p>If you live in a high-tax country, that could offer some benefits to you in that Singapore has a large amount of tax treaties that prevent double taxation. Singapore is, however, signed tax information sharing agreements with other governments in their attempt to be a good global citizen.</p>\n<p>Singapore&#8217;s desire to have its companies be involved in the jurisdiction is evidenced by some of its more interesting tax deduction plans. For instance, you wouldn&#8217;t have a need to claim a 400% tax deduction on the aforementioned computer if you didn&#8217;t owe any tax in the first place. Under these circumstances, Singapore will actually send you money in the form of a grant &#8211; but you must have several Singaporean employees on the payroll.</p>\n<p>Despite having one of the lowest unemployment rates in the world, Singapore wants to make sure its own citizens have good jobs, and it has stepped up the requirements for hiring Singaporeans if you want to do business AND live there. If you don&#8217;t have a college degree, you&#8217;ll have a tough time getting a residence permit through the Entrepass or Employment Pass programs.</p>\n<h2>How much does it cost to form a Singapore corporation?</h2>\n<p>Another disadvantage of the Singapore corporation is the cost. Most reputable firms will charge you as much as US$4,000 to set the thing up if you don&#8217;t live there. The fee is partially inflated due to the need for a resident director. This is one thing Hong Kong doesn&#8217;t require, but Singapore does. They claim that foreigners not living in Singapore could run off and, without supervision, turn the place into a money laundering haven.</p>\n<p>Ongoing fees for your company will be in the same ballpark. You can save the annual resident director fee by living there, but that process carries its own fees and Singapore is <a title=\"Top 5: Most livable cities in Southeast Asia\" href=\"http://nomadcapitalist.com/2013/10/20/top-5-livable-cities-southeast-asia/\">one of the most expensive cities on earth</a>.</p>\n<p>One thing Singapore and Hong Kong do have in common is a reporting requirement. Singapore does come out on top here in that its independent audit threshold is much than Hong Kong&#8217;s. As long as you own the business individually, or with twenty or fewer natural person partners, you should be exempt from the $3-5,000 expense of auditing the books.</p>\n<p>However, Singapore corporations are responsible for filing a tax return every year, even if they did no business whatsoever. The fee for that tax return should be included by the people who set up your company.</p>\n<h2>Is a Singapore company the best offshore corporation?</h2>\n<p>If you have some ties to Singapore or the greater region, and don&#8217;t mind paying some tax and dealing with compliance, Singapore might be worth investigating. I personally believe a <a href=\"http://nomadcapitalist.com/2013/04/16/asia-near-secret-haven-for-an-offshore-corporation/\">Labuan corporation</a> in Malaysia gives a Singapore company a run for its money.</p>\n<p>If you&#8217;re an online business owner or have some other form of location independent income coming from various places around the world, I don&#8217;t think the costs of a Singapore corporation are worth the hassle. While Singapore is viewed relatively favorably by tax authorities worldwide, Hong Kong isn&#8217;t exactly viewed as a pariah. Nor are several other jurisdictions.</p>\n<p>On one end of the spectrum you have value offshore jurisdictions like the Seychelles, which offer virtually no reporting, no tax, and very low fees (often under $1,000 per year out the door). Close to the other end is Singapore (lesser used jurisdictions like Dubai and Switzerland are even more expensive).</p>\n<p>It&#8217;s up to you to weigh your priorities, the type of business you have, and which other jurisdictions (ie: your home country and its tax gestapo) will be involved.</p>\n</div>","title":"Should you set up a Singapore company for your business?"}},"pageContext":{"id":"5b921d1187be0571ac1b04ed"}}