{"data":{"mongodbDatabaseArticles":{"id":"5b962a3b87be0583274911d2","content":"<div><p>Before your trip there is a lot to plan and get organized. But it&#8217;s not just packing, you&#8217;ve got to think about paperwork and your health as well. Lots of new travelers ask me: &#160;Should I get travel health insurance? The answer is most often,&#160;Yes!</p><p>Whether it&#8217;s for a short trip of a month or two,&#160;or&#160;a year RTW (round the world) trip I DEFINITELY recommend insurance. Any travel abroad situation, I&#8217;ll probably recommend insurance and there&#8217;s one thing you&#8217;ll want to know:</p><ul><li><strong>Many volunteer and tour groups make you prove insurance before buying or on the day you show up. Some activities may require it as well.&#160;</strong></li></ul><p><img class=\"aligncenter wp-image-4701\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/1080241_10151547644767337_1694856021_n2.jpg?resize=560%2C422&amp;ssl=1\" alt=\"Best Travel Books at Inducing Wanderlust\" width=\"560\" height=\"422\"></p><h2>So, which travel insurance should I get?</h2><p>I took out insurance through <a href=\"//www.worldnomads.com/Turnstile/AffiliateLink?partnerCode=hippie&amp;source=&amp;path=https://www.worldnomads.com/travel-insurance&amp;utm_source=hippie&amp;utm_content=link\">World Nomads</a> the top agency in the travel industry. I paid 211 for just under 3 months when I backpacked India, as I only had 200 in my budget so decided to cover myself only part of the trip. Not the best idea. I&#8217;ve heard horror stories of not being covered, and it&#8217;s best to cover yourself the day before you leave to the day you get back.</p><p>Actually, a blogger just BROKE his back and had to be life-flighted. They wrote about how travel insurance was a life saver for them. <a href=\"http://theplanetd.com/daves-broken-back-and-a-little-healing-time/\" target=\"_blank\">Read the story</a> over on the popular blog, the Planet D.</p><p></p><p id=\"wn-insurance-quote-editor\"></p><p>&#160;</p><p>If you&#8217;re really hoping not to buy insurance, I get it. I know what it&#8217;s like to want to cut costs. You probably think you&#8217;re okay under your parents insurance or your employer. <strong>The reality is, you&#8217;re not.</strong></p><p>Maybe you have it on the mind that where you&#8217;re headed is really inexpensive and in the case you get hurt, you can afford the care. That could be true.</p><p>You have to figure out how expensive health care is where you&#8217;re headed. Almost all countries have unaffordable health insurance (most of Europe, North American, South America, etc)&#160;In Asia, it&#8217;s more up in the air&#160;in somewhere like India but definitely necessary for say, Japan.</p><h3>An example&#160;when insurance didn&#8217;t actually help:</h3><p>I&#8217;ll be the first to admit for small things it&#8217;s not all that useful in a very inexpensive country. I took out travel insurance for three months in India, for a total cost of 211 dollars. I was hospitalized for food poising, and I was <a title=\"Survive Dengue Fever Symptoms Like A Boss\" href=\"https://hippie-inheels.com/dengue-fever-symptoms/\" target=\"_blank\">sick for one month</a> straight with Dengue Fever. Dengue causes severe and strange symptoms. By the time I was diagnosed I had been to multiple hospitals that treated me by prayer, incense, and pills. I had rashes, hives, Delhi belly, UTI, migraines, severe nausea and vomiting.</p><p><b>On the positive side</b>, it&#160;only 60 bucks all together counting the cab rides to the hospitals AND the treatments.</p><p><b>On the negative</b>, I was sick for a month and insurance meant nothing. I didn&#8217;t meet the deductible (or even come close) to get reimbursed. So basically I got severely sick, had medical insurance, and it was still didn&#8217;t get me the money back.</p><p>Had I gotten far more sick (which is very possible with Dengue) I could have needed that insurance and I was SO happy to have that piece of mind while I was in and out of the hospital.</p><p><img class=\" aligncenter wp-image-957\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/1176286_10151565099782337_878614869_n1.jpg?resize=560%2C574&amp;ssl=1\" alt=\"travel insurance, money, saving money, travel\" width=\"560\" height=\"574\">I go in and out of policies and sometimes am uninsured while figuring out my next move. At all times, I am under my parents health insurance because I&#8217;m under 26. <a href=\"https://hippie-inheels.com/vaccinations-for-travel/\" target=\"_blank\">I still get my required vaccinations.</a> I choose to do my preventative care here in India where it&#8217;s cheaper even so rather than at home.</p><p><img class=\"aligncenter wp-image-4064\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/IMG_4474.jpg?resize=560%2C419&amp;ssl=1\" alt=\"Best Travel Books at Inducing Wanderlust\" width=\"560\" height=\"419\"></p><p>&#160;</p><h1>Why you need insurance (while traveling):</h1><p>A kidney infection that causes hospitalization&#160;will cost you 1,000 dollars in India. A broken leg having surgery will cost you 2,000 dollars.</p><p>There are sad stories of travelers in India, which one might consider the least expensive place to travel and avoid buying insurance, who needed extensive care and had to be life-flighted home. They&#8217;re going to be tens of thousands of dollars in debt. Private care in India is expensive.</p><p>So, I&#8217;m using India as an example because I&#8217;ve seen my friends go through these scenarios. India is a cheap place to travel, so if these are the prices here, you can imagine what they would be elsewhere.</p><p>When making your decision you have to decide what&#8217;s best for you.&#160;But if you have the money to go abroad, then you should absolute take that extra shift at work, or save that extra $200 bucks so that you can buy adequate travel health insurance. It&#8217;s not something you&#8217;d regret!</p><p><img class=\"aligncenter wp-image-11925\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2013/12/travel-insurance-feature-2.jpg?resize=560%2C420&amp;ssl=1\" alt=\"should i get travel health insurance\" width=\"560\" height=\"420\"></p><p>&#160;</p><p>Did you enjoy this post? Let me know in the comments or by sharing it with the social media links! I&#8217;d love to keep giving you travel tricks &amp; tips so feel free to subscribe by e-mail in the big purple box below. Don&#8217;t forget you can follow me on <a href=\"http://www.facebook.com/hippieinheelsblog\" target=\"_blank\">facebook</a>, <a href=\"http://www.twitter.com/hippie_inheels\" target=\"_blank\">twitter</a>, <a href=\"http://www.instagram.com/hippieinheelsblog\" target=\"_blank\">instagram</a> &amp; <a href=\"http://www.bloglovin.com/hippieinheels\" target=\"_blank\">bloglovin</a>&#8216;.</p><p></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"Should I Get Travel Health Insurance?"}},"pageContext":{"id":"5b962a3b87be0583274911d2"}}