{"data":{"mongodbDatabaseArticles":{"id":"5b921d1e87be0571ac1b04fa","content":"<div><p>However, if you&#8217;re a serious entrepreneur or run an already successful business, a Hong Kong corporation could be the answer for you. Here are four reasons why&#8230;</p>\n<h1>1. It&#8217;s an easy and legitimate way to go global</h1>\n<p>Personally, I don&#8217;t think you should give too much credence to the naysayers who gripe about offshore corporations. As they say, haters gonna hate. But from a banking and regulatory point of view, you may run into more issues setting up shop in some Caribbean island with a bunch of ninnies than you would in a stable, trusted jurisdiction like Hong Kong.</p>\n<p>After all, the world views Hong Kong with envy. It&#8217;s a solid financial center with real business activity. They&#8217;re not just churning out boiler-plate corporations to collect a filing fee here. Hong Kong has real professionals, real bankers, and real lawyers. No one who knows what they&#8217;re talking about is going to accuse you of using a Hong Kong corporation for shady purposes or to hide out. That can come in handy, for instance, if you&#8217;re trying to raise capital.</p>\n<p>Personally, I like the idea that China is behind Hong Kong. In my mind, it&#8217;s the perfect win-win: economic freedom in the actual jurisdiction, with a government behind it willing to stand up to the US.</p>\n<p><a title=\"Offshore Banking\" href=\"http://nomadcapitalist.com/offshore-banking/\">Banking</a> is remarkably easy here for Hong Kong corporations. However, it is becoming almost <a href=\"http://nomadcapitalist.com/2013/07/11/hong-kong-banks-dont-need-your-money/\" target=\"_blank\">impossible for foreigners</a> to bank in Hong Kong. If you don&#8217;t have a Hong Kong corporation, look elsewhere. Hong Kong banks are so awash in Chinese money they can happily turn away anyone that comes without a referral. That said, I&#8217;d prefer you plant your banking flag in a jurisdiction other than where you&#8217;re incorporated, anyway. </p>\n<p>Stingy banks aside, having a Hong Kong corporation can be a great option for your offshore company. Most importantly, doing business in Hong Kong isn&#8217;t likely to get you on some bankrupt country&#8217;s blacklist for being a tax scofflaw.</p>\n<p></p><img class=\"size-full wp-image-14107\" src=\"http://nomadcapitalist.com/wp-content/uploads/2013/07/View-of-Hong-Kong-harbor-and-Central-perfect-place-for-a-Hong-Kong-offshore-corporation.jpg\" alt=\"View of Hong Kong harbor and Central, perfect place for a Hong Kong offshore corporation\" width=\"700\" height=\"467\"><h1>2. A Hong Kong corporation doesn&#8217;t pay tax on business outside of Hong Kong</h1>\n<p>It&#8217;s possible to avoid Hong Kong corporate tax altogether using a trading company. Thanks to a <a title=\"Tax freedom starts with a territorial tax system\" href=\"http://nomadcapitalist.com/2013/05/10/tax-freedom-starts-with-a-territorial-tax-system/\">territorial tax system</a>, the territory of Hong Kong only taxes transactions that happen within its borders. This system is based on the silly notion that taxes are earned by a government that provides you services. They figure income you earn in Belgium didn&#8217;t require their help and they shouldn&#8217;t get to wet their beak. </p>\n<p>Contrast that with Western governments and <a title=\"America&#8217;s bad excuse for citizenship-based taxation\" href=\"http://nomadcapitalist.com/2013/06/17/americas-bad-excuse-for-citizenship-based-taxation/\">The Land of the Free</a> in particular, where puppets like Obama say &#8220;you didn&#8217;t build that&#8221; and then happily tax companies based on their earnings in China. It&#8217;s maddening.</p>\n<p>Some trading companies will set up a Hong Kong corporation to source goods from Bangladesh, for example, and then sell them to markets in the EU. If the Hong Kong company merely facilitates the transaction between two other countries, it&#8217;s not taxed. That means getting invoiced by and sending invoices to a foreign country.</p>\n<p>It&#8217;s a better structure than even <a title=\"Economic freedom in Singapore &#8211; and why you must be planting flags\" href=\"http://nomadcapitalist.com/2013/04/17/economic-freedom-in-singapore-and-why-you-must-be-planting-flags/\">Singapore</a>. I love Singapore, but I find Hong Kong beats it out in most of my categories.</p>\n<p>Even if you actually do business in Hong Kong, you&#8217;ll pay a low 16.5% corporate flat tax. The government of Hong Kong is efficient compared to most and finances government expenses with user fees on real estate transactions. This allows them to be one of the lowest-taxed and widely-open &#8220;civilized&#8221; jurisdictions in the world. (Because we know that socialists love to say taxes are the price we pay for civilization).</p>\n<h1>3. Hong Kong corporations allow for more liberal write-offs</h1>\n<p>The IRS is pretty stingy when it comes to business write-offs. No surprise there. As a lifetime self-employed guy, I find their policies on business meals and entertainment, equipment depreciation, and other stuff rather appalling.</p>\n<p>While the tax authorities in your bankrupt, past-its-prime Western country might say buying a big client a glass of wine isn&#8217;t allowable come tax time, Hong Kong authorities are more lenient. Besides, you may not be paying much in the way of taxes anyway.</p>\n<p>Of course, Americans must maintain their accounting records to US GAAP standards, but having a Hong Kong corporation gives you more flexibility.</p>\n<h1>4. Hong Kong is a strong, stable jurisdiction for banking and corporations</h1>\n<p>I sometimes find it a bit funny that people bash on Hong Kong for its ties to China &#8212; which has nothing to do with Hong Kong corporations &#8212; but are perfectly willing to form their business on some random island. Consider that the UK took over the <a title=\"How Big Government robbed Turks and Caicos\" href=\"http://nomadcapitalist.com/2013/02/18/well-take-over-tax-you-and-youll-like-it/\">government of Turks and Caicos</a> on a whim, while China has left Hong Kong to manage its own affairs.</p>\n<p>If you want a stable base of operations, it&#8217;s hard to do better than Hong Kong. If you&#8217;re the owner of an established, successful business, it&#8217;s a straightforward process to get a second residence permit and eventually permanent residence.</p>\n<p>You do have to have a real office &#8212; not a post office box &#8212; to do business in Hong Kong, but you can get one for $30 to 75 per month. Virtual offices in Hong Kong are some of the most gorgeous I&#8217;ve ever been in. Skip companies like Regus (which provide dreadful service) and go with any of the many local companies that provide suites dripping with orchids, glass or marble, and pleasant service that includes fetching your guests tea.</p>\n<p>As &#8220;Asia&#8217;s world city&#8221;, Hong Kong gives you access to investment capital in the region and a legitimate business structure that serious investors wouldn&#8217;t bat an eyelash at.</p>\n<p>For an <a href=\"http://nomadcapitalist.com/offshore-company/hong-kong/\" target=\"_blank\">offshore corporation</a>, Hong Kong ticks a lot of boxes if you&#8217;re willing to live with a bit of oversight and a few rules from an easy government to get along with.</p>\n</div>","title":"Four reasons to use a Hong Kong corporation for your business"}},"pageContext":{"id":"5b921d1e87be0571ac1b04fa"}}