{"data":{"mongodbDatabaseArticles":{"id":"5b937b0487be056953db7d06","content":"<div><h1 name=\"c769\" id=\"c769\" class=\"graf graf--h3 graf--leading graf--title\">Why I&#160;nomad</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*0L0CjC-K23wppwAtWy1oGw.jpeg\"><p name=\"9f74\" id=\"9f74\" class=\"graf graf--p graf-after--figure\">For the last three years, I&#8217;ve embarked on several solo travel adventures.</p><p name=\"c0b3\" id=\"c0b3\" class=\"graf graf--p graf-after--p\">I went to live in Thailand for 8 months. Then I went to Mexico for 6. And then I went to spend some time in the States. Now, having spent a few months at my homeplace in London, I&#8217;m about to disappear again.</p><p name=\"343e\" id=\"343e\" class=\"graf graf--p graf-after--p\">Only I don&#8217;t really like travelling.</p><p name=\"1ddf\" id=\"1ddf\" class=\"graf graf--p graf-after--p\">I&#8217;m not a particularly visual person. I enjoy new scenes, but only because of the changes that they force internally. New visuals help to make me present. Usually because I&#8217;m trying to figure out what&#8217;s going on and how I&#8217;m going to craft a life for myself. From zero.</p><p name=\"648e\" id=\"648e\" class=\"graf graf--p graf-after--p\">What I really value is knowing myself through each new place I visit. And I do. Every trip has resulted in further layers of the onion coming off.</p><p name=\"1b7c\" id=\"1b7c\" class=\"graf graf--p graf-after--p\">Inertia is such a powerful counterforce to anything good in life&#8202;&#8212;&#8202;becoming self-reliant, being in touch with your desires, pursuing creative dreams, creating anything of value&#8202;&#8212;&#8202;that I realized that I simply wouldn&#8217;t get it done from my comfortable home in London. I&#8217;ll just lazily follow the same pastimes and pursuits.</p><p name=\"aaf5\" id=\"aaf5\" class=\"graf graf--p graf-after--p\">I&#8217;ll lead what psychologist <a href=\"http://www.artofwellbeing.com/2016/11/01/happiness/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Martin Seligman calls</a> the &#8216;pleasant life&#8217;&#8202;&#8212;&#8202;but not the good life.</p><p name=\"3b24\" id=\"3b24\" class=\"graf graf--p graf-after--p\">I&#8217;m not saying that you need to do anything as drastic as uproot yourself from everything you know in order to finally love and own your life.</p><p name=\"cc5f\" id=\"cc5f\" class=\"graf graf--p graf-after--p\">But I would encourage it. Even if you don&#8217;t really like travelling. Here&#8217;s just a few reasons why:</p><p name=\"90a6\" id=\"90a6\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">You get a shit ton more grateful for the humans back at home</strong>&#8202;&#8212;&#8202;your family members and friends. It is without hesitation that I can say I may not have learned to truly appreciate these beautiful people without periodically removing them from my life.</p><p name=\"ad52\" id=\"ad52\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">You learn how little you actually need.</strong> You create your own fulfilment.</p><p name=\"07f4\" id=\"07f4\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">You learn more about yourself in general.</strong> This is the big fish; the real reason. When it comes to the good life, there is no more profitable pursuit then self-knowledge. What do you truly value? And why? What are you really afraid of? Is it real? What do you desire? I think it&#8217;s nearly impossible to know what you need until you test yourself in different settings. Stay a month in a shitty apartment stripped of everything but basic comforts. Go somewhere where you have zero friends and have to make a community from scratch&#8202;&#8212;&#8202;see how you fare with that.</p><p name=\"78b3\" id=\"78b3\" class=\"graf graf--p graf-after--p\">Become a voyager, on the voyage of you.</p><p name=\"5de5\" id=\"5de5\" class=\"graf graf--p graf-after--p\">That sounds cheesy doesn&#8217;t it? Well I don&#8217;t care because it&#8217;s true. Ask everyone who moves around. We aren&#8217;t all pathetic, commitment phobic loners. Some of us just want to understand ourselves and the world a bit deeper.</p><p name=\"f872\" id=\"f872\" class=\"graf graf--p graf-after--p\">Don&#8217;t bother leaving to try to escape yourself. If you hate yourself at home then you&#8217;ll still hate yourself in Hawaii. So just stop hating yourself. Leave because you love yourself instead, and you want to honor the part of you that isn&#8217;t your job, your role in the family and your financial status.</p><p name=\"003c\" id=\"003c\" class=\"graf graf--p graf-after--p\">If you can&#8217;t move with your job, I do believe that the experience can be recreated at home, with a little effort. You have to be committed though. No fucking about. Here&#8217;s how I would do it:</p><p name=\"a1b2\" id=\"a1b2\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Remove yourself from all of your physical props and comforts</strong>. Do this at regular intervals. Your family, your friends, your phone, the internet, the endless bantering with strangers you&#8217;re trying to get something from. Disconnect for long periods and go somewhere totally unfamiliar. Do this with the right intention. The intention is to figure out what the hell it is you actually care about, underneath all the crap.</p><p name=\"e696\" id=\"e696\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Read a lot</strong>. All the time. It forces you to question your beliefs and ideas in the same way that moving continents does. Take an <a href=\"http://www.artofwellbeing.com/2016/10/21/enneagram/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Enneagram test</a>, figure out your <a href=\"http://www.artofwellbeing.com/2016/09/02/attachmenttheory/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">attachment style</a> and learn about mindfulness.</p><p name=\"461a\" id=\"461a\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">Scale back.</strong> Add in some positive constraints to your life. Give yourself a stupidly low budget for a week. You don&#8217;t need new clothes or expensive juices. You don&#8217;t even need your specific friends. Or that job. If these things were taken away from you tomorrow, you&#8217;d be okay. You&#8217;d be a little sadder temporarily, but you&#8217;d be freer too. Eventually, it&#8217;d result in a version of you that does less shoulding and more hell yeahing.</p><p name=\"e9fe\" id=\"e9fe\" class=\"graf graf--p graf-after--p graf--trailing\">I don&#8217;t travel for &#8216;more&#8217;. I travel because it helps me to love less&#8202;&#8212;&#8202;and to really appreciate what a good life means for me.</p></div>","title":"Why I nomad – The Coffeelicious – Medium"}},"pageContext":{"id":"5b937b0487be056953db7d06"}}