{"data":{"mongodbDatabaseArticles":{"id":"5b93834b87be056953db7e4a","content":"<div><h1 name=\"b721\" id=\"b721\" class=\"graf graf--h3 graf--leading graf--title\">How I stay productive working&#160;remotely</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*UiI71Uam51I4bN3W4UyhJw.png\"><p name=\"5afe\" id=\"5afe\" class=\"graf graf--p graf-after--figure\">One year ago, I made one of the best decisions of my life, I joined Help Scout to build our Android application from scratch.</p><p name=\"1120\" id=\"1120\" class=\"graf graf--p graf-after--p\">The interview process was already different from the rest I had done before. Everyone was extremely transparent and honest regarding how things were going to be and how the decisions were going to be made. Striking!</p><h4 name=\"5a8c\" id=\"5a8c\" class=\"graf graf--h4 graf-after--p\">Is this just a trend or is this the&#160;future?</h4><p name=\"db65\" id=\"db65\" class=\"graf graf--p graf-after--h4\">According to the latest <a href=\"http://stackoverflow.com/insights/survey/2017#remote-work\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Developer Survey from StackOverflow</a>, only 11.1% of the participants work remotely full time. However, almost 65% of them are working from home at least one day a week. Even more interesting, when asked about what developers value most when considering a new job, <a href=\"http://stackoverflow.com/insights/survey/2017#work-what-developers-value-in-compensationbenefits\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">53.3% said remote options were a top priority.</a></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*erTUmvyc6xONO0COLNe9Yg.png\"><p name=\"db51\" id=\"db51\" class=\"graf graf--p graf-after--figure\">These numbers have grown compared to <a href=\"https://insights.stackoverflow.com/survey/2016#work-remote\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">last year&#8217;s survey</a>, and it&#8217;s great to see that more companies are investing in remote work. There are <a href=\"https://www.helpscout.net/blog/remote-culture/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">several</a> <a href=\"https://signalvnoise.com/posts/3657-37signals-works-remotely\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">stories</a> and great <a href=\"https://37signals.com/remote\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">books</a> that extensively cover the benefits of remote work, so in this post I&#8217;d rather share my experience in this last year.</p><h4 name=\"609d\" id=\"609d\" class=\"graf graf--h4 graf-after--p\">How working remotely changed my work&#160;life</h4><p name=\"0669\" id=\"0669\" class=\"graf graf--p graf-after--h4\">Pre-Help Scout, I would often find myself looking at code I wrote the day before and exclaiming, &#8220;What was I thinking!? This is so wrong!&#8221; Now these moments are fewer and further between. The first and most shocking change for me, is that I&#8217;m more efficient than I was in previous jobs. Working remotely and having the freedom to choose working hours, gave me the opportunity of writing code when I&#8217;m at my best.</p><p name=\"c712\" id=\"c712\" class=\"graf graf--p graf-after--p\">Why does that happen? Well, in a traditional office environment the work hours don&#8217;t take into account the productivity of an individual. However, there are countless situations what will affect your productivity and efficiency. If I had a bad night sleep the day before, or an argument with my wife or any stressful situation, it&#8217;s more difficult to have quality work hours. I believe it&#8217;s very unprofessional to keep staring at a problem when I&#8217;m not at a clear state of mind. Unfocused, finding solutions takes more time than it should. If I set the problem aside for a few hours and come back when my mind is fresh, it&#8217;s much easier to solve. Working remote and choosing my own hours has enabled me to eliminate these situations and create a much more productive environment.</p><h4 name=\"f174\" id=\"f174\" class=\"graf graf--h4 graf-after--p\">Routine are not&#160;routine?</h4><p name=\"9c5e\" id=\"9c5e\" class=\"graf graf--p graf-after--h4\">At previous jobs, office hours ruled my life. If I was in the office from 9:30 to 18:00, I&#8217;d schedule activities around those hours to ensure I could go to the gym, meet with friends, do the groceries, etc&#8230; and leave the big activities for the weekend. For the last year, I&#8217;ve been able to schedule my work around my life and the activities that make me happy, not the other way around. Would you really choose to go to the gym at 7pm if you could go at 10am and not having to rush to the office? My wife and I found a <a href=\"http://londonfieldsfitness.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">gym in London</a> that matches exactly with that attitude. Anytime you go, there is always a class, spinning, circuit training, etc&#8230;</p><p name=\"f6c3\" id=\"f6c3\" class=\"graf graf--p graf-after--p\">After having breakfast with my wife, exercising and having a second breakfast, I&#8217;ll start working, usually between 8am to 11am. After 2 or 3 hours of work, I&#8217;ll go for walk, the &#8220;podcast walk&#8221; I like to call it. I&#8217;ll spend 30&#8211;45 minutes walking around the park or canal listening to a podcast on any number of topics, except Android. Clearing up the head with something different allows me to avoid thinking about that bug in the code that I just found. By this time, I may have spent 4 hours without articulating a word. Which leads to our next topic.</p><h4 name=\"5ec5\" id=\"5ec5\" class=\"graf graf--h4 graf-after--p\">Home office or co-working space</h4><p name=\"7d9e\" id=\"7d9e\" class=\"graf graf--p graf-after--h4\">I&#8217;ve tried both, very different results. I work better without noise around, and with freedom of movement. Anytime I work in a co-working space, I find that I have to leave after a few hours. I find that sitting in an open space surrounded by 20 individuals doing their own business, making calls or simply talking out loud makes it difficult for me produce the same quality code as I can in the quiet of my home. So for that reason, while I enjoy the energy and opportunity for human interaction the co-working space provides, I primarily work from home. I have a room in my house that is separate from my living space, and I only go there to work, the rest of the time the door is closed. It&#8217;s a place of peace, with a very simple standing desk and a Thunderbolt display. No water cooler, meeting room or coffee machine.</p><p name=\"8418\" id=\"8418\" class=\"graf graf--p graf-after--p\">Don&#8217;t get me wrong, co-working spaces make a lot of sense for a great deal of entrepreneurs and small companies. The opportunities for networking and synergistic effect these spaces provide can be extremely valuable for some, but not for me.</p><h4 name=\"1735\" id=\"1735\" class=\"graf graf--h4 graf-after--p\">Food and sleep are the fuel that feed your&#160;brain</h4><p name=\"7502\" id=\"7502\" class=\"graf graf--p graf-after--h4\">I&#8217;ve always liked to cook, and since working from home cooking has become more important. After the walk, I&#8217;ll go to my local butcher or fishmonger and get something fresh to cook. I can&#8217;t stress enough, the difference it has made being able to eat healthy and homemade every day. Back in the days we had this thing, we called it Burrito Tuesday, and almost everyone in the office would grab a Burrito for lunch together. It was great fun, but that type of fast food is not the best to fuel your brain. Right after a carnitas special, there was no way in hell I could write a particularly complex algorithm.</p><p name=\"e9bb\" id=\"e9bb\" class=\"graf graf--p graf-after--p\">Spending time choosing food, talking to the local butcher and discussing how to cook this particular piece of meat is also part of my the new routine. After that I&#8217;ll go home and cook, eat and go back to work.</p><p name=\"cc9c\" id=\"cc9c\" class=\"graf graf--p graf-after--p\">Eating healthy is one big part of the equation, but I can&#8217;t stress enough how important it is to sleep. And by sleep I don&#8217;t mean 6 hours and be on 5 espressos a day, I mean really sleep. Anything less than 8 hours makes me grumpy, clumsy and more prone to write bad code. It might sound like a trivial advice, but this is one of the most important things I&#8217;ve learned during the last year.</p><h4 name=\"4a02\" id=\"4a02\" class=\"graf graf--h4 graf-after--p\">Don&#8217;t feel guilty for being 2 hours away of your&#160;desk</h4><p name=\"3c47\" id=\"3c47\" class=\"graf graf--p graf-after--h4\">When I would occasionally work from home in the past, I felt like I had to consistently prove that I was actually working. Not because my employer asked me to, but because I felt guilty about the situation. The rest of the office had to enjoy the morning rush hour of the Central line in London, and I had to suffer my morning coffee in the garden. When I discuss this with other developers, many have said they feel the same; that they must prove they are working all the time lest their colleagues think they are in their pyjamas watching TV. This is an awful way to feel, and it&#8217;s complete nonsense. In Spain we have this say, &#8220;calentar la silla&#8221; or &#8220;heating up the chair&#8221;.</p><p name=\"c7f8\" id=\"c7f8\" class=\"graf graf--p graf-after--p\">At Help Scout, I never feel pressure to heat up a chair just to clock the hours. If I&#8217;m stuck, I take a walk (or a nap!) and come back when I&#8217;m focused.</p><p name=\"9a6c\" id=\"9a6c\" class=\"graf graf--p graf-after--p\">When remote work is the standard and team members are trusted to manage their own time for optimal productivity, great things can happen!</p><h4 name=\"fcb1\" id=\"fcb1\" class=\"graf graf--h4 graf-after--p\">But, do you actually&#160;work?</h4><p name=\"9d55\" id=\"9d55\" class=\"graf graf--p graf-after--h4\">After the first month working I was experiencing <a href=\"https://en.wikipedia.org/wiki/Impostor_syndrome\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">impostor syndrome</a>. The learning curve was bigger than I initially expected, and I wasn&#8217;t sure I was actually doing my best. So started monitoring the Github trend of commits to the repos I contributed to, and going through the reports generated by <a href=\"https://www.rescuetime.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">RescueTime</a></p><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*t2CoHFelhCITm33h0IKcKg.png\"><p name=\"ebf4\" id=\"ebf4\" class=\"graf graf--p graf-after--figure\">Turns out, I spend around 25 hours a week in Android Studio. 25! That is coding (and building) time! I invite you to do the same, just for fun, and look back at it after one month. My time spent in Android Studio has grown significantly since I started working remotely. Much of this success is because of <a href=\"https://engineering.helpscout.com/how-our-remote-engineering-team-stays-agile-cb626fdf9677\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">how we work at Help Scout</a> I only have 2 meetings a week.</p><h4 name=\"a36a\" id=\"a36a\" class=\"graf graf--h4 graf-after--p\">A learning&#160;process</h4><p name=\"2e7d\" id=\"2e7d\" class=\"graf graf--p graf-after--h4 graf--trailing\">I love my new life, I love working from home, but it&#8217;s taken a while to learn what helps me stay motivated and focused. Working from home is not for everyone. Maybe you need to feel the energy of other people to spark your creativity, maybe you can&#8217;t handle all the alone time, maybe you crave the commute and the shared bathroom and the water cooler. However, if you think remote work sounds like a dream come true check out our <a href=\"https://www.helpscout.net/company/careers/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">career page</a>, maybe we&#8217;ll work (remotely) together!</p></div>","title":"How I stay productive working remotely – Help Scout Engineering & Product"}},"pageContext":{"id":"5b93834b87be056953db7e4a"}}