{"data":{"mongodbDatabaseArticles":{"id":"5b95eec287be0583274900f3","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Where to Begin?</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>This is a story of two people who abruptly and unexpectedly ditch their comfortable lives in Northern Virginia in search of something unrealistic. It is a story of a successful, newlywed couple who foolishly give up their hard earned, well-cushioned jobs (complete with flex time, paid vacation, and 401ks), large suburban apartment, expensive cars, and a lifestyle that most people wish they could afford, all because they believed that the grass is greener on the other side (of the world, that is). A couple who selfishly leave friends and family behind and throw their responsibilities to the wind for some exotic escapade halfway across the globe, literally. What are they THINKING?</p>\n<p><strong></strong></p>\n<p>Or perhaps, this is a story of two people who, very strategically, prepare themselves for more than a year, to move to another country in order to pursue a goal &#8211; to truly LIVE LIFE during their remaining years on Earth. It is a story of a successful, newlywed couple who want more in life than the nine to five Washingtonian grind, a story of putting more value in experiences and memories rather than in material things; of being able to live life in a way that produces distinct, colorful memories rather than a long, grey blur. It is a story of a couple actively pursuing a life that makes them happy, not chasing after a life that they have been <i>told</i> will make them happy.</p>\n<p>Whether this story is perceived as one version or the other, it is our story, and we are excited to share it through the blog Tieland to Thailand. This blog is dedicated to our friends and our families, and those who have randomly stumbled upon it and are also interested in pursuing <i>life</i>. Tieland to Thailand is our way of sharing our experiences- the who, what, where, when, how, and why of leaving the comforts (and the <i>knowns</i>) of home in exchange for the unknown in another country. We may even inspire others to do the same &#8211; to not only live the length of our life, but the breadth of it too. It&#8217;s because it all comes down to one thing:</p>\n<p>You only live once.</p>\n<p>Whether this story is perceived as foolish or adventurous, one version or the other, it is our lives and we are excited to share our experience of moving to and living in Thailand.</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Where to Begin?"}},"pageContext":{"id":"5b95eec287be0583274900f3"}}