{"data":{"mongodbDatabaseArticles":{"id":"5b9382fa87be056953db7e13","content":"<div><p name=\"bc58\" id=\"bc58\" class=\"graf graf--p graf-after--figure\">The same overarching technology trends driving transformation throughout the business world&#8202;&#8212;&#8202;most notably cloud computing and the smartphone revolution&#8202;&#8212;&#8202;are also fueling both the demand and potential for remote workers. From Google Docs to Slack, ever-evolving collaboration and communication tools have made it easier than ever for remote teams to efficiently get things done.</p><p name=\"0c3a\" id=\"0c3a\" class=\"graf graf--p graf-after--p\">As of 2016, approximately one quarter of the U.S. workforce works remotely with some frequency, according to <a href=\"http://globalworkplaceanalytics.com/telecommuting-statistics\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">GlobalWorkplaceAnalytics.com</a>. And the number of remotely-working regular employees (not counting self-employed individuals) has more than doubled since 2005.</p><p name=\"23c2\" id=\"23c2\" class=\"graf graf--p graf-after--p\">With technology no longer a limiting factor and companies increasingly considering the idea of hiring remote workers, it&#8217;s likely that today&#8217;s job seekers are wondering whether this new way of working makes sense for them. To answer that question, we&#8217;re sharing the top advantages and disadvantages of working remotely.</p><p name=\"2576\" id=\"2576\" class=\"graf graf--p graf-after--p\">First, the advantages.</p><p name=\"befe\" id=\"befe\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">1. You&#8217;ll love the flexibility</strong></p><p name=\"c903\" id=\"c903\" class=\"graf graf--p graf-after--p\">The best part about working remotely is that you get to work from anywhere. That may sound a bit redundant, but it&#8217;s true: instead of having to check into the same office at the same desk every day, you can work from your home office, in the backyard, at the neighborhood cafe, at a conference, from a plane, and so on. Having the flexibility to work where you want means you can both create the ideal workspace for yourself while also having the option of attending events or traveling to various meetings on your schedule.</p><p name=\"9bd0\" id=\"9bd0\" class=\"graf graf--p graf-after--p\">And it&#8217;s not just flexibility in where you work, but also when you work. While some time constraints are simply a fact of life, such as meetings (which usually take place during regular business hours) and project deadlines, remote workers will generally find that they can set their own hours and plan their own schedule as they see most fit for their workload and project requirements. In other words, the number one advantage to working remotely is freedom and flexibility.</p><p name=\"a99d\" id=\"a99d\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">2. You&#8217;ll learn new skills</strong></p><p name=\"d14e\" id=\"d14e\" class=\"graf graf--p graf-after--p\">Because of the vast flexibility afforded to newer remote workers, we imagine there can only be one of two outcomes: they either fail to manage their time properly and flounder in their duties or they seize the opportunity to show how successful they can be independent of direct supervision. If you&#8217;re reading this article, you probably care enough about your work to fall into the latter group. Those who find success as remote workers will be those who naturally seek out information when they need it, teach themselves new skills when it&#8217;s necessary to do so, and develop a capacity for self-management (because nobody else will be managing them).</p><p name=\"98f8\" id=\"98f8\" class=\"graf graf--p graf-after--p\">If you ever speak with someone who has deep experience working remotely, you&#8217;ll notice they seem entrepreneurial. Entrepreneurs cannot afford to wait for somebody to give them answers to the day-to-day problems they face. Instead, they must proactively create their own solutions. Remote workers must do the same, <a href=\"https://www.entrepreneur.com/article/200730\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">acting entrepreneurially</a> by taking their work seriously, planning everything they do, and striving for the highest quality in their work.</p><p name=\"5315\" id=\"5315\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">3. You&#8217;ll save money</strong></p><p name=\"0a9d\" id=\"0a9d\" class=\"graf graf--p graf-after--p\">An average worker in the U.S. today will spend about $10 getting to and from work, according to a <a href=\"http://money.cnn.com/2015/06/17/pf/work-commute-time-and-money/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">2015 survey by Citi</a>. Assuming a regular Monday through Friday job, that comes out to nearly $2,600 spent on commutes every year. The figures are even higher in major U.S cities, with workers in Los Angeles paying $16 per day (or $4,160 per year) and workers in New York paying $14 per day (or $3,640 per year). Unless you&#8217;re in the minority of workers who walk or bike to work, that&#8217;s a huge chunk of cash to be spending on public transportation, fuel, and/or car maintenance. (Not to mention it&#8217;s a waste of time).</p><p name=\"23ec\" id=\"23ec\" class=\"graf graf--p graf-after--p\">Working remotely erases all of that waste. Additionally, remote workers will likely end up saving money in other ways. For example, instead of paying a few bucks for coffee every morning and then another $10 and up for lunch, you can brew your own drink at home and whip up an afternoon meal from the pantry. And instead of spending money on an extensive wardrobe of professional workwear, you can show up at your home office in your pajamas (unless there&#8217;s a video meeting scheduled, of course).</p><p name=\"ef05\" id=\"ef05\" class=\"graf graf--p graf-after--p\">So what are the disadvantages?</p><p name=\"8740\" id=\"8740\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">1. It&#8217;s hard to stay in the loop</strong></p><p name=\"ae1f\" id=\"ae1f\" class=\"graf graf--p graf-after--p\">Even with all the advancements in collaboration and communications technology described above, there&#8217;s still no environment as perfect for collaboration as being physically present with your peers. While teams that are fully remote can come very close to replicating that experience, partially remote teams present a tricky challenge: when your colleagues in the office have off-the-cuff conversations about a project or spontaneously start whiteboarding ideas, how do you as the remote worker stay in the loop?</p><p name=\"948c\" id=\"948c\" class=\"graf graf--p graf-after--p\">The real answer will differ from team to team, but the short answer is &#8220;it&#8217;s complicated.&#8221; Ultimately, the onus is on both the office colleagues and the remote worker to be consistent and methodical about communicating all relevant information on a regular basis. No business should rely merely on word-of-mouth or &#8220;osmosis&#8221; to spread ideas around, but this becomes even more true for businesses with remote workers. With such a potentially vast gap in communication, you could end up seeing colleagues repeating work unnecessarily while other projects slow down to a standstill.</p><p name=\"9c3f\" id=\"9c3f\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">2. No more happy hour</strong></p><p name=\"fa94\" id=\"fa94\" class=\"graf graf--p graf-after--p\">Some of my best friends today are people I got to know by working full-time in an office. Whether it&#8217;s that designer I sat next to for years, the HR person who would join me for midday walks, or that engineer who shared so many of my interests, it&#8217;s people who make the office come alive. And there&#8217;s nothing quite as satisfying as going out for happy hour drinks with a few co-workers at the end of a long, stressful week.</p><p name=\"358f\" id=\"358f\" class=\"graf graf--p graf-after--p\">As a remote worker, you miss out on many of those social opportunities. In some ways, it can be a plus: when you want to be completely focused on a project, there&#8217;s no chance of a colleague tapping you on the shoulder to talk about last night&#8217;s football game or to drag you into a random meeting. But, on the other hand, it can be isolating to work day in and day out all by yourself at a home office. It&#8217;s for this reason that many remote workers will take the occasional chance to work outside, at a nearby cafe or library, or even alongside other remote workers. After all, remote workers are only human, and humans are social animals.</p><p name=\"2481\" id=\"2481\" class=\"graf graf--p graf-after--p\"><strong class=\"markup--strong markup--p-strong\">3. Distractions</strong></p><p name=\"1cef\" id=\"1cef\" class=\"graf graf--p graf-after--p\">Just because you won&#8217;t have the distractions of a passing work buddy doesn&#8217;t mean, however, that the remote worker is free from distractions. Working remotely comes with its own set of distractions, which depend on each worker&#8217;s circumstances. Often it&#8217;s the very things you value about being remote that end up distracting you from your work. For example, a new mother or father may cherish the idea of working from home so they can take care of the baby, but then they&#8217;re suddenly tasked with getting a full work day done while simultaneously changing diapers and mixing baby formula.</p><p name=\"8729\" id=\"8729\" class=\"graf graf--p graf-after--p\">Even for non-parents, the list of distractions is endless when you&#8217;re working from home. You can be tempted to tidy up around the house, wash the dishes, do a load of laundry, or&#8202;&#8212;&#8202;since nobody&#8217;s watching&#8202;&#8212;&#8202;simply sit back and blast some of your favorite tunes while surfing Facebook. Distractions come in many shapes and sizes, and they definitely seem to multiply when you&#8217;re not in the office, so it takes a strong will to defend against them.</p><p name=\"9afe\" id=\"9afe\" class=\"graf graf--p graf-after--p\">As with most of the new paradigms transforming our world today, working remotely comes with significant advantages and disadvantages. And what works for one team or one individual won&#8217;t necessarily work for the next. But as technology continues to advance and the globe only grows more connected, it&#8217;s clear that remote working will play a crucial role in the future of business.</p><p name=\"ed0b\" id=\"ed0b\" class=\"graf graf--p graf-after--p graf--trailing\">This article is part of a new publication called <a href=\"https://medium.com/remote-work/\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\"><strong class=\"markup--strong markup--p-strong\">Remote Work</strong></a> which focuses on tips, tricks, and secrets for remote workers and teams. Remote Work is published by <a href=\"http://liftux.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Lift</a>, an awesomely remote team, who just recently launched <a href=\"https://remotejobs.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">RemoteJobs.com</a>, the best place to find remote jobs.</p></div>","title":"The pros and cons of working remotely – Remote Work – Medium"}},"pageContext":{"id":"5b9382fa87be056953db7e13"}}