{"data":{"mongodbDatabaseArticles":{"id":"5b95eec187be0583274900f2","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">211 Days Out</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p>Hello everyone! If you have somehow found your way to this blog then you are a friend, a family member, or an extremely lucky and random individual. For those lucky few&#8230;welcome! We are a young newly engaged couple set to be married in October of 2012. We both have great jobs and lead comfortable lives in the suburbs of Washington D.C. (Northern Virginia). Our names will remain private and unmentioned in this blog until we have given notice to our employers about our impending plans to travel abroad.</p>\n<p><strong></strong></p>\n<p>We have been tossing around the idea of escaping the hustle and bustle for a little over a year now. Sitting in my office one day I found myself in a conversation with my friend, officemate, and retired US Army First Sergeant when he began spouting off about ditching everything and moving to Belize. Of course he wasn&#8217;t serious, rather just making a few weightless threats in a moment of anger and frustration stemming from his new found civilian desk job. During that moment a revolution began inside of me. I began to think about how amazing it would actually get up and leave&#8230;how liberating it would be to just sell everything, board a one way flight, and just go. I was ready to escape the rat race in search for brand new experiences in foreign surroundings.</p>\n<p>From that afternoon on I became a persistent day dreamer. I couldn&#8217;t go a day at work without distracting myself with thoughts of living on an island in the Caribbean or a lying on a beach on the coast of South America somewhere. Belize seemed like a great move until I found out how low the cost of living in Nicaragua was. When I started to become fascinated by Nicaragua, an article on cheap retirement abroad brought me to Nha Trang, Vietnam. I was sold for about a week until I ventured a little more and stumbled across Chiang Mai, Thailand. The Northern Thai people, the extremely low cost of living, and the year-round warm weather left me captivated and wanting to learn everything I possibly could about Chiang Mai. I have watched hours of Youtube videos and read hundreds of blog posts about living as an expat in the Old City. The more I learn the more I want to be there right now. Thailand just cannot come fast enough!</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"211 Days Out"}},"pageContext":{"id":"5b95eec187be0583274900f2"}}