{"data":{"mongodbDatabaseArticles":{"id":"5b9248bd87be056953db7be4","content":"<div><p>I get these emails every week:</p> <blockquote><p> <strong>From:</strong> W.B. Lumbergh<br> <strong>To:</strong> Me</p> <p>Love your project! We'd love to talk to you about it.</p> <p>Could you jump on a call with me this week to discuss opportunities?</p> <p>Bill Lumbergh<br> CEO, Initech Inc. </p></blockquote> <p>The first time you get a message like this, you're enthusiastic. Some company likes what you're doing/making, and they want to work with you or become a client/user of your startup.</p> <p>But then the agony starts. You spent the next four days mailing back and forth to set up a time for a Skype call. If there's timezone differences to deal with (usually), that multiplies set-up times 3x.</p> <p>And now that you've finally got a date and time for that call, 75% of the time it's rescheduled to another time. Because you know \"business\" happens. At this point, you're still not sure what this call is specifically about. And when you ask, you'll get a vague answer and they'll insist to explain more face-to-face.</p> <p><img class=\"sl_lazyimg\" src=\"/wp-content/plugins/simple-lazyload/blank_1x1.gif\"></p><img src=\"/wp-content/uploads/2014/05/5d8664cf92e4ce604998ebc905667d3186818aee1c8786b9cfd51712eead636e.jpg\"> <h2>Business, the role playing game</h2> <p>To me, the traditional business world sounds a lot like one massive role playing game. For the last century, their mode of operations was to set up \"calls\", \"meetings\" and \"discuss opportunities\".</p> <p>People acting like they're productive by sitting in meetings and setting up useless calls all day being <a href=\"http://www.pbs.org/newshour/making-sense/ask-says-notorious-occupy-academic-job-exist/\">paid to look busy</a>.</p> <p>Luckily, times have changed.</p> <p>Those manipulative sales tactics that did so well face-to-face or over the phone? Yeah they don't really work anymore over email. And for good reason.</p> <h2>Email cuts through the bullshit</h2> <p>It's text-based. It removes emotion, enables rational conversation and forces people to be clear about what they want from someone. By definition you can't be bullshitting if you're text-based. And it's asynchronous. You can send me a long pitch and a few hours or days later I can read it, respond and back and forth we go.</p> <p>If you can't express yourself by email, you probably don't know what it is you want either. You're then better of spending more time figuring that out than wasting other people's precious time. Ask me what you want concisely, and I'll get it to you ASAP. We don't need to do \"jump on a call\" for that. Let's both save each other time.</p> <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"If you can’t express yourself by email, you’re not worthy of anyone’s time"}},"pageContext":{"id":"5b9248bd87be056953db7be4"}}