{"data":{"mongodbDatabaseArticles":{"id":"5b95ea1387be05832748ff7e","content":"<div><p> </p><p><img src=\"https://media.nomadicmatt.com/ghostsagain1.jpg\" alt=\" woman watching the sunset\"><br> Last year, I talked about how travelers are often <a href=\"https://www.nomadicmatt.com/travel-blogs/chasing-ghosts/\">chasing ghosts</a>. We revisit places, trying to capture that initial amazingness we felt while we were there. And most of the time we end up disappointed. We go back and try to re-create something that can&#8217;t be re-created. We are all like drug addicts, simply trying to chase that first high. But we can never quite reach it. After all, it is people who create our memories, not places.</p><p>And so last year I vowed never to chase ghosts. It&#8217;s why I&#8217;ll never go back to Ko Lipe in Thailand, and why I said I would never go back to the Greek island of Ios. The memories I made in those places were too special, and I knew going back wouldn&#8217;t be the same without the people who were there the first time around.</p><p>Yet here I am, writing this post from Ios, a place on my &#8220;do not return&#8221; list.</p><p>Yes, I came back here. But it had nothing to do with chasing the ghosts of travels past.</p><p>It was my birthday on June 12. I turned 30. In marking that special day, I wanted to go to a place where I knew I could celebrate like I was turning 20. And I wanted to do it on a beach. In Europe. There are a number of places I could have chosen (Lagos, Barcelona, Corfu), but I knew Ios would have everything I wanted.</p><p>I&#8217;ll admit, I was reluctant to come back. But after a few friends of mine said they would come too, I thought, why not? Even though I knew I wouldn&#8217;t be able to recapture those old memories of Ios, I knew I would still have some fun.</p><p>After two weeks here, I&#8217;ve changed my mind about last year&#8217;s post. You can return to a place and still love it. I&#8217;ve had nothing but fun here. The locals remembered me. Many of my friends from last year returned. I&#8217;ve made new friends. I&#8217;ve learned even more about the island. I don&#8217;t regret coming back here at all.</p><p>I&#8217;ve avoided revisiting a lot of places for fear that I&#8217;ll &#8220;ruin&#8221; my initial experience there and walk away disappointed. For example, in my mind, Ko Lipe is a deserted island in Thailand where I made lifelong friends. Going back to a now-developed island teeming with tourists would be something I couldn&#8217;t handle. Paradise lost.</p><p>But in some cases, you cango back &#8212; you just have to go back for different reasons.</p><p>This year, I came back to Ios not because I wanted to chase that high from last year but because I wanted to celebrate my birthday. It&#8217;s as simple as that. I didn&#8217;t want what I had last year. I wanted to party and ring in my 30th birthday with my friends.</p><p>I came here with a different mindset this time, realizing that what I had last year was unique. It can never be re-created, but that doesn&#8217;t mean I couldn&#8217;t come back and make new memories.</p><p>Years from now, I probably won&#8217;t reminisce about this second trip to Ios like I will the first. Years from now, I probably won&#8217;t be talking to people from this trip like I will the first. But I came in recognizing that; I didn&#8217;t expect this trip to outshine my first.</p><p>Was I chasing ghosts in Ios? I don&#8217;t think so. Even though I think we as humans are wired to hold onto those highs and try to re-create them, going back to a place you love doesn&#8217;t have to be about chasing ghosts. You can return to a destination and just enjoy it for what it is &#8212; a good place. But if you expect it to be as good as it was that first time, you will be disappointed in what you find. Instead, come expecting nothing. Just be there to enjoy a good place as a good place, having a good time without comparing it to the past.</p><p>And you&#8217;ll leave your ghosts in the past, where they can never haunt your present again.</p></div>","title":"Chasing Ghosts Again"}},"pageContext":{"id":"5b95ea1387be05832748ff7e"}}