{"data":{"mongodbDatabaseArticles":{"id":"5b95f4f087be05832749013c","content":"<div><h5>Foreign Language Experience</h5>\n<p>Appreciation of the difficulties involved in learning a foreign language and how this can benefit teachers. We do this by having Thai language classes that course participants take as a part of the TEFL program. This provides both some useful Thai words and phrases, as well as experiencing what it is like to learn a foreign language in a classroom environment (many have done this but, but a refresh is valuable to help the teacher more directly understand what it is like to be a foreign language student).</p>\n<h5>Language Awareness &#8211; Structure and Components of English</h5>\n<p>Trainees will receive an overview of grammar including all verb tenses and language components as well as a focused analysis of conditional sentences, passive verb forms and specific commonly used verb tenses. Stress, intonation and rhythm will be analyzed and practiced.</p>\n<h5>English Learner Student Profile</h5>\n<p>Trainees work with individual students on rapport-building, error analysis and correction and addressing individual student needs. A final report including a needs analysis, student analysis and summary will be prepared by trainees and discussed with the course trainer.</p>\n<h5>Practical and Authentic Teaching Practice</h5>\n<p>A fundamental part of any TEFL course, SEE TEFL&#8217;s trainees will teach 6 one-hour observed classes to real students using skills acquired during training. Levels will range from beginner to intermediate with an age range from primary to adult. One-to-one feedback will be given to every trainee by one of SEE TEFL&#8217;s experienced class observers.</p>\n<h5>TEFL Training Course Participants</h5>\n<p>The SEE TEFL Certificate in Teaching English as a Foreign Language to speakers of other languages is an introductory course for candidates with strong English language skills (a minimum IELTS academic module score of band 6.5 or equivalent for candidates for whom English is not their native language) who have little or no previous experience of teaching English as a foreign language. Candidates with some experience but inadequate or no training may also find the course beneficial.</p>\n<h5>TEFL Training Course Objectives</h5>\n<p>The course enables candidates to:</p>\n<ul>\n<li>Acquire essential pedagogical knowledge that is relevant to teaching English as a foreign language to a wide variety of age-groups</li>\n<li>Acquire essential practical skills for both assessing the level of an adult&#8217;s competency in using English as a foreign language and teaching English to Adults whose first language is not English.</li>\n<li>Demonstrate their ability to apply their learning in real teaching contexts.</li>\n</ul>\n<h5>TEFL Training Course Syllabus</h5>\n<p>The following syllabus reflects the needs of potential candidates and gives outlines of both what candidates will cover during the 4 weeks course and basic teaching skills required for novice EFL teachers.</p>\n<p>The syllabus consists of 16 specific topic areas, a course in language awareness consisting of 7 specific topic areas, 3 written assessments which are assessed (which shall be referred to as written assignment 1, writing assignment 2 and writing assignment 3 from now on) ,and are assessments of the candidate&#8217;s aptitude of the course in language awareness along with 6 one-hour, observed and assessed, classes (which shall be referred to as the 6 observed teaching practices) to real students during the final two weeks.</p>\n<p>The 16 topic areas:</p>\n<ul>\n<li>The Teaching Process</li>\n<li>Teaching Pronunciation</li>\n<li>Teaching Vocabulary</li>\n<li>Teaching Grammar</li>\n<li>Teaching Speaking</li>\n<li>Teaching Listening</li>\n<li>Teaching Reading</li>\n<li>Teaching Writing</li>\n<li>Topics, Situations, Notions and Functions</li>\n<li>Classroom Interaction</li>\n<li>Classroom Discipline</li>\n<li>Teaching Children</li>\n<li>Large Heterogeneous Classes</li>\n<li>Lesson Preparation</li>\n<li>Assessment overview</li>\n</ul>\n<p>The SEE TEFL Certificate in Teaching English as a Foreign Language to speakers of other languages is awarded to candidates who have completed the course and who have met all the criteria for all written and practical assignments.</p>\n<h5>TEFL Training Assessment Framework</h5>\n<p>Candidates are awarded two grades at the end of the course. One is given for the mark they achieve in a formal examination of their knowledge at the end of the language awareness course. The other is given as an overall grade for the candidate&#8217;s performance during the 6 observed teaching practices and this includes an assessment of their preparation for each of the lessons.</p>\n<h5>TEFL Training Course Program</h5>\n<p>Courses run for four weeks in total. During that time, candidates will receive 120 contact hours and these will include:</p>\n<ul>\n<li>Input</li>\n<li>Supervised lesson planning</li>\n<li>Six observed teaching practices (six hours)</li>\n<li>Feedback on teaching</li>\n<li>Observation of experienced teachers</li>\n<li>Consultation time</li>\n<li>Familiarization with the role of being a second language learner</li>\n</ul>\n<p>Candidates should allow around an additional 20 hours for pre-arrival familiarization materials. These include a grammar terminology review and video exercises associated with EFL teaching methodology.</p>\n<p>Successful candidates are able to know how to do the following:</p>\n<h5>Introduction</h5>\n<p>1.1 Overview of the proposed course, introduction to the methodology that trainees will look at (namely, presentation, practice and production &#8211; The 3Ps) and giving trainees an opportunity to speak publicly for the first time in a controlled and supported environment.</p>\n<h5>The Teaching Process, Part 1</h5>\n<p>2.1 Effectively presenting ideas to EFL students and the importance of this stage of the teaching process. 2.2 How EFL students will perceive both sounds and information. 2.3 A model EFL presentation by an experienced EFL teacher followed by a group discussion.</p>\n<h5>The Teaching Process, Part 2</h5>\n<p>3.1 Effective practice stage activities for EFL learners and the importance of this stage of the teaching process. 3.2 The importance of giving clear and effective instructions for a practice activity for EFL students. 3.3 How to issue clear and effective instructions for a practice activity for EFL learners. 3.4 Managing a practice activity effectively. 3.5 Effective production stage activities for EFL learners and the importance of this stage of the teaching process. 3.6 How to issue clear and effective instructions for a production activity. 3.7 Managing a production activity effectively.</p>\n<h5>Teaching Pronunciation</h5>\n<p>4.1 Overview of paralinguistic features, phonology and phonetics of the English language. 4.2 The 44 individual phonemes used in the English language. 4.3 Effective ways to remedy EFL student&#8217;s pronunciation problems and an overview of using &#8216;phonics&#8217; in an EFL classroom.</p>\n<h5>Teaching Vocabulary</h5>\n<p>5.1 Overview and discussion of the terminology used to both describe individual words in the English language and to group them. 5.2 Teaching vocabulary using &#8216;3Ps&#8217; methodology</p>\n<h5>Teaching Grammar</h5>\n<p>6.1 Teaching English language structures effectively using&#160;<strong>3Ps</strong>&#160;methodology. 6.2 A discussion of an outline of a &#8216;3Ps&#8217; lesson on singular, plural countable and uncountable nouns and their associated determiners.</p>\n<h5>Teaching Speaking</h5>\n<p>7.1 Overview of what constitutes a successful speaking activity for EFL students versus an unsuccessful one. 7.2 A discussion of the particular stages of a &#8216;3Ps&#8217; lesson when EFL students will participate in a speaking activity. 7.3 Generating a successful speaking activity</p>\n<h5>Teaching Listening</h5>\n<p>8.1 Specific listening skills that EFL students need to acquire. 8.2 Effective listening activities for EFL students. 8.3 How listening materials can be used to present both language structures and vocabulary as part of the presentation stage of a &#8216;3Ps&#8217; EFL lesson.</p>\n<h5>Teaching Reading</h5>\n<p>9.1 Specific reading skills that EFL students need to acquire. 9.2 Effective listening activities for EFL students. 9.3 How reading materials can be used to present both language structures and vocabulary as part of the presentation stage of a &#8216;3Ps&#8217; EFL lesson.</p>\n<h5>Teaching Writing</h5>\n<p>10.1 Specific reading skills that EFL students need to acquire 10.2 Effective listening activities for EFL students 10.3 Effective correction techniques for EFL student&#8217;s writing and communicative activities that can be set up through writing activities.</p>\n<h5>Topics, Situations, Notions and Functions</h5>\n<p>11.1 Overview of communicative situations and their associated language structures. 11.2 How to present the associated language structures to EFL students. 11.3 Spoken practice activities using the associated language structures 11.4 Effective production activities using the associated language structures.</p>\n<h5>Classroom Interaction</h5>\n<p>12.1 Establishing rapport with EFL students. 12.2 The importance of correctly graded language when speaking to EFL students. 12.3 The need for supported meta-language with EFL students.</p>\n<h5>Classroom Discipline</h5>\n<p>13.1 Discussion of specific discipline problems in an EFL classroom. 13.2 The importance of correctly graded language when enforcing discipline in an EFL classroom. 13.3 Examples of discipline problems in a classroom and a discussion of what may have caused them and how they could be remedied.</p>\n<h5>Teaching Children</h5>\n<p>14.1 Discussion of the specific needs of young children during each of the 3 stages of a &#8216;3Ps&#8217; EFL lesson. 14.2 Awareness of and discussion of how we are transferring an EFL methodology that was primarily developed for adults into a classroom of young EFL learners. 14.3 Effective management of the 3 stages with very young EFL learners.</p>\n<h5>Large Heterogeneous Classes</h5>\n<p>15.1 Effective management techniques for large groups of EFL learners with multiple needs and varying levels of ability using EFL. 15.2 Effective planning of lessons for large groups of EFL learners with multiple needs and varying levels of ability using EFL.</p>\n<h5>Lesson Preparation</h5>\n<p>16.1 How to generate clear aims and objectives for an EFL lesson 16.2 Planning an effective presentation stage for EFL students and creating the necessary materials. 16.3 Planning an effective practice stage for EFL students and creating the necessary materials. 16.4 Planning an effective production stage for EFL students and creating the necessary materials.</p>\n<h5>Language Awareness / Grammar Use</h5>\n<p>Successful candidates are able to do the following:</p>\n<h5>English grammar terminology</h5>\n<p>1.1 Identify the key parts of speech and parts of a sentence in the English language</p>\n<h5>Use of the present simple and present continuous verb tenses</h5>\n<p>2.1 Identify the form and structure of these two verb tenses. 2.2 Identify the contexts in which they are used. 2.3 Identify important sounds that EFL learners will make that are associated with the two verb tenses.</p>\n<h5>Use of the past simple and past continuous verb tenses</h5>\n<p>3.1 Identify the form and structure of these two verb tenses. 3.2 Identify the contexts in which they are used individually and used together. 3.3 Identify important sounds that EFL learners will make that are associated with the two verb tenses.</p>\n<h5>Use of the past simple and present perfect verb tenses</h5>\n<p>4.1 Identify the form and structure of these two verb tenses. 4.2 Identify the contexts in which they are used individually and used together. 4.3 Identify important sounds that EFL learners will make that are associated with the two verb tenses.</p>\n<h5>English verb tenses and language structures used to discuss future events.</h5>\n<p>5.1 Identify the form and structure of the associated verb tenses and language structures 5.2 Identify the contexts in which they are used. 5.3 Identify important sounds that EFL learners will make that are associated with the associated verb tenses and language structures.</p>\n<h5>The passive voice and the active voice</h5>\n<p>6.1 Identify the form and structure of the passive and the active voice in all verb tenses and structures in the English language. 6.2 Identify the contexts where we are more likely to use the passive voice as opposed to the active voice. 6.3 Identify important sounds that EFL learners will make that are associated with both the passive and the active voice.</p>\n<h5>Conditional sentences</h5>\n<p>7.1 Identify the form and structure of the four types of conditional sentences and mixed conditional sentences. 7.2 Identify the contexts in which they are used. 7.3 Identify important sounds that EFL learners will make that are associated with the four types of conditional sentences.</p>\n<h5>Summary of Course Outline</h5>\n<p>We have designed and improved our TEFL Training Course over the past 11 years. At first glance it appears a bit overwhelming. However, we have a very organized and effective course schedule and have an overwhelmingly successful completion rate. We not only provide all the basis that any in-class TEFL, CELTA, or TESOL course provides, but also include cultural awareness training throughout the course, and a culture day on the Friday of the first week.</p>\n</div>","title":"4 Week TEFL Training Course in Chiang Mai"}},"pageContext":{"id":"5b95f4f087be05832749013c"}}