{"data":{"mongodbDatabaseArticles":{"id":"5b937b2687be056953db7d2c","content":"<div><h1 name=\"69c1\" id=\"69c1\" class=\"graf graf--h3 graf--leading graf--title\">A Nomad&#8217;s Guide to Staying&#160;Fit</h1><p class=\"aspectRatioPlaceholder-fill\"></p><img class=\"graf-image\" src=\"https://cdn-images-1.medium.com/max/1600/1*YQHwnDrfdMt07gArXWEcgg.jpeg\"><p name=\"4110\" id=\"4110\" class=\"graf graf--p graf-after--figure\">I&#8217;ve been location independent since 2004, and a full-time nomad off and on ever since. Staying healthy on the road is probably one of my biggest challenges, and I certainly don&#8217;t claim to have it all figured out! But I have learned a lot over the years, so in this post I&#8217;m bringing together a bunch of different resources to help other nomads and aspiring nomads stay healthy on the road.</p><p name=\"783d\" id=\"783d\" class=\"graf graf--p graf-after--p\">It should go without saying, but I&#8217;ll say it anyway: I am not a personal trainer, a doctor, or an expert! Consult a health professional before beginning any new exercise program.</p><h3 name=\"132e\" id=\"132e\" class=\"graf graf--h3 graf-after--p\">Exercising on the&#160;Road</h3><p name=\"1e6b\" id=\"1e6b\" class=\"graf graf--p graf-after--h3\">Obviously the most important thing for nomads is to choose activities that don&#8217;t require any heavy equipment&#8202;&#8212;&#8202;we sure don&#8217;t want to haul around a weight set (although that might be good exercise in and of itself)!</p><p name=\"d56d\" id=\"d56d\" class=\"graf graf--p graf-after--p\">Lucky for us, we already have one piece of effective equipment that we carry around with us all the time: our own weight. Bodyweight exercises are a great tool for staying healthy on the road because they don&#8217;t require any special equipment. <a href=\"http://renegadehealth.com/blog/2011/02/08/top-10-bodyweight-exercises/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">This video</a> and <a href=\"http://zenhabits.net/minimalist-fitness-how-to-get-in-lean-shape-with-little-or-no-equipment/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">the tips here</a> (with videos) are a good start, and you can search &#8220;bodyweight exercises&#8221; on YouTube to turn up a bunch more. In the <a href=\"http://www.nomadtopia.com/136\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">most recent episode of Nomadtopia Radio</a>, my guests recommended the book <a href=\"https://www.amazon.com/Convict-Conditioning-Weakness-Using-Survival-Strength-ebook/dp/B004XIZN5M/ref=sr_1_1?ie=UTF8&amp;qid=1525996874&amp;sr=8-1&amp;keywords=convict+conditioning\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Convict Conditioning</a>, which focuses on bodyweight exercises.</p><p name=\"746a\" id=\"746a\" class=\"graf graf--p graf-after--p\">I used to travel with a <a href=\"http://www.amazon.com/gp/product/B0026PMD70/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0026PMD70&amp;linkCode=as2&amp;tag=nomadtopia-20\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">resistance band</a> (the Dyna-band style, which is just a long strip of rubber, no handles or anything extra; they come in different resistance levels), which is really great for travel: it takes up virtually no space in your bag, weighs hardly anything, and can be used for lots of different exercises, plus there are a lot of resistance band workout videos on YouTube. My husband and I now travel with a few pieces from a fancier <a href=\"http://www.amazon.com/gp/product/7245456313/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=7245456313&amp;linkCode=as2&amp;tag=nomadtopia-20\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">resistance-band set</a> with tubes of different resistance levels, interchangeable handles, and a door mount, though I focus more on bodyweight exercises or getting to the gym these days.</p><p name=\"8ede\" id=\"8ede\" class=\"graf graf--p graf-after--p\">When you&#8217;re in sightseeing mode, you might naturally stay fit by spending a lot of time walking around a new city. In fact, there are a lot of ways to learn more about a local culture or see the sights and get some exercise at the same time: rent a bicycle and tour around, take classes in the local traditional dance, join a pick-up game or morning calisthenics in the park, try a popular local sport, chase a dog down the beach, or go on a kayaking or hiking excursion.</p><p name=\"3dd7\" id=\"3dd7\" class=\"graf graf--p graf-after--p\">If your current activities are more sedentary (say, working on a new website or taking long bus rides), you&#8217;ll have to make more of an effort to be active. Running is a great no-equipment sport, as long as you travel with a good pair of running shoes (or give <a href=\"http://zenhabits.net/barefoot-running/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">barefoot running</a> a try).</p><p name=\"0b89\" id=\"0b89\" class=\"graf graf--p graf-after--p\">Keep in mind, however, that some places are not very running friendly (like the cobblestone streets and narrow sidewalks we encountered in San Miguel de Allende, Mexico, or oppressively hot and humid weather like we found in many parts of Southeast Asia and Central America). And, in some cultures, it is very unusual to see people (especially women) out jogging, so you might want to scope out the local situation before heading out for a run (do you see people exercising? where? what are they wearing?). I also suggest asking a local for good places to exercise, and letting someone know where you&#8217;re headed if you&#8217;re going alone. I often go for a walk or run without any money or ID on me, and have started to think that&#8217;s not such a good idea! I recently bought a little sports wallet that clips to my waistband so I can carry the essentials with me, just in case.</p><p name=\"bfd5\" id=\"bfd5\" class=\"graf graf--p graf-after--p\">Having access to a gym can be handy if you are in a place that&#8217;s not great for outdoor exercise or you prefer using free weights, weight machines, and/or cardio machines.</p><p name=\"8ced\" id=\"8ced\" class=\"graf graf--p graf-after--p\">I love to get out and walk (and sometimes run), but I&#8217;m also a longtime yogi. Sometimes I&#8217;ll go to a class wherever I am, but I often practice at home, either on my or with online classes from <a href=\"http://www.yogaglo.com\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">YogaGlo</a> or <a href=\"http://www.yogamazing.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">YOGAmazing</a>. I&#8217;ve also heard good things about <a href=\"https://www.youtube.com/user/yogawithadriene\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">Yoga with Adriene</a> on YouTube. My favorite mat from <a href=\"https://www.jadeyoga.com/collections/yoga-mats\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">JadeYoga</a> is too heavy and bulky to travel with, so I bought a thinner, lighter <a href=\"http://www.amazon.com/gp/product/B008R723AS/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B008R723AS&amp;linkCode=as2&amp;tag=nomadtopia-20\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener nofollow\" target=\"_blank\">travel mat</a> and some <a href=\"https://www.yogapaws.com/collections/yogapaws-full-sets\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Yoga Paws</a>; when I&#8217;m staying in one place for a while I sometimes buy a thicker mat. The main challenge I&#8217;ve found is that it can be difficult to find space, and quiet, to practice (especially if you&#8217;re sharing accommodations with others), but when I make the effort, it&#8217;s so worth it.</p><p name=\"17c4\" id=\"17c4\" class=\"graf graf--p graf-after--p\">In addition to all the great exercise videos available on YouTube or elsewhere online, there are lots of exercise apps out there. The ones I&#8217;ve used the most are the <a href=\"https://7minuteworkout.jnj.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">7-Minute Workout</a> (free) and <a href=\"https://aaptiv.com/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">Aaptiv</a> (my favorite right now, which I learned about from <a href=\"https://medium.com/@taragentile\" class=\"markup--user markup--p-user\" target=\"_blank\">Tara Gentile</a>, currently about $70/year). There are also personal trainers who work online via an app or Skype, so you can get your sessions in no matter where you go.</p><p name=\"b342\" id=\"b342\" class=\"graf graf--p graf-after--p\">If there are certain types of exercise that you prefer and want to stay consistent with, do your research and choose destinations where you can do them! If staying fit is important to you, it&#8217;s much better to take control of the situation rather than show up somewhere, discover there&#8217;s nowhere to go for a run, and just shrug your shoulders and let your routine slide.</p><h3 name=\"4a5b\" id=\"4a5b\" class=\"graf graf--h3 graf-after--p\">Beware the Vacation&#160;Mind-Set</h3><p name=\"247c\" id=\"247c\" class=\"graf graf--p graf-after--h3\">This is something I&#8217;ve talked to a lot of other nomads about (including in <a href=\"https://www.nomadtopia.com/annalong/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow noopener\" target=\"_blank\">this podcast episode</a>), and it&#8217;s something we often don&#8217;t realize right away: this is our real life, not vacation!</p><p name=\"d6ff\" id=\"d6ff\" class=\"graf graf--p graf-after--p\">If you&#8217;re anything like me, vacation is a permission slip to eat whatever you want and drink beer/wine/cocktails almost any time of day. Exercise isn&#8217;t something you schedule or take time out to do while you&#8217;re on vacation; it happens if it&#8217;s convenient and appropriate to your destination (walking around a new city, snorkeling, hiking, bike riding&#8230;).</p><p name=\"2afd\" id=\"2afd\" class=\"graf graf--p graf-after--p\">This is all well and good when you&#8217;re only on vacation for a week or two; you can go back to your normal (and presumably healthier) routines once you get home, and everything will go back to normal.</p><p name=\"35f3\" id=\"35f3\" class=\"graf graf--p graf-after--p\">But what if you&#8217;re a nomad or expat?</p><p name=\"a62a\" id=\"a62a\" class=\"graf graf--p graf-after--p\">If you&#8217;re traveling long-term, or living in another country for a period of time, it&#8217;s natural to have that vacation state of mind. But if you don&#8217;t snap out of it at some point, you&#8217;ll start to see (and feel) the effects.</p><p name=\"5be4\" id=\"5be4\" class=\"graf graf--p graf-after--p\">The next thing you know, none of the clothes you packed will fit anymore! (Trust me&#8212;I&#8217;ve been there.)</p><p name=\"467c\" id=\"467c\" class=\"graf graf--p graf-after--p\">To stay on top of your health goals (and perhaps even improve on them) while traveling or spending time overseas, I suggest setting some ground rules to help you avoid letting too much time pass with a vacation mind-set.</p><p name=\"16f1\" id=\"16f1\" class=\"graf graf--p graf-after--p\">For example, if you&#8217;re traveling slowly, you might allow yourself a week in each new destination to sample the local flavors and settle in without putting pressure on yourself to eat a certain way or exercise. Or you might be better off avoiding the vacation mind-set altogether and pledging to stick to the same patterns you follow at home. (And check out my conversations with experts below for their suggestions on this.)</p><p name=\"a2a5\" id=\"a2a5\" class=\"graf graf--p graf-after--p\">Pay attention to the things you do in a new destination that you wouldn&#8217;t do at home. For me, a big one is drinking cheap, crappy beer. When I&#8217;m at home, I&#8217;m quite picky about the beer I drink; I&#8217;d rather not drink at all than have some watered-down lager. But when I&#8217;m traveling, especially in hot climates, and the beer is ice-cold (and, often, cheaper than water), I&#8217;m all over it.</p><p name=\"761a\" id=\"761a\" class=\"graf graf--p graf-after--p\">After a while, I have to stop and remind myself that I wouldn&#8217;t drink that crap at home; when the road is my home, shouldn&#8217;t the same rules apply?</p><p name=\"8d8d\" id=\"8d8d\" class=\"graf graf--p graf-after--p\">Another pitfall nomads and expats need to watch out for is craving flavors from home. When I&#8217;m on the road, I sometimes find myself eating things like Doritos and Snickers that I would almost never eat at home in the States, simply because I&#8217;m eager for a familiar taste. Sometimes you just have to have it, but again, it&#8217;s best to try to keep it to a minimum.</p><p name=\"78f3\" id=\"78f3\" class=\"graf graf--p graf-after--p\">Recognizing your vacation tendencies, and reminding yourself that this is your life, not a vacation, can help you stay on track.</p><h3 name=\"7a8b\" id=\"7a8b\" class=\"graf graf--h3 graf-after--p\">The Experts Weigh&#160;In</h3><p name=\"06b4\" id=\"06b4\" class=\"graf graf--p graf-after--h3\">As I said at the beginning, this is a constant work in progress for me, and I don&#8217;t claim to have all the answers, so over the years I&#8217;ve talked with some people who are actually certified in this stuff or at least are doing a much better job of it than I am. Check out two of those conversations below:</p><p name=\"4203\" id=\"4203\" class=\"graf graf--p graf-after--p\">May 2018: Podcast interview with fitness and productivity experts Coleman and Kennedy Collins</p><p class=\"aspectRatioPlaceholder-fill\"></p><p class=\"iframeContainer\"></p><p name=\"85b2\" id=\"85b2\" class=\"graf graf--p graf-after--figure\">December 2012: Video conversation with Nathan Agin about healthy living on the road</p><p class=\"aspectRatioPlaceholder-fill\"></p><p class=\"iframeContainer\"></p></div>","title":"A Nomad’s Guide to Staying Fit – Amy Scott – Medium"}},"pageContext":{"id":"5b937b2687be056953db7d2c"}}