{"data":{"mongodbDatabaseArticles":{"id":"5b921d2487be0571ac1b0501","content":"<div><p></p><img class=\"size-full wp-image-10525\" src=\"http://nomadcapitalist.com/wp-content/uploads/2015/03/the-best-offshore-banks-world.jpg\" alt=\"The Best Offshore Banks in the world for 2015\" width=\"700\" height=\"466\"><p>Last updated January 30, 2017</p>\n<p>Dateline: Kuala Lumpur, Malaysia</p>\n<p>P.T. Barnum is widely noted for proclaiming that there is a sucker born every minute.</p>\n<p>By my count, there are more than 1 billion suckers in the western world right now, all of whom store the majority, if not all, of their wealth in an insolvent banking system.</p>\n<p>Forgive me if that sounds harsh, but the reality is that many Western banks could go bust at any minute.</p>\n<p>Now before we get carried away, let me clarify that I am all for diversification. I&#8217;ve even said that US banks are worthy of strong consideration <a href=\"http://nomadcapitalist.com/2016/10/31/why-have-us-bank-account/\">for business banking</a>. That said, the key word is &#8220;diversification&#8221;, of the carefully crafted and cautious kind.</p>\n<p>Sadly, most Westerners believe their government will solve ANY problem that comes up. Twelve or thirteen years of government schooling have conditioned the average American or westerner to believe that the people in your home country&#8217;s capital will find a way out of even the most potent financial meltdown.</p>\n<p>While I&#8217;m not suggesting that you should move your entire life savings to the safety of an offshore bank, I am saying that the risk that the US, Canadian, or European banking systems could see serious hiccups and lose depositor savings is a real possibility, particularly in the wake off bail-ins and other denial of service incidents in places like Cyprus and Greece.</p>\n<p>The idea behind offshore banking is jurisdictional diversification to ensure return OF capital in addition to better return ON your deposited capital.</p>\n<h1>What is an offshore bank?</h1>\n<p>The reality is that any foreign bank in a jurisdiction other than your own can be considered an &#8220;offshore bank&#8221;. Plenty of multinational banks like HSBC operate in a number of countries, and having a bank account with one of these banks is just as &#8220;offshore&#8221; as working with a bank that only operates in, say, Panama.</p>\n<p>That doesn&#8217;t mean that HSBC is the best offshore bank &#8211; in fact, HSBC is among the <a href=\"http://nomadcapitalist.com/2016/08/29/how-to-close-overseas-bank-account/\">worst banks on earth</a> &#8211; but merely that a US person banking with HSBC Hong Kong has an offshore account.</p>\n<p>Offshore banks have long had a reputation for being in shady, lawless &#8220;third world countries&#8221; on half-deserted islands. While it&#8217;s true that small countries with few natural resources often turn to the offshore financial sector as a way to generate revenue, there are now dozens of countries with reputable offshore centers.</p>\n<h1>Where are the best offshore banks?</h1>\n<p>Recently, my team and I went through a list of hundreds of banks in about 40 countries around the world in search of the best offshore banks with which anyone can open an account.</p>\n<p>Our criteria were simple: not only did the banks need to be stable, but the jurisdictions they operated in needed to be so as well.</p>\n<p>That means countries that respect capital and even go out of their way to attract it. Countries <a title=\"Things Singapore understands&#8230; but the West doesn&#8217;t\" href=\"http://nomadcapitalist.com/2015/01/20/things-singapore-understands-west-doesnt/\">like Singapore</a> that realize that their lack of oil and other resources, such as endless land, leave them in need of a way to bring in revenue.</p>\n<p>Increasingly, some of the best banks in the world are located in the Middle East. Middle Eastern banks are frequently capitalized far better than Western banks that are stuffed with worthless paper. Middle Eastern banks can also be easier to deal with once you have a business relationship with them, especially if you&#8217;re on the up-and-up.</p>\n<p>Banque Audi in Lebanon, for instance, has gained a reputation among many experts as a top place to park your cash. Banks in Qatar, namely Qatar National Bank, are off limits to Americans and some other foreigners, but do have an excellent reputation.</p>\n<p>And of course, Dubai has plenty of banks in the same way Hong Kong or Singapore do; some good, some bad.</p>\n<p>While Germany is statistically <a title=\"The 5 safest countries to bank offshore\" href=\"http://nomadcapitalist.com/2014/04/27/top-5-safest-countries-to-bank-offshore/\">the safest place to bank</a> in terms of the number of well-capitalized institutions, there are plenty of low-tax countries such as those in the Middle East, Asia, the Caribbean, and even Africa that beat out European banks.</p>\n<p>This is even more true considering that many Western European banks expanded heavily into Eastern European economies that have produced horrible results like Croatia, Greece and Albania.</p>\n</div>","title":"The best offshore banks for 2015 (even for Americans)"}},"pageContext":{"id":"5b921d2487be0571ac1b0501"}}