{"data":{"mongodbDatabaseArticles":{"id":"5b95ee2887be0583274900cd","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Cost of Grocery Shopping in Thailand</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><a title=\"Cost of Grocery Shopping in Thailand\" href=\"https://www.tielandtothailand.com/cost-grocery-shopping-thailand/\"><img class=\"aligncenter wp-image-10859 size-full\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Grocery-Shopping-in-CM-header2.png?resize=562%2C427&amp;ssl=1\" alt=\"Grocery Shopping in Thailand\" width=\"562\" height=\"427\"></a></p>\n<p>Although it&#8217;s not the most exciting topic, we admit being pretty intrigued by grocery shopping in Thailand before moving here. Things we wanted to know included: How much does&#160;produce cost? Is meat really butchered in front of our eyes or is it in a pretty sterile package like&#160;it is back home? What is the availability of Western spices or an infamous jar of&#160;peanut butter? Whether or not you&#8217;re one to enjoy this domestic task, you may be pleasantly surprised at what can be found in Thailand&#8217;s markets and grocery stores and at what cost.</p>\n<p><strong></strong></p>\n<h2><p>Shopping in Thailand&#8217;s Grocery Stores</p></h2>\n<p>Thailand has several popular grocery store chains that very closely resemble what we are familiar with back home. You know, the kind with white tiled floors and bright lights and beautifully organized and labeled packaged goods. A few popular grocery store chains in Thailand include Tesco Lotus, Big C, Makro, and Tops Market.</p>\n<p><img class=\"aligncenter size-full wp-image-10863\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Rimping3.jpg?resize=563%2C374&amp;ssl=1\" alt=\"Rimping, a fantastic international grocery store in Thailand\" width=\"563\" height=\"374\"></p>\n<p>We still shop at these grocery stores and did so particularly a lot when we first moved to Thailand before we became&#160;comfortable shopping at&#160;Thai markets. We&#8217;re happy to find things like bread and yogurt and pasta and various imported fruits (apples and grapes) and vegetables (lemons and celery). Oddly though, <a title=\"Overcoming Culture Shock in Thailand\" href=\"https://www.tielandtothailand.com/overcoming-culture-shock-thailand/\">we&#8217;ve never managed to find a pantry staple like chicken stock</a>, and it&#8217;s difficult to find&#160;cheese other than Kraft Singles. Now a days, we keep our food purchases at grocery stores to a minimum and mostly stick to buying household items like trash bags, sponges, and cat food.</p>\n<p>It wasn&#8217;t until six months after we moved to Chiang Mai that we finally decided to explore an international grocery store called Rimping. We felt like we won&#160;the lottery! Every once in a while we treat ourselves to a shopping spree here and indulge in hard-to-find items like chocolate covered coffee beans, whole wheat pasta, a fresh wedge of Parmesan cheese, or steak. Who could&#160;resist foods&#160;like these?</p>\n<p><img class=\"aligncenter size-full wp-image-10855\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Grocery-Shopping-in-CM-1.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Receipt from Rimping, a popular international grocery store in Chiang Mai\" width=\"563\" height=\"422\"></p>\n<p>Rimping is incredible. It has&#160;a bakery featuring freshly baked baguettes, scones, and our personal favorite, soft sourdough pretzels. It has a kickin&#8217;&#160;seafood and meat department and an entire aisle dedicated to&#160;pasta. There are tons of canned and jarred goods like beans, sauces and spreads, as well as pickles and olives. They even have a baking aisle and another dedicated to imported cheeses.</p>\n<p>The&#160;produce section&#160;features some hard to find items like asparagus, zucchini, and lettuce, as well as impossible to find items like peaches and Italian basil. Rimping is&#160;amply stocked with familiar toiletries and grooming products, and even our cat can count on food imported from the USA in which&#160;the first ingredient isn&#8217;t corn or rice.</p>\n<p>Here&#8217;s a look at our latest purchase. For about four bags worth of groceries, we spent 2,444 baht ($75 USD). Obviously it&#8217;s not the price that&#8217;s impressive, it&#8217;s the stuff we were able to buy while grocery shopping in Thailand.</p>\n<p><img class=\"aligncenter size-full wp-image-10853\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Grocery-Shopping-in-CM-5.jpg?resize=563%2C412&amp;ssl=1\" alt=\"Grocery Shopping in Thailand's international grocery store, Rimping.\" width=\"563\" height=\"412\"></p>\n<p><img class=\"aligncenter size-full wp-image-10865\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Shopping-in-Thailand-prices.jpg?resize=562%2C410&amp;ssl=1\" alt=\"A grocery list from Thailand's international grocery school, Rimping.\" width=\"562\" height=\"410\"></p>\n<p>We usually don&#8217;t buy fruits or veggies at Rimping&#160;if we can buy it at a Thai market, but it&#8217;s&#160;refreshing&#160;to see that the packages advertise &#8220;pesticide free&#8221; produce, which invariably is an issue here in Thailand.</p>\n<p>There is, inevitably, a premium to be paid to have access to familiar brands that are otherwise completely unobtainable from Thai markets. After getting over the sticker shock, we are thankful to have a place like Rimping&#160;to shop at when we are looking to cook some old recipes or indulge in favorite pastime snacks.</p>\n<h2><p>Grocery Shopping in Thailand&#8217;s Markets</p></h2>\n<p>We do 80% or more of our grocery shopping at our local market.&#160; Conveniently, it&#8217;s just a one or two minute walk down a little back road. We wish we could say we shopped at our local farmer&#8217;s market back home, but most of the prices were much higher than our old grocery store, so we only shopped there a few times a month.</p>\n<p>As with most Thai markets, ours sells fresh food and non-commercially packaged food. It has about seven or eight different vegetable vendors, three or four different fruit vendors, and about a dozen vendors specializing in either chicken, beef (er, water buffalo?), pork, fish, or shellfish. We can get three chicken quarters for around 80 baht (almost $3 USD) or four chicken breasts for 60 baht ($2 US).</p>\n<p><img class=\"aligncenter size-full wp-image-10878\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/market.jpg?resize=563%2C422&amp;ssl=1\" alt=\"Grocery shopping at Thailand's fresh produce markets\" width=\"563\" height=\"422\"></p>\n<p>There are many items that come in plastic bags rubber-banded shut. This includes freshly made wheat and rice noodles and wontons, pickled vegetables, fresh curry pastes, and eggs in packs of ten. For a mere 5 baht ($0.15 USD) there are tiny bags of garlic, scallions, sesame seeds, and both fresh and dried chilies. Herbs come in generous sized bundles for 5 baht as well. We remember paying $3 to 4 USD back home for a small-sized bundle of cilantro or basil. The price difference is incredible!</p>\n<p>Other things we can typically find include bags of white, brown, or cane sugar, dry spaghetti, and nuts, as well as coconut milk and various bottles of fish sauce, soy sauce, and chili sauce. We&#8217;ve also seen small bags of dry cat and dog food and bird seed and household items like sponges, cleaning agents, twist ties, etc.</p>\n<p>As it happens maybe once a week or so, we will <a title=\"Three Cheap Thai Food Options\" href=\"https://www.tielandtothailand.com/cheap-thai-food/\">buy cooked dinner right from the market</a>. Whether it is sweet green curry and rice, slow cooked pork leg, or chicken and veggie stir-fry, it&#8217;s hard to beat the price (30 baht! $1 USD) and convenience.</p>\n<p>Although this size of our&#160;purchases at Thai markets are smaller than our splurges at Rimping, here are two examples of our latest purchases from our Thai market:</p>\n<p>This first batch cost us 120 baht ($4 USD) and included three snacks (fried bananas, fresh spring rolls, and sesame bean dough puffs) and brown rice, two&#160;chicken quarters, peppers, celery, onions, and tomatoes. We used these ingredients to make chicken gumbo.</p>\n<p><img class=\"aligncenter size-full wp-image-10851\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Grocery-Shopping-in-CM-2.jpg?resize=563%2C355&amp;ssl=1\" alt=\"Fresh produce and snacks after grocery shopping in Thailand at a local market.\" width=\"563\" height=\"355\"></p>\n<p><a href=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Shopping-in-Thailand-prices-Thai-market2.jpg?ssl=1\"><img class=\"aligncenter size-full wp-image-10868\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Shopping-in-Thailand-prices-Thai-market2.jpg?resize=562%2C392&amp;ssl=1\" alt=\"Cost of Shopping in Thailand's Thai market\" width=\"562\" height=\"392\"></a></p>\n<p><img class=\"aligncenter size-full wp-image-10852\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2014/11/Grocery-Shopping-in-CM-3.jpg?resize=563%2C393&amp;ssl=1\" alt=\"Fresh chicken, eggs, and produce after grocery shopping Thailand's open aired markets\" width=\"563\" height=\"393\"></p>\n<p>The second batch cost us 270 baht ($9 USD), and included three chicken quarters, eggs, Thai basil, mushrooms, watermelon, Western green beans, mangosteen fruit, and a packet of curry seasoning.</p>\n<p>Grocery shopping in Thailand&#8217;s markets is affordable and we&#8217;ve grown to like the big mounds of produce and interesting cuts of fresh meat. We admit that it takes a bit getting used to finding what we&#160;needed and seeing everything so raw.</p>\n<p>It&#8217;s also inevitable that at times we&#8217;ve gone to the market with a particular meal in mind only to be disappointed that we can&#8217;t find a certain vegetable or that a cut of meat we want is sold out. But that&#8217;s life when you live in a society that believes in fresh, in-season produce.</p>\n<p>So what do you think? Are you happy to know that Thailand has more than just open aired markets at which to grocery shop? What things are you curious about finding? Or what foods&#160;are you worried about not finding in Thailand?</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Cost of Grocery Shopping in Thailand"}},"pageContext":{"id":"5b95ee2887be0583274900cd"}}