{"data":{"mongodbDatabaseArticles":{"id":"5b95eded87be0583274900c0","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">Bangkok Vegetarian Festival</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-18531\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Bangkok-Vegetarian-Festival.png?resize=1000%2C550&amp;ssl=1\" alt=\"Chinatown Bangkok Vegetarian Festival\" width=\"1000\" height=\"550\"><br>\nOver the years, we&#8217;ve gotten better at marking our calendars with the local Thai holidays. One of the more colorful celebrations that come to mind (and one that we happened to accidentally walk right into the middle of&#160;twice) is the Bangkok Vegetarian Festival in Chinatown.</p>\n<p>Locally known as Tesagan Gin Jay (&#3648;&#3607;&#3624;&#3585;&#3634;&#3621;&#3585;&#3636;&#3609;&#3648;&#3592;), this nine-day meat-free Chinese festival is celebrated by Thais with and without Chinese ancestry. Also known as the Nine Emperor Gods Festival, it occurs during the ninth lunar month of the Chinese calendar year. The exact date changes each year but it typically falls in October. <strong>This year, the 2018 Vegetarian Festival will be held from 8 to 17 October.</strong> Mark your calendars!</p>\n<p>The largest celebrations are in Bangkok and Phuket, although other places such as Chiang Mai, Trang, Krabi, and Chonburi put on quite a show, too.</p>\n<p><img class=\"aligncenter size-full wp-image-18534\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Parade-at-Bangkok-Vegetarian-Festival.jpg?resize=1000%2C714&amp;ssl=1\" alt=\"Parading down Yaowarat Road at the Bangkok Vegetarian Festival\" width=\"1000\" height=\"714\"></p>\n<p>Aside from the sounds of banging drums and crashing symbols, there are some telltale signs that the Vegetarian Festival is in town.</p>\n<p>Look for strings of yellow and red triangle-shaped flags draped across buildings, dangling off food stalls, and plastered on restaurant windows. They are Crayola yellow and feature two letters, &#3648;&#3592; (pronounced jay),&#160;in fire engine red.</p>\n<p>People in Thailand, especially those who have Chinese ancestry, practice jay. They wear white and are actively mindful of their actions and thoughts. Those participating will refrain from eating meat to cleanse their body. They are also not allowed to kill anything and must abstain from drinking alcohol, lying, stealing, having sex, and gambling during those nine days.</p>\n<p>Temples within Chinatown, Bangkok are decorated with lanterns, candles, and burning incense. You can quietly observe people making merit at the Mangkon Kamalawat Temple and the Chow Sue Kong Shrine.</p>\n<h2><p>Vegan Food at the Bangkok Vegetarian Festival</p></h2>\n<p>Gin Jay&#160;roughly translates to &#8220;eat vegan food.&#8221; <strong>Even though this event is called the&#160;Vegetarian Festival, the holiday is strictly vegan.</strong></p>\n<p><img class=\"aligncenter size-full wp-image-18530\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Stir-fry-at-Bangkok-Vegetarian-Festival.jpg?resize=1000%2C714&amp;ssl=1\" alt=\"Thai-Chinese stir fry with morning glory, fried mushrooms, and thin rice noodles\" width=\"1000\" height=\"714\"></p>\n<p>Gone are the dishes with stir-fried shrimp, grilled pork, and deep-fried chicken. No more moo gata (Thai-style BBQ) or the skewers of bite-sized meat or sausages. No sweetened condensed milk in Thai iced tea or drizzled on roti and ice cream. Le sigh. Although to be completely honest, we&#8217;d be ok if we never saw another fish ball or Thai hot dog again.</p>\n<p>Instead, participating restaurants and food stalls serve up dishes completely without red meat, pork, poultry, and seafood of any kind. And because it&#8217;s really a vegan festival, vendors also go one step further and refrain from cooking with animal products. <strong>This means no eggs, dairy products, honey, fish sauce, oyster sauce, or shrimp paste.</strong> Many of the prepared dishes leave out pungent ingredients such as onions and garlic, too.</p>\n<p><img class=\"aligncenter wp-image-18532 size-full\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Noodles-at-Bangkok-Vegetarian-Festival.jpg?resize=1000%2C714&amp;ssl=1\" alt=\"Mushrooms, tofu, and wide rice noodles serve up at the Bangkok Vegetarian Festival \" width=\"1000\" height=\"714\"></p>\n<p>You&#8217;ll find temporary food stalls and permanent restaurants selling bite-sized veggie dumplings, bowls of steaming noodles, and sweet desserts swimming in coconut milk. There&#160;are piles of deep fried spring rolls and steamed gyoza. Some dishes contain obvious meat substitutions such as mushrooms, tofu, and taro (a type of starchy root vegetable). Others contain savory bites you&#8217;ll swear are the real deal.</p>\n<p>Thailand is known for being vegan- and vegetarian-friendly year round. However, the Bangkok Vegetarian Festival is the place to enjoy vegan delicacies if that&#8217;s what you&#8217;re into.</p>\n<h2><p>Dragons, Fire Crackers, and Food Stretching Into Oblivion</p></h2>\n<p>Call us lucky but we&#8217;ve actually experienced the Bangkok Vegetarian Festival two times without prior planning.</p>\n<p><img class=\"aligncenter size-full wp-image-18533\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Dragons-at-Bangkok-Vegetarian-Festival.jpg?resize=1000%2C1000&amp;ssl=1\" alt=\"Mythical dragons parading down the streets of the Bangkok Vegetarian Festival\" width=\"1000\" height=\"1000\"></p>\n<p>The first time we had plans to meet up with some friends and long-time Bangkok residents, <a href=\"http://www.mickshippen.com/2014/07/scenes-from-yaowarat-bangkok/\" target=\"_blank\" rel=\"noopener\">Mick Shippen</a> and <a href=\"http://www.mythailandphotos.com/vegetarian-festival-parade-in-bangkok/\" target=\"_blank\" rel=\"noopener\">Richard Barrow</a>. We were in town for a personal trip and had no idea the Bangkok Vegetarian Festival was happening. They let us know and within the hour we were on our way to Chinatown.</p>\n<p>After cutting through a nearly empty neighborhood in Chinatown, we suddenly found ourselves in the middle of a parade. There were dancers in traditional Chinese dress, long dragons, incredibly loud firecrackers, and pounding drums within the skinny sois of Bangkok. The performers and musicians eventually dumped into the main parade on the multi-laned Yaowarat Road.</p>\n<p><img class=\"aligncenter size-full wp-image-18535\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2017/08/Chinese-performers-at-Bangkok-Vegetarian-Festival.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Chinese performers at Bangkok Vegetarian Festival\" width=\"1000\" height=\"550\"></p>\n<p>Another year we were taking a late night food tour. The last stop happened to take us right into the heart of Chinatown. We missed the parade, but permanent restaurants and temporary food stalls serving up jay food flanked both sides of the road. It was sweltering hot and steamy, but we managed to grab a table and dig into some tasty noodle dishes.</p>\n<p><strong>For all you meat eaters, this festival provides an easy way to sample foods that you may otherwise not eat.</strong>&#160;We thought that some of the plant-based &#8216;meat&#8217; came very close to the real thing. Others (like the tofu shrimp)&#8230; well, not so much. Overall it was a great way to sample several vegan dishes that we were unfamiliar with all at one time.</p>\n<p>If vegan food isn&#8217;t for you, you can still eat normal meaty fare throughout the rest of Bangkok. That is&#160;unless your favorite restaurants and food stalls happen to be along Yaowarat Road in Chinatown. Then you may have to wait a bit.</p>\n<h2><p>How to get to the Bangkok Vegetarian Festival</p></h2>\n<p>The festivities and food stalls are concentrated in Bangkok&#8217;s Chinatown, which is close to the Grand Palace. The festival and parade are along Yaowarat Road between the Odeon Circle and the Chalerm Buri&#160;intersection. During the holiday, that road is closed off and vendors start popping up around 4 pm. A bit further away on Charoen Krung Road Soi 20 (near the Chinese Opera performance at the Chow Sue Kong Shrine), you&#8217;ll find more vendors serving up tasty vegan treats.</p>\n<p>You can get there by taking Bangkok&#8217;s underground metro (MRT) all the way to the west-most stop at Hua Lamphong. From there, take a short taxi ride or a 15-minute walk to the entrance at the Chinatown Gate.</p>\n<p>You can also take Bangkok&#8217;s Skytrain (BTS) to Saphan Taksin. A large flight of stairs exits the Saphan Taksin BTS stop, which ends conveniently at the riverside Sathorn Central Pier. From there, you can hop on the <a href=\"http://www.chaophrayaexpressboat.com/en/services/\">Chao Phraya&#160;Orange Flag Express Boat</a> and take a 5-minute boat ride that costs 15 baht to the Rachawong N5 Pier. (Get on the orange flag boat that goes right &#8216;up&#8217; the river, not left &#8216;down&#8217; the river). It&#8217;s a 10-minute walk to Yaowarat Road from there.</p>\n<p></p>\n<p>The Vegetarian Festival is one of the many seasonal events in Bangkok. This article is sponsored by Accor. For more things to do and places to stay in Thailand&#8217;s capital city, check out their&#160;<a href=\"https://www.accorhotels.com/gb/travel-guide/bangkok/index.shtml\" target=\"_blank\" rel=\"noopener\">Travel Guide to Bangkok</a>.</p>\n<p><strong>Have you ever tried vegan food? If you&#8217;ve been to a vegetarian festival in Thailand, what was your favorite dish?</strong></p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"Bangkok Vegetarian Festival"}},"pageContext":{"id":"5b95eded87be0583274900c0"}}