{"data":{"mongodbDatabaseArticles":{"id":"5b962a0887be0583274911ca","content":"<div><p>Have you ever read my blog and thought &#8220;I could do that! I travel a lot and take good pictures, too&#8221;. While travel blogging isn&#8217;t as simple as traveling and taking photos, it actually is the start of a budding career! When I started my travel blog, that was my only skill and I wasn&#8217;t even very good at photos back then. This post is going to share exactly how to start a travel blog from scratch the easiest and CHEAPEST way, step by step.</p><p>In case you don&#8217;t know me or my blog, I feel like I should tell you a little bit about why you should trust me on these tips on how to start a travel blog. I started my travel blog, Hippie in Heels, in 2013 and within 6 months as was one of the <a href=\"http://www.theexpeditioner.com/the-top-50-travel-blogs/\">top 50 travel blogs in the world</a>, which at that time I made the list with around 65,000 unique monthly views a month. That&#8217;s a lot for just a new blogger, six months in. Fast forward to now and I&#8217;m still on the list and have worked with travel brands and tourism boards I had only dreamed about back then &#8211; and now make nearly 2x (almost 3x) times more annually than I did pre-blogging when I was a nurse. Right now, I average around 230,000 unique monthly views on my blog and have a combined 200,000+ social media followers.</p><blockquote><p>I knew literally NOTHING about blogs or travel blogging when I started mine and googled my way through everything. It is 100% possible to create a travel blog and become successful financially even if you know nothing about it. <strong>I&#8217;m proof of that.</strong></p></blockquote><h1>How to Start a Travel Blog from Scratch</h1><h2>1. Pick Your Niche</h2><p>It&#8217;s important that you think about why you are starting this blog and what will make you stand out from other blogs. When I started, there were so few travel blogs that having a niche other than &#8220;travel&#8221; wasn&#8217;t that important. Now, it&#8217;s important. Are you into adventure travel? vegan travel? gluten-free travel? Travel in a specific destination only? Learn more about niches <a href=\"http://thetravelhack.com/blogging/how-to-find-your-travel-blogging-niche/\" target=\"_blank\" rel=\"noopener\">here</a>.</p><h2>2. Name Your Travel Blog</h2><p>It&#8217;s something you want to narrow down but not pigeon hole yourself. There are a million blogs like Backpacker Bob or Budget Backpacker&#8230; these are lame and you should stay away from them! Not only are they lame, but they are overused, and if you do then you&#8217;ll be stuck &#8220;backpacking&#8221; forever or doing an expensive, complicated rebranding down the line. Don&#8217;t choose anything that is similar to another successful travel blogger because they will always outrank you on Google. Think about who you are as a person and try to make your personality come through.</p><p>I got Hippie in Heels because my friends and I put a list together of words that describe me and Hippie combined with heels showed how I am two different people (a true Gemini) and my niche became <a href=\"https://hippie-inheels.com/travel-to-india-made-easy/\">India travel</a> and Boho Chic vibes. After a year, my tagline became &#8220;a glamorous travel blog&#8221; but I&#8217;ve since gotten rid of that.</p><p>Here are some extra <a href=\"http://ohsheblogs.com/tips-for-choosing-a-perfect-blog-name/\" target=\"_blank\" rel=\"noopener\">tips on how to choose a blog name</a>.</p><h2>3. Choose the Domain &amp; Secure the Social Media Handles</h2><p>You have to choose the domain aka the URL or www in other terms. This is like &#8220;www.hippie-inheels.com&#8221;. For me, Hippie in Heels was taken by a breastfeeding website that was no longer active. I had to add the hyphen, but this is not recommended. I loved the blog name though and have no regrets!</p><p>You need to make sure that your name can be on Facebook, Twitter, and Instagram. If you choose a long blog name that makes it difficult. You can shorten it and abbreviate it but people won&#8217;t know what it is when they want to get in touch on the fly, which is annoying for them and will make them less likely to find and follow you. Go ahead and set up accounts in your new name on these platforms to secure them.</p><h2>4. Buy Your Hosting</h2><p>I wish I could say that you&#8217;ll buy hosting with a great host then never have to think about this again, but that&#8217;s not the case. As your blog grows, you will need more resources and will need a better hosting plan which often involves changing hosts. For beginners, <a href=\"https://www.bluehost.com/track/hippieinheels\">Bluehost</a> is the best and cheapest out there (don&#8217;t use GoDaddy, just my two cents). Once you hit around 50,000 UMV which takes most people at least a year, you might consider changing to <a href=\"https://www.siteground.com/index.htm?afcode=3e1e9ba24a35b29e650ff6e1ff1bf3f8\" target=\"_blank\" rel=\"noopener\">Siteground</a> which can handle more. I went from Siteground (who I loved but outgrew) to A2 Hosting (who I hated) to <a href=\"https://performancefoundry.com/ref/135/\">Performance Foundry</a> where I am now and am obsessed with. I pay $125/month to have servers that can handle my traffic and site size.</p><blockquote><p>I talked with Bluehost and asked them about a discount code and they offered one to my readers aka you! If you use <a href=\"https://www.bluehost.com/track/hippieinheels\">this link</a>&#160;to pay just $2.95/month. It&#8217;s normally $7.99.</p></blockquote><h3>There are some perks to starting with Bluehost and using <a href=\"https://www.bluehost.com/track/hippieinheels\" target=\"_blank\" rel=\"noopener\">my link</a>:</h3><ol><li>The discount code above makes it the cheapest option that actually has good support</li><li>They will give you the domain <p>FREE</p></li><li>You can install WordPress with just one-click (OMG, I wish I had this)</li><li>They offer a special 30-day money back guarantee</li></ol><p>I&#8217;m going to share screenshots now that will literally walk you through the entire setup. You can follow along and within 10 minutes you&#8217;ll have your blog totally ready to go. I am dying writing this because it took me weeks to figure this all out and I paid so much more, haha &#8211; how things have changed in the travel blogging world! I love how much information is now online about blogging.</p><p>To start, just click on this link and then click the green button that you see in the image below that says &#8220;get started now&#8221;.</p><p><img class=\"aligncenter size-full wp-image-25857\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-1.jpg?resize=1024%2C612&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"612\"></p><p>That will bring you to the next page where you can select the plan you want. You&#8217;re just starting out so select &#8220;basic&#8221; as you can see it allows loads of space to grow.</p><p><img class=\"aligncenter size-full wp-image-25863\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-7.jpg?resize=1024%2C759&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"759\"></p><p>Once you choose basic, then you continue by signing up. You will want to say &#8220;new domain&#8221; on the next page and type in the domain name you choose above. You will type in only the www.____ and then leave the rest blank as they fill in the .com. You can change the .com to .edu or whatever you want, but as a travel blog, I recommend keeping it as .com.</p><p><img class=\"aligncenter size-full wp-image-25864\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-8.jpg?resize=1024%2C575&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"575\"></p><p>After you click next, you have officially chosen your domain. Awesome! Now you have to pay. Just choose the account plan as &#8220;basic&#8221; like you already had but then decide how long you want to take it. &#160;As you can see it&#8217;s a mere $106 for THREE years (less than I pay a month now) or you can pay by the month.</p><p>*Hint: if you take the hosting for one year, then need to renew the prices often go up. This is the same with ALL hosts. So, I always take a longer time frame out, at least one year.</p><p>If you want, you can click SiteLock Security if you want. It&#8217;s more expensive, but it makes your site more secure which means it will show up higher in search results. Every blogger I know switched over this year as Google announced they were taking this very seriously. It means your blog will start with https instead of http. It&#8217;s a pain to change later and you can lose domain authority for months after the switch, so I recommend getting it ahead of time. Then just simply put in your payment information.</p><p><img class=\"aligncenter size-full wp-image-25865\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-9.jpg?resize=1024%2C626&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"626\"></p><h2>5. Install WordPress</h2><p>Bluehost will prompt you to set up WordPress, so just keep chugging along and follow the instructions. The first thing to do is make a password for your account and WRITE it down somewhere because you don&#8217;t want to lose this password.</p><p><img class=\"aligncenter size-full wp-image-25866\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-10.jpg?resize=1024%2C263&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"263\"></p><p>Just click &#8220;create your password&#8221; from the blue button above.</p><p>The following screen will appear:</p><p><img class=\"aligncenter size-full wp-image-25867\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-11.jpg?resize=1024%2C524&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"524\"></p><p>Once you hit next, it will say Congrats! Now you can log in.</p><p><img class=\"aligncenter size-full wp-image-25868\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-12.jpg?resize=1024%2C524&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"524\"></p><p>Once you log in, you&#8217;ll then get to make a few decisions about how your blog will look.</p><p>As part of the setup, Bluehost will suggest a few themes. Just choose any random one, because you&#8217;ll change this later.</p><p><img class=\"aligncenter size-full wp-image-25869\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-13.jpg?resize=1024%2C605&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"605\"></p><p>Once you choose a theme you can click &#8220;start building&#8221; as seen below. How exciting is this!?</p><p><img class=\"aligncenter size-full wp-image-25858\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-2.jpg?resize=1024%2C354&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"354\"></p><p>There are a few more choices to make. The screen below will be the first thing you see after you choose &#8220;Start Building&#8221;. You should click &#8220;Business&#8221; because I&#8217;m assuming the goal would be to make money? But, if you aren&#8217;t into that and just want this for a personal journal to show friends and family then you can choose &#8220;Personal&#8221; here.</p><p><img class=\"aligncenter size-full wp-image-25859\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-3.jpg?resize=1024%2C575&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"575\"></p><p>Almost done. You just need to make up a little name for the site. In my case, I would type in for Site Title &#8220;Hippie in Heels&#8221; and for Site Description &#8220;A Glamorous Travel Blog&#8221;. Think of the site description as your &#8220;tagline&#8221;. My first tagline was &#8220;an India travel blog&#8221;. This can always be changed later.</p><p><img class=\"aligncenter size-full wp-image-25861\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-5.jpg?resize=1024%2C546&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"546\"></p><p>Now the following page will pop up and you can easily click on the blue &#8220;Launch&#8221; button as seen below.</p><p><img class=\"aligncenter size-full wp-image-25860\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-4.jpg?resize=1024%2C583&amp;ssl=1\" alt=\"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)\" width=\"1024\" height=\"583\"></p><p>So, you are literally set now. Your blog is real and it&#8217;s live! You could click &#8220;Posts&#8221; on the left and start writing if you wanted to &#8211; but don&#8217;t. There is so much more you can do to make your blog special and you really should before you take any further steps.</p><p>You will want to know how to login if you exit out of this, so the way to do that is by going to www.yourdomain.com/wp-admin and a login will pop up. Just use the information and password you saved from the above account set up and login. You&#8217;ll see the same WordPress dashboard as above.</p><h2>6. Change the Theme</h2><p>Now, you can choose a free theme when you set up the Bluehost package, and this is the cheapest and easiest way by far BUT many people find changing themes stressful later on, including myself and I highly recommend purchasing a theme that you&#8217;ll be happy with for years. There are some things to consider when choosing a theme. You&#8217;ll want one that is highly customizable, responsive on mobile devices and is tested to be a theme that does not slow down the site speed.</p><p>I cannot say enough good things about my theme, <a href=\"https://themeforest.net/item/avada-responsive-multipurpose-theme/2833226?s_rank=1/?ref=arachel003\" target=\"_blank\" rel=\"noopener\">Avada</a>. It&#8217;s so customizable and I did a month of research before I settled on this theme, with the help of my developer. It&#8217;s capable of pretty much anything. You buy it one time and then own it &#8211; no monthly payments.</p><p><img class=\"aligncenter size-full wp-image-19670\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/10/Hippie-in-Heels-Theme-Screenshot-2.jpg?resize=1024%2C1024&amp;ssl=1\" alt=\"hippie in heels new theme\" width=\"1024\" height=\"1024\"></p><p>My homepage looks like the following image:<img class=\"aligncenter size-full wp-image-19669\" src=\"https://i1.wp.com/hippie-inheels.com/wp-content/uploads/2016/10/Hippie-in-Heels-Theme-Screenshot-1.jpg?resize=337%2C1024&amp;ssl=1\" alt=\"hippie in heels new theme\" width=\"337\" height=\"1024\"></p><p>It&#8217;s really easy to add a new theme. You can download the theme, then it will be in a zip file on your computer. Just click &#8220;Appearance&#8221;, then click on &#8220;Themes&#8221; then &#8220;Upload&#8221;. Now just drag and drop that file in. You&#8217;ll have to click something like &#8220;Install&#8221; to make it go live.</p><p>Now you can play and customize your site. I recommend just clicking on everything is the left side of your dashboard and getting a feel for where everything is before you start playing around.</p><p>You&#8217;ll want to know what comes with your theme because that could mean installing fewer plugins later.</p><h2>7. Install Necessary Plugins &amp; Design Your Site</h2><p>This is KEY and I have a blog post about the plugins I use on my site and what I use them for. You can read it here. Installing a plugin is easier than a theme. You just go to Plugins &gt; Add New &gt; then in the search bar search the plugin you want. You need to &#8220;install&#8221; and &#8220;activate&#8221; it. Once it&#8217;s activated it will show up under Settings &gt; and you can click on the plugin from that list and play with the plugin settings.</p><p>You do NOT want a million plugins. They do conflict with each other and can slow your site down. Use only what you NEED. Remember that if it can be coded in you should do that rather than add a plugin.</p><p>An example of this is if you have to redirect a URL. You can do this with a &#8220;redirect URL plugin&#8221; or you can add this directly&#160;on your server. It would take a developer a couple minutes to do and you could outsource this.</p><p>When it comes to design, you can play around and do this yourself by&#160;messing with theme&#160;settings. It&#8217;s very user-friendly inside WordPress so after an hour of fiddling, you&#8217;ll easily start to see how it all works. You could also hire someone, but it&#8217;s pretty pricey. I talk about my redesign (which I waited three years to do) in this <a href=\"https://hippie-inheels.com/hippie-in-heels-blog-makeover-three-years/\">blog post</a>.</p><p>Basically, the design draws people in and it will get you more views on your blog and make you look more legit: your logo, header, background. The plugins are what makes everything work. Plugins will add extras that are actually necessary like security, backing up your website content, resizing your images to keep site speed acceptable, and more. Again, I write about this in another blog post.</p><p>Set up the &#8220;pages&#8221; and &#8220;categories&#8221;. Your &#8220;about&#8221; page is very important. It should show people who you are and what this site is about. You can have other pages like I do (just check the top of my homepage). Categories are like &#8220;blogging&#8221;, &#8220;India&#8221;, or &#8220;Packing Tips&#8221;. Don&#8217;t just make this up willy-nilly, put some thought into how you want your site to be organized.</p><p>Below is my &#8220;Glamorous Globetrotting&#8221; page that has some of my top categories. When you write a blog post, you can choose a &#8220;category&#8221; of the post. For example, this one is under &#8220;Blogging&#8221;.</p><p><img class=\"aligncenter size-full wp-image-19672\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2016/10/Hippie-in-Heels-Theme-Screenshot-4.jpg?resize=971%2C1024&amp;ssl=1\" alt=\"hippie in heels new theme\" width=\"971\" height=\"1024\"></p><h2>8. Learn EVERYTHING about Travel Blogging</h2><p>When I started my blog there were no posts about starting a travel blog. I kid you not, it was just like diving into something completely clueless. I watched YouTube videos. I cried. It was a lot to take on when I knew nothing about computers and internet. I was as clueless as one could get. I figured it out but it was a stress. You can probably figure it out too!</p><p>If you want a shortcut, you can look into the <a href=\"http://superstarblogging.nomadicmatt.com/ref/117/\" target=\"_blank\" rel=\"noopener\">Superstar Blogging Course</a> by Nomadic Matt. He&#8217;s the number one travel blogger in the world and is probably a millionaire (guessing, but I bet so). It&#8217;s expensive but will give you all the secrets about travel blogging: how to make content go viral, how to get your blog ready for people to see it, how to set up a newsletter, rank on Google, work with brands, pitch brands, and make money. It&#8217;s a huge course with webinars from the top people in their fields and gives you access to a secret Facebook group where you can talk with other top travel bloggers and get advice directly from them. This course will put you 6 months to a year ahead of your competition. I wish there was something like this when I started blogging!</p><p>You are also going to want to read up on everything about travel blogging, join Facebook groups about travel blogging, network, meet other travel bloggers, comment on their blogs. Be a part of the &#8220;travel blogging world&#8221; which is huge.</p><h2>9. WRITE</h2><p>During all this, while you are learning, making your site WORK, and making it look good &#8211; you need to write. Personally, I set aside 6 hours every single day for three months and wrote and wrote&#8230; it was neverending. I wrote about all my travels. I used my journals as help when I forget where I stayed or ate. I didn&#8217;t go live until I had about 10 posts already live and 30 in my &#8220;pending&#8221; folder, ready to go.</p><p>You will need to edit images and have them added to your blog posts, too. This all takes a lot of time but it&#8217;s the fun part! Make sure you are using blogging tools like <a href=\"https://chrome.google.com/webstore/detail/grammarly-for-chrome/kbfnbcaeplbcioakkpcpgfkobkghlhen?hl=en\">Grammarly</a> for spell check and keeping SEO in mind (something Nomadic Matt&#8217;s course will teach you). Be sure to tell funny stories and be yourself!</p><h2>10. Go Public</h2><p>Once you have a bunch of posts live and have been networking on social media, it&#8217;s time to start sharing those blog posts with people. It&#8217;s time to show the world your travel blog!</p><h2>Pin how to start a travel blog for later:</h2><p><img class=\"aligncenter size-full wp-image-25870\" src=\"https://i2.wp.com/hippie-inheels.com/wp-content/uploads/2017/09/How-to-start-a-travel-blog-10-1.jpg?resize=683%2C1024&amp;ssl=1\" alt=\"Favorite blogging tools: chrome extensions too\" width=\"683\" height=\"1024\"></p><p>There are affiliate links in this post. I will make a commission with the purchase of some items mentioned here at no extra cost to you. I only promote things I belive in!</p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\">Related</h3></p><img width=\"594\" height=\"485\" src=\"https://i0.wp.com/hippie-inheels.com/wp-content/uploads/2016/12/EmailSidebar-01.png?fit=594%2C485&amp;ssl=1\" class=\" et_bloom_image_no_animation et_bloom_image\" alt=\"\"><p>Join my email list and get exclusive updates &amp; news straight to your inbox.&#160;</p><p>I will never give away, trade or sell your email address. You can unsubscribe at any time.</p><p class=\"et_bloom_fields\">  </p><p class=\"et_bloom_success_container\"> <p class=\"et_bloom_success_checkmark\"></p></p><h2 class=\"et_bloom_success_message\">You have Successfully Subscribed!</h2><p class=\"et_bloom_close_button\"></p></div>","title":"How to Start a Travel Blog From Scratch The Easy and Cheap Way (Just $2.95/Month)"}},"pageContext":{"id":"5b962a0887be0583274911ca"}}