{"data":{"mongodbDatabaseArticles":{"id":"5b9624c387be058327490efe","content":"<div><p class=\"nc_tweetContainer total_shares total_sharesalt\"><p class=\"swp_count\">15 <p class=\"swp_label\">Shares</p></p></p><a rel=\"nofollow noreferrer noopener\" class=\"nc_tweet noPop\"><p class=\"swp_count swp_hide\"><p class=\"iconFiller\"><p class=\"spaceManWilly\"><i class=\"sw swp_pinterest_icon\"></i><p class=\"swp_share\">Pin</p></p></p></p></a><p><img src=\"http://photos.foxnomad.com/Asia/Oman/Muscat/i-DzrDPcD/0/O/CIMG1346.jpg\" alt=\"muscat oman corniche\" width=\"1020\" height=\"765\"></p>\n<p>The other major cities in <a href=\"http://www.foxnomad.com/countries/bahrain-travel-information/\">the</a> <a href=\"http://www.foxnomad.com/countries/qatar-travel-information/\">Gulf</a> <a href=\"http://www.foxnomad.com/countries/united-arab-emirates-travel-information/\">states</a> have their fair share of corniches, which is a fancy French word for road by the water, one typically with a cliff on either side. Perhaps it&#8217;s the absence of skyscrapers looming on the horizon or nature&#8217;s inclusion of the rocky cliffs along the skyline, but Muscat, Oman&#8217;s corniche is visually unique in the region.</p>\n<blockquote><p>Muscat, and <a href=\"http://www.foxnomad.com/countries/oman-travel-information/\">Oman</a> in general, makes you feel like it&#8217;s a nation undercover. Hiding its wealthy status and oil money, along with throngs of visible tourists, it&#8217;s tough to be the wiser. There isn&#8217;t the modern <a href=\"http://www.foxnomad.com/2011/03/15/the-address-downtown-building-in-dubai-at-an-angle/\">blitz of metal like in Dubai</a>, or anything resembling the real-time metamorphosis of the landscape in Qatar. This militarily strategic tip of the country in the Gulf of Oman has seen the likes of the Persians and Ottomans, but now is a hub of jogging, shopping, and the drinking of endless amounts of highly sugared black tea.</p></blockquote>\n<p>These guys were much more lively the few hands before I shyly asked to take a video of their card game. (<a href=\"https://www.youtube.com/watch?v=llYg4nXsNjk\">Click here if you can&#8217;t see the video</a>.) I hung around a bit, trying to figure out the exact rules of what they were playing &#8211; and while I didn&#8217;t accomplish that, I learned to show up the next morning around 5am or so.</p>\n<p></p>\n<p>Immediately to the left, at the end of the main corniche path, is Muscat&#8217;s famous fish market. More than a seafood shopping paradise, it&#8217;s a social event and rather male-oriented gathering point. You&#8217;ll just have to get up very early to catch it &#8211; then relax afterward with some strong tea at one of the many inexpensive cafes outside of Mutrah Souk, which tends to get rolling later in the afternoon. The heart of Muscat&#8217;s pulse doesn&#8217;t beat from its markets or souks but rather just outside, along the calm waves of Oman&#8217;s coast; not to be confused with the concrete paradises of its northern neighbors.</p>\n<p class=\"swp-content-locator\"></p><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"></p></div>","title":"Sights And Sounds From The Gulf’s Best Corniche: Muscat, Oman"}},"pageContext":{"id":"5b9624c387be058327490efe"}}