{"data":{"mongodbDatabaseArticles":{"id":"5b95eed787be0583274900f9","content":"<div><p class=\"et_post_meta_wrapper\">\n\t\t\t\t\t\t\t<h1 class=\"entry-title\">A Week on a Mekong River Cruise</h1>\n\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t</p><p><img class=\"aligncenter size-full wp-image-16199\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/A-Week-on-a-Mekong-River-Cruise.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"A Week on a Mekong River Cruise\" width=\"1000\" height=\"550\"></p>\n<p>In April 2016 we were invited to experience&#160;Viking&#8217;s Magnificent Mekong River Cruise. The tour began in the city streets of Hanoi, Vietnam and took&#160;us into Cambodia and through several small country towns along the Mekong River before concluding in the Vietnamese capital of Ho Chi Minh City.&#160;Our favorite part of the tour was getting a glimpse&#160;of the rural life within both countries as we made our way down the Mekong.</p>\n<p>Although we&#8217;ve had our hearts set on going on a cruise at some point in our lives, neither of us had ever dreamed that our first cruise would be 1) a river cruise and 2) within the tropical jungles of Southeast Asia. But there we were, dodging the incessant&#160;crowds of Songkran and boarding our very first riverboat in mid-April.</p>\n<h2><p id=\"Day_1_Touring_the_MS_Viking_Mekong_Riverboat\"><p>Day 1: Touring the MS Viking Mekong Riverboat</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-16164\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Week-Long-Mekong-River-Cruise-with-Viking.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Boarding Viking's MS Mekong for our week long Mekong River cruise\" width=\"1000\" height=\"550\"></p>\n<p>This trip&#8217;s full itinerary was actually 15 days long but not all of it was by riverboat. In fact, before the cruise portion began we had spent six days touring the city streets&#160;in Hanoi and <a href=\"https://www.tielandtothailand.com/one-day-angkor-wat-siem-reap/\">temple hopping in Angkor</a>,&#160;so it was a treat to board the MS Viking Mekong in Kampong Cham, Cambodia and begin exploring this part of the world by way of river.</p>\n<p>The first day aboard we met the crew and captain, explored the ship&#8217;s&#160;layout, and had welcoming cocktails while watching the sunset on the Sun Deck. It felt like the start of a weekend with drinks in hand, a&#160;view of the river, and a soft evening breeze with no obligations.</p>\n<h2><p id=\"Day_2_Kampong_Cham_Cambodia\"><p>Day 2: Kampong Cham, Cambodia</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-16166\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Twin-Holy-Mountains-in-Kampong-Cham-Cambodia.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Twin Holy Mountains of Phnom Pros and Phnom Srey\" width=\"1000\" height=\"550\"></p>\n<p>Our first side trip was to the Twin Holy Mountains of Phnom Pros and Phnom Srey. This area is used&#160;by the local Cambodians for Khmer festivals and had intricate pagodas and temples to wander through. There&#8217;s a local folklore about the two&#160;mountains, which were believed to have been built in a competition between the men and women of the town to determine who&#160;would propose &#8211; men to women or women to men. The women won&#160;the competition and so the tradition of men asking for their hand in marriage remains.</p>\n<p><img class=\"aligncenter size-full wp-image-16167\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Sunset-in-Cambodia.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Sunset in Cambodia\" width=\"1000\" height=\"550\"></p>\n<p>We went to an unnamed orphanage and then set sail to a silk-weaving village further down the river. These people had so little, both the children and the families who wove silk fabric for a living, and we could see the frustration in their eyes when we declined to buy their paintings and silk scarves. Two ladies followed our group from their shop back to the river as the sun was setting, not taking &#8216;no&#8217; for an answer.</p>\n<h2><p id=\"Day_3_Kampong_Cham_CambodiaPhnom_Penh_Cambodia\"><p>Day 3: Kampong Cham</p><p>, Cambodia&#160;</p><p>|&#160;Phnom Penh, Cambodia</p></p></h2>\n<p><img class=\"aligncenter size-full wp-image-16176\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/U-Dong-Monastery.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"One of the main temples at the U Dong Monastery in Kampong Cham Cambodia\" width=\"1000\" height=\"550\"></p>\n<p><strong>One of the more surreal activities we experienced was a monk blessing </strong>at the U Dong Monastery. For ten minutes we sat on grass woven mats, shoes off, and listened to the monks&#8217; chants resonate through the temple.</p>\n<p><img class=\"aligncenter size-full wp-image-16168\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Monk-blessing-on-a-Mekong-River-cruise.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Monk blessing at U Dong Monastery in Kampong Cham \" width=\"1000\" height=\"550\"></p>\n<p>Afterwards we walked around the gardens and temples. It was one of the more beautiful places we&#8217;ve been to and there was no one there aside from our Viking group and the monks and nuns who lived there.</p>\n<p><img class=\"aligncenter size-full wp-image-16169\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Silversmith-on-Mekong-River-cruise.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Scalloped silver bowl decorated by hand in Cambodia\" width=\"1000\" height=\"550\"></p>\n<p>We continued to a hole-in-the-wall silversmith shop with beautifully&#160;decorated tea pots, jewelry, and elephant sculptures. <strong>We saw children sitting beside their adult peers, learning how to tap-tap-tap swirls and patterns&#160;onto old, tin cans. </strong>There were several really talented women adding intricate designs to scalloped bowls<strong>&#160;</strong>using pointy tools with special-shaped tips.</p>\n<p>Once our boat arrived in Phnom Penh we were free to explore Central &#8216;Russian&#8217; Market or go to some of the various temples of Wat Langka, Wat Botum, Wat Koh, or Wat Ounalom. We decided to take it easy and enjoyed evening cocktails on the boat instead.</p>\n<h2><p id=\"Day_4_Phnom_Penh_Cambodia\"><p>Day 4: Phnom Penh, Cambodia</p></p></h2>\n<p>One thing we really liked about this tour was that it was educational. Our guides were constantly sharing facts and tidbits of information and giving us the background of all the sites we visited. One of the most significant moments of history was the Cambodian Civil War, and more importantly, the effect of the Khmer Rouge on the country.</p>\n<p>We couldn&#8217;t help&#160;but notice the poverty that racked Cambodia, which we learned was attributed to the Khmer Rouge. Led by a man named Pol Pot during the Cambodian Civil War, this revolutionist was responsible for the murder of over 20% of&#160;Cambodians &#8211; more than one in five of&#160;his very own people&#160;&#8211; in&#160;an&#160;attempt to purify the population&#160;from &#8216;outsider&#8217; and modern influences. <strong>Pol Pot specifically sought out and slaughtered intellectuals such as doctors, engineers, and teachers in order&#160;to return the country to a backward farm-based socialistic society</strong><strong>.</strong> This brought Cambodia to its knees, which is evident 35+&#160;years later.</p>\n<p><img class=\"aligncenter size-full wp-image-16193\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Tuol-Sleng-Museum-of-Genocide-Barbed-Wire.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Looking out from barbed wire at the Tuol Sleng Museum of Genocide \" width=\"1000\" height=\"550\"></p>\n<p>We went to the Tuol Sleng Museum of Genocide, which was originally a complex where the Khmer Rouge interrogated and tortured their victims. Thousands of blank-faced pictures of Cambodians are archived within this museum. The buildings still have barbed wire wrapped around it&#8217;s entrances to prevent victims from escaping.</p>\n<p><img class=\"aligncenter size-full wp-image-16191\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Childrens-Tree-Killing-Fields.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Children's Tree at the Killing Fields\" width=\"1000\" height=\"550\"></p>\n<p>Not far away is the famous memorial site, the Killing Fields of Choeung Ek. It is located beside one of the many original mass graves where prisoners from the detention center were taken and brutally murdered.&#160;There are display cases of skulls, bones,&#160;teeth, and clothing from&#160;those who perished and are labeled with the method by which they were killed. This part of history really left an impression on us and we may write&#160;more about it in its own post at a later date.</p>\n<p>The afternoon continued on a lighter note with a ride on a cyclo through the streets of Phnom Penh. Cyclos are three-wheeled contraptions (essentially a backwards tricycle) with a comfortable chair on its front, some sort of sun cover, and a driver that pedals on a seat behind. <strong>Yes, it was utterly, completely touristy as our gang of fifty or so&#160;people filled the city streets on brightly colored cyclos, but&#160;it was a lot of fun.</strong></p>\n<p><img class=\"aligncenter size-full wp-image-16175\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Royal-Palace-Cambodia.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Manicured gardens of the waterfront Royal Palane in Phnom Penh Cambodia\" width=\"1000\" height=\"550\"></p>\n<p>The Royal Palace and Silver Pagoda were nice&#160;but no prettier than the U Dong Monastery in our opinion. In fact, we enjoyed ourselves more at the monastery because we weren&#8217;t around crowds of people.</p>\n<h2><p id=\"Day_5_Sailing_from_Cambodia_into_Vietnam\"><p>Day 5: Sailing from Cambodia into Vietnam</p></p></h2>\n<p>Ah, to relax on&#160;the Sun Deck with book (Angela) and phone (Chris) in hand was wonderful. Sometimes we just need a down day, and it went by surprisingly quick! We sailed from Cambodia into Vietnam and watched the jungle and small towns go by from our balconies.</p>\n<p><img class=\"aligncenter size-full wp-image-16177\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Mekong-River-cruise-banks-2.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Country views during our Mekong River cruise\" width=\"1000\" height=\"550\"></p>\n<p><img class=\"aligncenter size-full wp-image-16178\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Sun-Deck-Mekong-River-Cruise.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Relaxing on the Sun Deck of our Mekong River cruise\" width=\"1000\" height=\"550\"></p>\n<h2><p id=\"Day_6_Tan_Chau_Vietnam\"><p>Day 6: T&#226;n Ch&#226;u, Vietnam</p></p></h2>\n<p>This was our favorite day of the Mekong River cruise. We started off with a rickety rickshaw ride (another three-wheeled contraption, only this time the rider was in the front) through&#160;T&#226;n Ch&#226;u. Then we boarded a local wooden sampan boat and took a tour of the small canals.</p>\n<p><img class=\"aligncenter size-full wp-image-16179\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Mekong-River-cruise-canals-2.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Stilt houses along the Mekong River\" width=\"1000\" height=\"550\"></p>\n<p>The boat ride itself was pleasant and we were able to get up close to the houseboats and other fishing boats moored along the riverbank.</p>\n<p><img class=\"aligncenter size-full wp-image-16195\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/House-boat-on-the-Mekong-River.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"House boats on the Mekong River\" width=\"1000\" height=\"550\"></p>\n<p>We stopped at a fish farm along one of the canals, which had huge underwater barricades of tilapia. The fish were fed at&#160;a crudely made building where the floor was cut out from its center. Fish farmers threw fistfuls of food in the water from heavy bags, attracting swarms of splashing, wriggling fish. There was a mesh over the hole so that people didn&#8217;t fall in and so the fish didn&#8217;t just jump out onto the floor.</p>\n<p><img class=\"aligncenter size-full wp-image-16198\" src=\"https://i1.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Fish-Farm.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Vietnamese tilapia fish farm\" width=\"1000\" height=\"550\"></p>\n<p>Our favorite part of the trip was visiting the &#8216;Evergreen Island.&#8217; Accessible only by sampan boat, we hopped onto a makeshift staircase up the riverbank and were greeted by some gorgeous white cattle resting in the shade away from&#160;the afternoon sun. We walked through well-tended fields of corn and papaya and chilies&#160;and were invited into a home of a Vietnamese family. Their house was built on stilts, high above the flood zone, and even though it was very simple,&#160;from the glassless windows to the wooden stove, the family seemed happy and well to do.</p>\n<p><img class=\"aligncenter size-full wp-image-16188\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Vietnamese-Home.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Farmers home on Vinh Hao (Evergreen Island) Vietnam\" width=\"1000\" height=\"550\"></p>\n<h2><p id=\"Day_7_Sa_Dec_Vietnam_Cai_Be_Vietnam\"><p>Day 7: Sa &#208;&#233;c</p><p>, Vietnam&#160;</p><p>| C&#225;i B&#232;, Vietnam</p></p></h2>\n<p>On the last day of our Mekong River cruise, we putt-putted down a nearby canal and were surprised to see large houseboats moored smack in the middle of the water. In fact, these boats were advertising their produce for sale by attaching it, whether it be onions or pineapples or yams, to a thin pole 10 or 15&#160;feet into the air. We were told that each boat sold one item. Somewhere there&#8217;s a boat full garlic out there!</p>\n<p><img class=\"aligncenter size-full wp-image-16194\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Mekong-River-boat-selling-yams.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Yams for sale! Sampan boats selling goods in the Mekong River\" width=\"1000\" height=\"550\"></p>\n<p>We left our sampan and visited a nearby morning market. Bright and clean and fresh smelling, the Vietnamese vendors sat on short, little stools with their iconic conical hats selling produce of many colors and textures.</p>\n<p><img class=\"aligncenter size-full wp-image-16189\" src=\"https://i2.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Vietnamese-Morning-Market.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Morning market in Sa &#208;&#233;c Vietnam\" width=\"1000\" height=\"550\"></p>\n<p>The meat section of markets holds few surprises for us nowadays and this market was quite tame from our experience. <strong>We saw fish being plucked from buckets of frothy river water and expertly gutted and scaled before our eyes. </strong>Much to the relief of our shipmates, there were no skinned rats or chickens carcasses splayed open with partially developed eggs inside or pigs heads on display. It&#8217;s shocking to some, but it&#8217;s done the same way there as it&#8217;s done (behind closed doors) back home.</p>\n<p><img class=\"aligncenter size-full wp-image-16185\" src=\"https://i0.wp.com/www.tielandtothailand.com/wp-content/uploads/2016/06/Fresh-seafood-at-a-Vietnamese-market.jpg?resize=1000%2C550&amp;ssl=1\" alt=\"Fresh seafood at a Vietnamese market\" width=\"1000\" height=\"550\"></p>\n<p>We continued to the house of man who inspired the novel L&#8217;Amant and were treated to a cup of lotus tea and a snack of candied ginger. Afterward we continued to a brick-making factory and then a small village that made chewy caramel-like candy from palm sugar, popped rice (very similar to popcorn), and the delicate rice paper wraps used to make Vietnamese summer rolls.</p>\n<p>The next morning we finished our week-long Mekong River cruise and said goodbye to our crew and ship before continuing to Ho Chi Minh City, Vietnam.</p>\n<h2><p id=\"Mekong_River_Cruise_with_Viking_River_Cruises\"><p>Mekong River Cruise with Viking River Cruises</p></p></h2>\n<p>We really enjoyed this Mekong River tour with <a title=\"Magnificent Mekong with Viking River Cruises\" href=\"http://vikingrivercruises.com/cruise-destinations/asia/magnificent-mekong/2016-hanoi-hochiminh/index.html\" target=\"_blank\" rel=\"nofollow\">Viking River Cruises</a>. Even though we&#8217;ve been to Cambodia and Vietnam before, we were able to see places we wouldn&#8217;t have known of or how to find ourselves. A big thanks go to our program director guide, Mr. Lee, our&#160;Hotel Manager, Mr. Armin, and our Ma&#238;tre D&#8217;, Mr. Phalla for making our river cruise so wonderful. There was no way we would have been able to experience and learn so much without them!</p>\n<p><strong>DISCLOSURE:&#160;</strong>We were guests of Viking River Cruises but our opinions are our own. If you&#8217;d like to read more about Viking River Cruises and their tours all around the world, check out their <a title=\"Magnificent Mekong with Viking River Cruises\" href=\"http://vikingrivercruises.com/cruise-destinations/asia/magnificent-mekong/2016-hanoi-hochiminh/index.html\" target=\"_blank\" rel=\"nofollow\">website</a>. Many thanks goes out to Viking River Cruises and their staff for the wonderful hospitality.</p>\n<p>&#160;</p>\n \n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\">You May Also Like</h3>\n</p>\t\t\t\t\t</div>","title":"A Week on a Mekong River Cruise"}},"pageContext":{"id":"5b95eed787be0583274900f9"}}