{"data":{"mongodbDatabaseArticles":{"id":"5b92489a87be056953db7bc2","content":"<div><p>I <a href=\"//www.facebook.com/events/1546232848746952/\">just</a> did a presentation at <a href=\"//dojobali.org/\">Dojo</a>, a coworking space in <a href=\"//nomadlist.com/canggu-bali\">Canggu, Bali</a> about how to build a side project and turn it into a profitable startup. Thanks to <a href=\"//twitter.com/marcantoinefon\">@marcantoinefon</a> for recording it! <a href=\"/bootstrapping/\">Over a year ago</a>, I did a similar presentation. But since then I learnt a lot of new stuff that I'd like to talk about. A lot of this is covered more in-depth in <a href=\"//makebook.io/\">my upcoming book</a>.</p> <p></p> <p>Here's the transcript of the presentation with accompanying slides:</p> <img src=\"/wp-content/uploads/2018/01/3altpres.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8296 responsively-lazy\"> <p>I've built a lot of startups and side projects in the last four years. They're mostly bootstrapped, and bootstrapped means that you build a business without any funding.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0064_Layer-101.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8231 responsively-lazy\"> <p>That means, you don't go to San Francisco and get venture capital from big, old, fat, rich white guys, no offense. Instead you just do it yourself with your own skills, and that's very fascinating for me 'cause it's like a new way to build startups. It's finally made possible because technology's kinda cheap now. It's almost free to build things on the internet. And it's also exciting, because a lot of you guys here, and girl, and whatever, you guys wanna build things. You might have a job now, a remote job, but you might wanna have your own little side project. Make some money, or that maybe becomes a real startup later, and so maybe that's relevant for your guys. So thanks for coming, thanks for listening.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0078_Layer-83.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8216 responsively-lazy\"> <p>I would like to start with my own story. Four years ago, I was in Holland, and I just graduated from University. I studied business, and I was really bored, 'cause all my friends got corporate jobs, and I had a YouTube channel for electronic music, and I was making like $2,000 a month, $3,000 a month, so a lot of money for a student for just a graduate, so I was really happy, but I was sitting at home at my desk making these YouTube videos, and I loved the music and stuff, and I loved doing it, but it was really boring being at home all the time. So my friend said, \"Why don't you buy a laptop \"and just try and do this on a laptop, \"and then you can maybe travel a little bit.\" I was like, \"Okay, I'll do that.\" So, I sold all my stuff, similar story, maybe, to you guys. You sold all your stuff, stuff you were renting, and you just flew to Asia or South America, whatever, and you went traveling for a little bit with your laptop. I did this. I was all over Asia, and the problem was, my YouTube, meanwhile, was going bankrupt.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0077_Layer-82.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8215 responsively-lazy\"> <p>It was $3,000, $2,000, but then suddenly, it was $900 and then $700, and then $500. I was like, fuck, I need to make some money, or I'm not gonna be able to pay this travel, and just my rent and stuff, and also, I was getting fucking depressed. I'd been nomading and then I came back home to my parents' house. I was sitting there in this cold, Dutch winter, and I just wanted to die, and I got really big anxiety and depression and panic attacks for the first time ever in my life, 'cause my life was going fucking bad, so I needed to figure out something to do.</p> <p>[SAND]</p> <p>So I knew, like my dad always says, \"If you're depressed, \"you need to order one cubic meter of sand, \"and get a shovel, and just start shoveling, \"one to the other.\" And you do something, and you get less depressed. And so I was like, okay, I'll do it digitally.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0076_Layer-88.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8221 responsively-lazy\"> <p>I'll just do 12 projects in 12 months, and I called it 12 startups in 12 months, you know? It wasn't really startups, but I'll just do it. And I started building these little projects. I took one month for each, and I had something to do. I had focus. Still wasn't making money, but whatever.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0075_Layer-85.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8220 responsively-lazy\"> <p>The first one was, my friends and me, we would always send each other music over e-mail, so I made this little app that would playlist it, and you could list all the music we sent to each other back when we didn't really have chat apps yet, so, now, nobody uses e-mail anymore. Anyway, this didn't make any money, but it was really fun, and I launched it.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0074_Layer-84.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8219 responsively-lazy\"> <p>I made animated GIF books, so I got a supplier in Malaysia. He could print flip books, and then I would send the animated .gifs to him, the frames, and we would order it. Everybody loved it, but the margin was literally like two or 3%, so it was hardly making any money. I think I was losing money after tax. It was total bullshit, but it was really fun.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0072_Layer-95.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8224 responsively-lazy\"> <p>Then, this was the first one that went really viral. It's Go Fucking Do It, so you could enter a goal. You could add a deadline. Like, I wanna quit smoking. I want January 2018. You set a price, and you enter your credit card details with Stripe, and on the day, on the deadline, your friend gets an E-mail, and it asks, \"Hey, did Pieter really quit smoking on January or not?\" and if the friend said no, your credit card would get charged with $50, $100, and the money would go to me, (laughing) and this was the first one that was starting to make money. So, I was going from my YouTube crashing to $200 a month. Suddenly I was making $500 a month again with this, so now I was up at about $700 a month, so I could live again, so this was kinda nice. Still wasn't a lot of money, but okay.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0071_Layer-97.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8223 responsively-lazy\"> <p>And then the press started getting involved. So, my friend made this kinda funny picture of me, really pretentious, but whatever. It worked, 'cause the press started biting on this project of 12 Startups in 12 Months, and everybody started writing about it like The Next Web, Tech in Asia, and suddenly, like thousands of people started E-mailing me and following me on Twitter and stuff, and something was started to happen, so I cracked this little marketing thing accidentally with this 12 Startups thing.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0070_Layer-96.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8222 responsively-lazy\"> <p>Meanwhile, I had to keep continuing building more products, so one product I built was a spreadsheet of cities. So I was in Chiang Mai, and Bangkok, and Singapore, and Hong Kong, and Tokyo, whatever, but I wanted to find places where the internet was good, where it was kinda warm, like 26 degrees Celsius, and it wasn't super expensive to live, 'cause, you know, I had $700 a month. So I was like, okay, let's make a spreadsheet, and I published it on Twitter, but I forgot to, well, actually, the first time, it leaked, and I forgot to remove the edits thing, so actually, people were starting to edit it, and I was like, just share it on Twitter, and it went viral, and hundreds of people, maybe I think a thousand people started adding data to it, and then we had 75 cities with all the costs of living and fast internet and stuff, and all these nomad hotspots, so then I made it into a website, and I launched the website to Hacker News and it went number one. I launched the product, went number one, and just started going viral. And it was 2014, August or something at the time.</p> <a href=\"//trends.google.com/trends/explore?date=today%205-y&amp;q=%22digital%20nomads%22,%22nomad%20list%22\"><img src=\"/wp-content/uploads/2018/02/trend-nomadlist.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8310 responsively-lazy\"></a> <p>The second nomad wave of 2014, I think, after the first one in 2007 started with the 4-Hour Work Week by Tim Ferris, kind of started with Nomad List, if you look at the data.</p> <a href=\"//nomadlist.com/\"><img src=\"/wp-content/uploads/2018/01/merged-pres_0020_Layer-62.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8277 responsively-lazy\"></a> <p>And I grew Nomad List into this big website with loads of data. It's 1,250 cities, now 250,000 data points. It's all crowd-sourced, and it makes money. It makes $15,000 to $25,000 a month in membership fees and stuff, so that's a far reach from the $700 I was living on, but this took, obviously, years to build, but at least this one actually stuck.</p> <p>One of those projects stuck, which is kinda the philosophy I do now. It's like shotgun. You shoot a lot of projects and see which sticks. I bootstrapped Remote OK from Nomad List success. It's like a remote job website, which is now, also, since December, the number one remote job website in the world with almost a million monthly visits, so that's really cool, and it makes about $10,000 a month now.</p> <a href=\"//hoodmaps.com/\"><img src=\"/wp-content/uploads/2018/01/merged-pres_0066_Layer-16.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8225 responsively-lazy\"></a> <p>I also made <a href=\"//hoodmaps.com/\">Hoodmaps</a> recently. This is Canggu, so it's a map where everybody can cross-source tech, kinda like Wikipedia tech, things they think about a place. They can color it based on if it's hipster or rich, so you kinda know where to go in a city. So this is Canggu. So where? It's a nomad mecca. Deus' hipster mecca, and the ocean is full of hot surfer boys and girls.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0065_LOOP.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8232 responsively-lazy\"> <p>While building all these projects, there was one framework and pattern that kept happening, which was like, you have an idea, or I would have a problem and make it into an idea. I would build it, I would launch it, I would grow it, and then I would monetize it to make money from it, and then, if I got really annoyed with working on it, I would automate it with robots, so today, I wanna tell you about all these processes.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0064_Layer-101.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8231 responsively-lazy\"> <p>And importantly, there's no VCs involved. No venture capital, just self-funded.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0063_IDEA.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8230 responsively-lazy\"> <p>So let's start with idea. A lot of you have already startup or app ideas and a lot of them are good. A lot of them are really bad, and I think the bad ones are pretty much bad because they're not focused on a problem. I hear constantly, let's make another food delivery app or another fashion clothes delivery app or whatever, but they're not really problems that you wanna solve, so my thing is like, I try to look at my own life, and what am I really annoyed with?</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0062_Layer-25.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8229 responsively-lazy\"> <p>What is in my daily life, something I can work on, information that's missing or whatever. With Nomad List, I wanted to know new cities, where I could go. With Hoodmaps, I was lost in these tourist centers of big cities, and I was like, \"Fuck, I wanna see the real city.\" So I built Hoodmaps, for example. So I was always trying to find problems and then to solve, and I think that's the way to do.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0061_Layer-102.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8236 responsively-lazy\"> <p>And the reason that's cool, because when you have a problem you solve, you're actually, you're the expert at your own problems, so, this is an expert, and it's a competitive advantage, because let's say you're a gardener. You know very well about the problems that gardeners have about flowers and plants and stuff, and nobody else knows that, or only other gardeners, so you have a little niche there that's competitive, that's good.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0060_Layer-103.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8235 responsively-lazy\"> <p>The problem is, we're all very similar. Look at us. A lot of guys here beards and short hair and trimmed on the sides like me, so it's bullshit. That means that we all start getting the same ideas 'cause we all have the same problems. So you wanna become less homogenous, right? So how do you do that? Well, you have to start doing crazy shit.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0059_Layer-23.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8234 responsively-lazy\"> <p>So you have to, I don't know, go sky diving...</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0058_Layer-24.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8233 responsively-lazy\"> <p>...or you go trek to the jungle for six months alone without any phone, or just do some original stuff.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0057_Layer-22.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8239 responsively-lazy\"> <p>Go do orgies or whatever. Find new subcultures to go into. Fringe subcultures are really good, because when it's taboo, nobody else is doing it yet, so it's competitive advantage again, and you might find some business or app idea or service idea, whatever, in there, but you have to become original, 'cause otherwise, you're making the same shit everybody else is making, and that's not gonna make you money.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0055_Layer-27.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8237 responsively-lazy\"> <p>What I see a lot is a big fault, too. People think really big with ideas, so they start with, I wanna build a space company, but that's bullshit because you're nobody, so it doesn't go as fast as that. You have to start with something very small. So, if you look at Elon Musk, he started with PayPal which was a payment app for Palm Pilots, old smartphones. That became big, and he sold it with a lot of other people, and then, in the end, after 20 years, he's finally building a space company. So start slowly. Build something small, fix a small niche problem first. Make some money and keep growing the niche, and keep growing bigger. With Nomad List now, it was focused on nomads, but now I'm going bigger. I wanna go into the whole travel market, which is about 10 or 100 times as big as Nomads, so grow a niche instead of starting big, you know?</p> <p>Start small, it's better.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0056_Layer-26.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8238 responsively-lazy\"> <p>And a niche is really cool, because if you have, let's say, $100 products, you only need 10,000 people for one million dollars. I was shocked. Is that accurate? Yeah, it is accurate, it's one million dollars. So you don't need a lot of, and you can take a picture if you want. You don't need a lot of customers to make one million dollars. You just need a small niche of people. Everybody took the picture? Yeah? Nice, flash isn't gonna help, haha.</p> <p>Okay, so you can also make an idea list. That's what I did too. Every time I have an idea, I write it in a concepts list. This is all bullshit ideas, but whatever. And I'd see which ones are promising and which keep coming back to me, and then I might start building them. And it's good to just track this. Do it in WorkFlowy or Trello or whatever, to-do post-its or whatever. Write it down because you might need the idea later. I think a lot of the remote work ideas I had, they came months before I actually did them, so it takes a long time to boil in your head.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0053_Layer-31.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8243 responsively-lazy\"> <p>Also, I would definitely, definitely super advise, and this is very contradictory advice from what most people say. Do it yourself. Don't work with other people. You don't need a technical co-founder if you're a business person. Just learn to code. Just do it yourself and learn to design or whatever. Do the basics yourself, because it will save you so much time. And Groupthink. Groupthink is very dangerous. If you have two or three people in a group, you're building a startup, I've seen it myself. People sort of hyping each other, like, \"Wow, this dog food delivery idea is really gonna change the whole fucking ecosystem of the world.\" It's just not true. It's just you're hyping each other. And if you're alone, you cover your hype up, 'cause you're mostly insecure, right? And being alone is kinda good, because, yeah, it will help you ship faster and better.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0052_Layer-32.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8242 responsively-lazy\"> <p>A lot of people are like, \"Okay, I'm working on a startup, \"but I can't really tell you because we're \"in stealth mode, and I won't share \"that idea 'cause otherwise, somebody steals it,\" which is more bullshit. Nobody's gonna steal your idea. It's all about execution. Everybody has the same ideas anyway. The execution makes it original and unique, so, actually, sharing your idea is good 'cause you can talk to people, you can talk to maybe potential customers already before you actually build something, so be happy with sharing your idea.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0050_BUILD.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8240 responsively-lazy\"> <p>So, if you have an idea, you finally got it, you wanna build it, so how do you start building it?</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0049_Layer-29.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8248 responsively-lazy\"> <p>Well, a lot of people, they need to learn to code and they need to go to coding bootcamps or code academies or whatever, and I would definitely not recommend that, 'cause it's gonna take months or years, and I don't really think that works. I think it's a little bit of a scam.</p> <p>I think you should learn to code yourself.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0048_Layer-28.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8247 responsively-lazy\"> <p>I think you should just open Google and write how to make a website. And that's how I learned it. That's how most successful people around me learned it, and the thing is, the biggest thing in coding and in business you can learn, is learning how to learn and learning how to figure things out for yourself. That's very practical knowledge, and that's super, super important in entrepreneurship, just practically knowing how to do things, and not calling somebody, like, \"Hey, how do I do this?\" or not finding a book or something about it. Just do it yourself. Why not? All the information is now on the internet.</p> <img src=\"/wp-content/uploads/2018/02/Screen-Shot-2018-01-17-at-11.54.08.png\" alt=\"\" width=\"3120\" height=\"1792\" class=\"alignnone size-full wp-image-8318 responsively-lazy\"> <p>It's on YouTube, it's on Stack Overflow, it's on Google, so you can easily find for yourself. And that's, again, it's the most important skill you can have. Learn to learn.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0047_Layer-33.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8246 responsively-lazy\"> <p>If you really are stubborn and you're just like, no, Pieter, I'm not gonna learn to code, use Typeform. Typeform.com is a site where you can make a form, and you can even accept payments, and you don't need to do any coding, and you can actually build a little mini-startup just with a form.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0046_Layer-36.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8245 responsively-lazy\"> <p>Like here, you can enter your credit card, and then you can actually pay. You can accept payments with Stripe and stuff.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0045_Layer-34.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8252 responsively-lazy\"> <p>Another cool app is called Carrd. It's C-A-R-R-D.co. It's built by my friend AJ, and it's super amazing. It lets people without code build really advanced websites. I built this yesterday.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0045_Layer-34.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8252 responsively-lazy\"> <p>It's a luggage pickup service, and I just build a whole landing page out of nothing, and then if people schedule a pickup, it gets sent to Zapier. It's API website, and the luggage gets picked up. Not really, but I could do it if I want.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0043_Layer-37.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8250 responsively-lazy\"> <p>Me too, I started with a spreadsheet. Normally, this was a spreadsheet. I wasn't a good coder. I could make WordPress themes for a little bit, but I wasn't really good at it, so I learned just in time with Google. I learned something when I needed to learn it. When the problem happened, I would go on Google and just find it and figure it out, and because the only other option of not learning it was my entire startup failing, it's a very nice constraint to, you really need to learn how to make the button align with the logo because everybody thinks it's ugly. And that's a good reason to go learn.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0041_Layer-100.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8256 responsively-lazy\"> <p>Also, I see a lot of people, they build startups for years or months. Like, \"Yeah, I've been working on this thing for six months. \"We have no customers, \"and the design is perfect and beautiful.\" That just doesn't work. I would say, max one month for a prototype. It has to be a good prototype, though, but don't spend too much time working on something because you need to validate with launching. That's very important.</p> <img src=\"/wp-content/uploads/2018/02/launch.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8319 responsively-lazy\"> <p>Okay, launching, very important. So you built some things, and now you wanna actually get users, and I think this is the most important step in any startup because it validates if the product is actually useful or not, and can be monetized and stuff.</p> <img src=\"/wp-content/uploads/2018/02/PHpres.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8320 responsively-lazy\"> <p>Platforms for launching startups. Product Hunt, of course, one of the biggest. It'll get you about 10,000 users, 10,000 visits. I think about 10% maybe convert or something or less. Tips for Product Hunt, make sure just the whole item looks really good. Add some animated .gif. Make a really good slogan. Ask your friends and stuff about the slogan for your startup. A lot of the startup slogans are just super obtruse, and I don't know what they actually mean. So, make it very simple. Very important for Product Hunt. Product Hunt works in San Francisco time, so the time's on Pacific Standard Time, which means that you might have to stay up until midnight San Francisco time, and then you need to submit your product. Because otherwise, if you submit at like, I don't know, Bali time 4 p.m., it might be 1 p.m. San Francisco or something, anyway, a little bit too late to compete with other startups on Product Hunt for that day, and you wanna be high on the ranking. It's very important. Also, jump on the comments when you're on Product Hunt. You know, talk with people. Don't be marketing, just be honest and say, if this bugs or whatever, fix them immediately and be friendly. Be a human. It's very important.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0039_Layer-42.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8254 responsively-lazy\"> <p>Hacker News is another one. Hacker News is very critical. They can destroy your whole startup with their comments. Here it's even more important. Don't do marketing stuff. Be as frank and honest and personal as you can. If you build a food delivery app, whatever, say, show HN, \"I built a food delivery app.\" And then say something unique or whatever. Make it original, but make it friendly. No spamming. Don't use voting rings and stuff. No bolts, all that bullshit. It's only gonna go down, you know? They'll see it.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0038_Layer-43.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8253 responsively-lazy\"> <p>Reddit is very, very gigantic. It's about 100 times big than the sites before, Hacker News and Product Hunt. Reddit is the mainstream launching platform right now, I think it's becoming very quickly. Reddit, again, also, they don't like spam. They don't like marketing. They will remove your listing very quickly. Important think about Reddit is you wanna submit to subreddits, so if you doing an app for horse management, you might wanna go in /r/horse, and you wanna be very friendly. You wanna say, \"Hey guys, I made this app about horses. \"How to manage them. \"Would you give feedback on it?\" And then if it gets upvoted, people will like it, it will actually, that's a very good chance to go to the front page. I did it twice. I did it with Nomad List. I did it with Hoodmaps. The problem is, when you go to the front page, when you get about page two or three, your server will die because it can't handle traffic. It's like literally thousands of people in the same second, so you wanna make sure that your site stays up so, technical term, but make it static. Make it in XHTML instead of PHP or JS. Just make it static so it actually runs. Load test it before, 'cause a lot of people just don't get onto the front page when they might have if their server stayed up. And this, again, hundreds of thousands of users you'll get from this, 400,000, maybe, half a million, it's crazy.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0037_Layer-44.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8260 responsively-lazy\"> <p>Then the \"Horse Forum\", it's very important. (laughing)</p> <p>You're like, \"What the fuck is this slide doing here?\" No, it's very important.</p> <p>So, if you make for example a horse management app, you wanna also go in your niche. So you wanna find websites specifically for your niche. In this case, horses, and you submit it there. Same story, make it personal. This is actually users that might convert the highest, because it's very relevant to them. They have horse stables or whatever, and they need your app, so publish here.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0036_Layer-45.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8259 responsively-lazy\"> <p>Bodybuilding, another one, if you do a bodybuilding app.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0035_Layer-46.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8258 responsively-lazy\"> <p>And yeah, this is the subreddit for motorcycles if you make a motorcycle app, you get the point.</p> <p>Questions about launching?</p> <img src=\"/wp-content/uploads/2018/02/Screen-Shot-2018-02-01-at-18.09.51.png\" alt=\"\" width=\"1378\" height=\"824\" class=\"alignnone size-full wp-image-8326 responsively-lazy\"> <p><i>Audience: \"I was just gonna ask, do you have any procedure that you go through when you do a new startup, or you just jump right into it? Like, are you doing a competitor analysis or?\"</i></p> <p>Yeah, good question. I sometimes do competitive analysis. Like I check if the app already exists, but the thing is, the fact that an app already exists doesn't mean you can't add to the market, right? So many times, when an app doesn't exist, is you wanna build, it means there is no market for it. So usually, there is an app that already exists, but it's shit, and it doesn't have a lot of users, and it's just broken and ugly, whatever, so you can just make a better one. That's what I did a lot of times. There's a lot of competitors of mine who were just, their site was just unusable, but they were big sites before, but yeah, so it's easy to, not even take them over, but just like, yeah you'll get more traffic, but yeah, I will usually dive right into it, and I'm a little bit arrogant and naive, so I'm like, oh, I can do this better. Fuck this, I'll just do it, and sometimes, usually it doesn't work out. (laughing)</p> <p>But mostly, one out of 10 times it does, and then you made something that's better. So being a little bit arrogant about it works, I think.</p> <p><i>Audience: \"I mean like, do you have a checklist, I guess, of a lot of things that you would go through?\"</i></p> <p>Yeah, so I'll try and launch, so he asked, do I have checklist? Things I go through during launch? I will try and do Product Hunt, Reddit, Hacker News, all those websites on the same day, 'cause you kinda want a constant traffic, 'cause then it's like, oh my God, this whole day's about your startup and everybody's talking about it, and it has this giant effect, like exponential, but the checklist is pretty much, yeah, it's kinda Tweet about it, share it on Facebook, then submit it. Yeah. Just, it's pretty obvious, I think, yeah. Sure.</p> <img src=\"/wp-content/uploads/2018/02/grow.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8327 responsively-lazy\"> <p>So, when you've launched, of course you need to check your analytics, like if it actually worked. Usually you see a drop off in traffic. You see a spike of traffic when it launches, then it goes down and down and down, which is very normal. That doesn't mean your site is not validated, but if and when, in a week, or month, literally everybody's gone, then you might have to conclude this wasn't a successful product. If it does still have traction, you wanna try and grow that traction.</p> <p>Now, what I really hate these days (laughing) and it's also of events in Dojo, is there's a lot of talk about non-organic growth, and I think that just doesn't work. There's a lot of talk about Instagram bots. I tried them too, last week. Didn't work. There's a Twitter follow/unfollow bots, spamming and buying and selling e-mail lists, all this fucking dodgy, shady gray, or black hat stuff, and I hate it so much that every time I'll be in some heavy discussion at some coffee shop with somebody. What you're doing is not good. Don't do it. But, I don't wanna be a moral knight.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0034_Layer-77.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8257 responsively-lazy\"> <p>My point is this is how non-organic growth looks. It's a very ugly cow. It's not good.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0033_Layer-78.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8264 responsively-lazy\"> <p>And look how beautiful the next cow looks. Look, aww. :)</p> <p>This is organic growth, which means people actually really like your website. They're not there because of bots, or ads as well. Ads are ethical, but I don't like ads. Like who of us has ad-blockers? See? So why do we have ad-blockers but we're still buying ads at Facebook and Google? It's kinda morally ridiculous. I don't believe that ads will be the future.</p> <p>Ads, they give you, let's say they give you a spike of 10,000 users and signups, but when you stop buying these ads, usually it slowly just fades out. And I see it a lot with venture capital-based startups, and I think venture capital-based startups are a lot like this, 'cause it's all fake growth. It's all fake growth and paid traffic, and I don't really think it works.</p> <p>It stops working when the money stops, right?</p> <p>Then it usually just fall offs.</p> <p>And then you didn't really actually build something useful.</p> <p>Organic growth is much cooler, because it's much more hard to get, but when you get it, it means you validated the product you built, so you actually have people using it, and actually people loving it. And if you don't get traffic, it means your product's just not good enough.</p> <p>So organic growth is the ultimate test of, is my product good or not? Should I tweak it, should I build another product, a new thing, whatever, to have organic. And if you have all this paid traffic in there, okay, it's kinda hard to see if people actually really like your product, or if it's just paid traffic.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0032_Layer-39.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8263 responsively-lazy\"> <p>Very important, what I do, to kinda get this growing. I wanna build with my users. So every site or every app I have has this little feedback box, and it just sounds like, \"Hey do you have feedback? \"Tell me. \"Be nice.\" Cause people can be really angry in this feedback box, so I had to ask, be nice, and now they're really nice to me, so it actually worked. (laughing) If this box, like this, the images are not loading, you can write, \"Hey your images are broken.\" But also, there's a lot of feature requests. Every week, I'll add a feature, or I'll change a feature somebody just says is wrong. This week, I think I moved the search box on Nomad List to the right because somebody said it looked ugly, so, yeah, and then they're happy and they're involved in the process, so building. I think it's called co-creating. Building with users is amazing, because they become, what is it called? Ambassadors. Wow, you're British. Ambassadors of your products, so they will tell, \"Hey, I sent Pieter this message \"about the search box, and he actually changed it. \"I love it. \"You should use Nomad List, too.\" So, it's very positive effect you have, and users are really smart. You shouldn't always listen to everything they say, but you should definitely consider it, what they're saying.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0031_Layer-40.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8262 responsively-lazy\"> <p>A more beautiful feedback box, of course, Intercom, used by most startups. This works as well. It works very well. It's paid, though, so a little annoying.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0030_Layer-38.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8261 responsively-lazy\"> <p>Very important to add on your website or app is some kinda thing so you can re-engage users later. So you launch with 10,000 users on Hacker News or Product Hunt, but then after that day, those 10,000 people are gone. So how do you contact them again? So you wanna re-engage. So, capture their email with, I don't know, somewhere like this, send me a message when you have special food discounts in my area, or whatever. What I did with Remote OK was, the <a href=\"//remoteok.io/\">remote jobs</a> website, I would have daily job alerts that people can subscribe to. Nomad List has a newsletter, so that kinda stuff. So you can email people later. Don't spam people, you know? Again, just be sparing using these email addresses, 'cause you guys know how annoying it is to have annoying emails flooding your inbox.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0029_Layer-47.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8268 responsively-lazy\"> <p>Very important and very trendy, and if you do this, you will be so far ahead of everybody else. Build your startup in public. So this guy is a friend of mine, kinda friend, acquaintance, not really acquaintance. Okay okay, we hardly know each other. We once tweeted .(laughing)</p> <p>It's Drew Wilson, he's really cool, and he built Plasso, this payment startup, but he build a lot of it in public, and he just live streams. So he's just sitting there. It's a little boring, but also kinda fun, because he plays music and stuff, and you can see his code, so you can see the product being built right there in front of you, and that's super cool. And the cool thing is, nobody else is doing that. I did it with Hoodmaps. I hardly know anybody who's doing it, and it gives you so much attention and press, so definitely try this. Yeah, takes guts, but also streaming, it makes you very productive. 100 people were watching me, and I never coded as fast, 'cause I was just so nervous and stuff, so it works.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0028_keep-launching.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8267 responsively-lazy\"> <p>Another one to keep growing is to keep launching, so don't launch your startup once. Launch a feature as well, and launch to the press again, and just keep doing it every two or three months. You wanna keep getting into the press and keep getting into these websites. I don't think you can launch it in Product Hunt every two months, but you can launch every year. Every big version number you have, or every change you do, you can launch again, and that's very important, 'cause you wanna stay in people's minds.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0026_MONETIZE.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8265 responsively-lazy\"> <p>You aren't running a charity, you're running a business. If people won't give you money for your product, you have an existential crisis on your hands, and that's very important. And I see so many startups just don't make money, and it's like, how do you pay your rent? Just, I don't know. And (laughing) and that's just not the way to do it. It's very important to make money, because you need to pay your bills, and I would say within three months, I would say within two months, maybe, get the first dollar in. Maybe even during launch day, get the dollars running, 'cause otherwise, again, you didn't validate. You made a nice startup, but it's not making money, so it's not really validated as a product, and that's a big problem. Focus on money, and focusing money is very difficult for us. I'm Dutch, so especially for Dutch people, they're traders historically, but they're very weird about money. You're not really allowed to make money.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0024_Layer-55.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8272 responsively-lazy\"> <p>This is a typical, I wrote it myself, but this typical example email of the stuff I would get when I started charging money.</p> <p>But really, this is a typical email I get. It's absolutely ridiculous. They think you're a big company, but you're just you and your laptop and you're trying to just pay your bills and buy a coffee, and this is so, this happens so much, especially in Reddit. Like people really hate when you charge money for something, but you should charge money for something, and just ignore these people. And there's always a free alternative of your app that's worse, but yeah, you're not competing with them. You're competing in the premium with actually charging money.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0023_Layer-56.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8271 responsively-lazy\"> <p>A very good example of how to charge and validate at the same time is Buffer, and they pioneered this whole thing. They didn't even launch a product yet, but they just put up a landing page with a plans and pricing button, and if you clicked it, this is social media scheduling as well, you would get an email box, and you could sign to get updated if the app actually launched. And this was amazing, 'cause this is literally just validating how many people will click on this? How many people add their email? Okay, so now we have a list of 10,000 people that might actually wanna pay for it, because they clicked pricing, so they actually wanna maybe pay for it. I did this idea even worse, or even bigger. I made a whole payment button with a fake Stripe box where you enter your credit cards for a feature you wanna use, and then after paying, they wouldn't be actually be paying. I said, you didn't actually pay. This was a fake Stripe payment box, but now I know that you would pay if I built the actual feature. But I didn't actually build the feature yet. So, that's again, validating a feature before you build it, if actually people pay for it.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0022_Group-2.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8270 responsively-lazy\"> <p>Put buy buttons on everything. This is the most important slide of my presentation. You wanna check what people pay for in your product, so every feature, put a pay ball on it to see what happens, and then start, if nobody pays for it, make it free, but yeah, limit your app as well. See what people pay for again. Super important.</p> <p>A few business models here that you can apply. A lot of websites you know and startups, they don't actually make money off their main product. They make money off their by-line product, kind of, their main product.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0020_Layer-62.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8277 responsively-lazy\"> <p>So this is Nomad List. This website doesn't make any money. This is all free data. You can filter cities in the whole world. Nobody pays money for this.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0019_Layer-59.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8276 responsively-lazy\"> <p>But there's also like a social network for travelers, which is also Nomad List, which 7,000 people pay money for.</p> <img src=\"/wp-content/uploads/2018/02/Untitled-9.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8329 responsively-lazy\"> <p>Dribble. You guys, a lot of designers here know Dribble? A design website. It's free to post your designs on Dribble, and nobody pays money for this, but there's a job site that business people business pay for to post jobs, and they pay a lot for it. I think $299 for 30 days, yeah.</p> <p>So you can have your main site to be free, like freemium, and then have side things that you charge money for.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0016_Layer-90.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8281 responsively-lazy\"> <p>Also, sponsorships are good. When I launched Nomad List, I got an email within the first day by Matt Mullenweg, the founder of Automattic and WordPress.com, who had liked the website, and he said, \"Can we sponsor it?\" And I was like, \"Sure, I'll add a little banner,\" and then automatic, WordPress are hiring, and he paid me a few thousand dollars a month for it, and it still pays, which is very very helpful and nice.</p> <p>It's just, it's very hard to get sponsorships. Going outbound, like emailing companies for it is very hard. You wanna be so cool as a product, maybe, and be lucky to, a cool company wants to help you and provide you, so you can keep developing on the website.</p> <p>And this money from Automattic helped a lot, because in the beginning, I wasn't making a lot of money, so it has helped me continue developing the website.</p> <img src=\"/wp-content/uploads/2018/02/sindre.png\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8332 responsively-lazy\"> <p>A more cool modern model that you might now is Patreon where you just simply ask your users to pay money, not even for a specific feature, but just for supporting you as a maker, and I just saw this week on Twitter, a guy called Sindre Sorhus, who does a lot of open source development, he just asked like, \"Hey, do you wanna give me money \"for my open source work the last few years? \"I've been working for free.\" And I think he got a few thousand dollars.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0014_Layer-89.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8279 responsively-lazy\"> <p>This is my friend Abroad in Japan, a Japanese YouTuber, a British guy in Japan, and he makes $3,000 a month from 800 people paying him a few dollars a month, and it's actually a sustainable model to make money these days, and why not?</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0013_Layer-92.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8278 responsively-lazy\"> <p>Overcast, a podcast app for iOS, does the same thing. They don't have premium features anymore. They just have a patron part where you can literally just say, \"Okay, I'll pay $12 'cause I love the app.\" And you don't even get anything. You just, you're a supporter, and I think 400 people a day, or something, they're patrons, so it's a lot of money.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0021_Layer-57.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8269 responsively-lazy\"> <p>Very important about monetization. You know, I see a lot of people, I did the same thing. I see a lot of people charge $50 once to unlock a feature or use your product, but it's not recurring revenue, and recurring revenue is quite important, because, as you can see in this chart, if you have a single payment of $75 and the company, you can't see it, but it says sales growth by 25% a year, which is kinda okay growth, you know, year one, you make $75,000 on both. In year five, when you have a single payment by a user, you make $183,000, and with a subscription, you make almost $2,000,000 a year, because subscriptions keep going, and they keep growing with more and more subscriptions, so it's exponential kinda growth, and it's just a lot of money. And of course, you'll have churn, too. You'll have people canceling your subscriptions, but still, in the end, it's kinda positive. Only thing is, subscriptions are annoying for users. I hate getting another bill of some service I signed up a few years ago, like \"fuck, I was still paying for that. I don't even use it!\" That might be annoying.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0011_AUTOMATE.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8285 responsively-lazy\"> <p>So if you have this whole business running now, you make money, and you kinda, you kinda get sick of the business. Like, I get sick of startups after one or two years or whatever. I like doing new stuff. I hate doing the same shit all over, over and over again. So you can get robots to work for you. You can hire people, but humans are difficult. Robots are much easier and more efficient, I think. So automating.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0010_Layer-20.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8284 responsively-lazy\"> <p>So this is my server right now. I made a screenshot a few hours ago. In the top, you can see, it's blocked, but it's 187 robots are running now. That's parallel processes, and they're doing something for my site. They're getting the weather for the cities on Nomad List. They're getting job posts for Remote OK. They're processing refunds for users. Both sites are 100% automated, and these robots keep everything running.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0009_Layer-21.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8283 responsively-lazy\"> <p>This is my scheduled cron jobs, which means, it's tech lingo for scheduled programs, these robots. All these things are things that I need to do hourly or daily or weekly. This is my whole business, is all these lines. This is all the robots running everything, and for me, it's really cool. It just looks really cool that I have this server somewhere in San Francisco, and it just does all this stuff. And I have anywhere from 180 to 700 robots running, working for me 24/7, and they can scale up and scale down whenever they want. When they need more people, they just hire more people. Within seconds, more robots. It's just, the magnitude of this is like, it's hard to explain, but it's, it means that you can run entire businesses now with robots, with scripts doing stuff for you, and this means that you can hire people, but then you can't really fire them, 'cause it's hard with labor laws. Humans get sick, all this stuff. And I know it sucks, but this is the reality. Robots are, to be honest, just more efficient at a lot of stuff.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0008_Layer-50.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8282 responsively-lazy\"> <p>This, for example, is an app that monitors robots. So it's a robot monitoring a robot!</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0007_Layer-51.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8290 responsively-lazy\"> <p>So what's the role for the human then, left in his little black box of a business you built? Well, I think it's very important to have one human hired full time to manage all these robots when you've automated everything, so they can check if your server's down or not. Otherwise, you're still 24/7 working on this business. I've woken up so many times, it's 4 a.m., just check my website, and it's down, and then I have to do all this stuff, and then I'm awake for three hours 'cause the server crashed. You wanna have a guy or girl or whatever on there, on standby. Get alerts when a server's down and when the robots are not doing their work.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0005_EXIT.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8288 responsively-lazy\"> <p>Yeah, exit is very important. I've never done it: selling your business. I've got proposals to sell my business, but I'm not happy yet with the price. Very important to just finally get on with it and start living I guess.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0004_Layer-49.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8287 responsively-lazy\"> <p>The price of an exit is usually something like this. So, let's say you have 25% growth. You have $100,000. Usually you can ask $500,000. If you have higher growth, you can ask even a million dollars for $100,000 a year business. Yeah, this is very important. So that's why you see all these startups. They think about their growth rates so much, 'cause they want the growth rate for the selling price. It's very important.</p> <p>Also, there's a lot of psychological things with selling, like if you wanna sell your company, maybe. You know, your company's your baby. Like, Nomad List is my baby. If I sell, maybe I get depressed, so think about that stuff.</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0003_LOOP-copy.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8294 responsively-lazy\"> <p>See, that's the whole loop. So you have an idea. You solve your own problem. You build it. Then you launch it. You grow it organically, very important. That's my opinion. Monetize it, automate it, exit. And then you do it again. And this is like a little ecosystem and pattern I found after a few years.</p> <p>Thanks for listening! ^_^</p> <img src=\"/wp-content/uploads/2018/01/merged-pres_0002_QA-copy-6.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-8293 responsively-lazy\"> <p><strong>There's a <a href=\"//www.youtube.com/watch?v=6reLWfFNer0#t37m10s\">25-minute Q&amp;A available on YouTube</a> from here on.</strong></p> <img src=\"/wp-content/uploads/2018/02/Screen-Shot-2018-02-01-at-18.09.51.png\" alt=\"\" width=\"1378\" height=\"824\" class=\"alignnone size-full wp-image-8326 responsively-lazy\">  <p>P.S. I just wrote a book on bootstrapping indie startups called <a href=\"//makebook.io/\">MAKE</a>. And I'm now on <a href=\"//instagram.com/levelsio\">Instagram</a> and <a href=\"//twitter.com/levelsio\">Twitter</a> too if you'd like to follow more of my adventures. I don't use email so <a href=\"//twitter.com/levelsio\">tweet me</a> your questions. If you like what I'm doing, consider backing me on <a href=\"//www.patreon.com/levelsio\">Patreon</a>. </p><p></p>  </div>","title":"Turning side projects into profitable startups"}},"pageContext":{"id":"5b92489a87be056953db7bc2"}}