{"data":{"mongodbDatabaseArticles":{"id":"5b95eb3187be058327490005","content":"<div><p>See the Authentic Side of Iceland</p><p>Made with love by travelers for travelers! The purpose of my guides is to let you live large on a budget. I focus on activities that give you insight into the land, people, and culture.</p><p><strong>Updated:</strong> July 2018<br><strong>Return policy:</strong> No risk, 30 Day, 100% Money Back Guarantee<br><strong>Details:</strong> 196 pages of expert budget travel advice with maps</p><p>Iceland. Its name conjures images of rugged nature, people, and sheer majesty. It&#8217;s an exotic, otherworldly place that draws travelers from all over the globe. I&#8217;d seen movies and pictures. Of a land with jagged mountain peaks, volcanoes with desolate lava fields, rolling hills with grazing sheep, and glaciers that stretched for miles. From the moment I landed, Iceland was everything I had hoped it would be. I was welcomed and helped by kind strangers.</p><p>My love for Iceland became an obsession. I&#8217;ve returned multiple times, drawn back by the people and the raw natural beauty of the terrain. For such a small island, Iceland has a diverse range of landscapes. I&#8217;ve hitchhiked across the country, met locals who&#8217;ve let me stay n their farms, and been all over the island.</p><p>Iceland is a place that many travelers want to go &#8211; but are all worried about cost. They are worried about the rumors that its expensive, hard to get around, and not filled with great food. Those rumors are not true. I wrote this book to give you the insider&#8217;s look at Iceland. To take you off the beaten path, away from the crowds (and prices) that swarm the southern region, to help you meet locals, eat delicious food, sit in free hot springs ten times better than the Blue Lagoon, find secret waterfalls and pools, and hike trails where you can be alone with the natural beauty of Iceland under the gaze of the Northern Lights.</p><p><img class=\"alignright\" src=\"//www.nomadicmatt.com/wp-content/themes/nomadicmatt/images/matt_@2x.png\" alt=\"\" width=\"189\" height=\"189\">This guide is meant for travelers looking to see the most of Iceland. You&#8217;ll see the local side of Iceland as I take you off the tourist trail, save you money, and give you tips and tricks not found in mass market guidebooks.</p></div>","title":"Nomadic Matt’s Guide to Iceland"}},"pageContext":{"id":"5b95eb3187be058327490005"}}